{"reviewerID": "AB9S9279OZ3QO", "asin": "0078764343", "reviewerName": "Alan", "helpful": [1, 1], "reviewText": "I haven't gotten around to playing the campaign but the multiplayer is solid and pretty fun. Includes Zero Dark Thirty pack, an Online Pass, and the all powerful Battlefield 4 Beta access.", "overall": 5.0, "summary": "Good game and Beta access!!", "unixReviewTime": 1373155200, "reviewTime": "07 7, 2013"}
{"reviewerID": "A24SSUT5CSW8BH", "asin": "0078764343", "reviewerName": "Kindle Customer", "helpful": [0, 0], "reviewText": "I want to start off by saying I have never played the Call of Duty games. This is only the second first person shooter game that I have own. I think it is a lot of fun. Has good graphics and nice story line. It does take some skill to get through the levels. I think all players can enjoy this game. There are three levels to choose from based on your skill level. If your looking for first person shooter game that has current military type play than this is a good buy.", "overall": 5.0, "summary": "Love the game", "unixReviewTime": 1377302400, "reviewTime": "08 24, 2013"}
{"reviewerID": "AK3V0HEBJMQ7J", "asin": "0078764343", "reviewerName": "Miss Kris \"Krissy\"", "helpful": [0, 0], "reviewText": "this will be my second medal of honor I love how the incorporate real life military stories in the game great", "overall": 4.0, "summary": "MOH nice", "unixReviewTime": 1372896000, "reviewTime": "07 4, 2013"}
{"reviewerID": "A10BECPH7W8HM7", "asin": "043933702X", "reviewerName": "GMC \"Old Time Modeler\"", "helpful": [0, 0], "reviewText": "great game when it first came out, and still a great game", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
{"reviewerID": "A2PRV9OULX1TWP", "asin": "043933702X", "reviewerName": "grimi", "helpful": [0, 0], "reviewText": "this is the first need for speed I bought years and years ago.  I lost it so I bought this for a trip down memory lane.  Pretty tame by todays games.  It brought back memories of fun times.", "overall": 5.0, "summary": "memory lane", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "AE7GUHCDQQ4UI", "asin": "043933702X", "reviewerName": "Imperfection91", "helpful": [0, 0], "reviewText": "Doesn't load after installation. Tried it on 3 different computers. Waited a while to receive it... was kind of excited", "overall": 1.0, "summary": ">.&lt;", "unixReviewTime": 1366156800, "reviewTime": "04 17, 2013"}
{"reviewerID": "A48ABFDDRMKI8", "asin": "043933702X", "reviewerName": "me", "helpful": [0, 0], "reviewText": "i love this game i have had the best fun with this game if it does not work try it on a laptopif u like racing game you might like this.It is kinda old so be expecting that but other wise other than graphics it is grait", "overall": 5.0, "summary": "Best racing game", "unixReviewTime": 1374192000, "reviewTime": "07 19, 2013"}
{"reviewerID": "A26B0P6K95SIKW", "asin": "0439339960", "reviewerName": "Linda G. Baudoin", "helpful": [0, 0], "reviewText": "Gift for my granddaughter.  Likes the game a lot, but prefers to just listen to the music & sounds.  We use it at my house on a separate computer (just for Lana).  Money well spent--provides hours of amusement & education.", "overall": 3.0, "summary": "Lana's opinion", "unixReviewTime": 1288569600, "reviewTime": "11 1, 2010"}
{"reviewerID": "AZ3UWOC8QSO6C", "asin": "0439339987", "reviewerName": "Amazon Customer \"shoppnmama\"", "helpful": [0, 0], "reviewText": "I have reviewed this software many times and I still think it isawesome.I continue to order more and more.The kids at my school love, love it.", "overall": 5.0, "summary": "excellent game", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "A182S3ANC0W7DL", "asin": "0439342260", "reviewerName": "James", "helpful": [2, 2], "reviewText": "I am an Ice Cream Truck Vendor (I lease out 20+ Trucks), and an the owner of a small business that distributes Good Humor Ice Cream in Dayton, Ohio. I purchased this program (as I do most Ice Cream related stuff) just to see what it was all about. I was pleasantly surprised... as there are exercises that allow you to run your own business within the game.  You have to restock, and consider expenses... and you either win or you can loose the day, in business, depending on your decisions. Great tool (game) to teach your kids business and some responsibility. It was also fun!", "overall": 4.0, "summary": "Teach Business to Kids & Adults", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "AY5Q951JAZAX9", "asin": "0439374391", "reviewerName": "Springfield Grandma", "helpful": [0, 0], "reviewText": "My grandson loves Thomas the train so this computer activity was just  right for him.  He dearly loves the activities that are on the program and takes joy in printing off his certificate when activities are completed.", "overall": 5.0, "summary": "THOMAS & FRIENDS GREAT FESTIVAL ADVENTURE", "unixReviewTime": 1356393600, "reviewTime": "12 25, 2012"}
{"reviewerID": "A1TL721YECDIM8", "asin": "0439394422", "reviewerName": "lizzb92", "helpful": [0, 0], "reviewText": "Can not get it to play on my computer but works great on an old computer (xp or later). Otherwise fine.", "overall": 3.0, "summary": "Doesn't play", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "APDCEJMFDO2YT", "asin": "0439394422", "reviewerName": "L. Murray \"common sense\"", "helpful": [2, 3], "reviewText": "Such fast shipping, games is such great condition she even included two extra's so nice of her.Now all i have to do is start up my old windows 2000 to play it and ill be happy as a puppy with a chew toy :)i recommend everyone to buy from this company they are so nice, lovely little messages included and made my day so much better seeing how awesome this person/company is.", "overall": 5.0, "summary": "AMAZING COMPANY", "unixReviewTime": 1285545600, "reviewTime": "09 27, 2010"}
{"reviewerID": "AFJ7A9CSEPZNY", "asin": "043940133X", "reviewerName": "B. Vega", "helpful": [22, 24], "reviewText": "My son hates math!  But, he loves Star Wars and Jabba Math.  Would recommend it for other kids who find math boring and feel insecure in their skills.  It allows for several ways to solve the problems and appeals to the visual learner.", "overall": 4.0, "summary": "Math fun for the mathmatically challenged", "unixReviewTime": 1168300800, "reviewTime": "01 9, 2007"}
{"reviewerID": "A14YVGE643TRJK", "asin": "043940133X", "reviewerName": "David", "helpful": [0, 1], "reviewText": "I was searching for DS games and this somehow worked into the mix.This is a CD computer game.I did not play the game and cannot comment on it.", "overall": 1.0, "summary": "Make sure it is your format", "unixReviewTime": 1324944000, "reviewTime": "12 27, 2011"}
{"reviewerID": "A2H3TQWU51W1WE", "asin": "043940133X", "reviewerName": "ethans mom", "helpful": [3, 3], "reviewText": "My son who hates doing math loves to play this game. I like the fact that you can also have two players so I can play against him to see his progress.You can adjust the voice and music volumes separately and it plays on my Windows XP which I know some have had an issue with.", "overall": 5.0, "summary": "Great math game for your little Star Wars fan", "unixReviewTime": 1299456000, "reviewTime": "03 7, 2011"}
{"reviewerID": "A3KO10N2ODLHBR", "asin": "043940133X", "reviewerName": "Golden Gopher Mom", "helpful": [8, 8], "reviewText": "My seven year old has had a lot of fun with this game while learning math at the same time! Bought it for him when he was in kindergarten and he still loves to play it. No problems with the noise of this game - no noisier than any other PC game.", "overall": 5.0, "summary": "Great game!", "unixReviewTime": 1258329600, "reviewTime": "11 16, 2009"}
{"reviewerID": "A1T98OCCYW6OBI", "asin": "043940133X", "reviewerName": "hieveryone", "helpful": [0, 0], "reviewText": "The game doesn't save at all and that's really irritating because you can't turn your computer off without it completely deleting your progress. Also it turns on and off randomly so when you exit the game all of a sudden it pops back up again. My six year old  thinks it's fun but he gets frustrated with it.", "overall": 2.0, "summary": "UGHHHH!!!", "unixReviewTime": 1343779200, "reviewTime": "08 1, 2012"}
{"reviewerID": "A3P758JGM12DD7", "asin": "043940133X", "reviewerName": "Loretta  L. Fester", "helpful": [0, 0], "reviewText": "Well, i remember playing this game back when it came out, i spent so much time just beating it over and over it was so fun", "overall": 5.0, "summary": "Great Game", "unixReviewTime": 1357862400, "reviewTime": "01 11, 2013"}
{"reviewerID": "A1TBUSGCBTXWFC", "asin": "043940133X", "reviewerName": "Paula Thompson", "helpful": [3, 7], "reviewText": "Came across this accidentally and took it home to play--thought it might be a good gift for a seven year old I know.  Games are fun, so far as I could stand the decibel level.  For me to hear the voices, the music was so loud that the total sound hurt my ears. If the relative loudness of the music and voices were reversed, this would be a better product.", "overall": 1.0, "summary": "Hurts my ears.", "unixReviewTime": 1256428800, "reviewTime": "10 25, 2009"}
{"reviewerID": "A366EUKI8WMGYB", "asin": "0439573947", "reviewerName": "Alex", "helpful": [0, 0], "reviewText": "I had wanted to complete my collection of NFS, and this pack just had a title that didn't have yet ... worth mentioning that for the price you sold it, was impossible not buy it, no matter if I already had two of three games.Regrets that only deliver in the USA but the shipping is fast!.With offers how are you, I always buy on Amazon.", "overall": 4.0, "summary": "Great pack!!", "unixReviewTime": 1327449600, "reviewTime": "01 25, 2012"}
{"reviewerID": "A2VBOZL2J83PCG", "asin": "0439573947", "reviewerName": "gggggggggggabe", "helpful": [0, 0], "reviewText": "i used to play these games all the time, downloading cars and all that business is fun but high stakes doesn't work on windows xp and nothing i've tried to fix it has worked but nfs 3 is cool too.", "overall": 5.0, "summary": "yay old racing games", "unixReviewTime": 1400025600, "reviewTime": "05 14, 2014"}
{"reviewerID": "A31ZJPGGIEX3SV", "asin": "0439573947", "reviewerName": "Harold Morris", "helpful": [0, 0], "reviewText": "I really loved these games, and they were so much better for PC than for the old PS1.  I wish EA would resurrect Porsche for the new platforms.", "overall": 5.0, "summary": "Need for Speed", "unixReviewTime": 1356825600, "reviewTime": "12 30, 2012"}
{"reviewerID": "A221V1CP1DVGRI", "asin": "0439591295", "reviewerName": "Elaine", "helpful": [0, 0], "reviewText": "I got this for my son so I have no idea how it was. He lives in Chicago now.It was a gift", "overall": 5.0, "summary": "Gift", "unixReviewTime": 1391904000, "reviewTime": "02 9, 2014"}
{"reviewerID": "ATNN4DDRIT7Y5", "asin": "0439591295", "reviewerName": "nicole roxanne patrick", "helpful": [0, 1], "reviewText": "The game arrived quickly and plays vey well on my machine. Bought this for my 5 year old, who is already a gamer! Thx much!", "overall": 5.0, "summary": "Scooby-Doo Mystery Adventures PC game", "unixReviewTime": 1355529600, "reviewTime": "12 15, 2012"}
{"reviewerID": "AI2SHH1PWGEUJ", "asin": "0439591368", "reviewerName": "Albert Gomez", "helpful": [0, 0], "reviewText": "Had this game as a kid and figured it would be good for the little cousins. Plus it means I get to play it some more too.", "overall": 5.0, "summary": "good childhood memories with this game, love it", "unixReviewTime": 1363219200, "reviewTime": "03 14, 2013"}
{"reviewerID": "A1Z4X200ED17R4", "asin": "0439591368", "reviewerName": "an online shopper", "helpful": [0, 2], "reviewText": "The CD is incorrectly stated as supported on XP but actually does not!  Waste of money. piece of junk never buy", "overall": 1.0, "summary": "it's a waste - do not run on XP", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"}
{"reviewerID": "A129SW886TYQ6H", "asin": "0439591368", "reviewerName": "Barb Muccianti", "helpful": [1, 2], "reviewText": "Wonderful logic and reasoning skills for children with puzzles, sound effects, and characters to motivate children.  I have used it with students for 15 years and they still love it!", "overall": 5.0, "summary": "Wonderful!!!", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "A1SRVJNFWR0U9J", "asin": "0439591368", "reviewerName": "Cheyenne Henderson", "helpful": [0, 0], "reviewText": "I used to play this in Elementary School! It is a very fun game and even though I am 19 now, I still have fun playing the game!", "overall": 5.0, "summary": "I Love This Game", "unixReviewTime": 1387152000, "reviewTime": "12 16, 2013"}
{"reviewerID": "A2BY4WCZRIM2UM", "asin": "0439591368", "reviewerName": "Christian", "helpful": [3, 3], "reviewText": "If you can get this to run, it is a fun and educational game.  This does not run on xp...a great dissapointment.  I wish this was indicated on amazon before we bought it.", "overall": 1.0, "summary": "dissapointment", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A25C0NYV8WD775", "asin": "0439591368", "reviewerName": "Jpinkpuppy", "helpful": [0, 1], "reviewText": "It was a good product and my children enjoyed it and it worked great was what i expected and i received it in the time they said i would get it!", "overall": 4.0, "summary": "Liked it", "unixReviewTime": 1356393600, "reviewTime": "12 25, 2012"}
{"reviewerID": "A3Q9IUTBTBI7UH", "asin": "0439591368", "reviewerName": "Michelle", "helpful": [1, 1], "reviewText": "I have played Zoombinis since I was a child and I still enjoy this game very much, I just wish it didn't glitch on newer software such as windows 7.", "overall": 4.0, "summary": "Zoombinis", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A10CMR6B6QD60N", "asin": "0439591368", "reviewerName": "mr lady \"vendido\"", "helpful": [1, 1], "reviewText": "I had this game as a kid in the 90s and played it religiously with my sisters around our Windows 95 PC. I recently bought it for my cousin's 6th birthday because I want her to build better computer and problem solving skills. Computers and games have definitely evolved since then, but this is timeless game that helps kids develop those skills in a fun way without math equations and spelling. Watching her play brought back really fond memories and made me want to play again. &#34;Whoever you are.... MAKE ME A PIZZA!&#34;", "overall": 5.0, "summary": "Great game still!", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}
{"reviewerID": "A2M64UKVOU9CWU", "asin": "0439591538", "reviewerName": "Alex", "helpful": [6, 8], "reviewText": "The CD installs the game which doesn't actually run. You click the .exe file then they claim an error has occurred. I did this on three different computes, all with different operating systems.", "overall": 1.0, "summary": "Awful", "unixReviewTime": 1277596800, "reviewTime": "06 27, 2010"}
{"reviewerID": "A1MYSISP73W2OZ", "asin": "0439591538", "reviewerName": "ShakespereIsMyMuse", "helpful": [2, 2], "reviewText": "These are the second and third installments in the Nancy Drew PC line and while they might not be as graphically stimulating as the newer games and little bit on the short (not too short) side, the originals have something the newer games sometimes lack; an in-depth intriguing mystery that actually takes place like an actual crime/mystery that you would need to put a lot of thought and logic into to actually solve; just like on CSI.The second and third installments: Stay Tuned for Danger and Message in a Haunted Mansion are a step up-- graphics-wise -- from the original Secrets Can Kill PC game, but pale in comparison to the newer games. However that's to be expected the late 90's versus the beginning of the second decade of the twenty first century.There have been some complaints as to the older version games not being able to play on newer OS, that would be incorrect.We have OS's Windows: XP, Vista and 7; we have Nancy Drew: Secrets Can Kill (original), Stay Tuned for Danger, Message in a Haunted Mansion plus almost the rest of the Nancy Drew PC line running on these OS's.If you computer's OS isn't smart enough to switch over to the formats for you you can try the following instructions below; otherwise the game will install, but will not play because it was intended to run a much larger file in a much smaller window (I know that doesn't make a whole lot of sense, but it is correct in the way I explained it).This is what you need to do if you have a newer computer/OS (Windows: XP, Vista, 7, 8) and you are trying to play this older model game: You need to first install the game. It will do a computer anaylisis and will tell you that your computer \"Fails\" under two categories 1.) Color Resolution and 2.) OS (Operating System), ignore and install the game anyway. If you click to play the game after the install and an \"Error\" message appears close it and manually change your computer's compatibility mode.To set your computer to run in Compatibility Mode: This can be accessed from the Control Panel; just type in \"Older Version\" in the Control Panel Search Bar and the link will show up. Click it. A Dialog box will pop up and ask which version of Windows you would like to run this program in, choose either Windows: 95, 98 or ME.The computer should ask you if you wish to save this profile for every time you use this particular program click \"Yes\" or \"Apply\".Also from the Control Panel or by Right Clicking on your Desktop under \"Screen Resolution\" switch your pixel resolution all the way down to 800x600.If for some reason you computer does not switch back to normal once you've ejected the game, then once again, just reset the changes manually. The same goes for the fact, if your computer does not automatically set itself back to an older version of windows and a smaller screen resolution when you play the game again; just do it manually, it literally takes two minutes, both ways.Regardless of how much the graphics may suck, any older model game can play on a newer computer/OS whether it's on a CD-ROM or a Floppy Diskette (as long as you have a USB enabled External Floppy Diskette Drive or you hard wire one into your Desktop).", "overall": 4.0, "summary": "Original Nancy Drew; Dual Sequel to the Game that Started It All", "unixReviewTime": 1357344000, "reviewTime": "01 5, 2013"}
{"reviewerID": "A10N7L0GMRODUO", "asin": "0439671418", "reviewerName": "C. Bowman", "helpful": [0, 0], "reviewText": "I was impressed to find out that the game can be installed on Windows 7. I had problems with a previous install of the software. When registering it, the online feature does not work at all. Instead, you have to choose a different option of registering the product. Then once you complete the process, you can start playing the game. Chessmaster 9000 is by far the best way to learn how to be a more effective Chess player.", "overall": 5.0, "summary": "Installed on Windows 7", "unixReviewTime": 1368576000, "reviewTime": "05 15, 2013"}
{"reviewerID": "AFWPLXT2OD6H1", "asin": "0439715571", "reviewerName": "bandazar", "helpful": [1, 1], "reviewText": "seems to work on my xp machine, don't know why it doesn't work on other people's.  Only thing bad about this is that the graphics are not as good as the arcade version.  But what do you expect with a game this old?  Perhaps if it was written today, it would match the arcade graphics version.  Otherwise the game is pretty awesome and has many more configuration and play modes than the arcade version.  The instructions are pretty spotty, but if you press enough keys you'll figure out how and where things are (like F1 and F2 and F4 for example) if you use keyboard.", "overall": 4.0, "summary": "works on xp for me", "unixReviewTime": 1169769600, "reviewTime": "01 26, 2007"}
{"reviewerID": "A1P478YKNZYVXE", "asin": "0439715571", "reviewerName": "GC \"GRC\"", "helpful": [1, 1], "reviewText": "This game actually has fair graphics and gives some decent 3-d endings but it really is short on characters. Scorpion, Jax, Sonya and Sub-Z return but that is basically it.The style of fighting is similar to UMK3 except that you can use weapons(somewhat)and move horizontally in the environment, which makes projectiles a bit less useful. The uber-boss, Shinnok, is actually a playable character and is far too easy to beat while the sub-boss, Goro, is next to impossible to defeat except with 1 or 2 specific fighters.Overall, I think this was one of the best MK games simply because it carries in the tradition of the glory days(MK 3).Note* This game did not work for me on Windows XP so beware, I also doubt that it will even run on Windows 2000. Unless you have a pre-historic operating system, you might do best to pick this game up on a console aka PS2.", "overall": 4.0, "summary": "Solid but sure not perfect...", "unixReviewTime": 1159747200, "reviewTime": "10 2, 2006"}
{"reviewerID": "A1XOI72951IH9Y", "asin": "0439773660", "reviewerName": "1", "helpful": [0, 0], "reviewText": "My Son is very happy, not only with the game, but with the quickness of service and delivery.  Than You .", "overall": 5.0, "summary": "My Son is very happy, not only with the game", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
{"reviewerID": "A2890J1FHE76RY", "asin": "0439773660", "reviewerName": "4thorns", "helpful": [0, 0], "reviewText": "Ordered this for my son and was very disappointed when it did not work on our brand new CPU. It appears it was not compatible with our system software.  My son tried it on two relative's CPU, and it did not work on theirs.Good thing I paid only $4.", "overall": 1.0, "summary": "disappointed momma", "unixReviewTime": 1347235200, "reviewTime": "09 10, 2012"}
{"reviewerID": "AJRHPTQ7TXPD6", "asin": "0439773660", "reviewerName": "Brian48", "helpful": [0, 0], "reviewText": "This game would not install on any of my seven computers. The installer is so dated that if it detects any hardware that it doesn't recognize (i.e. modern hardware), it aborts. Tried all the user forum tricks I could find.  None of them helped.  Even the publisher has abandoned this game and no longer supports it.  Complete waste. Needless to say, my son was very dissappointed.  Don't bother with this one.  It's deprecated software meant for deprecated hardware.", "overall": 1.0, "summary": "Complete waste of time and money.......", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "A1J102IQ2SE7R2", "asin": "0439773660", "reviewerName": "Wendy  Wilson", "helpful": [0, 0], "reviewText": "The only reason I gave it one star is because it arrived to my home in a timely fashion. The game itself didn't work and there was no assistance from THQ to get it to work", "overall": 1.0, "summary": "Didn't work", "unixReviewTime": 1385424000, "reviewTime": "11 26, 2013"}
{"reviewerID": "A14L9HK0DK3SAI", "asin": "0439813182", "reviewerName": "Wendy Schoelier \"cakesbywen\"", "helpful": [0, 0], "reviewText": "wish I had known that my computer wouldn't support the game,  it is an old game and i have tried everything.  trying to open in different operating system etc....I should have checked.", "overall": 1.0, "summary": "not sellers fault but didn't work on my computer", "unixReviewTime": 1352678400, "reviewTime": "11 12, 2012"}
{"reviewerID": "A30W22RFAJSP4I", "asin": "0439862108", "reviewerName": "Robert Dwane Wokaty Jr", "helpful": [0, 0], "reviewText": "We're happy with this game.  My son says that Gameboy games are harder than DS games, but he still likes to play it.", "overall": 4.0, "summary": "My son likes it.", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A1VUPAQRYP1VAG", "asin": "0439900581", "reviewerName": "ldr322", "helpful": [0, 0], "reviewText": "My seven year old grandson loved this game as well as another.  What more can I possibly say?  Really  Really!", "overall": 5.0, "summary": "Loved it.", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "A34UGG0WDKRTQF", "asin": "0439900581", "reviewerName": "T. Downey", "helpful": [2, 2], "reviewText": "This is a great kids game for finding hidden objects. it is even great fun for adults too! It is all the I Spy's tied into one to find hidden objects and to solve puzzles.", "overall": 5.0, "summary": "I Spy Mystery", "unixReviewTime": 1234396800, "reviewTime": "02 12, 2009"}
{"reviewerID": "A1WJW2OIR5BZ58", "asin": "0545036372", "reviewerName": "Keeton Lockwood", "helpful": [0, 0], "reviewText": "This product arrived before it was scheduled to. However, the box was damaged and did not appear to be in new condition. It did look like it was unused though. The item only came with the box and disc for the software. No instructions of any kind. That was disappointing. Seller was excellent, product was good.", "overall": 4.0, "summary": "Interesting Product", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A2NQXA21O64HDZ", "asin": "0545036372", "reviewerName": "Laurie \"mnwoman49\"", "helpful": [1, 1], "reviewText": "My 13 year old grandson thinks it's the coolest thing ever. Installing it was a massive pain in the arse. If you are going to save it to disc, make sure you have RW (rewritable) discs. We still haven't gotten that right. May need to initialize new discs? Anyway, he's happily working on a 3 part epic game and we'll get it sorted eventually. Just be prepared to be patient!", "overall": 4.0, "summary": "Grandson loves it.", "unixReviewTime": 1360281600, "reviewTime": "02 8, 2013"}
{"reviewerID": "A261CI99KET69W", "asin": "0545036372", "reviewerName": "Pow3rh0use", "helpful": [0, 0], "reviewText": "I did a full review on my YouTube channel, but I'll review it here as well. Video Game Tycoon is a game where you're able to create your own video games. You can also burn them to a CD and show them to your friends. While this does sound awesome, the execution is not done all that well.The first thing you will notice is how dated the graphics are, even for 2006. Deus Ex (released in 2000) looks much better than this does. The animations are sloppy and the environments look bland.For the audio, the sounds effects are very stock and unimpressive. The music for the game is also pretty generic. However, you can put your own music into the game that you create if you change the format of the audio file.The game-play is decent enough. Being able to create your games from scratch is enjoyable. There is a good amount of customization you have when creating your games from the objectives of the level to the rewards for beating it. As you complete certain tasks, you unlock new features which give you much more customization to the various features of the levels.However, the mechanics are very limited. After testing out your games, you realize that the games feel very clunky. The controls are some of the worst in video games and there is absolutely no way to change the key bindings. Also, there is nothing really &#34;tycoon&#34; about it. You're not making games to sell them and there isn't any business aspect to it. It's very strange considering the word &#34;tycoon&#34; is in the title.Overall, I feel disappointed with this game. The concept is cool enough, but the execution was not up to par. However, I recommend you try this out for yourself and see how you like it. With the simplified mechanics, it's suited for younger audiences.", "overall": 3.0, "summary": "Unique game with many flaws and limitations", "unixReviewTime": 1401408000, "reviewTime": "05 30, 2014"}
{"reviewerID": "A1VJVU8YSBPAY7", "asin": "0545076412", "reviewerName": "Aerin'smom", "helpful": [0, 0], "reviewText": "We had this before and lost it.  I bought it again because my son wanted to play it.  I know he loves the game so I gave it 4 stars but it is useless unless I can figure out why it won't install.  I have looked for troubleshooting answers but really can't find minimum requirements on it or anything to help.  I obviously need to find someone under 22 years of age to tell me what the problem is.  Feeling old and out of my element.  This should be easy so that is frustrating but I don't think I ordered it wrong or anything is wrong with the product.  I'll find out.", "overall": 4.0, "summary": "Can't get it to install", "unixReviewTime": 1366761600, "reviewTime": "04 24, 2013"}
{"reviewerID": "A25M791P4YG471", "asin": "0545076412", "reviewerName": "Benjamin Varano", "helpful": [0, 0], "reviewText": "DO NOT BUY!The package inside was the wrong game? Save  yourself the money. You won't be playing civ city rome any time soon with this buy", "overall": 1.0, "summary": "If I could choose zero stars, I would.", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"}
{"reviewerID": "A1E2ODNEYJ1UWX", "asin": "0545112141", "reviewerName": "Charles T. Jones", "helpful": [0, 0], "reviewText": "So much fun helping sick animals! You get to work with a variety of animals, not just dogs and cats, which I really appreciate. You get to work with reptiles, amphibians, birds, at some points, even a pony, a fish, and a spider! This game has it all! It also very educational, as you can learn a whole ton about the many different things that can go wrong with pets.", "overall": 5.0, "summary": "Petz Vet", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
{"reviewerID": "A11DR0TXTI0P0L", "asin": "0545115507", "reviewerName": "Amazon Customer", "helpful": [1, 3], "reviewText": "I am a huge Civil War buff - I wrote my senior thesis on the military occupation of New Orleans - but even I found this game difficult to grasp. The AGEOD system needs a lot of streamlining and, though I prefer substance over style, could use a little more flash. A battle involving over a hundred thousand men should be depicted by something more satisfying than a green progress bar and a report full of poorly presented stats.That said, I respect the game's ambition and wish that there were more grand strategy games that tried to have this much fidelity to the period.", "overall": 3.0, "summary": "Ambitious, but Impenetrable", "unixReviewTime": 1349049600, "reviewTime": "10 1, 2012"}
{"reviewerID": "A214Z566V6QEDF", "asin": "0545115507", "reviewerName": "RPM", "helpful": [0, 7], "reviewText": "I don't know about the game because I can't play it.  I have widows vista and I can download the instructions, but error comes up when I try to play the game. I contacted Ageod and they said I am the only one haveing trouble. The internet says that Vista has a lot of game problems.  I just wasted my money on this game.", "overall": 1.0, "summary": "Civil war Game", "unixReviewTime": 1310860800, "reviewTime": "07 17, 2011"}
{"reviewerID": "A1NC9PQCE3NOGA", "asin": "0671317091", "reviewerName": "Joe Adams \"winstonthewolf\"", "helpful": [1, 1], "reviewText": "It won't run on the new operating systems, so if you ever had the chance to play it, just keep the money and the memories.", "overall": 2.0, "summary": "Windows 95 was a long time ago.  It's useless now.", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "AJRJ8E38CRB7C", "asin": "0671317091", "reviewerName": "Katja", "helpful": [0, 0], "reviewText": "If you started playing computer games in the early to mid nineties (e.g. Myst, Zork Nemesis) and think that most contemporary games are too violent, too \"real\", and too technical, then you're going to love this! No idea why I never played this back in the day, but it's awesome! A nice, puzzle-solving, dialog-driven, humorous (one of the voices is John Cleese!), not too linear game where you walk around inside a giant spaceship and figure stuff out at your own pace. It runs fine on Windows XP 32bit, but you might need to download the Cinepak codec to make some of the videos work.", "overall": 5.0, "summary": "So good!", "unixReviewTime": 1344988800, "reviewTime": "08 15, 2012"}
{"reviewerID": "A27QRTHZLBA61M", "asin": "0671317091", "reviewerName": "Miles", "helpful": [1, 1], "reviewText": "This is a very interesting game. It has a very neat art style and plays a lot like Myst. The main difference being the insane logic in this game. You will need to be in a &#34;Hitchhikers guide to the galaxy&#34; mindset to get anywhere in this game. The crazy events, and wacky humor in this game make it extremely entertaining. I would recommend this to any Douglas Adams fan. if you do get it, prepare to think WAY outside the box .( or find a walkthrough online...)", "overall": 5.0, "summary": "The illogical logic of Douglas Adams", "unixReviewTime": 1365033600, "reviewTime": "04 4, 2013"}
{"reviewerID": "AVTLLY67TSLU3", "asin": "0671317091", "reviewerName": "R. Laisle", "helpful": [0, 1], "reviewText": "Nowhere in the description does it tell you that it won't run on any program newer than Windows 98. I built a gaming computer that would have cost over $3K if you could buy anything close to it in a retail environment so I know it isn't my machine. VERY disappointed as I am a very big Douglas Adams fan.", "overall": 1.0, "summary": "Misleading", "unixReviewTime": 1383091200, "reviewTime": "10 30, 2013"}
{"reviewerID": "A3DYVJC57FX8EH", "asin": "0700026355", "reviewerName": "Maru Cheferrino", "helpful": [0, 1], "reviewText": "Great soundtrack, great graphics, amazing AI game commentators. As for playability I still prefer Pro-evolution Soccer for Nintendo Wii, because we can manage the whole team actions just by pointing at players and dragging their positions to where we want them to run to.", "overall": 4.0, "summary": "Nice game", "unixReviewTime": 1378944000, "reviewTime": "09 12, 2013"}
{"reviewerID": "ADOCLYEFV2PKH", "asin": "0700026355", "reviewerName": "Victor Vasquez", "helpful": [1, 2], "reviewText": "I consider its not your fault but a game from this time 2012 and 2013 must work for Windows 8", "overall": 2.0, "summary": "Doesnt work for Windows 8", "unixReviewTime": 1363737600, "reviewTime": "03 20, 2013"}
{"reviewerID": "A3P2DVO3OG6MIN", "asin": "0700026649", "reviewerName": "Ankit Agarwal", "helpful": [0, 0], "reviewText": "I liked this game a lot. I ordered the Limited Edition which has some extra NFS Edition cars and Challenge Series.If you are looking for some real thrill and real life driving, go buy this game.Amazing graphics ( courtesy of Frostbite Engine)Amazing soundtracks and effects.", "overall": 5.0, "summary": "Action Packed Hollywood Style!!", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"}
{"reviewerID": "AX0VECEWD77TF", "asin": "0700026649", "reviewerName": "Danielle Horton", "helpful": [0, 0], "reviewText": "Got here on time and got here a day early before they said it would and came in nice packaging.", "overall": 4.0, "summary": "Speedy quick", "unixReviewTime": 1364256000, "reviewTime": "03 26, 2013"}
{"reviewerID": "A31K5W6NWK68OA", "asin": "0700026649", "reviewerName": "Philw19642002 \"Phil\"", "helpful": [0, 1], "reviewText": "Not as good as X-Box version but I hear that in 2014 all games that are for a PC will be exactly l;ike the X-box and Play Station versions. I sure hope they improve.", "overall": 3.0, "summary": "Video Games", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "AQ6WW45IHO83P", "asin": "0700026657", "reviewerName": "Aaron Ledden", "helpful": [0, 0], "reviewText": "This is the best RTS game thats come out for a while. Solid game that keeps you interested and having fun that said its a Citysim type which won't appeal to everyone.", "overall": 4.0, "summary": "A Good Game", "unixReviewTime": 1371945600, "reviewTime": "06 23, 2013"}
{"reviewerID": "A2M8JTIST6FPZZ", "asin": "0700026657", "reviewerName": "Amazon Customer \"rlshill\"", "helpful": [1, 2], "reviewText": "4 Stars because they like it and play it often enough so don't feel like money is wasted. I got them one each so they can multiplay with each other.", "overall": 4.0, "summary": "My boys enjoys these strategy games", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
{"reviewerID": "A6XUMA60GD7OZ", "asin": "0700026657", "reviewerName": "Anna S. Palmer \"Lady Rags\"", "helpful": [13, 27], "reviewText": "I have been unable to play this game.  Unisoft has made it unplayable if you are not a techno whiz. ( I have tried several times to get it up and running.)  I just want to play in my home not on the internet and for some reason it will not load on the computer.  I probably will never buy another UNI-SOFT game or product..", "overall": 1.0, "summary": "ANNO 2070", "unixReviewTime": 1348358400, "reviewTime": "09 23, 2012"}
{"reviewerID": "A2IU72XM9F49P6", "asin": "0700026657", "reviewerName": "Brian V. Lee", "helpful": [6, 6], "reviewText": "This game is not for everyone.  If you only enjoy constant fast paced FPS games, this is probably not for you.  But, if you've dabbled in Empire Earth, AOE, Age of Mythology, and enjoy these economy based warfare games, definitely give ANNO 2070 a shot.There is a learning curve, particularly if you are a newcomer to the series.  Essentially, this game is about meeting the needs (food, drink, belongings, entertainment, community, etc.) of your citizens, which become increasingly demanding as they rise from the ranks of common workman to something equivalent of CEO.  With their progression brings higher taxes income, yielding a stronger economy capable of building and supporting an impressive military.  Warfare is not necessarily the focus, or even the majority of the fun, in this game, but it still gives the option for ship, submarine, and aerial combat, with several units of each type available.  You can even go nuclear.  It's pretty sweet.There are three \"races\" of people.  It's a bit like Starcraft in that they can each build their own units, and have their own specific needs.  The first group is the ECOS - they are the liberal hippy tree huggers who care only about thee environment, and turn unhappy if the ecobalance becomes too polluted.  The 2nd group, the TYCOONS, are the seal clubbin' oil drillin' conservatives who care only about making money no matter the cost.  Finally, you have the TECHS, a faction only concerned with technological research.  The TECHS are featured moreso in the expansion (ANNO 2070: Deep Ocean), but are still important for development of ECO and TYCOON needs as they advance.  I highly recommend the expansion if you play this and find you like it - it adds so many new ways to develop your cities.I love this game.  I've always been a fan of city builders, but this one (like ANNO 1404) has really drawn me in.  I've put in weeks worth of hours on it and am still playing.  The campaign missions are fun, but the real joy lies in a continuous game.  Once you are comfortable playing, you can spend literally hours on a hard continuous game with 3 AI players, a pirate base, and a warship hellbent on your destruction.  It is still a challenge even after playing for over a year.  I think a lot of what makes it fun is that no two games are ever played the same way.  There are different ways to power your city, different upgrades to utilize, different ways to destroy your opponents.A quick note about DRM: It sucks that this game must be played with a constant internet connection.  There is a multi-player faction, but honestly I've never even tried it.  Single player is what I enjoy, and there's no reason to be online for that.  Still, I give it five stars, because the game itself warrants it IMO.", "overall": 5.0, "summary": "If you like RTS games, check out ANNO 2070", "unixReviewTime": 1368403200, "reviewTime": "05 13, 2013"}
{"reviewerID": "A8SSL0QMV2VY1", "asin": "0700026657", "reviewerName": "Corubia", "helpful": [12, 13], "reviewText": "I finally broke down and bought this game.  I have played all of the other titles in the Anno series so I was reasonably confident I would like this installment.I did, but...First off: no CD-KEY printed on the manual cover (a .pdf file to boot).  I spent the next 3 days exchanging emails with Ubisoft to get one.  This entailed screen caps of receipts, manual covers and proof of a real CD (they were very helpful).  Ok, Now I can play... NOT!  Every time it loaded, it Crashed To Desktop (CTD).Ok, so now I have spent another day looking up info on the web about that.  I had to lower my computer resolution to 800x600 AND change some of the graphics settings to low AND had to turn off stuff in the uPlay settings.Ok, finally got a profile setup (and you only get 1).  Now, I get to play... NOT!  Every time I accept a side mission it CTD's and I have to kill the proses just to exit the game.I can put up with a lot of stuff if the game runs, but I cannot deal with having to save before every quest, mouse over on the info tabs, etc just in case my game crashes.  Hell, I cannot even play single missions without it crashing.  I was hoping the expansion would help stabilize it, but I have decided to send them both back.I was willing to put up with uPlay, even if the DRM sucks.  What do you mean I can't change my hardware?  Ok, I have a laptop and thought that would be ok.  Till I found out that 3 is the limit.  I do plan to get several new computers over the next decade.I really wanted to play a more modern feeling Anno.  From what I have played, its a fantastic game, but...At least I still have 1404 Gold.", "overall": 2.0, "summary": "Great game but...", "unixReviewTime": 1366588800, "reviewTime": "04 22, 2013"}
{"reviewerID": "A3HR8L31S8AFF6", "asin": "0700026657", "reviewerName": "D. A. Williams \"Omega\"", "helpful": [0, 0], "reviewText": "I picked this rating because, although this game is redundant in build, the scenarios do change. It is challenging in both multiplayer and single player. You get a world even every so often and only a limited time to do the event. You get mad experience points for it as well.So if you like builder games that come with some serious challenges, unlike its predecessors, this game will keep you busy for hours and hours and hours. Once you start you keep pushing to get to that new level, that new tech, that new fleet of ships. Ubisoft did good by this one. Pick up a copy and if you want to play together? Just coment and we certainly can arrange that.", "overall": 5.0, "summary": "Really fun", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"}
{"reviewerID": "AA9LU15A9PX9E", "asin": "0700026657", "reviewerName": "GT Extreme", "helpful": [0, 0], "reviewText": "Game can be fun, challengeign, and everything on the box, but its not easy to learn, not even with the manual(which is online)", "overall": 3.0, "summary": "Game is ok.", "unixReviewTime": 1377388800, "reviewTime": "08 25, 2013"}
{"reviewerID": "ATI21V0A8K25G", "asin": "0700026657", "reviewerName": "Hags...", "helpful": [10, 12], "reviewText": "Good game. Good graphics. A bit of a learning curve. It arrived way before estimated time. High speed connection and newer gpu for best outcome.", "overall": 4.0, "summary": "Nice..", "unixReviewTime": 1328313600, "reviewTime": "02 4, 2012"}
{"reviewerID": "A1JPYSVXO2PV36", "asin": "0700026657", "reviewerName": "J. Barone", "helpful": [11, 12], "reviewText": "The DRM is atrocious.  No one should buy a game with such a cynical and invasive wrapper.The game itself seems solid.  The interface is extremely cluttered; their UI/UX designers didn't do nearly as good of a job as they did with previous Annos.  If hell freezes over and Ubisoft decides to buck the AAA trend of putting their games in garish, grotesque cages, I'll be first in line for the DRM-free rerelease.", "overall": 1.0, "summary": "DRM and clutter ruin promising game", "unixReviewTime": 1361836800, "reviewTime": "02 26, 2013"}
{"reviewerID": "AFVETWC6I3BLJ", "asin": "0700026657", "reviewerName": "Jens Dietz", "helpful": [9, 11], "reviewText": "too much work to set up and play requires internet to play and too many items to set to play.", "overall": 2.0, "summary": "not the same as 1701", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A1EO9BFUHTGWKZ", "asin": "0700026657", "reviewerName": "johnnyz3", "helpful": [0, 1], "reviewText": "I liked it and had fun with it, played for a while and got my money's worth.  You can certainly go further than I did but I got frustrated with the fact that here we are in this new start and still taking from the earth rather than living with it. Better than simcity in that respect and maybe the best we could hope for.", "overall": 4.0, "summary": "Pretty fun", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
{"reviewerID": "A2RYQIFIOUDCPF", "asin": "0700026657", "reviewerName": "Kayla Benson", "helpful": [0, 0], "reviewText": "This was actually for my boyfriend, but he loves it. He enjoyed Anno 1417, & this one did not disappoint either. You do get to go under water this time which was fun. And the graphics are very stunning.", "overall": 5.0, "summary": "Very fun", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
{"reviewerID": "ADIFU04E5VS5", "asin": "0700026657", "reviewerName": "Kiroshimatsu", "helpful": [16, 18], "reviewText": "Awesome game, but all the DRM issues really have made some issues with the game. You have to have it attached to a uplay account in order to even play the game... so, similar to Diablo 3 you're forced to have internet access in order to launch the game, even if you want to play single player.At one point I've also had an issue come up that said the game was &#34;incompatible with my current OS&#34;... if you run into the same problem, launch the game as Administrator and it will work fine. Also... THE GAME CODE WILL NOT ACTIVATE ON STEAM. I got this on amazon to try it out and if I didn't like it I wanted to sell it, but having it required to attach to your uplay account basically didn't allow me to do that. So I'm stuck with a game with insane costs for any DLC...If you like sim city style games, I'd pick this one up... but wait for a steam sale and get it through there so that the dlc's are also at a reasonable cost as well.", "overall": 3.0, "summary": "DRM Issues", "unixReviewTime": 1357776000, "reviewTime": "01 10, 2013"}
{"reviewerID": "A23LPWYLCEXQ4U", "asin": "0700026657", "reviewerName": "krys", "helpful": [3, 4], "reviewText": "Great game. Very complex and can get hard to handle with larger cities but i like the challenge. Interesting missions", "overall": 5.0, "summary": "Great", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "ABU5YE20PHC8R", "asin": "0700026657", "reviewerName": "LinguistJunkie", "helpful": [1, 1], "reviewText": "Definitely one of the best products UbiSoft has released.  The game is very similar in its interface to its predecessor: Anno 1404 but its story line and the scope of the game is far more developed.  The player is able to vote in world council initiatives that directly affect in-game play as well as participate in random missions that earn the player career points enhancing the player's game play.", "overall": 5.0, "summary": "Anno 2070", "unixReviewTime": 1354579200, "reviewTime": "12 4, 2012"}
{"reviewerID": "A6Q1IUFSN2E2D", "asin": "0700026657", "reviewerName": "Mady", "helpful": [0, 0], "reviewText": "I got this game on Amazon because it had a very good price, but upon receiving it i downloaded the game, but it would not run. It said it needed updates but the auto updater would not work. I was able to get a full refund very quickly and I am happy about that but very disappointed that the game i had anticipated so long would not run.", "overall": 1.0, "summary": "Wouldn't download.", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A3KSKDF6K48NU6", "asin": "0700026657", "reviewerName": "Matraa", "helpful": [2, 6], "reviewText": "A bit of a snoore-fest. I played it for a few hours but felt like I was back in kindergarten.Perhaps I didn't give it enough of a chance, but when I have nearly nil motivation to keep playing it, I just cant waste the time on this title that it may need or deserve in order to want to keep going.", "overall": 1.0, "summary": "Yawn", "unixReviewTime": 1362009600, "reviewTime": "02 28, 2013"}
{"reviewerID": "AHHPSZAVRAQ9D", "asin": "0700026657", "reviewerName": "Matthew F. Newell \"~foster boy~\"", "helpful": [10, 12], "reviewText": "I love the Anno Series from the first one to this one, but holy crap that whole Uplay login process is ridicules.I mean what happened to just playing a game on you computer separate from the internet.other than that this is a great time waster, the hours fly bysome of the newer ways of this game are confusing for even long time anno players.Anyway I do kind of miss the old school 15th century styleAnyway I would really only recommend this for Anno allums that have to have an Anno fix.", "overall": 3.0, "summary": "Great Anno but......", "unixReviewTime": 1362441600, "reviewTime": "03 5, 2013"}
{"reviewerID": "A2L939JSLGHBP6", "asin": "0700026657", "reviewerName": "Michael Dalton", "helpful": [27, 52], "reviewText": "If you buy this game, you will regret it.  If you change any major component in your computer 3 times, the game will stop working permanently. And it will never work again. So, if you plan to play this game a few years from now, you will not be able to do so.  Is this some horrible bug? No - this is intentional. It is a scheme to get people to buy the same game over and over again.  This should be illegal.  So, if you want to actually play games you buy, DO NOT BUY THIS GAME!!!!!!", "overall": 1.0, "summary": "Terrible, terrible game.", "unixReviewTime": 1327795200, "reviewTime": "01 29, 2012"}
{"reviewerID": "A2VLH0R0UP9ULJ", "asin": "0700026657", "reviewerName": "Michael \"Physicist\"", "helpful": [3, 3], "reviewText": "This is a great real-time supply chain management game.  However, the play is novel and there is a steep learning curve.  Some reviewers have criticized the campaign for being too restrictive.  That is not a fair criticism.  The first 3/4 of the campaign is basically a tutorial.  The campaign holds your hand from objective to objective so that you can get a feel for how to succeed.This game really eats up time.  1 hour is about the minimum amount you would want to spend per session.If you like tinkering and optimizing and losing yourself in a complicated game, then you might really enjoy Anno 2070.I think this game should really appeal to people with an inclination to programming who like developing and optimizing algorithms.", "overall": 5.0, "summary": "Fantastic simulator, steep learning curve", "unixReviewTime": 1363996800, "reviewTime": "03 23, 2013"}
{"reviewerID": "A3UNTT3TJ8RC45", "asin": "0700026657", "reviewerName": "PhrozenBlur", "helpful": [0, 0], "reviewText": "This is a very fun game single player is difficult but the multiplayer makes you feel like you lived a sheltered life.  It reminds me of first generation Sim City with awesome graphics.", "overall": 5.0, "summary": "Very fun game", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A1LMJ9W8UX1H5B", "asin": "0700026657", "reviewerName": "Rob NY", "helpful": [27, 41], "reviewText": "I've bought and played ALL of the ANNO games since 1602, and spent more hours than I can even count building massive empires with extremely complex trade routes. I was thrilled to see another installment released, but I absolutely will NOT pay for something that limits my hardware changes and installs.Wake up UBI, look at all of your other software title reviews, both here on Amazon and on gaming sites. People are not as stupid as you think, and will simply find a different game to fill their time with and throw their money at if their freedoms are inhibited by your software.By adding DRM you've actually promoted the use of piracy instead of reduced it, because those that really do want to play it will find a way.", "overall": 1.0, "summary": "SAY NO TO DRM!!", "unixReviewTime": 1337040000, "reviewTime": "05 15, 2012"}
{"reviewerID": "A29BCFRLQ33TY2", "asin": "0700026657", "reviewerName": "Samuel S. Nicholas \"Grenn\"", "helpful": [2, 2], "reviewText": "Well, I read some ratings before i purchased this game. I watched video on youtube, and  figured I could figure out how to play. Well, I could  not. And as the other reviews state...there are no instructions inclueded.", "overall": 2.0, "summary": "Wow", "unixReviewTime": 1367798400, "reviewTime": "05 6, 2013"}
{"reviewerID": "A3IPBPB0Q9O5ZR", "asin": "0700026657", "reviewerName": "Thom", "helpful": [1, 4], "reviewText": "I can&#8217;t stop playing my wife is going to through it out soon. It was worth the money to buy it.", "overall": 5.0, "summary": "Anno 2070", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "AV969NA4CBP10", "asin": "0700026657", "reviewerName": "Travis B. Moore \"travman\"", "helpful": [0, 1], "reviewText": "I have played the old anno 1701 AND 1503.  this game looks great but is more complex than the previous versions of the game. I found a lot of things lacking such as the sources of power and an inability to store energy with batteries or regenertive fuel cells as buildings in the game need power. Trade is about the same. My main beef with this it requires an internet connection. Other than that it has wonderful artistry and graphics. It is the same as anno 1701 but set in a future world where global warmming as flood the land and resource scarcity has sent human kind to look to the deep ocean for valuable minerals. I recoment the deep ocean expansion or complete if you get this. I found the ai instructor a little corny but other than that the game has some real polish. I wrote my 2 cents worth on suggestions on anno 2070 wiki and you can read 3 pages on that for game ideas I had.", "overall": 5.0, "summary": "Anno 2070 more like anno 1701", "unixReviewTime": 1392940800, "reviewTime": "02 21, 2014"}
{"reviewerID": "A1WK5I4874S3O2", "asin": "0700026657", "reviewerName": "WHiteSkull", "helpful": [0, 0], "reviewText": "I bought this game thinking it would be pretty cool and that i might play it for a  week or two and be done.  Boy was I wrong! From the moment I finally got the gamed Fired up (the other commentors on this are right, it takes forever and u are forced to create an account) I watched as it booted up I could tell right off the bat that ALOT of thought went into making this game. If you have ever played Sim city, then this game is a must try as you will easily navigate thru it and its multi layers. I have been playing htis now for a month straight, and I am STILL discovering layers of complexity in the game. There are a few things in the game that could used tweaked, but all in all this is a 5 star game.", "overall": 5.0, "summary": "A very good game balance of skill with depth of choices", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "A1EHUIMKXQ45NX", "asin": "0700026657", "reviewerName": "Y. Haq", "helpful": [1, 1], "reviewText": "It was a lot of fun at first but after a few days it quickly got repetitive and really unsatisfying. There isn't much gratification in playing this game. I haven't touched it for months now. No real incentive to replay.", "overall": 3.0, "summary": "It's okay", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "A2HD75EMZR8QLN", "asin": "0700099867", "reviewerName": "123", "helpful": [8, 12], "reviewText": "Installing the game was a struggle (because of games for windows live bugs).Some championship races and cars can only be \"unlocked\" by buying them as an addon to the game. I paid nearly 30 dollars when the game was new. I don't like the idea that I have to keep paying to keep playing.I noticed no improvement in the physics or graphics compared to Dirt 2.I tossed it in the garbage and vowed never to buy another codemasters game. I'm really tired of arcade style rally/racing games anyway.I'll continue to get my fix from Richard Burns Rally, and you should to. :)http://www.amazon.com/Richard-Burns-Rally-PC/dp/B000C97156/ref=sr_1_1?ie=UTF8&qid;=1341886844&sr;=8-1&keywords;=richard+burns+rallyThank you for reading my review! If you enjoyed it, be sure to rate it as helpful.", "overall": 1.0, "summary": "Pay to unlock content? I don't think so.", "unixReviewTime": 1341792000, "reviewTime": "07 9, 2012"}
{"reviewerID": "A3UR8NLLY1ZHCX", "asin": "0700099867", "reviewerName": "Alejandro Henao \"Electronic Junky\"", "helpful": [0, 0], "reviewText": "If you like rally cars get this game you will have fun.It is more oriented to &#34;European market&#34; since here in America there isn't a huge rally fan party. Music it is very European and even the voices from the game very &#34;English&#34; accent.The multiplayer isn't the best but it works just ok.", "overall": 4.0, "summary": "Good rally game", "unixReviewTime": 1372550400, "reviewTime": "06 30, 2013"}
{"reviewerID": "AE5R88W48E02C", "asin": "0700099867", "reviewerName": "Amazon Customer", "helpful": [0, 1], "reviewText": "I was in punchdrunk love with the concept of DIRT. I loved the dirt tracks and the specialty racing vehicles and chopped up pickup trucks. I was deliriously giddy with racing garbage trucks in the desert! I H+A+T+E THE STIFF PRECISION LEVEL AND SKILL REQUIRED OF GYMKANA and racing on blacktop! This game is the stupidest ripoff ever foisted on a trusting consuming public. I even hate the dirt sections in this pathetic lame hurting loser. Go someplace far away.", "overall": 5.0, "summary": "I hate gymkana!!!", "unixReviewTime": 1385769600, "reviewTime": "11 30, 2013"}
{"reviewerID": "A1INA0F5CWW3J4", "asin": "0700099867", "reviewerName": "Amazon Shopper \"Mr.Repsol\"", "helpful": [0, 0], "reviewText": "1st shipment received a book instead of the game.2nd shipment got a FAKE one. Game arrived with a wrong key inside on sealed box. I got in contact with codemasters and send them pictures of the DVD and the content. They said nothing they can do its a fake DVD.Returned it good bye.!", "overall": 1.0, "summary": "Wrong key", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
{"reviewerID": "A1DLMTOTHQ4AST", "asin": "0700099867", "reviewerName": "ampgreen", "helpful": [7, 10], "reviewText": "I got this version instead of the PS3 version, which turned out to be a mistake. Console versions of games look 95 percent as good as their PC versions, but you do not have to deal with driver issues and the numerous things that can go wrong with windows. First off the installation takes about 30 minutes, which is ridiculous. I have never had a game take this long to load, Shift 2 took about 20 minutes which seemed too long also. Next many of the latest games for PC are forcing you to have an internet connection in order to install the game, regardless of whether you want to play only offline single player games. Shift 2 unleashed is also like this, so be forewarned. Internet requirements are not prominently displayed on the boxes. The game pushes you, but does not require you to, sign up for a Games For Windows Live account, which is required to get the game patches and updates. More time wasted signing up for that. Finally after about one hour the game was up and running , but the menu screen text had red blocky borders, and the sun in the game screens was ugly pink red, with red reflections on the car and everywhere. So more time spent googling to find a solution to this. I had to download a hot-fix driver update for my AMD videocard driver, which solved that red text and sun problem. Finally after nearly 2 hours I was able to play the game, which is perhaps the prettiest racing game I have ever played. Magnificent graphics, and fun excellent gameplay. Good forcefeedback effects with a steering wheel, and excellent sense of speed and immersion, makes this a top notch sim racer with just a hint of arcade feeling to it.I was really, finally enjoying the game , when suddenly about 30 minutes in to a race the game suddenly crashed. No error message or anything, it just hung up and crashed to desktop, under windows 7. I later tried it with Windows XP on the same machine, and it crashed less frequently, usually only when exiting the game, but random crashes really kill the fun of a racing game, since it might not crash during an entire 20 lap race or it might crash on the 2nd lap.It is a great game when it works, and if you are lucky enough to have a machine that it runs stably on then by all means get this game. But hang on to your receipt just in case.I am tired of fiddling with my computer trying to find a totally reliable setup for this game, so I think I am going to buy a copy for my PS3, which has never crashed, in over 3 years of game playing. I have been buying the top notch PC versions of videogames and spent thousands of dollars over the years on faster videocards and cpu's , but I have finally grown tired of fiddling with incompatibilities of hardware and software, and now game publishers demanding that you have an internet connection as well as providing a long serial number, utilizing gigabytes of harddrive space, 30 minute or longer installation times ( it takes less time to install Windows 7 ) , and requiring you to sign up for their online service and game store, and still you have to put that stupid little DVD in your computer everytime you want to play a simple game to relax. I am pretty much done with PC gaming, since the consoles are so much less hassle, and they have \" good enough \" graphics that the diminishing returns of costly higher resolution better antialiased higher framerate graphics is not worth it. When the PS4 and Xbox 720 come out, I think the law of diminishing returns will be even more evident.", "overall": 3.0, "summary": "awesome game, if it did not crash frequently !!", "unixReviewTime": 1315958400, "reviewTime": "09 14, 2011"}
{"reviewerID": "A25K6I70BEHL1W", "asin": "0700099867", "reviewerName": "Andy", "helpful": [0, 0], "reviewText": "Pros:The game is about driving all sorts of vehicles on all different terrain, and at that the game does very well. There are a number of different vehicles to unlock in each vehicle category and the tracks range from asphalt to dirt to snow, some mixing the various terrains in a single course. If anybody has played any of the Colin McRae Rally games, or naturally any of the previous Dirt games, they should feel right at home* (see Cons for *).The game basically has the player build up his fame to gain more sponsorships and be invited to tournaments and open new seasons. In the first season you are shown all terrains types and give the opportunity to learn gymkhana (~stunt driving~).The graphics are polished and high quality, especially on the vehicles, and engine audio is up to par.Gameplay is fairly straightforward, yet quite entertaining. Smashing your and opponent's vehicles is a ton of fun and damage modeling is well done.Its just fun to drive and crash in the game. The game is very \"modular\" and can be picked up to play for just a short while or you can go all out and spend hours and hours.Cons:Gameplay can get repetitive, and even if the type of event is switched nearly every other race, you get to replay the same tracks, a number of times in different events (which are \"different\" really only by name).Car feel is somewhat bland, most cars in the same group feel very similar or nearly identical, the biggest difference you will feel is the stopping distance increase with more horsepower of the car. By contrast, this also makes it weird when a car actually behaves quite differently than the others, such as Ken Block's car or the Original Mini Cooper.In conjunction to the above, car handling is a bit weird at times, might be me, using a keyboard, but, during a normal dirt rally stage, you pretty much cannot recover from a real handbrake turn. Not sure if it is because of car tuning or abs still on (abs should not matter, but it's the only thing I have on) but once the car's back-end has slid around past say 20 degrees off center, the slide is irrecoverable. Does not matter if you apply full opposite lock, does not matter if you break, accelerate, or just let go of the gas pedal, does not matter what type of turn it is (shy of a hairpin), your call will keep sliding in the same direction, potentially getting more sideways, until you crash or slow down to 10 km/h (6mp/h).Games for Windows Live - whenever you see this logo, be afraid, very afraid! In Dirt 3, you will HAVE TO have or create a Windows Live account, or you WILL NOT BE ABLE TO SAVE THE GAME. Or play online for that matter. This is just some crappy DRM scheme and I was quite sad to find out about it, as this, plus having to always have the dvd in your drive, makes just booting the game an annoyance. Once all is set up, its not that bad of a hassle, but still, why punish players that buy the game?The menus and animations, and introductions will drive you up a wall. The are cool the first 100 times, -_- , not allowing me a way to skip them is just cruel. You will notice this the most when you enter a race: unskippable animation to show you your car, 1 second pause, menu pops up with \"Race\" and \"Mod car stuff\", etc, and then another 5 second animation to show you your car again, but on the starting grid, 1 second pause, and then its time to race, 3 second countdown till you can actually drive. Also every time you select an item from the race menu (those triangle things) again, animation, 1 second halt, here is what you ordered, oh new selection, sorry that need another animation.* People that were used to the Colin McRae games might be wondering where real rally went in the game. The one with the stages, and having to spend time in between races to repair damage, having to complete a few stages of a race with a half broken car. The special feeling of being part of the WRC is mostly gone. Now most races are on the short side (they do get longer as you progress), can be restarted at any point and no previous-race progress is lost, and even more there is the rewind feature. Naturally you do not need to use these mechanics, but just being there spoils the mood.Other Thoughts:It may seem like I slammed the game pretty hard, but then gave it a strangely high mark. The point is that the game is good, quite good, despite all the above issues, which all in all are actually fairly small things. Plus the cheap price bumps it up a notch.You will want to immediately turn off all assists (keep the driving line and abs at first, then decide for yourself) else the car basically drives itself.The loss of a true rally mode may be a make it or break it deal for somebody. The game is really fun, the driving is very fun regardless of the issues stated above, yet you will miss good ol' Colin.I would have given the game 3.5 out of 5, just because of the great stuff lost over the years, but I realized that it was not fair to compare it with something that (unfortunately) it is not anymore.For $12 it's a great deal.", "overall": 4.0, "summary": "Great driving game with a few blemishes", "unixReviewTime": 1345075200, "reviewTime": "08 16, 2012"}
{"reviewerID": "A361M14PU2GUEG", "asin": "0700099867", "reviewerName": "Angry Ryan \"Ryan A. Forrest\"", "helpful": [2, 2], "reviewText": "I had Dirt 2 on Xbox 360 and it was an okay game. I started playing games on my laptop and bought a few new games to build my collection. This game is very fun to play. It is so much better than Dirt 2. If you like racing games you should check this out. The graphics are perfect on my compter.", "overall": 4.0, "summary": "DIRT 3", "unixReviewTime": 1308009600, "reviewTime": "06 14, 2011"}
{"reviewerID": "AW1X78QFLX7WL", "asin": "0700099867", "reviewerName": "anne schwendiman", "helpful": [0, 0], "reviewText": "Yeah, well, the interface on D2 is way more immersive, but D3 gives you many more and way cooler cars. The problem is you gotta pay for some of them. Now that ain't right. Anyway, this is a furiouse game with lots of eye candy and exciting race action (wow, I sound like a commercial.) You don't want to skip buying the xtra cars cuz they're way fine, but jeez man, that's more moola. So the camera work is still weak. Like why can't the playback just playback a good TV view. You miss a lot of action cuz you're getting a close up of a wheel spinning -- big deal (same with the playback on D2.) I'd buy it if I were you, but then there's no one like you... Right?", "overall": 5.0, "summary": "Give Me A Ford!", "unixReviewTime": 1360022400, "reviewTime": "02 5, 2013"}
{"reviewerID": "A2UTRVO4FDCBH6", "asin": "0700099867", "reviewerName": "A.R.G.", "helpful": [0, 0], "reviewText": "Overall this is a well done racing game, with very good graphics for its time period. My family has has enjoyed playing it a great deal. I personally think a steering wheel controller is almost a necessity for this game, but an x box type controller would probably work. The keyboard would be almost impossible, and not very fun. The \"windows live\" system detracts greatly, since you must log in and be online to play or save game progress. There was a mees up with my \"Live\" log in and the game would no longer accept my activation code and I had to rebuy the game if I wanted to play. There is no customer support at all. Dirt 2 suffers from this serious flaw as well. 4 1/2 star game 1 star Windows Live feature.", "overall": 4.0, "summary": "Good racing game, terrible Windows Live Requirement", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "A37DL3ZB4BKUDB", "asin": "0700099867", "reviewerName": "Barbara Hladik", "helpful": [0, 0], "reviewText": "I have been a fan of Dirt 3 ever since Dirt 2; (my fav). In Dirt 2 I have 100% of the game completed & on level 73. I plan to do the same with the 3rd game. Racing in snow is interesting. the ONLY thing I'll miss in Dirt 3 is my favorite car from Dirt 2; the Nissan 350z", "overall": 5.0, "summary": "Dirt 3 puts other racing games to shame", "unixReviewTime": 1357084800, "reviewTime": "01 2, 2013"}
