{"reviewerID": "ARMDSTEI0Z7YW", "asin": "0077614992", "reviewerName": "dodo", "helpful": [0, 0], "reviewText": "This book was a requirement for a college class. It was okay to use although it wasn't used much for my particular class", "overall": 5.0, "summary": "great", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A3FYN0SZYWN74", "asin": "0615208479", "reviewerName": "Marilyn Mitzel", "helpful": [0, 0], "reviewText": "This is a great gift for anyone who wants to hang on to what they've got or get back what they've lost. I bought it for my 77 year old mom who had a stroke and myself.I'm 55 and like many of us at that age my memory started slipping. You know how it goes. Can't remember where I put my keys, can't remember names and forget about numbers. As a medical reporter I was researching the importance of exercising the brain. I heard about BrainAerobics and that it can help improve and even restore memory. I had nothing to lose, nor did mom so we tried it and were actually amazed how well it works.My memory improved pretty quickly. I used to have to write notes to myself about every thing. Not any more. I can remember my grocery list and errands without writing it all down. I can even remember phone numbers now. You have to keep doing it. Just like going to the gym for your body several times a week, you must do the same for your brain.But it's a lot of fun and gives you a new sense of confidence because you just feel a lot sharper. On top of your game so to speak.That's important in this competitive world today to keep up with the younger one's in the work force.  As for mom, her stroke was over two years ago and we thought she would never regain any more brain power but her mind continues to improve. We've noticed a big difference in just the last few months since she has been doing the BrainAerobics program regularly. She's hooked on it and we are believers.Marilyn Mitzel/Aventura, FL", "overall": 5.0, "summary": "AMAZING HOW QUICKLY IT WORKS!", "unixReviewTime": 1228089600, "reviewTime": "12 1, 2008"}
{"reviewerID": "A2J0WRZSAAHUAP", "asin": "0615269990", "reviewerName": "icu-rn", "helpful": [0, 0], "reviewText": "Very helpful in learning about different disease processes and easy to understand. You do not have to be a med student to play. Also you can play alone or with several players", "overall": 5.0, "summary": "Must have", "unixReviewTime": 1396742400, "reviewTime": "04 6, 2014"}
{"reviewerID": "A38RKP6G5P8J63", "asin": "0615269990", "reviewerName": "JOSEPH A WONG", "helpful": [1, 1], "reviewText": "Occam's Razor is an unbelievably intuitive and enjoyable game that caters not only to medical professionals, but also to the general public. In medical translation, Occam's Razor is a principle of diagnosis, of trying to summarize multiple symptoms into one main problem. What makes Occam's Razor so versatile is that you can play the game in 4 DIFFERENT WAYS! You can play a spin-off of Gin Rummy, you can use the cards to a play a way that deduces a diagnosis, you can play on your own following a spin-off on solitaire, or you can play it as a spoons game.The card game comes with great visual directions that are easy to follow, diagnoses cards, and clinical cards. The pieces fit neatly into a box and is easy to bring around with you to any party or get-together.On a personal note, I am writing as a medical student. I brought the game over to my family's Thanksgiving party and played it almost during the entire time with my cousins. We played the &#34;spoons&#34; version of the game, where you try to match clinical symptoms and tests to diagnoses cards, and my cousins ranging from ages 15 to 30 easily got into the game. I then started playing the second version of the game where you &#34;deduce the disease&#34; and was instantly impressed when my 15 and 16-year-old cousins started spitting out diagnoses, which leads me to my next point. One of the greatest things about Occam's Razor is not only is it FUN, but you actually LEARN (with no added energy).Simply put, Occam's Razor is a card game worth investing, especially to anyone looking for a new game to try out or who are cards enthusiasts. This would make a GREAT holiday gift to anyone, and for those of you in the medical field, you'll have more fun than you realize. =)", "overall": 5.0, "summary": "Occam's Razor, a game for all ages and backgrounds!", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "ARENM677YXZKX", "asin": "0615269990", "reviewerName": "Sonny Patel", "helpful": [0, 0], "reviewText": "I met the guys from Nerdcore at a medical conference and was intrigued by the game.  It comes with a stack of ddx cards and a stack of lab findings/pertinent positives.  The #1 reason why I find it to have limited utility is that the larger deck is lab findings when it really should be ddx.  The ONLY diagnostic ddx you can play/study are: acute appy, acute choly, ACS, leukemia, endocarditis, c.diff colitis, CAP, CHF, DKA, gout, PE, pylo, RA, and septic arthritis.The symptoms and presentation fore these diseases are pretty well known.  In fact most 3rd and 4th year med students are already familiar with diagnosing and the work up for the above.  It doesn't help you study for atypical presentations, lesser known tested diseases, zebras, etc.  A good example of what what I'm talking about is how the deck only includes 1 cancer to study.In the end, I'm sending it back.", "overall": 2.0, "summary": "Very limited utility", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
{"reviewerID": "AMBJQQSRCAOHS", "asin": "0615315860", "reviewerName": "Jon Stall", "helpful": [0, 0], "reviewText": "Love this little book, Has allot of great recipes.  I cant wait to start trying a lot of them it covers wide array of foods and deserts.", "overall": 5.0, "summary": "Great Recipes", "unixReviewTime": 1362614400, "reviewTime": "03 7, 2013"}
{"reviewerID": "A2KX3GMQY9LS9N", "asin": "0615315860", "reviewerName": "rebajean", "helpful": [0, 0], "reviewText": "This is a great simple book for blender bottle recipes. I used it to make the slaw for Christmas dinner. It was a hit in my family.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
{"reviewerID": "A35G5VLYZIDBAU", "asin": "0615406394", "reviewerName": "Karen's Kindle", "helpful": [0, 0], "reviewText": "You have to be a breast cancer survivor, which I am, to really appreciate this book. It was inciteful to read othe women's stories .", "overall": 5.0, "summary": "Great Read", "unixReviewTime": 1373155200, "reviewTime": "07 7, 2013"}
{"reviewerID": "A12V35OD8T4ZVP", "asin": "0615406394", "reviewerName": "lore", "helpful": [0, 0], "reviewText": "Aphrodite Reborn tells the dramatic and courageous tales of 28 women who have undergone breast cancer and reconstructive surgery. We get to know these wonderful women through Terry Lorant's compelling photographs and first person accounts of what it's like to be given a breast cancer diagnosis and navigate the choices for healing their bodies and spirits. Ten years ago we met most of these brave souls in the warm and compassionate Reconstructing Aphrodite. How lucky we are in this follow up study to revisit these survivors, and to be privy to their continuing journeys. Although the women in Aphrodite Reborn specifically have had breast cancer, the book really speaks to us in a more universal way about what the human spirit can do when confronted by life-changing illness. I enthusiastically recommend this book!", "overall": 5.0, "summary": "up close, personal and poignant", "unixReviewTime": 1298505600, "reviewTime": "02 24, 2011"}
{"reviewerID": "AVFXCA5AW8I7F", "asin": "0615406394", "reviewerName": "nsanlan \"nscanlan\"", "helpful": [0, 0], "reviewText": "What an inspiring and visually stunning book Ms. Lorant has given us.  I have fortunately been spared the agonizing diagnosis of breast cancer (so far) but have accompanied many friends on that perilous journey.  I would certainly recommend this book to anyone who has any connection with the disease, either from personal experience or just from friends and acquaintances.  The photographs express a real joie de vivre and enthusiasm which should be a real boost to those fighting the disease.  I found the comparisons of the women from one decade to the next especially compelling - sometimes their commentaries shed a darker light on what they've been through but Ms. Lorant captures their joy in hopefully beating and living with the disease.", "overall": 5.0, "summary": "I'm overwhelmed!!", "unixReviewTime": 1297900800, "reviewTime": "02 17, 2011"}
{"reviewerID": "A2COS3K6OVGHO8", "asin": "0615406394", "reviewerName": "pcurtis", "helpful": [1, 1], "reviewText": "The new book is FABULOUS! I thought Reconstructing Aphrodite was amazing and am thrilled to see the 10-year anniversary of the women in this edition. The profiles of the women are so inspiring and I'm in complete awe over the advancements in surgical techniques over the past ten years.Aphrodite Reborn is about beauty and inspiration. In sharing their stories, these women have demystified breast cancer. The stories aren't about surviving, they are about thriving--about living life to the fullest. The pictures are beautiful and certainly do speak a thousand words.", "overall": 5.0, "summary": "Amazing and Inspiring", "unixReviewTime": 1296432000, "reviewTime": "01 31, 2011"}
{"reviewerID": "A36IT4R58E2F10", "asin": "0615406394", "reviewerName": "Rene McLean", "helpful": [0, 0], "reviewText": "I too am battling breast cancer! I've had a Bilateral Mastectomy and currently undergoing Chemotherapy.  I bought this book AND Reconstructing Aphrodite. This book was written 10 years After Reconstructing Aphrodite and I haven't gotten that book in the mail yet.  I can't wait though.Aphrodite Reborn is 28 Stories of woman who have been through surgery and their pictures, 10 years after having reconstructive surgery. 20 of the women were in the 1st book as well.  This book really helped me look on the brighter side of Breast Cancer and helps to take the \"Whoa is me\" out of my head!!  We are not alone.", "overall": 4.0, "summary": "Good reading for Breast Cancer Survivors", "unixReviewTime": 1350259200, "reviewTime": "10 15, 2012"}
{"reviewerID": "AJCPRB73A2EPV", "asin": "0615836828", "helpful": [0, 0], "reviewText": "I have shared this with so many people and not one has a bad thing to say. What an inspiring and uplifting book. Puts God in the heart of it all. Mo has proved that He never left her side thru it all, the good and the bad. Whether you have cancer or know someone who does, this truly is a remarkable journey to lean back on. Read and learn. Praise God!", "overall": 5.0, "summary": "a must read!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
{"reviewerID": "A3NNL2LPM66ZH5", "asin": "0615836828", "reviewerName": "Danielle De Wees", "helpful": [0, 0], "reviewText": "Amazing story.  I bought this book for a co-worker to help her thru her journey and recovery, she loves it.", "overall": 5.0, "summary": "Great Book", "unixReviewTime": 1379548800, "reviewTime": "09 19, 2013"}
{"reviewerID": "A361YMXSRYL4K4", "asin": "0615836828", "reviewerName": "The Reader", "helpful": [1, 1], "reviewText": "Not your typical book about someone experiencing breast cancer. I found this book to be enlightening, sometimes uproariously funny and sometimes heart-breaking. It reveals what can happen in desperate times when a person throws themselves into the arms of God and trusts Him. The spiritual lessons Mo Hurley learned and how her relationship with God became more vital can be transferred to any situation in life if a person is just willing to let Him work. I found this book extremely encouraging and I've never had breast cancer! I highly recommend it, and plan to \"pass it on.\" I think it also belongs in the Christian reading section of books.", "overall": 5.0, "summary": "Unusually Uplifting", "unixReviewTime": 1373760000, "reviewTime": "07 14, 2013"}
{"reviewerID": "A2BWNU3Z38JEZ7", "asin": "0641710577", "reviewerName": "Lady Diane", "helpful": [0, 0], "reviewText": "These glasses work great - I ended up buying two pairs. The frames/side pieces are flexible and comfortable. Other frames have broken so many times, these really last. I don't go out shopping so I'm very happy these work so well and look pretty good! Great price, too!", "overall": 5.0, "summary": "Comfortable, cute, and long-lasting - great value!", "unixReviewTime": 1346284800, "reviewTime": "08 30, 2012"}
{"reviewerID": "A11O3IHGGJBH67", "asin": "0641864507", "reviewerName": "Ann L. Allman", "helpful": [0, 0], "reviewText": "I have bought this item many times before, and have ended up giving them away for a number of reasons, especially to those with macular degeneration or those who have trouble reading the fine print on purchases. They fit wonderfully in a pocket, light up well, and survive wear and tear.  Ann A.", "overall": 5.0, "summary": "Excellent product!", "unixReviewTime": 1384992000, "reviewTime": "11 21, 2013"}
{"reviewerID": "ANLSE84SL6HWI", "asin": "0681504498", "reviewerName": "Bill", "helpful": [3, 4], "reviewText": "I really enjoyed this light for several months. It got me through a cold, hard winter. Then the light stopped working one night, so I got on-line and ordered replacement bulbs for less than the shipping cost, total around $10. Changed out bulbs but still won't work. Read other comments pointing to inherent quality issues with this device and good money after bad spent on restoring its function. I quit. Device and new bulbs are in the trash can. Too bad - great product but unreliable quality.", "overall": 2.0, "summary": "Itty Bitty Life Span", "unixReviewTime": 1304380800, "reviewTime": "05 3, 2011"}
{"reviewerID": "A30CP7L9JPBWX", "asin": "0681504498", "reviewerName": "B. Lagemann", "helpful": [0, 0], "reviewText": "This product is fine.  Just what I expected.  Shines a bit brightly for my taste, but what doesn't when the rest of the room is dark?", "overall": 4.0, "summary": "Itty Bitty Booklight", "unixReviewTime": 1168473600, "reviewTime": "01 11, 2007"}
{"reviewerID": "A42VPA76SE1U3", "asin": "0681504498", "reviewerName": "Darla Joan Moore", "helpful": [4, 5], "reviewText": "Started using electric cord at home and within 2 months base of cord, where it joins light clip, cuts off light and no longer works.  When it did it was wonderful. Now I have all these nice parts but no light to use.", "overall": 1.0, "summary": "dj", "unixReviewTime": 1198972800, "reviewTime": "12 30, 2007"}
{"reviewerID": "A1LBXMFXPT2F7Q", "asin": "0681504498", "reviewerName": "dolly", "helpful": [0, 1], "reviewText": "I bought this product out of desperation because it was the only elec. book light Barnes and Noble had at the time. I previously used Relight Rechargeable but it got so old that some of the lights burned out. Loved the Relight. Anyway the bulbs get so hot I have burned myself twice. I also see this as a potential fire hazard if someone fell asleep while reading. The bulbs don't last long either. I have spent a small fortune on them. I do not  recommend this product. I see sooner or later a lawsuit.", "overall": 1.0, "summary": "potential fire hazard", "unixReviewTime": 1337731200, "reviewTime": "05 23, 2012"}
{"reviewerID": "A34IX57PYIKFFF", "asin": "0681504498", "reviewerName": "J. Davis", "helpful": [3, 3], "reviewText": "rec'd as a gift last xmas.  took it out and began to use it in late nov(i am on my third in 12 years)  the wire at the switch has a protection now compared to earlier versions....but the wire was pulled and wrapped so tight in the new box that it failed on its first use...it works intermitently based on where the invisible brake in the line is.jd", "overall": 1.0, "summary": "disappointed", "unixReviewTime": 1229040000, "reviewTime": "12 12, 2008"}
{"reviewerID": "A102TGNH1D915Z", "asin": "0681504498", "reviewerName": "LINDA Riley", "helpful": [0, 0], "reviewText": "This is the original Itty Bitty Book Light.  Its advantages include that it does a good job of illuminating the page and it weighs next to nothing, so even on a paperback, you probably won't notice it.  However, if you ever fall asleep while reading, this light is dangerous as it gets very hot.  I have two second-degree burn scars to prove it.  And you should NEVER give this book light to a kid.  I recommend theZelco Itty Bitty Book Light, Volume 2.  It is a big improvement in safety, plus it's easier to replace the bulbs.I have tried probably 8 or 10 different book lights, and I always come back to the Itty Bitty Book Light.  I think my next purchase is going to be the LED version.  No hot bulb, and no bulbs to replace.", "overall": 3.0, "summary": "Good light, but dangerous", "unixReviewTime": 1326585600, "reviewTime": "01 15, 2012"}
{"reviewerID": "A2RGVNP1D6LRTA", "asin": "0681504498", "reviewerName": "ruby star", "helpful": [1, 1], "reviewText": "I consider this light way superior than LED illumination - read a lot and can't do without it at night", "overall": 5.0, "summary": "Favorite light ever", "unixReviewTime": 1378512000, "reviewTime": "09 7, 2013"}
{"reviewerID": "A1P27BGF8NAI29", "asin": "0705394638", "reviewerName": "Alice in Wonderland", "helpful": [0, 0], "reviewText": "I got this book for a baby shower, and it really is even better than I had thought. It certainly has all of the things that you would expect in a memory book, but it has so much more. First off, and best of all, it has plenty of room for pictures, which is great. It also has great month-by-month pages, which let you really look back on how the baby has advanced. It also allows you to record the prices of basic commodities (gasoline, food, etc.) for a fun look-back years later.And, best of all, in the back it has a place for a Letter From Mommy and a Letter From Daddy &#8211; it&#8217;s a great feature! About the only thing missing would be a plastic cover, to keep the cover nice. But, that&#8217;s not a big deal.If you want to get a memory book for yourself or a loved one, then get this one! I think it&#8217;s great!(Review of C.R. Gibson Baby Boy Zoom-Zoom Loose-leaf Memory Book BO-6436S)", "overall": 5.0, "summary": "Even better than I had thought!", "unixReviewTime": 1400112000, "reviewTime": "05 15, 2014"}
{"reviewerID": "A3HLHJ0WEZS7ZB", "asin": "0705394638", "reviewerName": "J. Rice", "helpful": [0, 0], "reviewText": "LOVE, LOVE, LOVE this babybook.  It has great pages in it and lots of space to add my own things to it!  Plus, I love how the pages are decorated!!", "overall": 5.0, "summary": "Great boy babybook!", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "A377LUP9XL6BQD", "asin": "0736789928", "reviewerName": "MEZZO", "helpful": [0, 0], "reviewText": "I have used these pens since I first started to teach&#62; They are the easiest writing tool for both students and people. One's handwriting improves with the use of this pen! THANK YOU Zaner- Bloser!", "overall": 5.0, "summary": "Best pen in the World!", "unixReviewTime": 1391299200, "reviewTime": "02 2, 2014"}
{"reviewerID": "A3HOO8XWX6Y57K", "asin": "0736789928", "reviewerName": "N. Jacobs", "helpful": [1, 1], "reviewText": "I'm an adult, and bought this for myself. I have arthritis in my hands, but this pen is fairly comfortable. It writes smoothly too.", "overall": 5.0, "summary": "Comfortable", "unixReviewTime": 1368489600, "reviewTime": "05 14, 2013"}
{"reviewerID": "AVEZNYIN8PTCY", "asin": "0736789928", "reviewerName": "sandicu", "helpful": [0, 0], "reviewText": "This was the pen I used in grade school to learn handwriting from those Penguins, I mean Nuns!  It still has the feel and same snug fit in my adult hand and is a joy for letter writers--writers of any sort really.  Sadly, it only comes in black and where's the fun in that?  Not sure about refills, but still happy to have it.", "overall": 4.0, "summary": "Pen from Catholic school rides again", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"}
{"reviewerID": "A27BMFKOEIHZUX", "asin": "0736789928", "reviewerName": "Sheila \"Sheila\"", "helpful": [1, 1], "reviewText": "Yes, I learned how to write with a Zaner-Bloser pen, but with todays products, I knew I would be taking a chance.The pen is wonderful. It gave me the same ease of writing I remember from many years ago.It's comfortable in your hand, and has already worked beautifully for me.Yes, it does bring back fond memories. However, today I need something that works well, and is comfortableto use, on a daily basis. This pen, did exactly that, and more. It glides just right, and the grip is perfect.I really like it, and I believe you will too.", "overall": 5.0, "summary": "Love this pen!", "unixReviewTime": 1370304000, "reviewTime": "06 4, 2013"}
{"reviewerID": "A3GGD7ZWVWIKOU", "asin": "076493211X", "reviewerName": "Peter P. Fuchs \"&#34;The Meta-Reviewer&#34;\"", "helpful": [0, 0], "reviewText": "I love his paintings of his desserts. I remember staring at them in awe at the Phillips years ago when they had the big show. The pies are especially well done. Great idea for a book.", "overall": 5.0, "summary": "Great Pies!", "unixReviewTime": 1302048000, "reviewTime": "04 6, 2011"}
{"reviewerID": "A9VV6ALCZ914K", "asin": "0767196767", "reviewerName": "danielle gruber", "helpful": [0, 0], "reviewText": "It is a really cute slogan, but I didn't look at the measurements or think about the fact that it said &#34;purse note&#34; so I was surprised by it's size (roughly the size of 3x3 sticky notes). Otherwise, seems like a perfect gift for someone I just met.", "overall": 4.0, "summary": "Smaller than I thought", "unixReviewTime": 1382400000, "reviewTime": "10 22, 2013"}
{"reviewerID": "A3M9MH383KTZ5N", "asin": "0767196767", "reviewerName": "Veronica Norris", "helpful": [0, 0], "reviewText": "I have gotten so many compliments about this cute little pocket notebook. It arrived early in the mail and is just adorable. It's made well and the magnetic closure works great.", "overall": 5.0, "summary": "Very cute and handy", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "A15C9PBP100HLB", "asin": "0767196813", "reviewerName": "Patricia M. Sadowski", "helpful": [0, 0], "reviewText": "At our monthly BUNCO games we give prizes for certain categories. This made an excellent gift and carried the theme for the night.", "overall": 5.0, "summary": "BUNCO GIFT", "unixReviewTime": 1403222400, "reviewTime": "06 20, 2014"}
{"reviewerID": "A3P9CRRJW17643", "asin": "0895640163", "reviewerName": "V. hitchcock \"Beware, be very aware.\"", "helpful": [2, 2], "reviewText": "this book is a rare gem of ancient wisdom, well documented and easy to read.  worth it's weight in gold.  Zarathustra.  Here is an excerpt from the foreaord\"  The Blue Bird (of happiness) came to humanity when it received that first and greatest encyclopedia of mankind-the Zend Avesta of Zarathustra.  This every-sided and eternally valid teaching is as yet undiscovered, because humanity does not know that it possesses it. I highly recommend this book, the wisom is so simply stated it almost goes over your head. It is not God or Jesus or any other thing or person in the universe that will set you free, only the Truth.  \"...then you will know the truth...and the truth shall set you free\"-Paraphrased from Jesus.", "overall": 5.0, "summary": "awesome wisdom book for real truth seekers", "unixReviewTime": 1219795200, "reviewTime": "08 27, 2008"}
{"reviewerID": "A3E0DR883I8DA5", "asin": "0898004640", "reviewerName": "Debra Kravan", "helpful": [1, 1], "reviewText": "This paper is beautiful, perfect for a small wedding gift. The only thing I wish is that it would come in bigger sheets so that I could wrap bigger presents.", "overall": 5.0, "summary": "White Peacock Wrapping Paper", "unixReviewTime": 1312416000, "reviewTime": "08 4, 2011"}
{"reviewerID": "A38XHGJZ8PD8IK", "asin": "0898004640", "reviewerName": "Grandma8 \"Nancy Toft\"", "helpful": [0, 0], "reviewText": "Am saving this paper for Christmas to wrap a present for a friend. It really is beautiful, however there isn't much of it, so I'll have to be careful on how I cut it.", "overall": 3.0, "summary": "BEAUTIFUL PAPER", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "A3K9CBDPJTUXFH", "asin": "0898004659", "reviewerName": "Nolan Guiffre \"The Mayor\"", "helpful": [0, 0], "reviewText": "This Iris and Wisteria Gift Wrapping Paper is simply stunning. More than you would ever expect from gift wrap. I use it for weddings and important occasions when I want my gift to stand out on the table. I also love thePeacock Gift wrapping paper. I would recommend this to anyone who wants to present their gift beautifully.", "overall": 5.0, "summary": "Highest Quality Wrapping Paper!", "unixReviewTime": 1276732800, "reviewTime": "06 17, 2010"}
{"reviewerID": "A1S4LE5OVOFI3", "asin": "0898004667", "reviewerName": "K. Mclean \"KM\"", "helpful": [0, 0], "reviewText": "I love these wrapping paper sheets and they are very high quality.  A sheet works great to cover a gift candy box.", "overall": 5.0, "summary": "High quality wrapping paper", "unixReviewTime": 1365033600, "reviewTime": "04 4, 2013"}
{"reviewerID": "A3K9CBDPJTUXFH", "asin": "0898004667", "reviewerName": "Nolan Guiffre \"The Mayor\"", "helpful": [6, 6], "reviewText": "This wrapping paper is simply beautiful! By far the best looking wrapping paper I have ever used. It looks even better when you are holding it. I save it for special gifts and everyone always comments on how nice it is! Perfect 10.", "overall": 5.0, "summary": "Absolutely Gorgeous!", "unixReviewTime": 1276646400, "reviewTime": "06 16, 2010"}
{"reviewerID": "AY5NWX45GCYUE", "asin": "0929619730", "reviewerName": "seasalt", "helpful": [0, 0], "reviewText": "B-flax-D is a regular at our house. It does its job simply and with good results. It is reasonable, lasts a long time, and is able to be obtained with free shipping if you hunt around. Good product, good price, good results.", "overall": 5.0, "summary": "Dpes the job well", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"}
{"reviewerID": "A3RIAD0O2XLMHA", "asin": "093926322X", "reviewerName": "Anonymous", "helpful": [4, 6], "reviewText": "This video is terrible! The positions aren't explained well at all, and there are about ten in all. Most of the time, you are watching some African chick with hairy armpits or a middle aged Indian lady dancing around. The rest of the time, you are staring at Japanese wood-cut prints, which totally turned off my wife! If you've ever been to the zoo, or seen a horny dog in action, than you have seen more than what's presented in this DVD. DON'T WASTE YOUR MONEY!!", "overall": 1.0, "summary": "More Art Ed than Sex Ed!", "unixReviewTime": 1171670400, "reviewTime": "02 17, 2007"}
{"reviewerID": "A3O05KW6IVN4T4", "asin": "093926322X", "reviewerName": "L. Macforrest", "helpful": [2, 6], "reviewText": "Sensual ethnic dance (with good rhythms), historical erotic art, poetry drawn from the old erotic traditions, and scenes from nature, interspersed with demonstrations of positions from the historic texts.  Everyone involved seems to be having a very good time. Why lions?  Why giraffes?  Why not?If you expected an instructional film, this could be disappointing.  If you're tired of tacky, staged, pseudoscientific \"intimacy\" films then this one is a joy.  We use it as background to massage and lovemaking, and we try a position or two from it as the mood strikes us.  A previous review mentions that the VHS version is better edited and has better picture quality, so I will order it also.", "overall": 5.0, "summary": "Lovely mood movie, NOT a training film!", "unixReviewTime": 1148083200, "reviewTime": "05 20, 2006"}
{"reviewerID": "A362UXFLXDHTOC", "asin": "093926322X", "reviewerName": "Loretta Champagne", "helpful": [0, 0], "reviewText": "This was a great gift at a friends bridal shower. Gave with a basket of Honeymoon goodies. Hit of the party", "overall": 5.0, "summary": "Great Bridal shower gift", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
{"reviewerID": "ARHCME7CHYR29", "asin": "0945523181", "reviewerName": "LovetoTravel", "helpful": [1, 1], "reviewText": "I was looking for something to kind of help us out in the intimacy area and make things more interesting...didn't really think this was worth all the money. Maybe $5 in my opinion, being only cards, you know it was cheap to make. But hey, sex sells, right? We tried it once, got bored and haven't touched it since. Didn't even finish the game. I don't think it was very stimulating. Maybe if we had been newly weds and really nervous it might have helped to get over the shyness and learn some things about the new spouse. The questions weren't really that great.", "overall": 2.0, "summary": "Not Worth MY Money", "unixReviewTime": 1295913600, "reviewTime": "01 25, 2011"}
{"reviewerID": "ASU8DF1U8G263", "asin": "0945523181", "reviewerName": "Shannon R. Bellamy", "helpful": [0, 0], "reviewText": "This game is awesome for couples!!!! It will help bring you closer together", "overall": 5.0, "summary": "Perfect relationship mate", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}
{"reviewerID": "A3S40N4TTI1M8W", "asin": "0972433503", "reviewerName": "nancylwho", "helpful": [1, 1], "reviewText": "I expected a relaxing experience listening to music.  This CD has a voice over the whole way. It would have been nice if it had one track that was just soothing music.  I found it quite jarring and not the least bit relaxing.  If you are someone who needs to have someone verbally take you to a relaxing state this is the CD for you.", "overall": 1.0, "summary": "Dissapointed", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "ACGYWB251L0DX", "asin": "0974959200", "reviewerName": "D. Kastl", "helpful": [1, 1], "reviewText": "I've been reading 'Eas Sports Nutrition Review', even though it's distributed by a nutrition company EAS it is incredibly informative; and RIGHTFULLY SO! What a better source of knowledge than a company funded to study it completely?! I started reading it completely this time about a week ago and I'm nearly halfway done, its 305 pages with pictures diagrams notes and an credible amount of resources to further your study. This book is PERFECT for everyone, as a starting point for a solid foundation to someone wanting to refresh and strengthen their knowledge about nutrition, exercise as well. There is a complete section all about exerciseing and goal settiing as well as mental health in addition to everything else!I've read parts of it before about muscle and strength gain and now as I read the section on fat loss and basic nutrition I cannot believe I overlooked the importance of the two sections. They explain insulin, carb. effects in terms of energy etc and leptin along with so much more. It is highly dense in information on not just describing what's happening in the body but giving examples, explanations and suggestions.I'm highlighting key points as I read it and compiling questions along the way so that I can quiz myself on the material to seriously retain the knowledge. I believe so strongly on this subject that it should be taught in schools as a necessity. I would advice EVERYONE to pick up a copy of this book and study it, not just read it but STUDY it! The knowledge and implementing of it is priceless.For anyone that has ever gone through a diet, tried to lose weight or try to gain muscle and strength once you read this book your eyes will be open to a whole new world. This book is very cheap on amazon.com. You can get a copy used in great condition for as little as a few dollars. SERIOUSLY once you read this book you will have so many \"Ah-Hah!\" moments, where something in your mind will click. There are so many good points I could share with you about this book, I wish I could, so just read the book and see what I'm talking about.Everything from how the food you eat effects insulin (also how to jump start insulin production, my dad is a type two diabetic and I have been noticing dozens of ways and combinations to almost `cure' him of his diabetes! If there ever was a cure it is through nutrition!) production and energy storage to how fat cells work and what happens to your muscle cells and BRAIN when you are lacking energy from carbs, muscles get broken down into amino acids to supply the body with energy to the effects of lack of carbs and energy with brain function and concentration, not to forget the importance of water as well....There is so much good stuff in this book! This book is all about optimizing your nutrition and well being I don't think it should be limited to health enthusiasts, IT SHOULD BE TAUGHT TO EVERYONE! It should be taught in school as a mandatory subject for everyone. I don't mean the average nutrition class one might take in high school I mean an in depth seriously important insight, one that this book greatly supplies.", "overall": 5.0, "summary": "Two Thumbs Up!", "unixReviewTime": 1166054400, "reviewTime": "12 14, 2006"}
{"reviewerID": "A17TS41YM7E5O9", "asin": "0974959200", "reviewerName": "RAUL", "helpful": [0, 0], "reviewText": "The delivery and price was right on the money also the preparation of the package was perfect given the remote location that I was in it could'nt of got any better than this. I will order again very soon!!!", "overall": 5.0, "summary": "Informative!!!", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A108X7C0O8VLPK", "asin": "0974959200", "reviewerName": "The Bod \"Bod\"", "helpful": [0, 0], "reviewText": "This book is awesome for those interested in strength training and body building.  It combines the best thinking on foundation fuel eating and dietary supplements to achieve your physical fitness goals.", "overall": 5.0, "summary": "Bodybuilder's delight", "unixReviewTime": 1145491200, "reviewTime": "04 20, 2006"}
{"reviewerID": "AEN529A4F4YHM", "asin": "0976202107", "reviewerName": "alvar", "helpful": [0, 0], "reviewText": "A must have piece of work for those who really appreciate excellence in academic references. It definitely deserved the price.", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1367625600, "reviewTime": "05 4, 2013"}
{"reviewerID": "AY1WV5IVQBT23", "asin": "0976202107", "reviewerName": "Amazon Customer", "helpful": [4, 10], "reviewText": "The classic \"Methods of Theoretical Physics\" by Morse and Feshbach should be featured in the library of every engineer, physicist, and applied mathematician. It is a very worthwhile investment. 2013 update: I'm eagerly awaiting the Kindle edition.", "overall": 5.0, "summary": "Should be in the library of every engineer and physicist", "unixReviewTime": 1191542400, "reviewTime": "10 5, 2007"}
{"reviewerID": "A3OWPGOU32GE6R", "asin": "0976202107", "reviewerName": "Kris", "helpful": [19, 20], "reviewText": "A great deal has already been said elsewhere about the content in these books.  The first book is a deliberate (but not introductory) coverage of the math behind physics; the second book is mostly applications and worked out problems using the material from the first book.  Some of the material on dyadics is a bit dated, but the amazingly clear and comprehensive exposition on generalized vector spaces, Greens functions and eigenfunction expansions makes them a wonderful resource. These books go into great detail on what are now considered esoteric coordinate systems (elliptical, parabolic, etc); this may be the best place to find material on this topic. Overall, the material in these books is very dense.The republished versions of these books are not just \"photocopies\" of the original books, as are some of the other reprints of classic books which are similarly expensive, but contain much less material (namelyCarslaw & JaegerandBender & Orszag).The print is as clean and crisp as it is in the original library copies of this book I have seen, which is especially important with all the detailed mathematical notation.  The nifty 3D stereo figures are crystal clear, too.  The paper is excellent quality and the books are bound very soundly (not just glued).  Definitely a good addition to the library.", "overall": 5.0, "summary": "Great books. Both content AND binding", "unixReviewTime": 1185235200, "reviewTime": "07 24, 2007"}
{"reviewerID": "A3Q5AUYLHS1OT7", "asin": "0976202107", "reviewerName": "Michael", "helpful": [0, 0], "reviewText": "Excellent book with a fair price. The author approaches the subject in a complete way (it means, perfect). That's an indispensable book for all Mathematics and Physics students.", "overall": 5.0, "summary": "Methods of Theoretical Physics, Parts 1 and 2", "unixReviewTime": 1350950400, "reviewTime": "10 23, 2012"}
{"reviewerID": "A6ZR4X45H2ZPV", "asin": "0976202107", "reviewerName": "Morski \"Prof  Physiker\"", "helpful": [0, 0], "reviewText": "After looking for these on Ebay and here on Amazon, the best price I found was directly from the publisher. Talk about great customer service! They're superb!feshbachpublishing dot com / index.htmlNo, I do not work for this company... but think that it's reasonable to inform customers of a cheaper price.", "overall": 5.0, "summary": "Wonderful books! Order directly from the publisher!", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"}
{"reviewerID": "ACXQ6HVYNROZB", "asin": "0976202107", "reviewerName": "SABINO CHAVEZ CERDA", "helpful": [0, 0], "reviewText": "This is one of the most complete works in mathematical physics to date, unfortunately these books are out of print. It is not for the beginner", "overall": 5.0, "summary": "Great Works in Mathematical Physics", "unixReviewTime": 1384732800, "reviewTime": "11 18, 2013"}
{"reviewerID": "A36Y3ZIL9416N8", "asin": "0978559088", "reviewerName": "Adam P. Simer", "helpful": [1, 1], "reviewText": "Studies show that Resveratrol is poorly absorbed when taken by pill, but lozenges are very effectively absorbed. Hardly any companies are selling lozenges. This company promises 99% purity and has fast shipping and good communication. I can't comment on the quality of product because I'm not a chemist but they seem to be legitimate.", "overall": 4.0, "summary": "Fast shipping, good communication", "unixReviewTime": 1266624000, "reviewTime": "02 20, 2010"}
{"reviewerID": "A1IOY3EOEYKPKS", "asin": "0978559088", "reviewerName": "Greenemerald", "helpful": [1, 1], "reviewText": "I started taking this after both my parents died of cancer as it supposed to enhance your immune system - the story on 60 Minutes on resveratrol was incredibly inspiring. Doing some research on the Internet, it is indicated that taking resveratrol in lozenge form is preferable as it is broken down by stomach acids.  The ez-melt formula recommended in another review is OK, but it is dissolved in the mouth much more quickly than this lozenge formula, while dissolving more slowly is preferable according to my research.This product has the greatest side effect - since taking it, I haven't had colds or sore throats.  Soon after starting to take it every day, I was starting to come down with a cold, with all my usual symptoms, and was anticipating being very sick the next day, as is my usual pattern.  But I never did get as sick as anticipated - taking this product is the only reason I can come up with.  Since then, I've had no colds or sore throats - it has been great.  I recommend this product to everyone I know, and have given it as gifts to my family.", "overall": 5.0, "summary": "Bioavailability is the key", "unixReviewTime": 1295568000, "reviewTime": "01 21, 2011"}
{"reviewerID": "A1HILJQ43PET2N", "asin": "0978559088", "reviewerName": "inspector", "helpful": [0, 1], "reviewText": "I tried Nutrihill, but did not feel any of the supposed health benefits. I started reading and realized that even though buccal delivery is the best, the dose is too small in this supplement. I then tried Resveratrol 150 from ezmelts. It's also a lozenge (they call it melt) and it literally melts in your mouth. I have a lot more energy, and haven't been sick at all. I used to get colds and flus all the time before. You can find ezmelts here on amazon, ebay and a bunch of other suppliers. You can find it here:EZ Melts Resveratrol, Natural Grape Flavor, 60 Tablets", "overall": 1.0, "summary": "Other Resveratrol Supplements are Better", "unixReviewTime": 1279843200, "reviewTime": "07 23, 2010"}
{"reviewerID": "A14NLAZZWPAHJ7", "asin": "0978559088", "reviewerName": "Mr. Rocky G. Willson", "helpful": [0, 0], "reviewText": "I really liked this product because it stayed in my mouth for a long time and I felt it was probably doing some good.  I take a number of resveratrol products and this was one of my favorites.  I can't find it anymore and wish I could still find it.When I contacted the company, they said there was no date for re-introduction of this product, and they implied that it would no longer be produced.  I also found someplace online where the product manufacturer was trying to find someone to market it for them.  I hope this happens.  I really enjoyed taking these little pills and felt they were doing some good.  The claims on their website made sense, and I believe that resveratrol is almost a wonder drug/suppliment.  (The 60 Minutes Episode convinced me of that.)", "overall": 5.0, "summary": "I can't find this product any longer, and I wish I could.", "unixReviewTime": 1358121600, "reviewTime": "01 14, 2013"}
{"reviewerID": "A1WDGPIMICR0RM", "asin": "0978559088", "reviewerName": "Thomas J. Pall \"Tom P\"", "helpful": [3, 3], "reviewText": "Resveratrol is a polar compound, very insoluble in water and hence saliva.  To get sufficient Resveratrol absorbed a Resveratrol lozenge would have to stay in the mouth and be slowly dissolved.  The lozenge would have to contain enough Resveratrol since most of the Resveratrol will be swallowed with the saliva.  A better known and competing product contains only about a milligram of Resveratrol.  These lozenges contain 20 milligrams.  Nutrihill Resveratrol lozenges dissolve very slowly and contain, IMO, just the right amount of Resveratrol to optimize absorption.  Most of the product will be swallowed but that's OK as just fractions of a milligram need to be absorbed though the mouth's mucosa to produce sustained high levels of Resveratrol in the blood and be absorbed into the cells to do some real good.  I can see where many producers of Resveratrol products like, for example Revgenetics, would not want this product to catch on as their selling point is how well they try to increase absorption of Resveratrol in the digestive system.  Taking Quercetin helps protect Resveratrol when swallowed from first pass liver metabolism, but at an additional financial cost which makes suppliers happy because they can sell more supplements. An additional cost of taking Quercetin with Resveratrol is joint inflammation.I hope this product catches on so it's available from many sellers.Nutrihill Resveratrol Lozenges", "overall": 5.0, "summary": "Just the Resveratrol product we need", "unixReviewTime": 1271548800, "reviewTime": "04 18, 2010"}
{"reviewerID": "ACW99811JYO9V", "asin": "0979047714", "reviewerName": "D. K. Curry", "helpful": [0, 0], "reviewText": "Cards are very good for reviewing and when practicing. However, there are 3 sets each, respectively for levels 1,2&3. Anyone know where I can acquire Level 1 & 3 or a full set for all 3 levels?", "overall": 5.0, "summary": "Healing Touch Review Cards for Level 2", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
{"reviewerID": "A1XNOF91EMN1IY", "asin": "0979679737", "reviewerName": "Susan Marek", "helpful": [0, 0], "reviewText": "This CD is a meditation program which left me feeling relaxed, peaceful, and empowered. Betsy is truly a master at helping you feel comfortable while leading you in this effective, enlightening program. I highly recommend this to anyone looking for a peaceful meditation which also draws you closer to the Divine.", "overall": 5.0, "summary": "Empowering Meditation!", "unixReviewTime": 1237075200, "reviewTime": "03 15, 2009"}
{"reviewerID": "A184EJ3LLEF2T2", "asin": "097968191X", "reviewerName": "A. L. Aguilar", "helpful": [0, 0], "reviewText": "I purchased this after I saw that another student had one and I love it! It fits into your pocket and you can fold it to maintain patient privacy. I took it to clinic and 3 other RNs bought them that same day!", "overall": 5.0, "summary": "Great organizer!", "unixReviewTime": 1275436800, "reviewTime": "06 2, 2010"}
{"reviewerID": "A94S2Y2RON2II", "asin": "097968191X", "reviewerName": "An Amazon Customer", "helpful": [0, 0], "reviewText": "This is a very useful clipboard, & portable.Its not being sold here on Amazon? (says currently unavailable). I like this one better than the vertical folding one they have ASIN: B000KK5FR8 (this version I am reviewing, won't hit your elbow in your coat pocket or slide around).Glad I got the last one at least!", "overall": 5.0, "summary": "Great idea!", "unixReviewTime": 1279411200, "reviewTime": "07 18, 2010"}
{"reviewerID": "A10BUG0VJRIQLU", "asin": "097968191X", "reviewerName": "Arick P. Sabin", "helpful": [0, 0], "reviewText": "I recommend this little thing, if for no other reason than it is an ingenious solution to the problem of trying to find a good, mobile writing surface in many situations. I must confess that I don't always use it unfolded, but it does the trick when I use it that way.Calculations and information printed are useful, but after awhile you'll have them memorized. It would have been nice to include some more information on the inside panels and not just the outside, but now I can make my own to tape on. A Washington manual takes care of the rest.The hinges seem pretty sturdy right now, but I don't really know how long they will last. Unfolding it maybe 20 or 30 times a day will certainly cause them to wear down over time.A good product. I would recommend it for health professionals who move around a lot and don't always have a handy writing surface.", "overall": 5.0, "summary": "Very useful", "unixReviewTime": 1271635200, "reviewTime": "04 19, 2010"}
{"reviewerID": "A24N52FJH17Y97", "asin": "097968191X", "reviewerName": "Barbara Kusmierczak", "helpful": [4, 5], "reviewText": "Excellant and helpful product.  A lot of the Doctors at medical school  ordered this clipboard after seeing my son's.", "overall": 5.0, "summary": "Dr. Dan's clipboard", "unixReviewTime": 1234396800, "reviewTime": "02 12, 2009"}
{"reviewerID": "A36W9OLVM8HXMN", "asin": "097968191X", "reviewerName": "Carly Adams", "helpful": [0, 0], "reviewText": "I like this clipboard very much.  It is handy and fits into small spaces so that I don't have to carry a big bulky regular clipboard around that becomes unwieldy.  It has made my work so much easier.", "overall": 5.0, "summary": "clipboard", "unixReviewTime": 1261094400, "reviewTime": "12 18, 2009"}
{"reviewerID": "A2EZG412MMUJI8", "asin": "097968191X", "reviewerName": "Cindy", "helpful": [0, 0], "reviewText": "Very nice, I use it everyday at work and I am planning on buying another for home use.", "overall": 5.0, "summary": "Awesome, why didn't I think of that!", "unixReviewTime": 1269820800, "reviewTime": "03 29, 2010"}
{"reviewerID": "A13UM8WCUC1LDD", "asin": "097968191X", "reviewerName": "C. Nukala", "helpful": [1, 1], "reviewText": "Really good but price is a lil moreworks better for those who were white coats but most of the times residentsdonot wear coat but I do so works for me", "overall": 4.0, "summary": "Very good product for med students and residents", "unixReviewTime": 1258588800, "reviewTime": "11 19, 2009"}
{"reviewerID": "AWUEDDAK4NTER", "asin": "097968191X", "reviewerName": "Constantinos Zambirinis \"Gravity is not respo...", "helpful": [5, 5], "reviewText": "I bought this about a month ago and it has proven really helpful!The only reasons I didn't give 5 stars: It does not fit A4 paper (the European style) well, and most importantly, it is a little heavy.Other than these, it is almost perfect! I highly recommend it (especially for US)!", "overall": 4.0, "summary": "Almost perfect!", "unixReviewTime": 1241049600, "reviewTime": "04 30, 2009"}
{"reviewerID": "AMEGPD597TRUN", "asin": "097968191X", "reviewerName": "Diadem", "helpful": [0, 0], "reviewText": "This is a SUPER invention! Kudos! It is I believe, a bit on the pricey side. But a good investment. Compact, easy to clean, aides with HIPPA privacy as well as certain isolation preventative measures by not having to set it down, (put it in your LARGE pocket) or by placing your papers on hard surfaces to write on. Generally overall a big hit! Again, the price could be around $20 instead of $25. But if it's made in America, it's worth it!", "overall": 4.0, "summary": "REALLY Handy! But Pricey", "unixReviewTime": 1270684800, "reviewTime": "04 8, 2010"}
{"reviewerID": "AYO9BNOJED59J", "asin": "097968191X", "reviewerName": "Elaine V. Tharrington", "helpful": [0, 0], "reviewText": "The clipboard works very well, I use it as my charge board to hold info about the pts on the unit when I am in charge.  I can fold the board withe necessary to maintain the privacy of the patients  It is portable enough to put in my jacket pocket if necessary.", "overall": 5.0, "summary": "White clipboard", "unixReviewTime": 1276300800, "reviewTime": "06 12, 2010"}
{"reviewerID": "A2THDHEBWRVJRR", "asin": "097968191X", "reviewerName": "G. Sandhu", "helpful": [1, 1], "reviewText": "Great product, very handy, lightweight.Now I never forget any pertinent things about my pt even at the end of the day, I can write my notes.", "overall": 5.0, "summary": "Great product, a must have for all Residents/Med Students", "unixReviewTime": 1259107200, "reviewTime": "11 25, 2009"}
{"reviewerID": "A2OB1F7VOT41RV", "asin": "097968191X", "reviewerName": "hanuma", "helpful": [3, 4], "reviewText": "Handy clipboard that conveniently fits in the side pockets of my whitecoat.  Awesome.  Even my colleagues have commented how cool it is.", "overall": 5.0, "summary": "Clipboard", "unixReviewTime": 1242086400, "reviewTime": "05 12, 2009"}
{"reviewerID": "A1SOBRIT1T6ZDN", "asin": "097968191X", "reviewerName": "James L. Thompson \"Para-medic\"", "helpful": [0, 0], "reviewText": "I love this clip board. I work on an ambulance and use it everyday. Wish I bought had one years ago. Thanks", "overall": 5.0, "summary": "Great Product!", "unixReviewTime": 1251590400, "reviewTime": "08 30, 2009"}
{"reviewerID": "A1EOVQ3XI5FIKA", "asin": "097968191X", "reviewerName": "Jennifer Tanner", "helpful": [0, 0], "reviewText": "I love my clipboard! I haven't lost my \"brain\" since I have been using this. It is easy to use and put in my pocket, and then flip out to use when I need it!  So far 4 other nurses on my floor have purchased this item!  It is very handy----and informative.  I would recommend it to everyone!", "overall": 5.0, "summary": "Love my white coat clipboard", "unixReviewTime": 1262822400, "reviewTime": "01 7, 2010"}
{"reviewerID": "A3B85JMWYZX68C", "asin": "097968191X", "reviewerName": "J. K. Baker", "helpful": [6, 6], "reviewText": "Love this clipboard.  I carry one daily and have done so for more than a decade.  This is the best one I have found and I love that it fits in my white coat pocket.  It is sturdy for me to write on at the bedside as well.  I have shown it to everyone.", "overall": 5.0, "summary": "White Coat Clipboard fits perfectly", "unixReviewTime": 1238544000, "reviewTime": "04 1, 2009"}
{"reviewerID": "A9PRUR750JY42", "asin": "097968191X", "reviewerName": "J. Peters", "helpful": [0, 0], "reviewText": "Works very well.  I agree with other reviewer that it does have capacity limitations but easily carries what I need for daily rounds.  Even if you don't put it in your coat pocket it is less bulky to carry folded compared obviously to full size clipboard.  Pretty expensive though; I think they would sell many more if they dropped the price.", "overall": 4.0, "summary": "Excellent clipboard; little pricey", "unixReviewTime": 1268352000, "reviewTime": "03 12, 2010"}
{"reviewerID": "A2O7IKI1X057WF", "asin": "097968191X", "reviewerName": "K. M. Kemp", "helpful": [0, 0], "reviewText": "fits perfectly in your white coat...these have become quite popular in my institution and for good reason. very handy!!", "overall": 5.0, "summary": "well worth the price", "unixReviewTime": 1269388800, "reviewTime": "03 24, 2010"}
{"reviewerID": "A1EQSYHCHMEBBO", "asin": "097968191X", "reviewerName": "L.W.K.", "helpful": [0, 0], "reviewText": "Love it!  It's very helpful in the hospital when seeing patients.  There's lots of good information on it.", "overall": 5.0, "summary": "great idea!", "unixReviewTime": 1271203200, "reviewTime": "04 14, 2010"}
{"reviewerID": "A68DHC9MW8PUF", "asin": "097968191X", "reviewerName": "Manpreet Singh", "helpful": [0, 0], "reviewText": "Great for medical students and interns. Has good information, as you progress from student to resident you need less information since you have memorized it, best for med students.", "overall": 5.0, "summary": "Good product", "unixReviewTime": 1235260800, "reviewTime": "02 22, 2009"}
{"reviewerID": "A2J6YDDNCA05L", "asin": "097968191X", "reviewerName": "Martin", "helpful": [12, 12], "reviewText": "I bought this clipboard at the beginning of 3rd year of med school. I have now stopped using it altogether. So have almost all of my many classmates who also bought it at the beginning of the year.I'm not sure how most people hold clip boards, but IMHO grasping it at the top and pressing the bottom against the body is the most stable and convenient way to do it. With this clipboard, the middle would simply collapse out. You have to hold it with one forearm wrapped around the back,and often have to make an effort to support the middle.This clipboard does not fit into all white coat pockets. Many of my female classmates have small white coats with pockets that are too small to fit this board. Even with my rather large white coat, the board takes up the whole space, and it take a little effort every time to get it.As a med student, my pocket space is very valuable. I eventually realized that I much prefer using it for Maxwell's, PE tools, sign-out, articles, other documents, pocket medicine or surgical recall, and a small notepad instead of this bulky clipboard. I now find it easier to use a folded up bunch of paper (sign-out or article) or just finding a surface to write on.One last complaint: the hinges stick out quite a bit, and on occasions get in the way when I'm writing.", "overall": 2.0, "summary": "Doesn't work as well as 1.0. Not good for medical students and house staff.", "unixReviewTime": 1298073600, "reviewTime": "02 19, 2011"}
{"reviewerID": "A33DMYXMAEH43R", "asin": "097968191X", "reviewerName": "Mary K. Weeks \"BaylorMedStudent\"", "helpful": [14, 14], "reviewText": "This board is probably the most useful thing I carry in my white coat pocket. One, you'll always have a hard surface to write on and won't need to borrow a surface in a patient's room (where you'd be picking up MRSA/VRE and who knows what else) before transfering it to another room (same thing applies to other clipboards that don't fit in your coat pocket). Also, they've included some very useful information on the outside of the board including how to interpret Acid/Base problems and tons of helpful equations. You won't regret ordering this board.", "overall": 5.0, "summary": "Your new best friend...", "unixReviewTime": 1232236800, "reviewTime": "01 18, 2009"}
{"reviewerID": "APOGFI31VCH7S", "asin": "097968191X", "reviewerName": "Medstudent1", "helpful": [0, 0], "reviewText": "Delivery was timely - the website said estimated delivery 10 days but it arrived in about 4.It's great to be able to keep all my papers organized and neat. You don't want to be that medical student with tons of patient notes and articles hanging out of your whitecoat-much easier to loose stuff that way.Also while rounding it's nice to always have a surface to write on.Ithas helpful reminders on the back of it: GCS, ABG normal values, acid-base disturbances etc.This is a good product to have.", "overall": 4.0, "summary": "White coat clipboard-Good product", "unixReviewTime": 1267920000, "reviewTime": "03 7, 2010"}
{"reviewerID": "A6EL948S9VQ04", "asin": "097968191X", "reviewerName": "M. Inayat \"hardy doc\"", "helpful": [0, 0], "reviewText": "I saw a student carrying this board, and was instantly inspired to buy it!! Believe me its the next best thing you have after stethoscope, very handy, easy to use,keeps papers organized without having to have the hassle of carrying the conventional clip board around!! I use it everyday now and have inspired quite alot of residents to buy it.. Very innovative indeed!!", "overall": 5.0, "summary": "Superb!!", "unixReviewTime": 1268524800, "reviewTime": "03 14, 2010"}
{"reviewerID": "AQYY2OH4BRCZG", "asin": "097968191X", "reviewerName": "Ms. Piper Valentine \"jet_set\"", "helpful": [2, 3], "reviewText": "I love my \"Dorkboard\" and so do all of my nerdy med school friends.  This is the ultimate in nerdy med school gear.  I am sure glad that my nose ring deflects some of the nerdiness of carrying this thing around.  But seriously, it's amazing and almost worth the ridiculously high price.  Too bad I don't wear my white coat on my psych rotation, I just have to carry it around with me now.", "overall": 5.0, "summary": "This is the nerdiest (and BEST) invention EVER!", "unixReviewTime": 1258934400, "reviewTime": "11 23, 2009"}
{"reviewerID": "A3DLD8N05O2H4B", "asin": "097968191X", "reviewerName": "ncysa15", "helpful": [0, 0], "reviewText": "While I'm yet to really use the information on the outside (I tend to refer to Maxwell's pocket handbook for that type of stuff), having a clipboard that fits in your whitecoat pocket is a lifesaver. There is always a little room carved out for this necessity regardless of how much other junk might be in my coat (i.e. during surgery rotation). Highly recommended.", "overall": 5.0, "summary": "Lifesaver", "unixReviewTime": 1252886400, "reviewTime": "09 14, 2009"}
{"reviewerID": "A22VCQY0RSX9UT", "asin": "097968191X", "reviewerName": "pa2011 \"Michele\"", "helpful": [0, 0], "reviewText": "This little gizmo is seriously handy.  I bought it because it had received so many great reviews, and discovered that it deserves the praise.  The only thing is that it's a tad bit heavy, but I am carrying so much in my pockets anyway it all balances out.  So sturdy it looks like it will last a lifetime.  The choice of info on the outside is extremely good.  Not just for show.", "overall": 4.0, "summary": "Wonderful", "unixReviewTime": 1278633600, "reviewTime": "07 9, 2010"}
{"reviewerID": "A34SB80MWK7BOQ", "asin": "097968191X", "reviewerName": "Raggson Media \"RM\"", "helpful": [9, 9], "reviewText": "When I began my clerkships, I found myself without an efficient way to take notes during rounds and lectures. It seemed as though my only options were to carry around a regular clipboard or try to write everything in a notebook small enough to fit in my white coat.When carrying a clipboard, I constantly had to put it down in order to perform physical exams or procedures. This cost precious time and also presented to risk of exposing confidential patient information if the wrong person were to glance at it while I was engaged in something else. Also, almost nothing is more embarrassing than having the papers on your clipboard spill onto the floor during a presentation or during rounds.On the other side of things, carrying around a small notebook is great for quickly scribbling down notes without the problems associated with carrying around a full sized clipboard. However, I found those notes difficult to organize and integrate with handouts and other documents that were on full sized (8.5\"x11\"). In addition, the smaller notebook did not provide an adequate writing surface for standardized progress reports, orders, and other forms.Then along comes the White Coat Clipboard 2.0. It solves the problems of both the regular clipboard and the small notebook, with the additional complement of having some common lab values and other algorithms conveniently printed on the outside. With this product, I could take notes on full sized filler paper, while also carrying forms and handouts.The bottom line on this product is two fold; First, it makes organizing notes, forms, and other documents that you will be flooded with on the wards infinitely more efficient. Second, being able to fold it and drop it in your white coat pocket allows you to make a better transition between taking notes and having both hands free to perform exams or procedures. If nothing else, it will convey to your patients, supervising residents, and attendings that you are organized, and an integral and capable part of the team, rather than a scribe.In my opinion, this is one of most important things you can have on the wards along with Maxwell.", "overall": 5.0, "summary": "Absolutely Essential For Medical Students!", "unixReviewTime": 1249430400, "reviewTime": "08 5, 2009"}
{"reviewerID": "A36L4OKIO8A9G9", "asin": "097968191X", "reviewerName": "rayt \"rayt\"", "helpful": [0, 0], "reviewText": "Cute clipboards. Fits in the pocket when folded. I gave it 4 stars only because its a bit pricey.", "overall": 4.0, "summary": "As described", "unixReviewTime": 1277337600, "reviewTime": "06 24, 2010"}
{"reviewerID": "A2PYZQDJV8FSPJ", "asin": "097968191X", "reviewerName": "Samantha J. Vizzini", "helpful": [2, 2], "reviewText": "Great item, keeps you organized and has all the formulas u use on a regular basis.", "overall": 5.0, "summary": "Every med student should have!!!", "unixReviewTime": 1244419200, "reviewTime": "06 8, 2009"}
{"reviewerID": "A1KN4WAQ5UMEWO", "asin": "097968191X", "reviewerName": "Shakira", "helpful": [0, 0], "reviewText": "It is very practical idea but it can not hold tons of paper. It is relatively sturdy and the equations on the outside are very helpful.", "overall": 3.0, "summary": "Pratical", "unixReviewTime": 1265587200, "reviewTime": "02 8, 2010"}
{"reviewerID": "AHLIXM4EMP06", "asin": "097968191X", "reviewerName": "S. Khan \"S. Khan\"", "helpful": [0, 0], "reviewText": "I get stopped almost on a daily basis with people asking me where I got my clipboard and how clever they think it is.  Overall I am extremely pleased with my purchase; its small, sturdy, and you don't have to worry about loosing it since it's in your pocket.My only complaint would be the fact that you initially are annoyed by your papers being folded in the middle and this is not the cheapest item.  But i would definitely recommend this to others and would buy another if mine goes out of commission.", "overall": 5.0, "summary": "Great ClipBoard", "unixReviewTime": 1269907200, "reviewTime": "03 30, 2010"}
{"reviewerID": "A1MILYTI1HJVK1", "asin": "097968191X", "reviewerName": "snowflakes", "helpful": [0, 0], "reviewText": "This clipboard is the best and last one you'll ever own. You will never again leave your clipboard in a patient's room or at a nursing station. And you'll have free hands to get coffee and capitalize on some of that taboo drug rep food. It fits perfectly into your white coat pocket and the clip has enough capacity to hold all your patient notes for the day plus any other random notes or paperwork you might need. Just be careful not to pinch your fingers in the hinge when you open it.", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1264636800, "reviewTime": "01 28, 2010"}
{"reviewerID": "A1IWFMHCR9AD4Y", "asin": "097968191X", "reviewerName": "whimsyraj", "helpful": [0, 0], "reviewText": "I love this clipboard and have had it for several years.  Very handy for several reasons:- foldable - main reason that I got this.  As a medical student and resident, you have enough things to carry and don't want to worry about carrying something in your hand.  It fits very easily into my white coat pocket.- has lots of information on it including common lab values, ABGs, neuro, etc which is great to have handy and you can easily look down to find the needed information, if needed- easy to write on (other people have commented on the hinges but I don't find it to be a big deterrent)I've had this for several years and always get commendations on it.  I know it's not available on amazon but it is made by whiteboardclipboard and available for purchase on the mdpocket website.", "overall": 5.0, "summary": "Very handy clipboard for medical students and residents", "unixReviewTime": 1361577600, "reviewTime": "02 23, 2013"}
{"reviewerID": "A1VMIWSLYDR2GC", "asin": "097968191X", "reviewerName": "W. M. Pullen \"Med Student\"", "helpful": [0, 0], "reviewText": "I love this thing.  I gave it 4 stars because i prefer the vertical one to the horizontal one just because that's the way i like to fold my papers, but this thing works great.  If i could the the vertical one again i would be super excited.  So...White Coat Clipboard...bring it back!!!", "overall": 4.0, "summary": "Incredible", "unixReviewTime": 1261958400, "reviewTime": "12 28, 2009"}
{"reviewerID": "A1FJJQAFTJDUIV", "asin": "097968191X", "reviewerName": "Y. shaykevich", "helpful": [0, 0], "reviewText": "this product is very hand while on the floors seeing people in the hospital and handy info is on the outside for calculations and med doses.", "overall": 4.0, "summary": "good product", "unixReviewTime": 1270252800, "reviewTime": "04 3, 2010"}
{"reviewerID": "A1Z0FYB284TZTT", "asin": "0982614926", "reviewerName": "Denalee C. Chapman \"Silver Strands\"", "helpful": [1, 1], "reviewText": "Susan has a realistic way of bringing optimism to the table in her Celebrate Life Book.  One of my favorite parts was where she taught me that one does not need to possess anything negative.  She never said \"I have cancer\" ... cancer is something that tries to invade us, but we don't need to possess it.  We battle it, we acknowlege it, we work against it - we don't \"have\" it.  That is our choice.  This book has given me great perspective and also some very practical ideas.  It's not just how to battle cancer ... it's how to live life to the fullest; how to enjoy the moment; how to get through tough things and emerge an actual victor ... it's truly how to CELEBRATE LIFE.  I recommend this for those who need to find some happiness in their current situations, and to those who already are celebrating - it's filled with wisdom and an undercurrent of smiles.", "overall": 5.0, "summary": "Perspective", "unixReviewTime": 1293667200, "reviewTime": "12 30, 2010"}
{"reviewerID": "A1VY6NH4WCWGX0", "asin": "0982614926", "reviewerName": "Yvonne Gudmundson", "helpful": [1, 1], "reviewText": "Feeling discouraged?  Life's problems seem overwhelming?  This book helps one discover new ways of handling the challenges we all bear.  The author's optimism and enthusiasm are contagious.  She includes not only her own life experiences but those of others who faced challenges and overcame them in positive ways.  We can't just let \"life happen to us\" but can turn even negative experiences into opportunities for growth. I've used these ideas on many of my down days to lift my spirits.  I recommend this book to all who want to not just \"get through life\" but celebrate the joy of each new day!  I was touched and inspired by this book, and think you will be too!", "overall": 5.0, "summary": "We all have reasons to celebrate life!  Discover yours!", "unixReviewTime": 1294617600, "reviewTime": "01 10, 2011"}
