{"reviewerID": "AMEVO2LY6VEJA", "asin": "0000191639", "reviewerName": "Nicole Soeder", "helpful": [0, 0], "reviewText": "Great product, thank you! Our son loved the puzzles.  They have large pieces yet they are still challenging for a 4 year old.", "overall": 5.0, "summary": "Puzzles", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
{"reviewerID": "A3C9CSW3TJITGT", "asin": "0005069491", "reviewerName": "Renee", "helpful": [0, 0], "reviewText": "I love these felt nursery rhyme characters and scenes.  The quality of the felt is good, and the illustrations are detailed and pretty.  As noted, the figures and scenes are printed on 2 large sheets of flannel and each individual item needs to be cut out.  This process took me 2 hours of tiny cutting.  To me it does not lend itself to a book form but rather laying out the scenes separately or for use on a flannel board.  However, I love the quiet play it offers for my toddler, and as a former Kindergarten teacher, I understand the value of learning rhyme and its connection to future reading.  Overall, delightful product with some work involved.", "overall": 4.0, "summary": "Charming characters but busy work required", "unixReviewTime": 1377561600, "reviewTime": "08 27, 2013"}
{"reviewerID": "A31POTIYCKSZ9G", "asin": "0076561046", "reviewerName": "So CA Teacher", "helpful": [0, 0], "reviewText": "I see no directions for its use. Therefore I have to make up the games, unfortunately.", "overall": 3.0, "summary": "No directions for use...", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
{"reviewerID": "A2GGHHME9B6W4O", "asin": "0131358936", "reviewerName": "Dalilah G.", "helpful": [0, 0], "reviewText": "This is a great tool for any teacher using the Pre Calculus Enhanced with Graphing Utilities book (of any edition). Easy to use with a very extensive test bank. Excellent!", "overall": 5.0, "summary": "Great CD-ROM", "unixReviewTime": 1382400000, "reviewTime": "10 22, 2013"}
{"reviewerID": "A1FSLDH43ORWZP", "asin": "0133642984", "reviewerName": "Dayna English", "helpful": [0, 0], "reviewText": "Although not as streamlined as the Algebra I materials .. this is extremely helpful for first time teachers ...bulk of materials are prepared for presentations.", "overall": 5.0, "summary": "Algebra II -- presentation materials", "unixReviewTime": 1374278400, "reviewTime": "07 20, 2013"}
{"reviewerID": "A3NXHTSEBX9YHB", "asin": "0279515766", "reviewerName": "marlenetbueras", "helpful": [0, 0], "reviewText": "i am glad to get it after 25 yr of waiting for her i ended up with 4 of her", "overall": 5.0, "summary": "my strawberry shortcake", "unixReviewTime": 1363564800, "reviewTime": "03 18, 2013"}
{"reviewerID": "AYVR1MQCTNU5D", "asin": "0375829695", "reviewerName": "annie", "helpful": [0, 0], "reviewText": "What a great theme for a puzzle book. My daughter loves both Dr. Seuss AND puzzle books, so this was a hit!", "overall": 5.0, "summary": "So cute!!", "unixReviewTime": 1291939200, "reviewTime": "12 10, 2010"}
{"reviewerID": "A3CJHKFHHQJP2K", "asin": "0375829695", "reviewerName": "Beth Sharo \"bookmom\"", "helpful": [0, 0], "reviewText": "My son got this book for his birthday.  He loves puzzles and Dr. Seuss and I felt that this would be a winning combination.  The pieces are all the same shape and can easily be put together in the wrong place.  I worked with him to complete the puzzle and found it frustrating as an adult.  I would not recommend this book to anyone.", "overall": 1.0, "summary": "Disappointing Puzzle Book", "unixReviewTime": 1297209600, "reviewTime": "02 9, 2011"}
{"reviewerID": "A3638FINP26E8N", "asin": "0375829695", "reviewerName": "C. Boykin", "helpful": [1, 1], "reviewText": "Love the book format. My 4yr old grandson loves puzzles and Dr. Seuss was an added plus. BUT several of the pieces are cut the same, causing unnecessary confusion and frustration for both of us.", "overall": 3.0, "summary": "frustrating puzzle pieces", "unixReviewTime": 1282521600, "reviewTime": "08 23, 2010"}
{"reviewerID": "AUT7723O49VMN", "asin": "0375829695", "reviewerName": "Cindy Lindy", "helpful": [1, 1], "reviewText": "I'm a 2nd grade teacher.  My students found the jigsaw puzzle book challenging and fun.  We ended up cutting it up to allow more to use the puzzles at one time.  A great activity for children when they have finished their work and or when a class is celebrating Dr. Seuss' Birthday!", "overall": 4.0, "summary": "challenging and fun", "unixReviewTime": 1237766400, "reviewTime": "03 23, 2009"}
{"reviewerID": "A27GZ92KLXDJVJ", "asin": "0375829695", "reviewerName": "D. Glade", "helpful": [1, 1], "reviewText": "This puzzle is poorly made.  The picture part of the puzzle pieces pops right off the backing.  Also, as another review mentioned, all the pieces are cut the same - so pieces that don't actually go together fit just fine.  This was extremely confusing for my 3 year old who is a puzzle pro!  Don't waste your money, stick with Melissa and Doug!", "overall": 2.0, "summary": "Cheaply made puzzle - not worth your $!", "unixReviewTime": 1264550400, "reviewTime": "01 27, 2010"}
{"reviewerID": "A1QG5NJW3LOTSO", "asin": "0375829695", "reviewerName": "H. Chao", "helpful": [0, 0], "reviewText": "On the plus side - puzzle book format and delightful Seuss pictures. Big minus - puzzle pieces that physically fit together don't actually go together if you look at the picture, which makes these children's puzzles unnecessarily and frustratingly difficult.", "overall": 3.0, "summary": "mixed feelings", "unixReviewTime": 1201564800, "reviewTime": "01 29, 2008"}
{"reviewerID": "A2R5OO04DXXGZ2", "asin": "0375829695", "reviewerName": "Jack Bowdoin", "helpful": [0, 0], "reviewText": "Nephew and Niece loved these! Highly recommended. Each page has a puzzle and on the back a Dr. Seuss blurbs. The puzzles don't look that cheap to me.", "overall": 5.0, "summary": "Great Puzzle!", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}
{"reviewerID": "A11TL78PNBS336", "asin": "0375829695", "reviewerName": "L. Vickers \"lcvickers\"", "helpful": [0, 0], "reviewText": "If you have a child who loves Dr. Suess, and loves puzzles- this may be a good match! Just be aware that the peices are small, (48 per page) and that although it suggests an age range of 4-8, it probably is too involved for most 4 year olds to do on their own. But it is a fun book, and I have given several out for birthday presents to the children in my son's preschool.", "overall": 4.0, "summary": "Big book of puzzles!", "unixReviewTime": 1292198400, "reviewTime": "12 13, 2010"}
{"reviewerID": "A2WR3MP7IGOFBO", "asin": "0375829695", "reviewerName": "M. Jimenez", "helpful": [0, 0], "reviewText": "Very cute. I liked that each of the puzzle frames have their own background color that corresponded with the backs of the puzzle pieces, Makes is so easy to sort if your child happens to take out pieces from all of the puzzles", "overall": 5.0, "summary": "Cute", "unixReviewTime": 1399852800, "reviewTime": "05 12, 2014"}
{"reviewerID": "A3K6F6HQIH3UJP", "asin": "037585746X", "reviewerName": "Lindsay", "helpful": [1, 1], "reviewText": "Great coloring and activity book for young children!It arrived in plenty of time for my daughter's birthday, I would recommend it!", "overall": 5.0, "summary": "Very Cute Coloring Bookwith Activities!", "unixReviewTime": 1348531200, "reviewTime": "09 25, 2012"}
{"reviewerID": "A2HPAJUKS7QQZM", "asin": "0425066169", "reviewerName": "Benjamin Stiefel", "helpful": [0, 0], "reviewText": "I have loved this game since I was really young.  I used to play with my family and I'm glad I can play it now as an adult with new people.  The game mechanics are simple - you go to a location based on the card you draw, acquire wealth and avoid the bad guys (and other players!).  The first player to acquire enough wealth wins... couldn't be simpler, couldn't be more fun!The copy I bought was kindly packaged with extra bags (essential!) and was well cared for.  Someone else clearly recognized its value, and I'm happy to continue to.", "overall": 5.0, "summary": "Super fun game from childhood", "unixReviewTime": 1349913600, "reviewTime": "10 11, 2012"}
{"reviewerID": "A15KKP3QW57CMT", "asin": "0425066169", "reviewerName": "Carlos J. Glanville", "helpful": [0, 0], "reviewText": "Complex game.  It takes a while to learn but when you play with multiple people, it really is a lot of fun.", "overall": 5.0, "summary": "Great game", "unixReviewTime": 1363392000, "reviewTime": "03 16, 2013"}
{"reviewerID": "A2O0GYFT35RIX6", "asin": "0425066169", "reviewerName": "John D. Culbertson", "helpful": [5, 5], "reviewText": "Sanctuary is a 1982 board game based upon the anthology series Thieves World.  The production values are rather low and the rules horribly written.  If you take the time to really, really sift through the rules you can enjoy this game.The neat thing is that the game comes in many forms.  You can play it solitaire.  Your goal is to clean up crime in Sanctuary.  Or you can play the basic design for two to five players or an advanced version of the same game.  Finally, you can try a six player version (just so you don't leave anyone out.  I found the advanced game the most satisfying.You goal is to commit thefts so that you gain and secure 300 silver pieces.  Along the way you may luck into 10 or 20 silver pieces here or there.  Of course you will lose money as you get thrown in the dungeon, mugged by other players, have bad luck, or choose to buy weapons, thugs, or magic to assist you.In a neat convention, players move their characters and the guards during their turn.  Two six sided dice and one ten sided die are rolled and the player uses two to move his/her character with the remaining die used to move the guard.  In this way players can choose to move the guards away from them, toward their competiton, or hopefully both.  After moving to the designated area players burgle, mug, or pick pocket their way to wealth and retirement.  Fortune smiles on the players in the liberal mecca of Sanctuary as even the worst of thefts results in only a temporary setback - no death or dismemberment here.Overall this is a decent game, but it will take you awhile to find this out.  Readers of the books will enjoy the game for nostagic reasons.", "overall": 3.0, "summary": "If your willing to fight for it, this game will work.", "unixReviewTime": 1117065600, "reviewTime": "05 26, 2005"}
{"reviewerID": "A2BK2H5ZEB4H2Z", "asin": "0439028485", "reviewerName": "Alicia Pearson", "helpful": [0, 0], "reviewText": "Bought this form my nephew age 2, He loved clifford.  Found this to be helpful with fine motor skills and he just loves blocks.  They are like a cardboard with covering type material so they can break but for clifford lovers and for stacking blocks this is great.", "overall": 4.0, "summary": "Clifford stacking blocks", "unixReviewTime": 1324425600, "reviewTime": "12 21, 2011"}
{"reviewerID": "AWC5CBJRYHDQO", "asin": "0439028485", "reviewerName": "Cynthia E. Vangavree \"Cindy\"", "helpful": [1, 3], "reviewText": "The product review was unclear as to the condition of either new or used. You were made to believe the item was new. The seller's store profile indicated nothing but USED items were being sold. This information only surfaced after attempting to cancel the credit card purchase. Contact was made by email to the seller numerous times to cancel the order 20 minutes after sending it. This experience reinforces why people do not trust internet vendors.RichardMifflintown,PA", "overall": 1.0, "summary": "Very confusing description of the product for sale", "unixReviewTime": 1274054400, "reviewTime": "05 17, 2010"}
{"reviewerID": "AFKFJKM6J13P3", "asin": "0439028485", "reviewerName": "M. Strickland \"Montana Grandma\"", "helpful": [1, 1], "reviewText": "Very sturdy, has the ABC's, Numbers, and is fun to stack up and knock down.  I bought them form my 16 mo old grandson and his big sister who's 7 loves them too!!", "overall": 5.0, "summary": "Lots of fun", "unixReviewTime": 1232323200, "reviewTime": "01 19, 2009"}
{"reviewerID": "A4Y5PAH9NPQKJ", "asin": "0439028485", "reviewerName": "Sarah Crawford", "helpful": [1, 1], "reviewText": "My daughter loves Clifford and stacking, so these blocks seemed like a perfect gift.  I was shocked to see the price listed so I put it in my wish list instead of my cart but as the Xmas grew closer I thought \"well... maybe they will be worth the splurge\".  They are pretty.  But they're made of cardboard.  They are just 10 cardboard stacking blocks.  I am not what you would call a frugal person but the cost is exorbitant.  Would look for a used set next time.*** Thought I should clarify after reading my review and seeing the NEW price listed.  Apparently I was taken by the old \"raise the price around Xmas\" trick.  I paid... ON AMAZON a few weeks before XMas $39.99 for these blocks.  I see now they are $15.99.  Now I really feel tricked.", "overall": 2.0, "summary": "Product is nice but the cost!  Yeesh.", "unixReviewTime": 1326326400, "reviewTime": "01 12, 2012"}
{"reviewerID": "ANMSW0F2QRMDE", "asin": "0439028485", "reviewerName": "Tonia Hannemann", "helpful": [1, 2], "reviewText": "I already sent in 1 review for this toy.The quality was Poor!  The outside paper covering was flimsy...and the glue had run down the inside of several of the boxes...and looked cheap and messy.  This is the 1st Amazon product I have been disappointed with.  It was not worth the money I spent getting it for my granddaughter...what a shame.", "overall": 1.0, "summary": "disappointment with quality", "unixReviewTime": 1268524800, "reviewTime": "03 14, 2010"}
{"reviewerID": "A18OBUSMXVE8R0", "asin": "0439400066", "reviewerName": "J. Guild", "helpful": [0, 0], "reviewText": "This is a neat little introduction set for anyone interested in puzzles,optical illusions,quizzes ,etc. The pack consists of 9 thumbnail size wire puzzles.These are age old puzzles and are very simple to solve,and actually the way they are solved is much the same way.There is small 3 3/4 X 3 3/4 inch booklet of 48 pages ,which gives a full page illustration for solving each wire puzzle.The rest of the book consists of 29 puzzles and answers.The quality of the wire puzzles is quite poor as the wire is very light and can be easily bent and deformed,ruining them.The other puzzles are fairly good and with a little time can be solved by kids or adults.Now let me explain my title.On the back of the package the price is stamped,$7.99 US,$10.99 Cdn.That is plenty to pay for this item.However,it is being offered here for $99.15.This is a  ridiculously high price and anyone who pays that much for this kit will be very disappointed.Then there's the Shipping Weight that is listed as 2 pounds.At the most this item weighs only about 3 or 4 ounces.", "overall": 3.0, "summary": "Who's  kidding who ?", "unixReviewTime": 1375401600, "reviewTime": "08 2, 2013"}
{"reviewerID": "A10DW4UGJM196Q", "asin": "0439512050", "reviewerName": "Debby Holda", "helpful": [0, 0], "reviewText": "This Puppet is wonderful for use in a Classroom or Library when reading any Mike Thaler books to your students. It is also a nice Gift for Children. It is made well.The Glasses are cute!", "overall": 5.0, "summary": "A Wonderful Teaching Aid", "unixReviewTime": 1197158400, "reviewTime": "12 9, 2007"}
{"reviewerID": "A30U0XP1N4P22Z", "asin": "0439651859", "reviewerName": "Page Surfer", "helpful": [1, 1], "reviewText": "I love these notes because of the documentation aspect.  I keep one copy, while the parents receive the other.  I have often photocopies my copy to mark it second notice.", "overall": 5.0, "summary": "Great for Documentation", "unixReviewTime": 1338940800, "reviewTime": "06 6, 2012"}
{"reviewerID": "A2PA3OGD25NAYS", "asin": "0439651859", "reviewerName": "Sylvia Elliott", "helpful": [0, 0], "reviewText": "Very useful notes for any teacher--comes complete with a ready made carbon copy.  Great service--speedy shipping.  Everything top-notch from beginning to end!!", "overall": 5.0, "summary": "Great product!!", "unixReviewTime": 1369958400, "reviewTime": "05 31, 2013"}
{"reviewerID": "A2RMI27PZ41AEB", "asin": "0439652472", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Wish it had more flags depicted - the picture shows exactly what you get, no more, no less.  Not what I was looking for.", "overall": 3.0, "summary": "It's ok", "unixReviewTime": 1389830400, "reviewTime": "01 16, 2014"}
{"reviewerID": "AKSRRH038UEAX", "asin": "0439710324", "reviewerName": "William L. Brown \"Bill\"", "helpful": [0, 0], "reviewText": "The only reason I listed durability as just OK is because I bought it for my Terrier.  She loved it, but few cloth toys can withstand the determination of a Westie :)", "overall": 4.0, "summary": "This is a great toy!", "unixReviewTime": 1328054400, "reviewTime": "02 1, 2012"}
{"reviewerID": "A1XB3SJ3CAQP5F", "asin": "0439838649", "reviewerName": "J. Hughes", "helpful": [0, 0], "reviewText": "My daughter has had a hard time learning  and these have really helped so much. She can recognize some of her letters now.  There's even picture magnets", "overall": 5.0, "summary": "Love Montessori Learning", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}
{"reviewerID": "AFWGHF6XGKJ26", "asin": "0439838649", "reviewerName": "JuJuBee", "helpful": [0, 0], "reviewText": "These letters exceeded our expectations!  They are large, sturdy, and stick VERY well to any surface we have tried!  I love that the consonants are one color and vowels are a different color!  The magnetic pictures are also sturdy and are excellent tools to use.  My five year old can find all the beginning letters to each picture and can use the letters to spell other simple words on his magnetic board. We use this set weekly in our kindergarten home school time and for free play too!", "overall": 5.0, "summary": "Exceeded our Expectations!", "unixReviewTime": 1387152000, "reviewTime": "12 16, 2013"}
{"reviewerID": "A2GMR735A8OIX7", "asin": "0439843073", "reviewerName": "Monica Sharpton \"Auntie Mo\"", "helpful": [0, 2], "reviewText": "There's not much to say.  I ordered it as a gift for my nephew's 3rd birthday.  I'm not sure what I expected, but when I saw it, the dog looked a little more geared toward girls than boys.  I honestly have know idea how it's going to teach him how to count, but we shall see.", "overall": 1.0, "summary": "Countdown Letdown", "unixReviewTime": 1259798400, "reviewTime": "12 3, 2009"}
{"reviewerID": "AIEV9YB94UCQB", "asin": "0439845297", "reviewerName": "ESellers", "helpful": [0, 0], "reviewText": "It's a pretty awesome model. BUT I'm not happy that it was missing a part. The package was intact but when I put the model together I discovered that there were only 5 legs. Couldn't find any appropriate place on Amazon to communicate this to the seller. And it's definitely not worth returning. 'MIGHT' consider ordering another one - from another source - as long as I can be reasonably sure that the 2nd one will in fact have ALL of the parts in the package.", "overall": 3.0, "summary": "Missing parts - but otherwise, a relatively good model.", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"}
{"reviewerID": "A6LDQF16SFXIH", "asin": "0439855896", "helpful": [0, 0], "reviewText": "I had one of these when I was first starting out in magic. Loved it! It's an easy trick that just about anyone with a brain can do", "overall": 5.0, "summary": "Loved it! It's an easy trick that just about ...", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
{"reviewerID": "A12PP78XFH8LCZ", "asin": "0439855896", "reviewerName": "4grandma", "helpful": [0, 1], "reviewText": "Should have read other product reviews before ordering. It is a piece of black paper. Yes the price is low, but not at all what I had expected.", "overall": 2.0, "summary": "Magic Wand", "unixReviewTime": 1376956800, "reviewTime": "08 20, 2013"}
{"reviewerID": "A3E469XRTYO1HG", "asin": "0439855896", "reviewerName": "Amazing Magic Jack", "helpful": [0, 0], "reviewText": "A small appearing wand that is easy to operate and does what it is supposed to do. Most magicians can use this wand sometime in their many performances.", "overall": 4.0, "summary": "A fun appearing wand", "unixReviewTime": 1357344000, "reviewTime": "01 5, 2013"}
{"reviewerID": "A2R6DR8WU5BMUW", "asin": "0439855896", "reviewerName": "Amazon Customer", "helpful": [2, 2], "reviewText": "very fun magic trick but belive me buy multiple because very un durable made of paper i also do suggest throwing it up because itexploded in my hand and it was ugly real ugly basicly it hit my head cheap", "overall": 4.0, "summary": "pretty good buy multiple", "unixReviewTime": 1308182400, "reviewTime": "06 16, 2011"}
{"reviewerID": "A20B5LQTWGVUHD", "asin": "0439855896", "reviewerName": "Amy", "helpful": [3, 5], "reviewText": "My five year old son wanted a magic wand for Christmas. This &#34;wand&#34; is a rolled up piece of paper. I almost threw it away because I didn't see it in the box with my other items. Very disappointing!", "overall": 1.0, "summary": "Seriously?", "unixReviewTime": 1387929600, "reviewTime": "12 25, 2013"}
{"reviewerID": "A27DKVJ11SRCYN", "asin": "0439855896", "reviewerName": "Andrew", "helpful": [1, 2], "reviewText": "It's a cheap magic trick. Don't expect too much.This item is a strip of mylar/foil that wants to roll up along its long axis. It is rolled up the other way and secured with a rubber band. Secured this way, it is about an inch long and 1/4 in across; small enough to palm easily. When you remove the band, the strip unrolls quickly and re-rolls itself into a tube.It's good for a cheap laugh; it looks just remotely enough like a wand when it is unrolled to go along with, say, a children's magic show. If you need a real wand for a trick, though, this isn't it.EDIT:The price on this has risen since I reviewed it! It was a dollar when I bought it, and just barely worth the price - by no stretch of the imagination is it worth $5!DO NOT BUY THIS WHILE THE PRICE IS SO HIGH! It is just a strip of mylar - it cannot cost the company more than 2 cents each. Do not buy at this price. I would drop this down to two stars if I could.", "overall": 3.0, "summary": "You get _less than_ what you pay for.", "unixReviewTime": 1294790400, "reviewTime": "01 12, 2011"}
{"reviewerID": "A3PU4ZG8ZS1VMS", "asin": "0439855896", "reviewerName": "Angela", "helpful": [0, 0], "reviewText": "I didn't realize that this was just a piece of aluminum...too flimsy for a child to get much use out of.", "overall": 3.0, "summary": "Not As Expected", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
{"reviewerID": "A5I1R4N306W68", "asin": "0439855896", "reviewerName": "bais", "helpful": [0, 1], "reviewText": "Did not realize that this was just shiny paper that was rolled up and held together by a tiny ring that will be lost in a week by an 8 1/2 year old.", "overall": 2.0, "summary": "Flimsy", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "A1O2YMUW3SZC8P", "asin": "0439855896", "reviewerName": "Ben", "helpful": [1, 2], "reviewText": "It worked.  However it was just a piece of foil in essence.  I did not read the description carefully enough before I gave as a gift.  It was relatively lack luster.", "overall": 1.0, "summary": "Ok", "unixReviewTime": 1394236800, "reviewTime": "03 8, 2014"}
{"reviewerID": "A2D8Y4TOD4VNW4", "asin": "0439855896", "reviewerName": "berry_fly", "helpful": [0, 0], "reviewText": "Not enough description was given as to how the magic wand worked (Must keep secret)However, after finding out how it worked, i would not have paid the amount i did on this product.It did get a few laughs, but product needs to be well taken cared for, fragile.", "overall": 4.0, "summary": "Magical wand", "unixReviewTime": 1322179200, "reviewTime": "11 25, 2011"}
{"reviewerID": "A2DQZ19DE5CM14", "asin": "0439855896", "reviewerName": "Billy Banjo", "helpful": [7, 11], "reviewText": "Great when it is new but looses its memory quickly if not stored properly.  A hard thing for kids to manage.", "overall": 1.0, "summary": "Magic Wand", "unixReviewTime": 1294963200, "reviewTime": "01 14, 2011"}
{"reviewerID": "A3A6Y55YAVB4X4", "asin": "0439855896", "reviewerName": "Bob Snyder", "helpful": [0, 0], "reviewText": "Used it as part of a safety presentation for kindergarten children. Very simple design but end result is realistic to children.", "overall": 5.0, "summary": "Very simple but impressive to little children", "unixReviewTime": 1389484800, "reviewTime": "01 12, 2014"}
{"reviewerID": "A2G4TBLSXYR25Y", "asin": "0439855896", "reviewerName": "Brigid's Veil", "helpful": [2, 4], "reviewText": "This is not a wand. It's paper that does a neat trick that is not worth the $5.99 plus shipping, for a total of $10.14.It likely cost $0.25 to make. My son was very disappointed with the &#34;paper trick,&#34; and played with it a total of 15 minutes.Save your money and buy a real wand, or something that is more durable and worth what you spend.", "overall": 1.0, "summary": "Paper Ttrick, not a wand", "unixReviewTime": 1380585600, "reviewTime": "10 1, 2013"}
{"reviewerID": "AUJKCCB2HDZ82", "asin": "0439855896", "reviewerName": "BurghGuy", "helpful": [0, 0], "reviewText": "This product does exactly what it claims it does, however the picture is misleading.  The product works beautifully; simple, somewhat durable (for the price), and a child could operate it with no problems. But there was one surprise.  The effect is deathly simple, you just reach out into the air and \"Viola\" a magic wand appears.  Makes for a great opener.  I recieved this product in the mail, took it out of the box, performed the trick (in front of a few coworkers) and sure enough, as promised, an 18\" magic wand appeared.  An 18\" PURPLE magic wand appeared.  Needless to say the trick was a surprise to the magician also.Now, there are worse things than a purple wand.  It's eye-catching, it's flashy, it's regal.  But if you're expecting a stock black wand, this isn't it.No complaints about the overall product beyond color though.  Performs exactly as promised.", "overall": 4.0, "summary": "Fun product with a surprise!", "unixReviewTime": 1320451200, "reviewTime": "11 5, 2011"}
{"reviewerID": "A26QQ56IOUOUJQ", "asin": "0439855896", "reviewerName": "Calvn Hobbes \"calvnhobbes\"", "helpful": [1, 1], "reviewText": "This is a wonderfully cute trick. Of course these don't last forever, so buy a couple at this price. But I wonder- can you chose a color? Ours was plum purple, not black like the photo. Next time I will specifically request a black wand.", "overall": 4.0, "summary": "Cute trick for a good price", "unixReviewTime": 1290124800, "reviewTime": "11 19, 2010"}
{"reviewerID": "A2NYUQM7MKANW0", "asin": "0439855896", "reviewerName": "Creyu Suda \"Creyu Suda\"", "helpful": [1, 1], "reviewText": "It is a rolled up piece of paper, and yes it is way overpriced for the materials.  It's a &#34;trick&#34; trick wand.Giving this to a four year old cousin.  It's actually a pretty cute and works perfectly.  It also looks like a legit wand when opened, retains it's shape, and could be used for another trick.Hope the review explained it enough to not have to read all the five star reviews...and then all the one star reviews...", "overall": 5.0, "summary": "All the one star reviews are true; the wand itself is the real \"trick\"", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}
{"reviewerID": "A19YXR1MIQC4DX", "asin": "0439855896", "reviewerName": "Dan", "helpful": [1, 3], "reviewText": "This is a roll of foil. If you give it a shake, it is supposed to open up into a magic wand. It is incredibly flimsy construction. I purchased this to accompany my son's Wizard Halloween costume and it is just not going to cut it. I see other reviewers rave about it but caveat emptor. Not a magic moment for me.", "overall": 1.0, "summary": "Piece of foil", "unixReviewTime": 1381276800, "reviewTime": "10 9, 2013"}
{"reviewerID": "A50F2OBZSPVSY", "asin": "0439855896", "reviewerName": "Dave B.", "helpful": [6, 8], "reviewText": "I had lots of fun with this, it took me five minutes to learn. It was fun, when I showed people, they were amazed, some said it gets smaller, so I let them try making it small and they couldn't. I recommend this for kids.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1302825600, "reviewTime": "04 15, 2011"}
{"reviewerID": "A1ZBVOKXQ46DRH", "asin": "0439855896", "reviewerName": "Deanne M Uhteg", "helpful": [0, 0], "reviewText": "A lot of people spend A LOT MORE for a cup of coffee.  Granted, this &#34;magic&#34; wand LOST it's magic, after about 10 uses (it doesn't spring/pop into a wand much anymore), but for the money spent, it was worth it.  My 5 year old impressed his family and friends, and felt &#34;magical!&#34;Yes, I would like it to be longer lasting, but you get what you pay for folks.", "overall": 5.0, "summary": "GREAT for about 10 uses, but it was only $2, so not that horrible", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "A1NRSWWOFZSQCV", "asin": "0439855896", "reviewerName": "D. Jakway \"doug-O!\"", "helpful": [0, 0], "reviewText": "Great little toy. Works good for a few times. The mylar bends and creases easily. Hard to reroll after its' uncoiled.", "overall": 3.0, "summary": "cool trick", "unixReviewTime": 1332720000, "reviewTime": "03 26, 2012"}
{"reviewerID": "A1C61V1GJ2MI3O", "asin": "0439855896", "reviewerName": "D Leena \"Leena\"", "helpful": [0, 0], "reviewText": "My almost 5 year old kid loves doing this Magic trick. He cannot roll back the wand and needs my help with that. But other than that, I would recommend this for any young magician.", "overall": 5.0, "summary": "My kid loves it", "unixReviewTime": 1368576000, "reviewTime": "05 15, 2013"}
{"reviewerID": "A3LC7S1LAOTCFA", "asin": "0439855896", "reviewerName": "eric", "helpful": [0, 0], "reviewText": "I bought it for my sons talent show. It worked just as advertised. It isn't very sturdy and very quickly wears out as its a coil of thin flat metal I think. Its good for a show or two but no more.", "overall": 4.0, "summary": "worked great.", "unixReviewTime": 1372032000, "reviewTime": "06 24, 2013"}
{"reviewerID": "AMSPMQQ7TY419", "asin": "0439855896", "reviewerName": "fadi", "helpful": [0, 0], "reviewText": "My son needed to practice a lot catching this wand. Will need to get comfortable with how it pops open. It is very light weight and it kind of floats in air.", "overall": 4.0, "summary": "Great trick", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}
{"reviewerID": "A2BG35W36BHC1P", "asin": "0439855896", "reviewerName": "Gary Daniel \"Gary Daniel\"", "helpful": [0, 0], "reviewText": "cheap, fun, and easy to do. Great for a 6 year old. Difficult for beginner to roll up. Bougth two. Would do it again.", "overall": 4.0, "summary": "magic wand", "unixReviewTime": 1356739200, "reviewTime": "12 29, 2012"}
{"reviewerID": "A3PQK2C3YHELKQ", "asin": "0439855896", "reviewerName": "Got your fanta?", "helpful": [2, 5], "reviewText": "I wish I hadn't bought 3 of these; I really regret it because like the negative reviews say, it only works once and then quickly loses its memory. I had to return 2 of them and just suck up the cost of shipping because they would be a reminder of how foolish I was to buy this thing. Please don't buy it unless you want a cheap $4 toy that you play with once. The first time is pretty cool; after that, you really hate yourself for buying it.", "overall": 1.0, "summary": "SUCKS", "unixReviewTime": 1305504000, "reviewTime": "05 16, 2011"}
{"reviewerID": "A1FHIBN7Y0E9YF", "asin": "0439855896", "reviewerName": "Heather H.", "helpful": [0, 0], "reviewText": "These little wands are so cool!  My daughter got the biggest grin on her face when she tried it for the first time and loves doing this trick for anyone who comes over.  They are a little difficult to re roll at first, I have to do it for her, but once you get the hang of it it's not so bad.  I got 2 based on other reviews, and they are a little different, one is silver and black like the picture and the other is black and gold with a cool pattern, it's a bit longer than the other as well, but we liked the variety.  It's a good idea to have more than one if you want to do the trick more than once during a &#34;show,&#34; as you can't repeat the trick until you've re-rolled it. I don't see why they shouldn't last a long time as long as you aren't too rough with them.  They are a great price and I think any kid who's into magic needs a few of these.", "overall": 5.0, "summary": "Clever!", "unixReviewTime": 1390521600, "reviewTime": "01 24, 2014"}
{"reviewerID": "A1KNH6JA6UQ3KX", "asin": "0439855896", "reviewerName": "Jacqueline Nenchin \"bibliophile\"", "helpful": [0, 1], "reviewText": "It was a flimsy piece of foil really. To use it for my costume I had to decorate it and fill it with fairy dust, so it worked but wasn't what I thought.", "overall": 3.0, "summary": "Magic Wand", "unixReviewTime": 1372636800, "reviewTime": "07 1, 2013"}
{"reviewerID": "AQAIPDWD8JLND", "asin": "0439855896", "reviewerName": "J. Ball", "helpful": [9, 10], "reviewText": "My nephews love magic, so I always get something new for us to play with before I visit them.  When I received these magic wands, they seemed so cheap and cheesy that I thought they'd bomb.  But my nephews loved them!  They never seemed to get tired of doing the same trick, and since they are Harry Potter fans, they taught me a lot of words for various kinds of spells.At any rate, the magically appearing wands were extremely inexpensive and provided fun for the boys.  The wands' low quality materials are in line with the low price. They're definitely not for serious adult magicians, but I was quite pleased with the fun they provided for only a couple of dollars.", "overall": 5.0, "summary": "Nephews loved it", "unixReviewTime": 1306368000, "reviewTime": "05 26, 2011"}
{"reviewerID": "AF55WNLZO9G97", "asin": "0439855896", "reviewerName": "jeff", "helpful": [6, 8], "reviewText": "This one is so good.You'r better off ordering twothe price is right.You'll use it that much", "overall": 5.0, "summary": "Excellent, You must get this one.", "unixReviewTime": 1281657600, "reviewTime": "08 13, 2010"}
{"reviewerID": "AR85W5K2J3128", "asin": "0439855896", "reviewerName": "jody soucie", "helpful": [3, 5], "reviewText": "I was very disappointed with my purchase.  In fact, even though a small purchase (no pun intended) I was so disappointed I wanted to return item to prove a point!  However, I found that retailer would charge shipping costs of $4.01 to return via UPS to get my purchase price of $5.99 (plus tax) reimbursed.  I would not recommend this product to anyone.The only reason I gave it one star was because it was a requirement to post this message.", "overall": 1.0, "summary": "Very misleading", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
{"reviewerID": "A37JSGUOS2FE28", "asin": "0439855896", "reviewerName": "John O'Donnell", "helpful": [0, 0], "reviewText": "It's good. Not amazingly high quality, but it is so inexpensive ! I would definitely recommend it. Buy it !", "overall": 4.0, "summary": "Pretty Good", "unixReviewTime": 1376524800, "reviewTime": "08 15, 2013"}
{"reviewerID": "A21VVPON9BEQ8E", "asin": "0439855896", "reviewerName": "Magic man", "helpful": [0, 0], "reviewText": "Hey there I saw this and when I checked out I should have gotten this for free but did not. Here is why it should have been free, Spend $10-Trick IS FREE! Must add to cart, I did spend more that $10", "overall": 5.0, "summary": "Miss paid", "unixReviewTime": 1329523200, "reviewTime": "02 18, 2012"}
{"reviewerID": "ARYSR23N0O1EV", "asin": "0439855896", "reviewerName": "mel guido", "helpful": [1, 1], "reviewText": "This is a foil paper wand that appears magically after you have rolled it into a very small roll and throw it in the are.  My daughter loves the trick, but the picture is certainly misleading.  It does look pretty nice when new but, as being paper, it looks marked and a little damaged by now.  I bought it for my daughter's ballet recital where she will appear as a magician, but I will probably will need to buy another one for the show as this one is already quite damaged.", "overall": 3.0, "summary": "Foil paper wand, it is okay but not for long use", "unixReviewTime": 1367884800, "reviewTime": "05 7, 2013"}
{"reviewerID": "AXNPM6DT6S9ZX", "asin": "0439855896", "reviewerName": "Michael Vaughan", "helpful": [2, 3], "reviewText": "Bought this for my Nephew.  He seems to really enjoy it.  No complaints and it was received ontime.", "overall": 5.0, "summary": "Magic Wand", "unixReviewTime": 1284422400, "reviewTime": "09 14, 2010"}
{"reviewerID": "A8C4JMFD9LCJ", "asin": "0439855896", "reviewerName": "mp101", "helpful": [8, 13], "reviewText": "This wand is so cheap, the picture was misleading, I guess I should have measured out 18 inches, anyways its really small its made of paper?This definitely wont last a year if you use it all the time. Not even plastic, this is a  gimmick, a joke, something you would probably show a little kid but thats about it, I would return it but rock ridge the seller on amazon doesn't pay for return shipping, I only spent like [...] so its not worth the hassle, all I have to say is  if your a serious magician please pass on by, nothing great here.", "overall": 1.0, "summary": "What a joke....", "unixReviewTime": 1294444800, "reviewTime": "01 8, 2011"}
{"reviewerID": "A26I5R02K4BDFO", "asin": "0439855896", "reviewerName": "M. Pierce", "helpful": [0, 0], "reviewText": "Ok- so this wand has gotten several bad reviews but I have to say, WE LOVE IT!!! I bought this for my 6 year old son who wants to do a school talent show. The thrill he got when he threw it in the air and it popped open was awesome! It is indeed made of some sort of paper (kind of like a really thick mylar material), but I have to say after rolling it up and tossing it in the air 30 or more times in one night, it still looks great! Also, while it is paper, I do not think it looks like paper at all when being used. You would really have to hold it to know that it wasn't metal or plastic.I give this product 4 stars because I do believe the product description should state what kind of material it is made of. If you just go by the picture it looks to be plastic. So, I can understand the frustration of others if a more solid wand is what they were looking for. Also, it is not that easy to roll at first but once you break it in a bit, it gets much easier. Even my son was able to roll it after some practice.All in all, if used properly, I don't see why this wouldn't last a good long while. It is surprisingly fun and easy to use. I personally think I got a lot of bang for my buck. If you are a serious magician, this is probably not for you. But for a child who is looking for fun, it is, well, magic!!!", "overall": 4.0, "summary": "Fabulous wand for a child!!!", "unixReviewTime": 1389830400, "reviewTime": "01 16, 2014"}
{"reviewerID": "A4GO7H3C8A1CE", "asin": "0439855896", "reviewerName": "musicrobdog", "helpful": [3, 5], "reviewText": "cheap material, misleading photo, looks nothing like a typical magic wand, the profit margin on these must be enormous.  don't bother.", "overall": 1.0, "summary": "Misleading and low quality", "unixReviewTime": 1385942400, "reviewTime": "12 2, 2013"}
{"reviewerID": "AGJ5VZ9QDM7JK", "asin": "0439855896", "reviewerName": "Nils Lorch", "helpful": [0, 0], "reviewText": "5 Dollars  the material is 50 cent or less but the idea is great ant the money worththe magic wand will just appear out of the nowhere instandly.your child will be very surpriced when doing this.", "overall": 4.0, "summary": "stick is very nice", "unixReviewTime": 1397174400, "reviewTime": "04 11, 2014"}
{"reviewerID": "A2PR7F4Y92WHRW", "asin": "0439855896", "reviewerName": "Phillip G.", "helpful": [0, 2], "reviewText": "This product's quality was atrocious! I payed 4$ for a Cheap piece of plastic that Dented If you used it once! This was not expected!", "overall": 2.0, "summary": "Im Very Disapointed with this.", "unixReviewTime": 1304121600, "reviewTime": "04 30, 2011"}
{"reviewerID": "A1OPRCW4VM7N5I", "asin": "0439855896", "reviewerName": "p.j 'n the kanes", "helpful": [0, 0], "reviewText": "Im Really Intrested It Sounds Really Cool And Stuff But Im Scared It Might Only Have A Few Uses Can Someone Tell Me How much Uses It Has?", "overall": 5.0, "summary": "Im Intrested", "unixReviewTime": 1385078400, "reviewTime": "11 22, 2013"}
{"reviewerID": "A2K1K1BC9QEEXI", "asin": "0439855896", "reviewerName": "Rudolf", "helpful": [3, 5], "reviewText": "DO NOT BUY THIS PIECE OF S...!A simple piece of paper rolled up, that's all it is. Worth approximately $0.01. The BIGGEST and only magic it does is blowing $6.00 out of your pocket. DO NOT GET SCAMMED!", "overall": 1.0, "summary": "BIGGEST SCAM EVER!!!!!", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A1UTA1RYFEKNVE", "asin": "0439855896", "reviewerName": "SG \"Grandparent of boys\"", "helpful": [2, 4], "reviewText": "I thought it would be a wand that opened and closed. Not as it &#34;appears&#34;.  It is a cheap piece of plastic that you have to manually roll back up!  In addition it is tiny with a rubber gasket around it to keep it in place when rolled up.  This would be dangerous if swallowed by the  younger members of the family (under 3).  Not sure it will pay to return it, may cost more than it is worth.  If that's the case, it is going in the garbage!", "overall": 1.0, "summary": "Just a total disappointment!", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A28XNMLUXDYMGI", "asin": "0439855896", "reviewerName": "Shin", "helpful": [0, 1], "reviewText": "I honestly did not expect what I received. The actually wand was ripped and destroyed when it undid itself. Very unhappy kids.", "overall": 1.0, "summary": "Waste of money", "unixReviewTime": 1397692800, "reviewTime": "04 17, 2014"}
{"reviewerID": "ACS2FZVMITA1M", "asin": "0439855896", "reviewerName": "Stuart A. Mackellar \"XIII\"", "helpful": [2, 4], "reviewText": "Fun to pop this magic wand out when things get down to the wire at work.seems sometimes the bosses expect miracles, much fun to pop the wand out and say \"what, do you expect me to pull a rabit out of a hat?\".", "overall": 4.0, "summary": "Fun and laughs at work...", "unixReviewTime": 1272844800, "reviewTime": "05 3, 2010"}
{"reviewerID": "A31KKBUY35NQ1V", "asin": "0439855896", "reviewerName": "TexasTruckLover", "helpful": [0, 0], "reviewText": "After using this wand for about a week, it started getting creases in the ends and wont unfold correctly, therefore exposing the trick to the audience. Overall, i think this was an OK buy, but if you have the option, invest a little more money and get a metal one.", "overall": 3.0, "summary": "Looks as advertised.", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A62WCSG4QSBCJ", "asin": "0439855896", "reviewerName": "TH", "helpful": [3, 5], "reviewText": "Don't waste your money. This is a thin piece of celephane.  Opening is ok, you have to unroll a rubberband and then it flies open. To close it, though, you have to manually roll it up. I'm very disappointed. Is a $6 reminder to read reviews before ordering anything.", "overall": 1.0, "summary": "its a piece of celephane,  not a wand", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A14VQHANYFA2UY", "asin": "0439855896", "reviewerName": "W.Jacobs", "helpful": [0, 0], "reviewText": "The wand is great and a very funny good magic trick.  The wand is just rolled up plastic but a good quality great buy", "overall": 4.0, "summary": "Good wand", "unixReviewTime": 1361232000, "reviewTime": "02 19, 2013"}
{"reviewerID": "A39WLVQG9EA4BI", "asin": "0439855896", "reviewerName": "Ye Olde", "helpful": [11, 12], "reviewText": "Don't be decieved by its low price.  This is one magic trick that, while brief, is stunning and incredibly funny.  You can toss it in the air and it will appear midair!  To better the illusion of spontaneous appearance, toss it up with some confetti, for a delightful effect!  I tried this as a parial test of my new routine and it was enough to make a room full of jaded adults burst into applause and laughter!  It is made of a thin material, however, but it is durable enough for plenty of use. Just don't use it to whack anybody.  At this price, buy three...you won't regret it!", "overall": 5.0, "summary": "A showstopper...or show starter!", "unixReviewTime": 1285718400, "reviewTime": "09 29, 2010"}
{"reviewerID": "A2MAG7BIDRQTF8", "asin": "0439855896", "reviewerName": "zach's nana", "helpful": [2, 3], "reviewText": "I bought 2 of these wands for my 3 year old and 7 year old grandchildren. Both loved them because they flung them out from one inch to full length in an instant. A big hit for a small price.", "overall": 5.0, "summary": "Instand Magic Wand", "unixReviewTime": 1297555200, "reviewTime": "02 13, 2011"}
{"reviewerID": "A36FHTVY9A6M8P", "asin": "0439893577", "reviewerName": "757eileen \"eivb47\"", "helpful": [1, 1], "reviewText": "I used it with my  granddaughter. It is useful, but can get bent very easily.  That's why I only gave it 4 stars.", "overall": 4.0, "summary": "Magnetic Tabletop Learning Easel", "unixReviewTime": 1385337600, "reviewTime": "11 25, 2013"}
{"reviewerID": "A1NDCQ5AJZJY0O", "asin": "0439893577", "reviewerName": "A. J. Newton", "helpful": [1, 1], "reviewText": "Purchased this for my 2 great-grandsons to use with their Melissa & Doug wooden magnetic numbers and letters.  Just right for table top and easy to fold and store.", "overall": 4.0, "summary": "Good for the price", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
{"reviewerID": "AD20KF4B7ZGZD", "asin": "0439893577", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "the easal is tiny. deson't give enough room to learn or even put a sentence. The thing is just a cardboard wrapped around something magnetic. cheap quality. I wasted my money. should have gone to walmart and buy a real magnetic board instead. very unhappy.", "overall": 2.0, "summary": "too small", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "A1XH32CSZUKUAF", "asin": "0439893577", "reviewerName": "Amazon Customer \"Reader RN\"", "helpful": [1, 1], "reviewText": "Bought this for my granddaughter because stainless appliances do not support magnetic play. She loves it [age 2] and it can go in the car, plane, or on a table or floor. Good 'old-fashioned' non - tech non-electronic toy choice", "overall": 4.0, "summary": "good for travel & home", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "AG74YNIIZMHY0", "asin": "0439893577", "reviewerName": "Amy Smith", "helpful": [1, 1], "reviewText": "I bought this easel for my 20 month old niece for Christmas because I made her some photo magnets and their frig is not magnetic. The price for this easel is great. Without seeing a real picture, I was worried that it might be flimsy; however, it is quite sturdy and doesn't look like it will wear out easily. It folds flat, less than 1 inch thick when flat. One flap on the bottom is around 1 foot long and the other is about 2 inches. The flaps have velcro on them to make them stick together when the easel is up. The easel stands sturdily on the floor or table.  Both sides are both dry-erase and magnetic. It was exactly what I needed and my niece loved it!I would recommend this!", "overall": 5.0, "summary": "Good compact easel", "unixReviewTime": 1296086400, "reviewTime": "01 27, 2011"}
{"reviewerID": "A3NB50PHKE64QA", "asin": "0439893577", "reviewerName": "Angela campbell", "helpful": [0, 0], "reviewText": "My grand daughter wanted a magnetic board so I ordered this and we couldn't be happier. Being 2 sided it works well for her brother to also play with the magnets.", "overall": 5.0, "summary": "Great Product", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"}
{"reviewerID": "A30FVGQNTTZDAY", "asin": "0439893577", "reviewerName": "Angelyn Zapata", "helpful": [0, 0], "reviewText": "This easel is perfect for playing with magnets. It is durable, however, some of the velcrow has come off. I'm very pleased with the product & would buy again.", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1381536000, "reviewTime": "10 12, 2013"}
{"reviewerID": "A1VXOAVRGKGEAK", "asin": "0439893577", "reviewerName": "Angie", "helpful": [0, 0], "reviewText": "I like the item pricing. My granddaughter wanted to mark on it but I wanted it just for the letters.", "overall": 5.0, "summary": "Magnetic board", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A2QDG1AKQ64OWG", "asin": "0439893577", "reviewerName": "Angie in Cali", "helpful": [0, 0], "reviewText": "My kids love these... they use magnets on them, they draw on them with dry-erase markers (only one side is dry-erase friendly, beware). I own 3 of them and they are wonderful play and education tools. I will purchase another when my youngest is ready for one.", "overall": 5.0, "summary": "Useful in so many ways!", "unixReviewTime": 1379894400, "reviewTime": "09 23, 2013"}
{"reviewerID": "A84O9HIHZWBSK", "asin": "0439893577", "reviewerName": "Antonia La Forgia", "helpful": [0, 0], "reviewText": "The easel can go any where in the house or car.  We use it to teach our 3 year old granddaughter and she loves it.  Great tool to use with magnetic shapes, letters, numbers and pictures.  All of which we purchased on Amazon.", "overall": 5.0, "summary": "Great tool to help children learn.", "unixReviewTime": 1392336000, "reviewTime": "02 14, 2014"}
{"reviewerID": "A10QD3J3UZCXOY", "asin": "0439893577", "reviewerName": "Ashley", "helpful": [3, 3], "reviewText": "Very sturdy.  Good size.  Just as described.  We were very happy with this product.", "overall": 5.0, "summary": "Great easel", "unixReviewTime": 1260576000, "reviewTime": "12 12, 2009"}
{"reviewerID": "A3996T1ENBWSD5", "asin": "0439893577", "reviewerName": "Ashley Mullins", "helpful": [0, 1], "reviewText": "This is great for students to use at a center because it is magnetic. They can use this to create words! I am also able to use this when working with groups.", "overall": 5.0, "summary": "Great for centers!", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}
{"reviewerID": "A3OPZ8SV7IT3QN", "asin": "0439893577", "reviewerName": "BK", "helpful": [1, 2], "reviewText": "From the pictures, it looks like a decent size easel. It was my mistake that I didn't pay attention to the measurements. It's smaller than what I had expected and you should pay attention to the measurements.", "overall": 2.0, "summary": "Way too small", "unixReviewTime": 1352419200, "reviewTime": "11 9, 2012"}
{"reviewerID": "A8R62G708TSCM", "asin": "0439893577", "reviewerName": "Candace", "helpful": [1, 1], "reviewText": "Love the magnet easel... great for moving to different areas... Wish it had some sort of non skid pad on bottom though...", "overall": 4.0, "summary": "it works pretty good for moving to different areas", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}
{"reviewerID": "A21KH420DK0ICA", "asin": "0439893577", "reviewerName": "capemaychristy", "helpful": [1, 1], "reviewText": "Both sides are magnetic.  A real plus when you're entertaining more than one child.  The four-year old can find the letters for the words, while the two-year old can find the pictures the words spell.  (I bought letters and magnetic pictures to go with this board).  Both grandkids liked it a lot, which means I like it a lot as well.  Have not even introduced markers, as this will be used strictly as a magnetic board.", "overall": 5.0, "summary": "love this!", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A2TDEVLH6G73JK", "asin": "0439893577", "reviewerName": "Cassie Collura \"myairmanrocks\"", "helpful": [2, 2], "reviewText": "I bought this daughter after seeing her interest in magnets at 10months old. She is now 19months and still loves it. My friends 2yr old also enjoys putting the magnet animals on and off this board while reciting their names/sounds!", "overall": 5.0, "summary": "Educational and Fun for all ages.", "unixReviewTime": 1325203200, "reviewTime": "12 30, 2011"}
{"reviewerID": "AJCKAJHBNLHJI", "asin": "0439893577", "reviewerName": "Charles H. Johnson \"chasjohn02\"", "helpful": [2, 2], "reviewText": "Shortly after purchase the surface developed a microcrack. I suspect that delamination was occurring. Amazon replaced the easel.It will be interesting to see if the problem is generic or specific to the first unit that I purchased.The replacement failed aftertwo weeks of use. Would not recommend this product based on my personal experience.", "overall": 2.0, "summary": "QualityControl", "unixReviewTime": 1366588800, "reviewTime": "04 22, 2013"}
