{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "05 4, 2014", "reviewerID": "A2IC3NZN488KWK", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Ruby Tulip", "reviewText": "This book has beautiful photos, good and understandable directions, and many different kinds of jewelry.  Wire working and metalsmithing jewelry are covered.  Highly recommend this book.", "summary": "Unique designs", "unixReviewTime": 1399161600}
{"overall": 4.0, "verified": true, "reviewTime": "04 26, 2014", "reviewerID": "A3OT9BYASFGU2X", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Laurie K.", "reviewText": "I love the ideas but have no access sea glass, but will experiment with other stones ... but I do love the book.  Great job!", "summary": "makes you want to live by the sea...", "unixReviewTime": 1398470400}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "04 17, 2014", "reviewerID": "A28GK1G2KDXHRP", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Marie Rhoades", "reviewText": "As someone who has never possessed the manual dexterity or patience for creating jewelry, I think that I could actually make something after reading this new book.\n\nThe book is bursting with exceptional up-close photography which walks you easily through each process.  The explanations of basic tools and techniques are written clearly and for those without any jewelry making experience, it all makes sense!  Once you learn the how tos of working with different organic elements, the book teaches you numerous beginner and intermediate projects. Again, the photography is exceptional and the instructions easy to understand.\n\nIf you've had the desire to learn jewelry making, especially using sea glass or other natural elements,  I highly recommend this book to you!", "summary": "Highly Recommend this Jewelry Making Book", "unixReviewTime": 1397692800}
{"overall": 5.0, "verified": true, "reviewTime": "04 16, 2014", "reviewerID": "A3NFXFEKW8OK0E", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Bobbie", "reviewText": "beautiful layout and fun pictures. as a collector of beach glass it is great to see other ways to use it beside a mason jar in the window.", "summary": "great book", "unixReviewTime": 1397606400}
{"overall": 5.0, "verified": true, "reviewTime": "04 15, 2014", "reviewerID": "A3I6G5TKBVJEK9", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "mperez", "reviewText": "Some days ago I received my fabulous book: Organic Wire and Metal Jewelry. I'm in love with my book. Love the pictures and the instructions are simple and clear. I loved all the projects and I'm sure everyone who has purchased the book. think like me.", "summary": "Excellent", "unixReviewTime": 1397520000}
{"overall": 5.0, "verified": true, "reviewTime": "03 31, 2014", "reviewerID": "A1A7Y1M8AJWNZ8", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Laurie", "reviewText": "Excellent! It was just what I was looking for. Great service too! Thank you very much for the great experience!", "summary": "Great!", "unixReviewTime": 1396224000}
{"overall": 5.0, "verified": true, "reviewTime": "03 31, 2014", "reviewerID": "A30FG02C424EJ5", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "NWCancerBaby", "reviewText": "Loved their approach in this book and that it was a \"paperback\".  Easy to use and inspiring me to use up my beachcombing finds.", "summary": "Great Book", "unixReviewTime": 1396224000}
{"overall": 5.0, "verified": true, "reviewTime": "03 28, 2014", "reviewerID": "ADQQYU1UCDEWB", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Marlee", "reviewText": "Well written and beautifully illustrated.  Features unique designs using gemstones and/or beach glass. A definite must have for anyone looking for new designs and different mediums to work with.", "summary": "Beach Glass and Wire Jewelry - what a bonus!", "unixReviewTime": 1395964800}
{"overall": 5.0, "vote": "14", "verified": true, "reviewTime": "03 23, 2014", "reviewerID": "A39YL2NXZORK56", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Susan Coffey", "reviewText": "I highly recommend this book.  It's written for those new to the craft of jewelry making and those with more experience who want to expand their skill set. I have some jewelry making experience and consider my skills intermediate to advanced, and I'm pleased to say this book is now on my book shelf.  Beth Martin and Eva Sherman are excellent teachers and it comes through in this book.  They take you from the fundamentals of tools and material choices,to technique basics of a wrapped loop,to texturing,and even the use of a torch.  The instructions are clearly written and easy to follow. The projects are beautiful and will offer a chance for those new to jewelry making to expand on the skills you learn as you move from what they designate as beginner to intermediate.  Great purchase!", "summary": "Excellent addition to the jewelry maker's book shelf!", "unixReviewTime": 1395532800}
{"overall": 5.0, "vote": "7", "verified": true, "reviewTime": "03 20, 2014", "reviewerID": "A2PRY50ZESF1MH", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Nancy Petro", "reviewText": "This beautifully photographed book provides step-by-step instruction from beginner level to more advanced projects in hand-crafted jewelry using sea glass, stones, and crystals. Having admired and worn Beth Martin's jewelry crafted from sea glass found along the shores of Lake Erie, I thoroughly enjoyed reading about the materials, tools, and skills that combine to make stunning, one-of-a-kind wearable art. This book has everything the beginner needs to produce lovely pieces, and, with 50 different projects, it offers ideas and inspiration for the seasoned and skilled jewelry designer as well.", "summary": "Beautiful, Instructional, Inspirational", "unixReviewTime": 1395273600}
{"overall": 5.0, "verified": true, "reviewTime": "05 30, 2015", "reviewerID": "A2G9GWQEWWNQUB", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Pamelarenee", "reviewText": "great", "summary": "Five Stars", "unixReviewTime": 1432944000}
{"overall": 4.0, "verified": true, "reviewTime": "05 7, 2015", "reviewerID": "A3RGH15H17SM1Z", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "beadmom", "reviewText": "Great book. Lots of great projects and easy to follow instructions. Great price also.", "summary": "Great book.", "unixReviewTime": 1430956800}
{"overall": 3.0, "verified": true, "reviewTime": "04 3, 2015", "reviewerID": "A20QJNRKLJVP1E", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Sue Cook", "reviewText": "It's O.K.", "summary": "Three Stars", "unixReviewTime": 1428019200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "03 27, 2015", "reviewerID": "A1G26EYQGW3YF1", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "N. Bean", "reviewText": "Fantastic book - good directions, good projects.  The only recommendation I can offer is that some of the pictures are \"reversed\" to the directions so it just requires a bit of study and \"recalculation\" to reconcile the two; otherwise, wonderful book!", "summary": "Wonderful book", "unixReviewTime": 1427414400}
{"overall": 4.0, "verified": false, "reviewTime": "03 16, 2015", "reviewerID": "A2JGAZF2Y2BDU6", "asin": "0871167042", "reviewerName": "drc536", "reviewText": "I like cold connections, so I'm constantly in search of books that demo connections without solder.  What a wonderful surprise! When I saw the cover, I wasn't sure if I was going to like the designs.  Well, I found this book amazing!  Contains some really nice designs and techniques are shown.  Yeah, there are few times when a torch is used, but for the most part, many of the designs don't require heat.  For that, I am thankful.", "summary": "A Wonderful Surprise", "unixReviewTime": 1426464000}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2015", "reviewerID": "A3NI5OGW35SLY2", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Gail", "reviewText": "Always love the way Eva thinks, and there are some fun designs in this book. Easy to advanced for all. Fast shipping.", "summary": "Great Book!", "unixReviewTime": 1424476800}
{"overall": 5.0, "verified": true, "reviewTime": "01 21, 2015", "reviewerID": "A1OPRA4NE56EV6", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "carol a inman", "reviewText": "Nice patterns", "summary": "Five Stars", "unixReviewTime": 1421798400}
{"overall": 4.0, "verified": true, "reviewTime": "12 18, 2014", "reviewerID": "A3M6UXIK7XTA7A", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "CV", "reviewText": "love the spirit of the book and some of the projects.", "summary": "Four Stars", "unixReviewTime": 1418860800}
{"overall": 5.0, "verified": true, "reviewTime": "11 24, 2014", "reviewerID": "A3I3B5OSB80ZXC", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "dorothy I huttenlocker", "reviewText": "just what I wanted", "summary": "Five Stars", "unixReviewTime": 1416787200}
{"overall": 5.0, "verified": false, "reviewTime": "10 21, 2014", "reviewerID": "A62O7C5RQB353", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Robin", "reviewText": "Beautiful pictures and easily understood.", "summary": "Five Stars", "unixReviewTime": 1413849600}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2014", "reviewerID": "A8MZ2YP8UJA9Q", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Lu H.", "reviewText": "This has got to be my favorite wire and glass book!", "summary": "Five Stars", "unixReviewTime": 1413504000}
{"overall": 5.0, "verified": false, "reviewTime": "10 9, 2014", "reviewerID": "AL3IEZLLIAGNH", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Jean Van Brederode", "reviewText": "This is a fabulous book! The designs are wonderful, but what I consider even better are the photographs of the projects, directions for the designs, and explanations of the techniques.", "summary": "The designs are wonderful, but what I consider even better are the ...", "unixReviewTime": 1412812800}
{"overall": 2.0, "verified": true, "reviewTime": "09 3, 2014", "reviewerID": "A22ZX01TPWQY4G", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Nonnie", "reviewText": "Not a fan. Limited designs. Limited content for the money", "summary": "Two Stars", "unixReviewTime": 1409702400}
{"overall": 3.0, "vote": "5", "verified": true, "reviewTime": "07 23, 2014", "reviewerID": "A1YIEW86G14BHP", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Aldne Now", "reviewText": "If you're an experienced wire jewelry maker, there's not much new to be found in this book. There are a few clever ideas, but overall, the look of the projects is pretty amateurish. \"Stunning\", is an overstatement.", "summary": "OK Jewelry Book", "unixReviewTime": 1406073600}
{"overall": 5.0, "verified": true, "reviewTime": "07 14, 2014", "reviewerID": "A3A96RTGZTWKWG", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Designs by Germany", "reviewText": "A very good book.  I loved the projects in the book and it inspired me to create some new designs.  I would definitely recommend it.", "summary": "Great jewelry book", "unixReviewTime": 1405296000}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "06 5, 2014", "reviewerID": "AA7PNT2OPS3RP", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Catherine Franz", "reviewText": "Hi, have been making jewelry now for the last 5 years and love the use of nature and using natural materials.  The cuff bracelet uses a lot of wire; however, the outcome is beautiful.  Especially if you patina the copper with antique black and tumble it for 30 minutes or so afterwards.", "summary": "Organic and upcycling jewelry maker", "unixReviewTime": 1401926400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "05 30, 2014", "reviewerID": "A3LOIIIW4G3TL7", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Picky Virgo", "reviewText": "There's nothing prissy or matchy-matchy about the designs in this book.  The authors have presented jewelry that appears to have sprung full-grown from the earth, sea, and/or sky.  I was inspired by nearly every page.\n\nI've been fortunate to have taken classes with Eva, and if you have the opportunity I urge you to do the same.", "summary": "Perfect Title!", "unixReviewTime": 1401408000}
{"overall": 5.0, "verified": true, "reviewTime": "05 12, 2014", "reviewerID": "A25QEMMPTX5D5D", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "Susan Hildebrand", "reviewText": "Great projects that I'll be able to personalize for any occasion. The only thing better than the instruction in this book is to be in one of Eva's classes--she's a wonderful teacher.", "summary": "Wonderful projects by a great teacher!", "unixReviewTime": 1399852800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "05 10, 2014", "reviewerID": "AZI75OKBKZ98R", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "T. Malone", "reviewText": "I love this book! There are some very lovely ideas in this book. It is just full of inspiration and beautiful photography.\nIt's a great book for your jewelry-making library.", "summary": "Inspirational", "unixReviewTime": 1399680000}
{"overall": 5.0, "verified": true, "reviewTime": "05 7, 2014", "reviewerID": "A1NZRLAQC3XB32", "asin": "0871167042", "style": {"Format:": " Paperback"}, "reviewerName": "L. Foxwell", "reviewText": "I wanted to support a fellow sea glasser by buying this book and hoped to get some nice ideas and tips from it. I do believe it will provide all of that and enjoy the easy read of it! I saw only 1 editing error, LOL, which in no way ruined the quality of the book! Thank you so much!", "summary": "nice book for beginners and the advanced", "unixReviewTime": 1399420800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 13, 2015", "reviewerID": "A16DSXRAN5QK94", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Denise", "reviewText": "Just love this series, and the catch ups with the previous character just love it.\nIt a good love story", "summary": "Loved it", "unixReviewTime": 1449964800}
{"overall": 3.0, "verified": false, "reviewTime": "12 13, 2015", "reviewerID": "A3GWE80SUGORJD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Bette Hansen", "reviewText": "I wanted to LOVE this book but it wasn't quite the home run I'd hoped it would be.  It has a great solid story and I did love the crossover of characters with those from the author's sisters books.  What didn't quite live up to my expectations where the characters.  Brice is an ass, plain and simple. He may have a past that has shaped him into that but I just couldn't warm up to him.  While I liked Lena, the fact that she doesn't call Brice on his crappy behavior drove me nuts.  The other thing that had me a bit crazy was the fact that these two couldn't seem to just sit down and have a conversation.  Avoidance on both their parts just made things worse than they needed to be.\n\nAs I stated though it does have a good story and because I have enjoyed all the other books from this author I will definitely be reading the next in this series.  Hopefully those characters won't have me yelling at the book.", "summary": "I wanted to LOVE this book but it wasn't quite the home run ...", "unixReviewTime": 1449964800}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "12 12, 2015", "reviewerID": "A2NLY1TJ8TYV6D", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "GSKM in sc", "reviewText": "This was really a good story.  Only gave it 4 of 5 stars because I really didn't like Brice.  Story was entertaining but needed more depth from him for me to give it a 5.  Perhaps I will get the \"more\" as the series continues.  What was so horrible about the grandmother?  Why did the mother go & where?  What did the father finally say during his night of confessions?  Yes, I want to read more in the series.", "summary": "Enjoyed", "unixReviewTime": 1449878400}
{"overall": 5.0, "vote": "22", "verified": true, "reviewTime": "12 12, 2015", "reviewerID": "A2GU5SHR2DC29H", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "ZETTER", "reviewText": "Brice Henderson friend and business partner to Asher Barrington has always been a go getter so when his latest project was the one that could get him recognized his talent, he went all out. But what Brice didn't count on was a face from the past turning his world upside down.\n\nLena Razzi a single mother to a little boy named Nicholas got a job as a replacement for a month at B&H Advanced Engineering but what she was not told was that she would be working for an old flame....the one and only, Brice Henderson.\n\nWhen Lena and Brice came face to face it was a surprise to them both, the chemistry and attraction were still very much alive....The former still loved the latter ans vice versa, they were both trying to stay away but to no avail.\n\nLena never told Brice about Nicholas cause she never wanted her son to feel rejected by his father. But when Brice found out about his existence, he regretted the choices he made in the past....Choosing success over family and relations.\n\nThere was no turning back the hands of time only looking forward to the future with Lena and Nicholas. ONE WHITE LIE was fascinating. Love Dominic Corisi, Trent and many more making an appearance.\n\nThis is my first book by Jeannette Winters, I'm thrilled that she's working with one of my favorite authors, Ruth Caredello and I can't wait for what they have in store for us with this amazing series.", "summary": "Sweetest Love!!!", "unixReviewTime": 1449878400}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "12 7, 2015", "reviewerID": "A2FHBHNKHRDS72", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Reading by the Book Blog", "reviewText": "This book was a solid 4 stars for me. I did not forsee Brice having the attitude and determination of his partner Asher. When I first met him in Always Mine, I thought he was the gentler of the two. HEY, I was SO wrong. Him and Lena relationship or reunited one was tricky. Things ended confussed and hurtful on her part but she never got over the person she once knew. As they say all people change and Brice's change was not for the better.\n\nIt took long nights in a hospital room after some mixed feeling news and a meddling sister for him to learn the truth about Lena. Also, it took clearing a soul before death for him to get closure that held him in a place of stay and go, love from a distance or by her side. I am glad he made the right choice and am excited to see what lies ahead for the other Henderson clan.", "summary": "Solid and Engaging Read", "unixReviewTime": 1449446400}
{"overall": 5.0, "vote": "8", "verified": true, "reviewTime": "12 7, 2015", "reviewerID": "A1EAXUN286CZ5Z", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Tina Brimlow", "reviewText": "As always Jeannette is so wonderful. This story was breath taking. It just keeps you wanting more. I mean who doesn't like two past lovers reuniting trying to fight the urge they have for each other. I would say I wish this would happen to me, but I am glad my ex's are my ex's. If this is how the first book in her brand new series starts, I can't wait to read the rest of this series.", "summary": "A new series, another great read", "unixReviewTime": 1449446400}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 7, 2015", "reviewerID": "A1OMRK7B7SN83C", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "A great start to her new series, This one has all the elements I love, passion, intrigue, love, lust, family, and redemption.", "summary": "A great new start", "unixReviewTime": 1449446400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 7, 2015", "reviewerID": "A3TCVTOI95UQUT", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amanda", "reviewText": "Fab new series.  This book was brilliant about meeting up with a long lost love with a twist.  I am looking forward to reading about Brice's sister and brothers.  It was also great the way the booked meshed with Ruth Cardello's new series.", "summary": "Fab new series", "unixReviewTime": 1449446400}
{"overall": 4.0, "verified": true, "reviewTime": "03 14, 2018", "reviewerID": "A17S6SU1PHP443", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "James Castle", "reviewText": "Good read.. unpredictable. Love and romance amazing.  Would highly recommend this book.\n\n Family Dynamics were unpredictable as well\nEnjoy this book", "summary": "Amazing", "unixReviewTime": 1520985600}
{"overall": 5.0, "verified": true, "reviewTime": "03 14, 2018", "reviewerID": "A3IUKE1LC890XR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Great Read. I really enjoyed reading this book. It kept me entertained and engaged. The characters felt like real people. And the intimate moments are phenomenal.", "summary": "Great Read", "unixReviewTime": 1520985600}
{"overall": 4.0, "verified": true, "reviewTime": "03 10, 2018", "reviewerID": "A2R2AOAQ0E7CCN", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Great quick read for some getaway time. Traditional plot: really wonderful gets the right guy for her. Fun read, the heroine is incredibly lovely.", "summary": "One White Lie", "unixReviewTime": 1520640000}
{"overall": 5.0, "verified": true, "reviewTime": "03 6, 2018", "reviewerID": "A3FLZJDY64B3NS", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Delightful read quite the page turner.", "summary": "Five Stars", "unixReviewTime": 1520294400}
{"overall": 5.0, "verified": true, "reviewTime": "02 23, 2018", "reviewerID": "A2CPOWZUTJWXJ7", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "griffle", "reviewText": "I'm new to this author and I plan to read every one of her books on Kindle. The story is easy to read and so romantic, delving deeply into the male psyche. Can't wait to read all the other ones!", "summary": "Enjoying this series of books very much!", "unixReviewTime": 1519344000}
{"overall": 5.0, "verified": true, "reviewTime": "02 22, 2018", "reviewerID": "ASR774IIR8VN7", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Lucinda Jo", "reviewText": "Great series to read.", "summary": "Five Stars", "unixReviewTime": 1519257600}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2018", "reviewerID": "AH6N2G535GBTV", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Anita Gillis", "reviewText": "I enjoyed the story.", "summary": "Five Stars", "unixReviewTime": 1519171200}
{"overall": 4.0, "verified": true, "reviewTime": "02 17, 2018", "reviewerID": "AOOQKOAO92KYC", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Missym", "reviewText": "Loved the ups and downs of the story and how she shows the good and bad sides of the characters", "summary": "One White Lie", "unixReviewTime": 1518825600}
{"overall": 4.0, "verified": true, "reviewTime": "02 10, 2018", "reviewerID": "ARQV45QV4HI0", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "I have enjoyed reading this book. I found myself liking the characters and being drawn into their life and story.", "summary": "Good read", "unixReviewTime": 1518220800}
{"overall": 5.0, "verified": true, "reviewTime": "02 7, 2018", "reviewerID": "A3IP9K53AAY4BD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer ln", "reviewText": "One of the best romance novels I have read.  There were so many phrases that brought back memories and were so real to true life experiences.  I highly recommend reading it.", "summary": "One white Lie", "unixReviewTime": 1517961600}
{"overall": 5.0, "verified": true, "reviewTime": "02 3, 2018", "reviewerID": "A39J539BKZCHCQ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "JR", "reviewText": "Loved this book from the first to the last. Great read and the characters meshed well together.  This is a must read", "summary": "Great Read", "unixReviewTime": 1517616000}
{"overall": 5.0, "verified": true, "reviewTime": "02 3, 2018", "reviewerID": "A2DODWGA5PVBH7", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Loved this story twist and turns. A little argumentative but quiet the story line.  No chauvinism with main character he wallowed in it. She was so submissive it was hard to believe she ended up winning.", "summary": "Long coming", "unixReviewTime": 1517616000}
{"overall": 3.0, "verified": true, "reviewTime": "01 30, 2018", "reviewerID": "A1TX3YQ1JAAUQU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "smithward", "reviewText": "I liked it somewhat...", "summary": "somewat!", "unixReviewTime": 1517270400}
{"overall": 5.0, "verified": true, "reviewTime": "01 28, 2018", "reviewerID": "A30XRWJW8N5KG3", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Donna", "reviewText": "Great start better ending but the middle was a bit long winded at times. Not a lot of drama or espionage  or murder for hire. A perfect HEA!", "summary": "Great read", "unixReviewTime": 1517097600}
{"overall": 4.0, "verified": true, "reviewTime": "01 27, 2018", "reviewerID": "A2AVMG9IJQ6WAL", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Gracie", "reviewText": "Great book even though I don't agree with lying. Happy ending which I like.", "summary": "Four Stars", "unixReviewTime": 1517011200}
{"overall": 5.0, "verified": true, "reviewTime": "01 27, 2018", "reviewerID": "A3TVEWE83GGUYS", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ann Jackson", "reviewText": "First time reader of this author. I will read more of her books. Thought it was a great story. Very fast read.", "summary": "Thought it was a great story. Very fast read", "unixReviewTime": 1517011200}
{"overall": 1.0, "verified": true, "reviewTime": "01 27, 2018", "reviewerID": "A1TR7SQWWLREQR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Dee", "reviewText": "Neither Brice or Lena were likable from beginning to end, and I wondered where their so-called connection came from b/c the writer never said. We know they had a previous relationship but that was it. He was a jerk and she was just a doormat who apparently fell apart at his every touch. Thankfully this was just a book b/c their happy ending would definitely be short-lived. Wish I hadn't wasted my time.", "summary": "Too many thoughts not enough words & actions", "unixReviewTime": 1517011200}
{"overall": 4.0, "verified": true, "reviewTime": "01 26, 2018", "reviewerID": "A2D9S6V1AFXOAO", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "sue", "reviewText": "I gave this book a four rating because it was a good story and I enjoyed the characters and how they grew", "summary": "Good", "unixReviewTime": 1516924800}
{"overall": 4.0, "verified": true, "reviewTime": "01 25, 2018", "reviewerID": "AIKENFPBT2GQF", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Bailey&#039;s Bookshelf", "reviewText": "This is the second time for love story of Brice and Lena. The story was good and the interaction well written. I wish there wasn't so much telling of the story. I only fell into the story a few times. The rest was internal thought and dialog. But I would read another if part of this storyline.", "summary": "Nice storyline", "unixReviewTime": 1516838400}
{"overall": 4.0, "verified": true, "reviewTime": "01 24, 2018", "reviewerID": "A3IJPLGF5RM6Y0", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Cheryl", "reviewText": "The book was an easy read.  Kept your intrest, yes a few times it was hard to put down... Enjoyed it.", "summary": "Ok..", "unixReviewTime": 1516752000}
{"overall": 4.0, "verified": true, "reviewTime": "01 23, 2018", "reviewerID": "A3GESL9MR87GID", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "GMM", "reviewText": "Very entertaining story line, good characters and it was well written. I enjoyed the book very much. It kept my interest start to finish.", "summary": "Good Read", "unixReviewTime": 1516665600}
{"overall": 2.0, "verified": true, "reviewTime": "01 23, 2018", "reviewerID": "ASXWJG51BFXXU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ashley L.", "reviewText": "The lead female was a complete pushover. Considering everything Lena had to do on her own then to just allow Brice to do whatever he wanted and she not put up a fight was ludicrous. Weak female lead and clueless male.", "summary": "If you like man barreling over a woman.....", "unixReviewTime": 1516665600}
{"overall": 5.0, "verified": true, "reviewTime": "01 23, 2018", "reviewerID": "AF9YCLIG5V8BO", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Carolyn Wilson", "reviewText": "I liked it and I like this author this is my first book by her. The only thing is to much back thinking with the characters. I  skimmed over a lot.l would recommend this book and this author.", "summary": "Good Story...", "unixReviewTime": 1516665600}
{"overall": 3.0, "verified": true, "reviewTime": "01 23, 2018", "reviewerID": "A2ZAXQZWWZ2A1L", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Nicole M.", "reviewText": "I wanted to enjoy this story much more than I did. For me personally, there was to much inner reflection and not enough conversation/interaction between the characters. This whole purpose of a romance novel, once again, for me, is to enjoy the journey of a couple through how the banter with each other. This novel sorely lacked that for me.\nAlso, there were parts of the story that seemed lacking and jumpy. The hospital room where his father was talking one minute and then BAM...he's dead. What was he working on? What was the threat?\nLike I said, the story was good, but could have been so much better with more development", "summary": "Good book", "unixReviewTime": 1516665600}
{"overall": 5.0, "verified": true, "reviewTime": "01 23, 2018", "reviewerID": "A3KWEH5N55QD48", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "J. Guerrero", "reviewText": "I loved this book. Happy endings are always something i love to experience with every book i read. The world sometimes gets too cynical. Happy Endings are always necessary!", "summary": "Loved it!", "unixReviewTime": 1516665600}
{"overall": 1.0, "verified": true, "reviewTime": "01 21, 2018", "reviewerID": "A4QQFZOC26A2W", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Jennie", "reviewText": "This book was disjointed, half thoughts that never coalesced into a story. What did these two people really have in common?  Theres so many romances out there - don't waste your time on this one.", "summary": "Not worth reading", "unixReviewTime": 1516492800}
{"overall": 5.0, "verified": true, "reviewTime": "01 21, 2018", "reviewerID": "A17GNC9CHVBPN1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "dot", "reviewText": "Really good read. Great storyline and happy ending. I would highly recommend.", "summary": "WOW!", "unixReviewTime": 1516492800}
{"overall": 4.0, "verified": true, "reviewTime": "01 21, 2018", "reviewerID": "A19I908V60L8VQ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "adrianna mackey", "reviewText": "This was a good read not too lovey dovey but a good romance. Cant wait to read the next. Too many sercrets left out not much info on the other siblings.", "summary": "Loved it", "unixReviewTime": 1516492800}
{"overall": 2.0, "verified": true, "reviewTime": "01 20, 2018", "reviewerID": "A3MX9TPIVGILJU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "The author spent so much time providing the character's thoughts. \"Does he want me?\", \"Has he changed?\", bah bah bah. I literally skipped over pages in the book because of these repeated thoughts. I liked Ruth Cardello's books better.", "summary": "It was just ok", "unixReviewTime": 1516406400}
{"overall": 3.0, "verified": true, "reviewTime": "01 20, 2018", "reviewerID": "AW1452QH5IOPG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "chris grey", "reviewText": "This book was so so. To much thinking on both the man and woman.  She can't tell the man her thoughts and everything gets drawn out and the book loses its luster.....sorry", "summary": "This book was so so. To much thinking on ...", "unixReviewTime": 1516406400}
{"overall": 3.0, "verified": true, "reviewTime": "01 19, 2018", "reviewerID": "A1UWB134YFRJFO", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sonia Goliath", "reviewText": "The story line  is a bit overused but nevertheless it is a feel good romance that warms the heart. A lovely read", "summary": "The secret child, a sruggling mother and a work obsessed man who does not know he is a father. Makes for interesting dynamics between the characters.", "unixReviewTime": 1516320000}
{"overall": 5.0, "verified": true, "reviewTime": "01 19, 2018", "reviewerID": "A1R0Q58JMZ20WE", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Just goes to show that love does conquer all of it is patient. Sometimes it takes longer than expected. Great read.", "summary": "Workaholics need love too.", "unixReviewTime": 1516320000}
{"overall": 5.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "AUNBUNFLIVQN6", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Having been a single parent for a few years, I thought the character of Lena was well portrayed.  Enjoyed the book.", "summary": "Good Romance novel", "unixReviewTime": 1516233600}
{"overall": 3.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "A24M2A9VVMPR4D", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Avid Reader", "reviewText": "I liked the Author. The theme  was one of my favorites. I did not like the swear words or the sex scenes. I got sick of the hero's lame excuses for his attitude and outlook on life. Plenty of REAL MEN have a job, family and life. I do like the way the hero  connected with his son.", "summary": "Avid Reader", "unixReviewTime": 1516233600}
{"overall": 3.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "AGA6C1UQDNQ1P", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ellen Anderson", "reviewText": "This was a new author for me. The story started off pretty quickly but if I am totally honest, I'm still clueless to some of it. That may just be my interpretation. Still an enjoyable read.", "summary": "One White Lie", "unixReviewTime": 1516233600}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "01 18, 2018", "reviewerID": "AQFF452SVDF48", "asin": "1519588135", "style": {"Format:": " Audible Audiobook"}, "reviewerName": "Karen Talley", "reviewText": "This is a poorly written and extremely predictable book with characters that I couldn't stand.  Lena Razzi was dumped by her boyfriend on the evening that she intended to tell him that she was pregnant.  So, for three years she has had to go it alone and provide for her 2 1/2 year old son by herself.  She gets a sudden call from a temporary agency to replace \"Mr. Henderson's\" personal assistant.  She submits her resume, has an over the phone interview and is hired to start immediately.  (Yeah, like big shot company owners would let this happen.  Hah!)  The first morning she walks into the office and...TA-DAH...there is her former lover and father of her child.  He is NOT happy to see her and demands that she leave.  She talks him into giving her a trial run.  One week later she goes into his office and they strip off their clothes and have hot sex.  Hmm.  See how this is going?  It doesn't get any better...or any more believable or any more interesting, either.\n\nMost of this book is made up of characters talking to themselves.  I don't mind a little of that but page after page after page is mind-numbing.  I started counting pages (yeah, you can see how interested I was in this story!) and there would be 4 or 5 pages of this before you would get any dialogue.  The hero(?) was a total a**hole.  He treated his family like crap, all the while complaining about what a heartless bas***d his father was.  The heroine was supposed to be a self-sufficient woman who was only interested in taking care of her son, but turned into mush every time this jerk touched her.  I disliked her as much as I did him.  I'm quite sure that their HEA is only temporary.\n\nSexual situations may offend some readers", "summary": "**********ENTIRE REVIEW IS A SPOILER***************", "unixReviewTime": 1516233600}
{"overall": 3.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "A1F41PH89SL6JB", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Paige", "reviewText": "I did enjoy the story but not the ending. The book seemed to just end and with all the build up, I felt that there needed to be a little more mixed in there at the end. The ending of the book made it feel like she hadn't been holding in this huge secret from him for the 3 years they were apart. Brice was a character that you had a love/hate relationship with. Something had happened in his past, that you kind of find out but are still left with a little mystery. Lena is just trying to make ends meet. It was a good story but I thought it glossed over some things.", "summary": "Not for me", "unixReviewTime": 1516233600}
{"overall": 5.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "A7JNFOM3MCB07", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Linda Helms", "reviewText": "Enjoyed the story!  Wanted to kick Brice a time or two.....but all in all I did enjoy the story!  My heart went out to Lena.....she is truly a good person, there should be more like her!  Recommend!", "summary": "Enjoyed the story!", "unixReviewTime": 1516233600}
{"overall": 4.0, "verified": true, "reviewTime": "01 18, 2018", "reviewerID": "A1K99BGCIH6X9X", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "*Sharon*", "reviewText": "This is my first book Ive read by this author and I really enjoyed it.", "summary": "One White Lie.", "unixReviewTime": 1516233600}
{"overall": 5.0, "verified": true, "reviewTime": "01 17, 2018", "reviewerID": "A3U7CU4EH8MRNK", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sanguivora", "reviewText": "A wonderful story filled with emotions. You can really feel how the characters are feeling. The flow is nice and it isn't too fast or too slow. Sex was nicely written and not over the top. The storyline focused on the emotional struggle and finding redemption. It was very nice. Very well written. Everyone should give this book a try.", "summary": "Must read!", "unixReviewTime": 1516147200}
{"overall": 5.0, "verified": true, "reviewTime": "01 14, 2018", "reviewerID": "A1Z23SPDHNPIOZ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "denyt57", "reviewText": "Great book can't wait to read the next book hoping it's as good and captive as this one was couldn't put it down", "summary": "Great book", "unixReviewTime": 1515888000}
{"overall": 5.0, "verified": true, "reviewTime": "01 10, 2018", "reviewerID": "A3I1Y1RPM9I2JX", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "dream writer", "reviewText": "Love this series, had to know the rest of  the stories ASAP. Couldn't put the reading down until I was done!", "summary": "Love this series", "unixReviewTime": 1515542400}
{"overall": 3.0, "verified": true, "reviewTime": "12 31, 2017", "reviewerID": "A13T3T45KEVRMD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Dixie", "reviewText": "I rated this book 3 stars. Thought it had a fun story line  but the author repeated her self over and over and over. I found myself skipping to dialogue just to get through it.  I think you can find a more captivating book.", "summary": "Not my favorite.", "unixReviewTime": 1514678400}
{"overall": 3.0, "verified": true, "reviewTime": "12 19, 2017", "reviewerID": "A2SQ0M2YRHSXI4", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Texas.mom", "reviewText": "Overall good story and enjoyed the cross over of other related characters. I got lost at times between dialogue from one character to the other and never really got when Brice had a true change for the better. Too much time and events were brushed over and lack d depth in detail of how their relationship was evolving. Never understood who sent the red roses and wished More closure with his dad and brothers was provided to show Brice really did become a better man.", "summary": "Good story but hard to follow", "unixReviewTime": 1513641600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 4, 2017", "reviewerID": "A12PVTAWHUHI10", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Robbob19", "reviewText": "Truly enjoyed this version of One White Lie. Lot of emotion and drama but not over the top or exaggerated. It's easy to get frustrated with the characters and love them at the same time since the reader has X-ray vision and knows both sides of the story. While Brice was an arrogant jerk, he also saw his faults and took responsibility for his behavior. I didn't blame Lena for what she did.... Brice made it clear to her that his 'future' was all that counted and no room for her in it. So, I never saw what Lena did as a 'white lie'.... not when you replay Brice's words to her. She really didn't have much of a choice.\n\nAppreciated the sweet version. Love it when bedroom antics don't get in the way of the storyline.", "summary": "When Choices Aren't Really Choices", "unixReviewTime": 1512345600}
{"overall": 4.0, "verified": true, "reviewTime": "11 23, 2017", "reviewerID": "A1QSZFZJ3BVRNU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "evora laney", "reviewText": "It kept me reading late in the night. I liked it  can't wait to read the other books getting ready to start book two now", "summary": "I liked this first book", "unixReviewTime": 1511395200}
{"overall": 4.0, "verified": true, "reviewTime": "10 24, 2017", "reviewerID": "A2LAII96I1O1IY", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "This one kept my interest from the first word to the last. Brice and Lena were two strong characters who knew what they wanted, just didn't know the best way to get there.", "summary": "Good read!!!", "unixReviewTime": 1508803200}
{"overall": 5.0, "verified": true, "reviewTime": "10 19, 2017", "reviewerID": "A367G44LZPGBUR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "A Lamb", "reviewText": "I felt like I was holding my breath in anticipation of the next page. A wonderful story. I know the series will be just as good as the first.", "summary": "Glued to my chair...", "unixReviewTime": 1508371200}
{"overall": 4.0, "verified": true, "reviewTime": "10 19, 2017", "reviewerID": "A1TVJ9WDRP0UZS", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Thank you for this emotional love story between Lena and Brice.  I loved the storyline and the many interesting characters.  The truth always wins.", "summary": "Being Truthful Wins", "unixReviewTime": 1508371200}
{"overall": 5.0, "verified": true, "reviewTime": "10 16, 2017", "reviewerID": "A1B2BIUUA9C4Y9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Really enjoyed reading this book. Great storyline and characters. A sweetcorn chance love. Some steamy scenes, a bit of drama. A secret baby.  Definitely recommending", "summary": "Good book", "unixReviewTime": 1508112000}
{"overall": 5.0, "verified": true, "reviewTime": "10 9, 2017", "reviewerID": "A21S5ALGJFYKTK", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "naomi morney", "reviewText": "It Was A Good Book. I Enjoyed It.", "summary": "Five Stars", "unixReviewTime": 1507507200}
{"overall": 5.0, "verified": true, "reviewTime": "10 6, 2017", "reviewerID": "AV6ORIR1JV86P", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Totally enjoyed book one of this Barrington series by thus author.  Shows all the potential of a very entertaining series.  Very strong and dynamic characters.", "summary": "HIGHLY RECOMMENDED READ", "unixReviewTime": 1507248000}
{"overall": 3.0, "verified": true, "reviewTime": "09 19, 2017", "reviewerID": "A27ZDAAC7R6PPU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Susan G", "reviewText": "Had a hard time getting into this book. Not sure why, but once got reading went right thru it. Ended up being a page turner.", "summary": "Good", "unixReviewTime": 1505779200}
{"overall": 2.0, "verified": true, "reviewTime": "09 14, 2017", "reviewerID": "A13BG50AIFMTXE", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "LiteraryLoveAlways", "reviewText": "I was trying hard to become invested in the lives of Brice Henderson & Lena... what was her last name?  Razzi? But I'm not very fond of the author's writing style. I feel like 80% of the book was lamenting... She was always thinking, \"He loves me (not)/He loves me not\". While Brice is always in his head... By the 70% competition mark, I used my extremely underdeveloped speed reading technique to get the gist of 3 pages (i.e. The 1st two sentences and the last of each paragraph...)  Like I said, I am trying. I'll be downloading Book 2....", "summary": "I'm here for the Barrington cameos", "unixReviewTime": 1505347200}
{"overall": 5.0, "verified": true, "reviewTime": "09 6, 2017", "reviewerID": "A4BR54NSLR51W", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Mel", "reviewText": "Sweet, entertaining  story line.  Predictable ending and a wonderful ride.  Good rainy day read. Love the happy ever after theme.", "summary": "Sweet read", "unixReviewTime": 1504656000}
{"overall": 3.0, "verified": true, "reviewTime": "09 4, 2017", "reviewerID": "A2HKO2HDCZ1QJG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Eugenia Lepley", "reviewText": "Storyline sometimes weak & inconsistent. Brice seems shallow & not always believable. Rex is an unnecessary addition to the story. He sends Lena roses. Then when he drives her back to Boston, tells her he is seeing someone else. Seemed like her was introduced just to add words to the total count.", "summary": "A Bad Relationship", "unixReviewTime": 1504483200}
{"overall": 5.0, "verified": true, "reviewTime": "09 3, 2017", "reviewerID": "A42PRBV98IBV", "asin": "1519588135", "style": {"Format:": " Paperback"}, "reviewerName": "Melissa Padron", "reviewText": "Exellent!!!", "summary": "Five Stars", "unixReviewTime": 1504396800}
{"overall": 3.0, "verified": true, "reviewTime": "09 1, 2017", "reviewerID": "A1BTXVZBWLDC90", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "hope", "reviewText": "this story telling between 3 authors can be confusing, but the read is interesting", "summary": "Three Stars", "unixReviewTime": 1504224000}
{"overall": 5.0, "verified": false, "reviewTime": "08 31, 2017", "reviewerID": "A1VDX7EZF3OMVP", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Pamela D. Gary", "reviewText": "I absolutely loved this book and can't wait to read the entire series!", "summary": "Five Stars", "unixReviewTime": 1504137600}
{"overall": 3.0, "verified": true, "reviewTime": "08 28, 2017", "reviewerID": "A1AAF9DI6FGBSR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "I didn't like this book , the arrogance of the lead male character was beyond necessary. He used the lead female for sexual needs with forcefulness. Of course she weakly went along with knowing she was still in love. Add in baby and suddenly a happy family, ummm if only that easy", "summary": "Arrogant maleweak female", "unixReviewTime": 1503878400}
{"overall": 5.0, "verified": true, "reviewTime": "08 27, 2017", "reviewerID": "A3G40E13MQRT9C", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Honey", "reviewText": "A wonderful mommy that always protected him. It was just the wonderful book.. I definitely would recommend this book to other people", "summary": "Great story I could hardly put the book down every chance I got I would read I felt so good when they came together and a little boy finally had a daddy that loved him and", "unixReviewTime": 1503792000}
{"overall": 3.0, "verified": true, "reviewTime": "08 18, 2017", "reviewerID": "A3E4H5A1X8NJRR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "This was a quick read with an interesting plot. A young woman accepts a desperately needed temporary position as a executive assistant at a prestigious company with a very good salary. The only drawback is when she arrives for her first day she finds herself working for a past lover. The plot thickens, but I will not spoil what was a light but enjoyable read.", "summary": "Quick Read", "unixReviewTime": 1503014400}
{"overall": 5.0, "verified": true, "reviewTime": "08 18, 2017", "reviewerID": "ALULARUJRJMJ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Carmen B.", "reviewText": "I found this book to be very good and am pleased to have found yet another author to enjoy.  Can't wait to get book 2 on payday.", "summary": "Good book", "unixReviewTime": 1503014400}
{"overall": 5.0, "verified": true, "reviewTime": "08 15, 2017", "reviewerID": "A1TNKI0D4KUAGW", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "This was a joy to read. The banter between the two leads was tearful and sexy , funny,  Both find the meaning of a long time love and joy and loss,but sometimes everything has it,s time and place.", "summary": "Fun fun fun!!!!!!!!", "unixReviewTime": 1502755200}
{"overall": 5.0, "verified": true, "reviewTime": "08 13, 2017", "reviewerID": "A3NBBNEX7NICCJ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Excellent news", "summary": "Five Stars", "unixReviewTime": 1502582400}
{"overall": 5.0, "verified": true, "reviewTime": "08 7, 2017", "reviewerID": "A13VBB5VQ8WPV0", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "RhondaWilliams", "reviewText": "Good book!", "summary": "Five Stars", "unixReviewTime": 1502064000}
{"overall": 5.0, "verified": true, "reviewTime": "08 5, 2017", "reviewerID": "A3JT3775MCE8MG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "enjoyed this book", "summary": "Five Stars", "unixReviewTime": 1501891200}
{"overall": 5.0, "verified": true, "reviewTime": "08 4, 2017", "reviewerID": "A19JKH9HW2ZOJ1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Very good", "summary": "Five Stars", "unixReviewTime": 1501804800}
{"overall": 5.0, "verified": true, "reviewTime": "07 29, 2017", "reviewerID": "AQD7RZJ8OZI31", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sheraine", "reviewText": "Great read", "summary": "Five Stars", "unixReviewTime": 1501286400}
{"overall": 3.0, "verified": true, "reviewTime": "07 27, 2017", "reviewerID": "AQZD5ZMVKC3CG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Adrian", "reviewText": "so much writing for so little story", "summary": "one white lie", "unixReviewTime": 1501113600}
{"overall": 4.0, "verified": true, "reviewTime": "07 27, 2017", "reviewerID": "A195SSTSACOIQ0", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Marianne Ocheltree", "reviewText": "Was rather a good book and kept your attention.", "summary": "Four Stars", "unixReviewTime": 1501113600}
{"overall": 5.0, "verified": true, "reviewTime": "07 22, 2017", "reviewerID": "A1LEP3FM28J5RB", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Stephanie V", "reviewText": "This book is One White Lie, book 1 of the Barrington Billionaires Series, written by Jeanette Winters. This is my first book by Ms Winters and I thoroughly enjoyed it. I was trapped from the first page. I love second chance romances and this one was very well written. The characters were relatable and normal flawed humans. What a way to start a new job! Ok folks, Im headed off for book number two.  Ta ta.", "summary": "Great book!", "unixReviewTime": 1500681600}
{"overall": 4.0, "verified": true, "reviewTime": "07 19, 2017", "reviewerID": "A2722W1DSTNUJ1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "This story was well written.  A couple finding their way back to each other.  Learning to go from a workaholic to being a good father was the premise of this story.", "summary": "One While Lie", "unixReviewTime": 1500422400}
{"overall": 5.0, "verified": true, "reviewTime": "07 4, 2017", "reviewerID": "A7M73HAH815DM", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Theresa Lee Minter", "reviewText": "Three years ago her heart was crushed by Brice. Will they find a way back to each other? A very heartfelt love story.", "summary": "One White Lie: Barrington Billionaire's Series: Book one", "unixReviewTime": 1499126400}
{"overall": 5.0, "verified": true, "reviewTime": "06 28, 2017", "reviewerID": "A35D5VE44YLBJU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Paula J. Miklose", "reviewText": "I fun summer read, bring it to the beach or on vacation you'll be happy you did.\nEnjoy\nThanks bookbub", "summary": "Fun", "unixReviewTime": 1498608000}
{"overall": 5.0, "verified": true, "reviewTime": "06 14, 2017", "reviewerID": "A29I1LCVYCGZA1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Tamela C", "reviewText": "Great story and love how they bring other characters in.  Well written easy to read love story that never fades.", "summary": "Awww", "unixReviewTime": 1497398400}
{"overall": 5.0, "verified": true, "reviewTime": "06 13, 2017", "reviewerID": "A7LYNE6GEDAG8", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Julianne Mathias", "reviewText": "Good read", "summary": "Five Stars", "unixReviewTime": 1497312000}
{"overall": 5.0, "verified": true, "reviewTime": "06 8, 2017", "reviewerID": "A10PIB0GJZQHJA", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Linda", "reviewText": "Lena and Brice share have many obstacles to overcome before their HEA.  I loved this complicated story with just as complicated characters.  If you love reading billionaire stories you won't want to miss this one.", "summary": "Read this one!", "unixReviewTime": 1496880000}
{"overall": 3.0, "verified": true, "reviewTime": "06 5, 2017", "reviewerID": "A3UWXZGY924QRI", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Patty Fox", "reviewText": "To me this book was just ok.  I felt there was a lot of repeating.  Glad I got it for free, not sure I will buy any of the rest.", "summary": "Just an ok read", "unixReviewTime": 1496620800}
{"overall": 3.0, "verified": true, "reviewTime": "05 20, 2017", "reviewerID": "A1ZV5XBKG7RVZU", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Daun", "reviewText": "Lena is a single mom who becomes a fill-in personal assistant for  Brice. Both are surprised as they are past. Lovers and her son is his son!  Brice had a really tough family life, as his father was abusive. Consequently he feels unworthy of love, and unable to show love and be a good father. As a result, he does not allow relationships to grow serious. The story is not that hard to figure out, but the relationship between father and son is really and his father explains things about his grandmother and his mother. These are really not explained so that the reader understands underlying causes of his father and mothers relationship or if the mom is even still alive. Those were real empty spots in this story. There was too much head speaking happening. I was waiting for solution of the family issues and that was left unresolved. Also he wasn't believing in his worthiness, and she was convinced he would leave her again. Yet both turned on a dime when the time came. I would have liked more time explaining why he left her originally, and what happened to his dad and why, as well as if mom is still alive and can be a positive influence on her kids.", "summary": "Love and romance and a hard road", "unixReviewTime": 1495238400}
{"overall": 4.0, "verified": true, "reviewTime": "05 15, 2017", "reviewerID": "A2JVGM1RDV77OZ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Dorothy Beer", "reviewText": "Sad story. When success becomes more important than family or friends, you miss anticancer of happiness. It is,sad if your home life does not promote love or respect. ,no amount of wealth or success is worth it. How Leno could stillf love Brice, and allow him to do the things he did,is hard for me to comprehend. Luckily he did finally wake up and change his ways. I gave it 4 stars as I could not put myself in such a,lifestyle", "summary": "One White Lie", "unixReviewTime": 1494806400}
{"overall": 3.0, "verified": true, "reviewTime": "05 13, 2017", "reviewerID": "A2S5EPJ451WL3I", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Guy Reviews Romance and More", "reviewText": "One White Lie is a \"love interrupted\" and \"secret baby\" romance. I personally find it hard to accept why woman would just walk away and keep the baby a secret from the father even if he had wrong her, but that's just my personal opinion. Still, this story, while polished, just didn't grab me.\n\nBrice Henderson broke away from his controlling father to make his own fortune, by sacrificing everything, including the one woman he loved, but he can afford no distractions. When his personal assistant needed to take sick leave to take care of family, Brice reluctantly agreed to hire a temporary replacement... who turned out to be the one woman he pushed away... Lena Razzi. Lena spent years trying to forget Brice, despite having a daily reminder... a son by Brice that not even Brice knew about. Lena needed the job, even if it's just a temporary gig, to take care of the baby and herself, and Brice hasn't changed. But as they spent more time together, neither can forget the good times they once had. Can Lena tell Brice about their son if she's not staying? Can they rekindle their love... Or was this going to be a flash in the pan like last time?\n\nFrankly, I am tired of books that tout doormat single mom keeping the baby secret as if to spite the (bleep) dad just to prove you don't mean anything to me except as sperm donor, but as soon as they see each other, they got back together. It's basically formula that she won't tell him, believing this second time is temporary as well, then he found out and was pissed off, or he think he's damaged and was too good for her, or vice versa... But eventually they got back together. It's a trope, and this is no exception.", "summary": "Single mom ended up as assistant to the one man who got her pregnant... will she tell him about their son?", "unixReviewTime": 1494633600}
{"overall": 2.0, "verified": true, "reviewTime": "05 13, 2017", "reviewerID": "A2DE9PDS1V4UYY", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Damon Lamar Dauser", "reviewText": "ok", "summary": "Two Stars", "unixReviewTime": 1494633600}
{"overall": 2.0, "verified": true, "reviewTime": "05 11, 2017", "reviewerID": "ALFGUMMTD7M4R", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Charlotte in Va.", "reviewText": "The plot of this book was not so bad.  It basically is a story of a man who is so damaged by his unloving father growing up that he thinks he is unable to have love.  Resulting in pushing everyone away including his brothers and sister.  While he comes across as arrogant and unfeeling you know it all goes back to his childhood.  The main problem with this story is all the repetition.  The same things, and the same lines were repeatedly over, and over in nearly every chapter.  Just words to fill a story.  Pathetic that writers do that.  Don't waste your time.", "summary": "Could have been a good book.", "unixReviewTime": 1494460800}
{"overall": 3.0, "verified": true, "reviewTime": "05 9, 2017", "reviewerID": "A2993ELUH5DQQP", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "I.enjoyed this book and would have given it at least 4 stars except for the over-use of inner thoughts throughout the story.  I wished those had been incorporated in character conversations.", "summary": "Good book", "unixReviewTime": 1494288000}
{"overall": 5.0, "verified": true, "reviewTime": "05 9, 2017", "reviewerID": "A1CZCX3KF35J6Y", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "theresa lacerda", "reviewText": "I loved the but almost stopped reading it because with almost 98% of every page that you turned you were either a page ahead of the story line or repeated the last page. I missed alot of the story where it just stopped in the middle of talking or action. It was difficult to follow but im stubborn. If you read just the first chapter you will und we understand but does continue through whole book. Excellent story line that is why I had to finish.", "summary": "Excellent book", "unixReviewTime": 1494288000}
{"overall": 5.0, "verified": true, "reviewTime": "05 7, 2017", "reviewerID": "A5UM17P1E7DUQ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Trollhair", "reviewText": "Great read. Literally, could not put the book down. Parts were heartbreaking, and knowing Brice's background we all could relate to his feelings.\n\nGlad I fell upon this jewel of a book.", "summary": "One White Lie", "unixReviewTime": 1494115200}
{"overall": 5.0, "verified": true, "reviewTime": "05 7, 2017", "reviewerID": "A3NRIP7W09YAYR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "jeannene gray", "reviewText": "Love the story...didn't want it to end.. it's a must read if you love romance. Don't miss out you need to read", "summary": "Easy read", "unixReviewTime": 1494115200}
{"overall": 3.0, "verified": true, "reviewTime": "05 6, 2017", "reviewerID": "A2EE5ZFUERXU8G", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Okay book.  The thoughts of every character on every line became a bit redundant and overdone however.  Sometime the reader likes to imagine the thoughts of a character-- not have them spelled out over and over.  Good storyline.  I just grew a little tired of reading all the thoughts in the character's heads.", "summary": "Constant thoughts...a bit much...", "unixReviewTime": 1494028800}
{"overall": 4.0, "verified": true, "reviewTime": "05 6, 2017", "reviewerID": "A3DBWE4DDTY68O", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Jeri Lynn", "reviewText": "It jumped around a lot to the point I had to reread or go back to make sure I hadn't skipped something.", "summary": "Decent story but....", "unixReviewTime": 1494028800}
{"overall": 5.0, "verified": true, "reviewTime": "05 6, 2017", "reviewerID": "A1UVH2I7WHDWLD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "AmyJean Barclay", "reviewText": "I enjoyed the story and the characters and wanted to keep reading to the very end and then wanted more! The author draws you in and lands you in the middle of an incredible story.", "summary": "Kept you wanted to read more", "unixReviewTime": 1494028800}
{"overall": 3.0, "verified": true, "reviewTime": "05 5, 2017", "reviewerID": "A21TSBBTF0DMG5", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Reader Lady", "reviewText": "This one is hard to rate for me. The plot is good, but I listened to the audio book. Ms. Winters uses a lot of direct internal thought,which was very distracting. The narrator was not the right fit for this book. Perhaps if I had designated of listening the rating  right have been higher. Happy reading!", "summary": "My Musings", "unixReviewTime": 1493942400}
{"overall": 4.0, "verified": true, "reviewTime": "05 3, 2017", "reviewerID": "A1DHJPRKE586ZA", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "the book", "reviewText": "This is a good book to read I enjoyed the suspense great writing can't wait to read another one from this author", "summary": "Good book", "unixReviewTime": 1493769600}
{"overall": 5.0, "verified": true, "reviewTime": "04 23, 2017", "reviewerID": "A1S7O6YQQMQBJD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "amazon customer", "reviewText": "I loved the sex scene's and the people got along very well and they argued some of the time and they were great at arguing with each other.", "summary": "The book was great to read.", "unixReviewTime": 1492905600}
{"overall": 5.0, "verified": true, "reviewTime": "04 21, 2017", "reviewerID": "A2TAETU9IWACA4", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Alexis", "reviewText": "I loved this book so touching gives me hope in believing in love again.", "summary": "Five Stars", "unixReviewTime": 1492732800}
{"overall": 4.0, "verified": true, "reviewTime": "04 21, 2017", "reviewerID": "A1SIET92EMT59R", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Jill of all trades, master of none", "reviewText": "I read this after reading a book I really didn't like so perhaps it made this one seem better than it is.  Having said that, I enjoyed reading this mostly predictable but with a few twists story.  Poor young working woman works for rich billionaire, who happens to be her baby's daddy.  There's chemistry, misunderstandings and slow reveals of their past.  They're both strong believable characters.", "summary": "Fun, easy read", "unixReviewTime": 1492732800}
{"overall": 5.0, "verified": true, "reviewTime": "04 20, 2017", "reviewerID": "A3SASWJAJNCXT5", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Valerie mantle", "reviewText": "It made me cry. My family was much the same. Awesome ending!!! Thank you for freeing my heart! Love and family is what matters.", "summary": "Heart wrenching", "unixReviewTime": 1492646400}
{"overall": 5.0, "verified": true, "reviewTime": "04 20, 2017", "reviewerID": "A2QHFVYTXBPGJG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "josefina mendoza", "reviewText": "I love this book", "summary": "Five Stars", "unixReviewTime": 1492646400}
{"overall": 4.0, "verified": false, "reviewTime": "04 19, 2017", "reviewerID": "A2OFJBHS2NUTSS", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "J Dowell", "reviewText": "Fun read. There were mistakes on both sides of the relationship, but love saved the day.", "summary": "Good read.", "unixReviewTime": 1492560000}
{"overall": 3.0, "verified": true, "reviewTime": "04 16, 2017", "reviewerID": "A220QBB9933TJO", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Viji Iyer", "reviewText": "Good ztoryline...well laid out. Reasons for Brice's behavior was never made clear.  Book seemed to end abruptly .  Lena' s character was well defined.", "summary": "Good  Read", "unixReviewTime": 1492300800}
{"overall": 5.0, "verified": true, "reviewTime": "04 11, 2017", "reviewerID": "A5XAUEAVIG289", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Tenino1", "reviewText": "Despite being pig headed and afraid love prevails. Good story fun  to read. If you like a good romance this is it.", "summary": "Love lost and found", "unixReviewTime": 1491868800}
{"overall": 2.0, "verified": true, "reviewTime": "04 6, 2017", "reviewerID": "A33PN60H2ECP60", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Roselyn", "reviewText": "It was a good book, but I found the sex scenes bit much.\nCleaning it up would have made it much better.  You need to leave something for the reader's imagination", "summary": "One white lie", "unixReviewTime": 1491436800}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2017", "reviewerID": "A2BOKBB1IZA13L", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Nancy Banks", "reviewText": "Loved", "summary": "Great book", "unixReviewTime": 1491436800}
{"overall": 2.0, "verified": true, "reviewTime": "04 5, 2017", "reviewerID": "ANQE4Y2L328AV", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Julia", "reviewText": "Sadly the characters caved in too quickly. It never felt real as I was reading.  Just read like an  author's first story.", "summary": "Didn't like", "unixReviewTime": 1491350400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 5, 2017", "reviewerID": "A11VYN8DIT7TN7", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Liz L", "reviewText": "Couldn't wait to get to the next .", "summary": "Good read!", "unixReviewTime": 1491350400}
{"overall": 5.0, "verified": false, "reviewTime": "04 4, 2017", "reviewerID": "AKE2BU239ZGXU", "asin": "1519588135", "style": {"Format:": " Audible Audiobook"}, "reviewerName": "Evelyn Guilbault", "reviewText": "Lena and Brice ...Love story great way to start a series", "summary": "Hot and sexy !!", "unixReviewTime": 1491264000}
{"overall": 1.0, "verified": true, "reviewTime": "04 4, 2017", "reviewerID": "A1JOT36Z7IFM6G", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Yes I am looking forward to seeing what you are looking for impeachment trial in this country and pictures are not the mountain view of all", "summary": "#0", "unixReviewTime": 1491264000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 3, 2017", "reviewerID": "A3BHKL8KUBE8T9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Susan K.", "reviewText": "As always, a pleasure to read!", "summary": "Another winner!", "unixReviewTime": 1491177600}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "04 1, 2017", "reviewerID": "A21UM27Y6HXJF3", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "I gave this book a 5 star rating for many reasons. It's well written.  Entertaining, and I couldn't put my kindle down.", "summary": "Entertaining", "unixReviewTime": 1491004800}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "04 1, 2017", "reviewerID": "ATB9ITQKD4NAE", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Roseann C Diamond", "reviewText": "Loved the book. Have read all following books!", "summary": "Love!!!", "unixReviewTime": 1491004800}
{"overall": 5.0, "vote": "8", "verified": true, "reviewTime": "04 1, 2017", "reviewerID": "A2ZZNM1KESOB78", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Bev", "reviewText": "Reading other reviews I'm wondering if some of the others read the same book I did.  I loved it.  Lena was a formidable woman trying to protect her only son from any hurt.  Brice was a typical work a holic.  Couldn't see the forest for the trees.  For them to be thrown back together after so many years and still feeling the jolt of the sparks was awesome.  I love this series.  Maybe you have to read all the books that Jeannette, her sister and her niece wrote to fall in love with them?  They are really stand a lones intertwined with each other.  Like I said I loved it and couldn't put it down.", "summary": "A white lie to be sure.", "unixReviewTime": 1491004800}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 30, 2017", "reviewerID": "AFSMJQ0ROUWPC", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Very good book. Mostly upbeat but covered a wide range of emotions. This book could have been much longer.  I now want to know more about all the others mentioned in this story.", "summary": "Well written no slow areas.", "unixReviewTime": 1490832000}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 28, 2017", "reviewerID": "A37GCC410JYT17", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Susan P Spurgeon", "reviewText": "I like the characters but the storyline is too predictable.  I think I'm getting tired of billionaires.  I'd rather have more ordinary people.", "summary": "Too predictable", "unixReviewTime": 1490659200}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "03 26, 2017", "reviewerID": "A3ALJLQAL0AUS9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "CCH", "reviewText": "I'm not a fan of emotionally weak women or self centered men. This book just wasn't my taste. I won't be reading anymore of this series.", "summary": "Didn't like it", "unixReviewTime": 1490486400}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "03 23, 2017", "reviewerID": "A331Q71CBZCVGR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Faith M. Willoughby", "reviewText": "Cold hearted billionaire who leaves breaks up with his girlfriend to further his career. Three years later he unknowingly hires her and finds out he still desires her. The woman falls immediately back into his arms and they live happily ever after.  There was nothing special about this book and the heroine was really a pushover. Please get this book for free. Don't pay it's not worth it.", "summary": "Really Simplistic", "unixReviewTime": 1490227200}
{"overall": 4.0, "vote": "6", "verified": true, "reviewTime": "03 21, 2017", "reviewerID": "A2MR30PDP7O9HP", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "I enjoyed this book. It does leave you wondering about their mother. Maybe that is another story. I will probably read book two.", "summary": "One White Lie", "unixReviewTime": 1490054400}
{"overall": 2.0, "verified": true, "reviewTime": "03 20, 2017", "reviewerID": "A367DUC4LZ16MF", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Too much sex and  very week plot very evident from the start how it would end. Not the book for me.", "summary": "Poor", "unixReviewTime": 1489968000}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "03 19, 2017", "reviewerID": "A3IQ0P3M39IY8U", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "CINDY F.", "reviewText": "I thought this story drug on a bit too long, and it was also very a very slow read. There was too much internal dialogue, and not much in the way of actual conversation between the two. And when there was, it was him barking out orders and then fleeing the scene. He breaks things off with her 3 years ago, and for no real apparent reason other than he was a real selfish smuck!!! Then when she lands a job with his firm filling in as a temp for his regular PA, he practically forces her into sex within days....then proceeds to totally ignore her for weeks on end.\n\nLena was a sweetheart, but one of the worst doormats I have ever read. I was shocked at the little respect she had for herself, really...what else could turn her into such a idiot. Brice treated her with such indifference it was almost too painful to even read at times..\n\nI mean, really.....Where was there supposed to be this great love connection between these two, because I sure never saw it.\n\nAs much as it pains me to say this; I'd give this story a pass, it's not really all that good.", "summary": "2.5 stars for effort.", "unixReviewTime": 1489881600}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "03 18, 2017", "reviewerID": "A3Q1VWK8ICLCOX", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Mary B. Law", "reviewText": "It was more than just a sex srory! A beautiful love story. I en joyed the entire . Time for another good one.", "summary": "Good  read", "unixReviewTime": 1489795200}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "03 17, 2017", "reviewerID": "A1QV9Z4H4USF2R", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sassy Jones", "reviewText": "A spicy romance with lots of steaming hot scene. It will satisfy the our hunger and leave hot, hot, hot.", "summary": "A spicy romance with lots of hot steaming scene. It will satisfy your hunger and leave you wet.", "unixReviewTime": 1489708800}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "03 17, 2017", "reviewerID": "A37ZK5CLA2T2C9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "kipling", "reviewText": "ok read", "summary": "Three Stars", "unixReviewTime": 1489708800}
{"overall": 5.0, "vote": "15", "verified": true, "reviewTime": "03 16, 2017", "reviewerID": "A18E2A7YFNNELG", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Mim", "reviewText": "A great, strong, wonderful story with interesting characters. I felt that the author described their feelings very well but did it over and over. I found that boring. I skipped a lot of those repeats. But on the whole I found this book very interesting. Mirilou", "summary": "Wonderful read.", "unixReviewTime": 1489622400}
{"overall": 2.0, "verified": true, "reviewTime": "03 16, 2017", "reviewerID": "A16WBOMWK2GERJ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ku&#039;ualoha", "reviewText": "I had a really hard time getting into this book, I just couldn't.  The characters were one dimensional and uninteresting.  The plot was boring.  The authors writing style was irritating to read.  The fact that BOTH characters were having inner monologues made the book feel awkward and full of unnecessary information.  Every chapter was repetitive, feeling as though I were reading the same chapter over and over and over and over.  How many times do I need to read about how his father was abusive and uncaring?  Or how much he wants to sleep with Lena?  How many times do I have to read about how he hurt her and her back and forth about telling him about their son or not?  Apparently hundreds.  That's all there was in this book.\n\nI DNF, and I wish I hadn't wasted my time with the half of the book that I forced myself to read.\n\nI wouldn't read another book by the author.\n\nI would not recommend this book, nor the author to anyone.\n\nI'm being generous by giving the book 2 stars.  I'm sorry.  I just didn't like it.", "summary": "Repetitive & Boring", "unixReviewTime": 1489622400}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 12, 2017", "reviewerID": "A1N4Y46VSD72KI", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Jennie", "reviewText": "Loved it and will be looking into more by Jeanette Winters. I'm not so great at reviews, but felt this book deserved one.", "summary": "White lie", "unixReviewTime": 1489276800}
{"overall": 1.0, "verified": true, "reviewTime": "03 9, 2017", "reviewerID": "A3H2TJBKERBXU1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "KN", "reviewText": "This book was too drawn out for me I didn't finish it.", "summary": "predictable and boring", "unixReviewTime": 1489017600}
{"overall": 2.0, "verified": true, "reviewTime": "03 9, 2017", "reviewerID": "A27LQ5LXL7ACK4", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Jamie B", "reviewText": "I wish I would have reas some reviews before wasting my time. I couldn't even finish the book. The characters are lost in their own thought all the time. I don't want to be in somebody's head. Where's the dialogue? Where's the actual story? All I see is them thinking about what the other is thinking or what has happened in the past.", "summary": "It could have been good.", "unixReviewTime": 1489017600}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "03 9, 2017", "reviewerID": "A38SHBX6H6UUZ1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Rachel M. Yamaguchi", "reviewText": "Got a little annoyed at the the tell rather than show which tells me this is an amateur book instead of a professional one.", "summary": "More tell than show", "unixReviewTime": 1489017600}
{"overall": 5.0, "vote": "15", "verified": true, "reviewTime": "03 9, 2017", "reviewerID": "A1MCH6N1BCMZYZ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kathleen Thompson", "reviewText": "Another great read. This story has a lot of heart. Can relate to the story. Now I need to read the rest of the series. Table for two here I come.", "summary": "One white lie", "unixReviewTime": 1489017600}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 8, 2017", "reviewerID": "A34FGMJ3K5O6GT", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sherry  Ellis readsbychoice", "reviewText": "I enjoyed this story. I thought it was well written. The characters were more in thought than actually communicating but for me it didn't take away from the story. It's just a different style. I have read her sisters book with the Barrington's  so I was surprised one of them was in this story.\nAnyway good story and heartfelt", "summary": "Good", "unixReviewTime": 1488931200}
{"overall": 1.0, "vote": "5", "verified": true, "reviewTime": "03 8, 2017", "reviewerID": "A36T3T3602P86F", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Love2read", "reviewText": "While the gist of the story was good the addition of every single crazy thought in each of their heads was too much. It was like trying to chase a rabbit trail it was just too random.", "summary": "Rabbit trails", "unixReviewTime": 1488931200}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "03 8, 2017", "reviewerID": "A1WNLWGN92FR9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Great book very good reading enjoyed it a lot looking forward to reading the other story and series related to this story line", "summary": "Good", "unixReviewTime": 1488931200}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A3TNL8O01NO33O", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "dicentra", "reviewText": "The writing wasn't that great and it throws the whole book off for me, I wasn't crazy about the characters either. I skipped through a good portion of this just to get a resolution but I won't be buying the others in the series.", "summary": "The writing wasn't that great and it throws the whole book off for me", "unixReviewTime": 1488844800}
{"overall": 1.0, "vote": "4", "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A207YKYJE5YGX1", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Save your money!! It is the same storyline as any other book out there. It bored me and made me blush and not for the right reasons.", "summary": "Bored nothing original about this book.", "unixReviewTime": 1488844800}
{"overall": 2.0, "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "AN3DWC1CZZE4D", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Surina", "reviewText": "This isn't the worst I've read but gosh is it getting close. Where was the connection. Although I forced myself to complete the book, I'm sitting here wondering how the end up together? He was rude, demanding, forceful, and she was just a puppet going along with everything but saying she had a backbone. Where is it cause throughout this book she didn't show it. I won't waste my time with the next book.", "summary": "Maybe a conference call with the sister is needed...", "unixReviewTime": 1488844800}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 6, 2017", "reviewerID": "A2MIY2NDRNDIG8", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "rjr96762", "reviewText": "It was a delightfully different and fun book to read. The story line and characters kept the plot interesting and moving along.", "summary": "Good read", "unixReviewTime": 1488758400}
{"overall": 2.0, "verified": true, "reviewTime": "03 6, 2017", "reviewerID": "A31VL6CGDSYD7P", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "dzumwalt", "reviewText": "Need I say more?  Nice try Jeanette, hopefully the next installment will make up for the shortcomings of this book.", "summary": "Boring, Stupid, and In Need of Editing", "unixReviewTime": 1488758400}
{"overall": 4.0, "vote": "8", "verified": true, "reviewTime": "03 6, 2017", "reviewerID": "A2LNYPQ2Q4NCU0", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "boone", "reviewText": "The story is good and kept you wanting to read further.  I found some of the language distasteful and more sex than I wanted to know.  The story is about a single mother and the man who was the father of her child. He was wanting to be successful and had destroyed their relationship.", "summary": "Women with a child and a business man", "unixReviewTime": 1488758400}
{"overall": 2.0, "verified": true, "reviewTime": "03 6, 2017", "reviewerID": "A24X6Z7E2HIVQB", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "AuNaturel1", "reviewText": "This book was 95% each other's thoughts and 5% actual talking communication. If you like that kind of read, I guess you may like this. Not a lot I can say. I stuck til the end but it was a frustrating read", "summary": "Just ok..", "unixReviewTime": 1488758400}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 6, 2017", "reviewerID": "A3BF70JQE1X7WB", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amma21", "reviewText": "Good story good ending.  Now let's see what happens with the rest of the series.  Hoping the rest of the series is as good as the first book", "summary": "Good story", "unixReviewTime": 1488758400}
{"overall": 3.0, "verified": true, "reviewTime": "03 5, 2017", "reviewerID": "A3TDV9GGQKIG4H", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer Betty", "reviewText": ". This book was more sexually explicit than I like.  The story would have been much better if the office and bedroom scenes would have been left to readers own imagination.", "summary": "story line drags out.", "unixReviewTime": 1488672000}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "03 5, 2017", "reviewerID": "A2PJCE1T0AXDD3", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "purple rose", "reviewText": "I like the story. It is written in a way that it almost stands by itself so no need to read more.", "summary": "Good", "unixReviewTime": 1488672000}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "03 5, 2017", "reviewerID": "A3CBZUOAQ1LBU5", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Betty", "reviewText": "It had been three years, how things had changed.  This story tell of two different ways of life meeting. What comes next.", "summary": "Changes", "unixReviewTime": 1488672000}
{"overall": 4.0, "vote": "6", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A2XZY9TNRXX6WZ", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ephne Williams", "reviewText": "The author wants us to believe Brice has a big chip on his soldier but the context in which he pushes Lena away is not very believable", "summary": "Chip", "unixReviewTime": 1488585600}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "AETC8Z2S3L6RK", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "save and continue", "reviewText": "Everything was good and I liked the progression of the romance\nThe only thing I would say is that there's too much of explaining of history as compared to the present ongoing story", "summary": "Very good book", "unixReviewTime": 1488585600}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A2NNCJJ8SFRU7M", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Yvonne Smith", "reviewText": "I couldn't put it down it was a good read. That you can work hard and still have happiness. It's a truly good book", "summary": "Don't lie", "unixReviewTime": 1488585600}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A35S00HT71Q6DE", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Mamalovestoread", "reviewText": "A good weekend read that leaves you wanting more.  A love story that your not sure is going to end happy.  Love Nicolas adorable wove me too.....", "summary": "Oh my....", "unixReviewTime": 1488585600}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A15S96FNISMN5Y", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "HugsBugs2", "reviewText": "Good read ....", "summary": "Four Stars", "unixReviewTime": 1488585600}
{"overall": 4.0, "vote": "12", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A18EEC1ENOT9YN", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Nana", "reviewText": "Chemical Engineer, Brice Henderson has an agenda for his life that Brice told Lena Razzi he would not let anything or anyone get in his way to reach his goals. Lena had something important to tell Brice on the last night of their relationship, but he tossed her away as though she was nothing. Three years have passed since the night he had ended their relationship and by a trick of fate, Lena is on a temporary job in Brice's office for a month.  Now the decision to tell him the truth is Lena's to make. I try to make positive comments to writers, but there are glaring problems in the starts and stops in this story.  The story is line is a good concept overall, but it needed some serious editing by a professional for me to give it 5 stars.", "summary": "One White Lie: Barrington Billionaire's Series: Book 1", "unixReviewTime": 1488585600}
{"overall": 1.0, "vote": "6", "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A35TNJP9MWP4VD", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Linda M. Day", "reviewText": "Lena is a pathetic push over!!! 2 days after meeting back up with the guy who got her pregnant and then dumped her 3 years before, she has sex with him in his office!!!! He pushes her around, making her go to dinner when she already had other plans, making her move into his place to keep her safe and and she just takes it. Don't like people like this. Stand up for yourself.", "summary": "Weak main character", "unixReviewTime": 1488585600}
{"overall": 5.0, "vote": "17", "verified": true, "reviewTime": "03 3, 2017", "reviewerID": "A3UHSI45ZYGHM9", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Lena Razzi had spent the last 3 years trying to forget Brice Henderson, now she stood there and couldn't  believe that he was  her boss. Brice Henderson, a wealthy and prosperous chemical engineer had left her as he wanted power and success and not tied down to a family life.\n\nIn the middle of his company closing a deal  seeing her was too much of a distraction. The last thing he needed was remembrance of his passion shared with Lena . Little did he know she had his son!\n\nRomance instead of power and the need for someone that not only was beautiful,  but so caring, brought turmoil to Bruce. Would he continue his life without her?  Did he need this family issue to change his perfect life!  Great story, hard to put down.", "summary": "One Lie Leads to Another", "unixReviewTime": 1488499200}
{"overall": 5.0, "vote": "14", "verified": true, "reviewTime": "03 3, 2017", "reviewerID": "A138V63QY5CSBC", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Does not matter what walk of life we come from it seems all have troubles when it comes to love. Really enjoyed the story.", "summary": "Great read.", "unixReviewTime": 1488499200}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "03 3, 2017", "reviewerID": "A31YGA6DZOKSOS", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Donna", "reviewText": "The story is well written with enough realism and romance to make it believable. The story flows well. It was a very enjoyable read.", "summary": "Awesome", "unixReviewTime": 1488499200}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A2HBFQQC59RPTR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kindle Customer", "reviewText": "Many of the reviews didn't like the H but I found him to be a victim of abuse and had to learn  life could be different. It was a circle he could break. Fortunately, he found a woman that loved him in spite of his attitude.", "summary": "I liked this story", "unixReviewTime": 1488412800}
{"overall": 4.0, "vote": "9", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A31G4MNGZNYSZI", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sue Grosz", "reviewText": "A struggling, single mom takes a temporary position with a company to get a recommendation for future jobs only to find that her new boss turns out to be the man who walked out of her life three years earlier unaware he was about to be a father. Brice can't understand Lena's reluctance to continue the relationship. Lifelong hurts and stubborn wills make the temporary position a trial for all.", "summary": "Hidden Secrets", "unixReviewTime": 1488412800}
{"overall": 1.0, "vote": "10", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "AO2T4D7H4PKTC", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Ellakay", "reviewText": "Synopsis sounded very interesting as I'm a sucker for a second chance romance. Nope. There was nothing romantic about these two. H is a jerk and h is a doormat with no self respect. In addition, there are huge gaps in the story. A death bed confession that changes everything seems important enough to include in the story, I would think, but no. I kept flipping back pages to see if I had accidentally turned two at a time. I hadn't. Glad the book was free so i don't have to try returning it.", "summary": "Not worth the effort to read", "unixReviewTime": 1488412800}
{"overall": 1.0, "vote": "7", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A391QCPZB8VQBE", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "J.T. Grey", "reviewText": "If you like your heroes to be mean and thoughtless, your heroines to be weak and helpless, well then this is the book for you.\n\nMyself I prefer to actually like the main characters in the books I read, and where I did rather like the h her inability to stand up to the jack ass H turned me off.\n\nNot my cup of tea.", "summary": "Not so much", "unixReviewTime": 1488412800}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A4XQ2CZ8CGUY2", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "jzozo", "reviewText": "This is a very quick read. I do agree with some of the reviews. There is more inner thought and explanations rather than dialog. I don't think the h was a 'doormat' but she was weak, hoping to stand up for herself and failing most times. The H was arrogant and self-centered. He wasn't always like that but things from his past haunted him. We don't really get much of an explanation into his past, just a few lines, no big revelations where I think the author could have expanded and made things a big more dramatic and traumatic. The Epiphany is a bit lack luster. I wish the push and the pull between the H/h pulled on your heartstrings. I guess that just didn't happen for me. Will I continue with the series? Probably not.", "summary": "Hoped for more but it didn't deliver the punch I had hoped", "unixReviewTime": 1488412800}
{"overall": 2.0, "vote": "5", "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A17M03SA36RYKR", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "wendyp", "reviewText": "implausible, very drawn out, repetitive, and often didn't make sense.\nThe H suddenly drops the h 3 years ago, with absolutely no explanation.  I don't blame her for staying away, but i do blame her for falling back in with him so quickly and actually feeling bad about it.\nand i won't even get into the concept of developing some chemical formula that isn't ready yet, but suddenly is in time to produce it at a factory in a war zone.  can you say \"years of testing\" first?\nand absolutely everything that could point to a toddler living in the apartment is gone with said toddler, on a bus?  this author obviously has never had a kid, or at least doesn't remember the sheer amt of stuff that can accumulate.  how could the H not see SOMETHING that points to a kid living in that apartment?", "summary": "he's a jerk, she's a doormat, not worth your time.", "unixReviewTime": 1488412800}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "02 21, 2017", "reviewerID": "AB45WQ24A7RJW", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "ladtbug", "reviewText": "Loved the story line will be reading the rest of this series. Dad what the Henderson endured but they came out ok", "summary": "Great read", "unixReviewTime": 1487635200}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "02 4, 2017", "reviewerID": "A2YF0QVNVT7ZI8", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Juaniferdingbat", "reviewText": "All of the books by Winters and Cardello and Stewart in the Andrades/Barrington series are fantastic!.", "summary": "... and Cardello and Stewart in the Andrades/Barrington series are fantastic!.", "unixReviewTime": 1486166400}
{"overall": 5.0, "vote": "8", "verified": true, "reviewTime": "02 3, 2017", "reviewerID": "A304SVREB6REUL", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "Great story with some twists and sensual scenes.  This main characters are fun and complex in this adventure.", "summary": "Five Stars", "unixReviewTime": 1486080000}
{"overall": 4.0, "vote": "6", "verified": true, "reviewTime": "01 26, 2017", "reviewerID": "A1JOQKXM7ZND7V", "asin": "1519588135", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Helen Akin", "reviewText": "loved this story and the characters", "summary": "Four Stars", "unixReviewTime": 1485388800}
