{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 27, 2013", "reviewerID": "A3NHUQ33CFH3VM", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Greeny", "reviewText": "Not one thing in this book seemed an obvious original thought. However, the clarity with which this author explains how innovation happens is remarkable.\n\nAlan Gregerman discusses the meaning of human interactions and the kinds of situations that tend to inspire original and/or clear thinking that leads to innovation. These things include how people communicate in certain situations such as when they are outside of their normal patterns.\n\nGregerman identifies the ingredients that make innovation more likely. This includes people being compelled to interact when they normally wouldn't, leading to serendipity. Sometimes the phenomenon will occur through collaboration, and sometimes by chance such as when an individual is away from home on travel.\n\nI recommend this book for its common sense, its truth and the apparent mastery of the subject by the author.", "summary": "Clear on what leads to innovation", "unixReviewTime": 1385510400}
{"overall": 5.0, "verified": false, "reviewTime": "11 1, 2013", "reviewerID": "A3SK6VNBQDNBJE", "asin": "1118461304", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Leif C. Ulstrup", "reviewText": "I have enjoyed Dr. Alan Gregerman's weekly blog ([...] and two previous books since taking an innovation class with Alan over a decade ago.  He opened my eyes to seeing the world in a fresh way and also taught me structured techniques that I can use to increase the creative problem solving skills of teams and individuals.\n\nAlan untangles the difference between invention and innovation and makes it much easier to see that 99%+ of innovation is adaption of proven inventions borrowed from other industries, disciplines, contexts, and cultures.\n\nHis previous book, Surrounded by Geniuses, is excellent.  It is a great mix of ideas and memorable examples of his insights in action.\n\nHis newest book, The Necessity of Strangers, builds on that previous body of knowledge and delves further into a critical dimension of his innovation research about the power of making connections outside of one's group to discover alternative approaches to addressing a challenge.  The book is full of excellent examples of individuals and organizations tackling challenges by seeking ideas and insights from \"strangers\".  Alan borrows heavily from personal experience which enriches the storytelling aspect that makes his writing so accessible.\n\nIf you have not seen Alan teaching his ideas or present to an audience, I would highly recommend it.  He has been a featured speaker at a solution architect leadership development program at our firm.  He recently presented the ideas from The Necessity of Strangers to a large audience of executives at our firm that left people talking, engaged, and energized.\n\nI highly recommend his books and Alan's live presentations.", "summary": "Becoming more innovative by opening yourself to conversations with \"strangers\"", "unixReviewTime": 1383264000}
{"overall": 5.0, "verified": false, "reviewTime": "10 10, 2013", "reviewerID": "A3SOFHUR27FO3K", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Harry Gilbert Miller III", "reviewText": "Alan Gregerman believes that innovation comes from viewing problems from different and fresh perspectives.  In The Necessity of Strangers, he tells short, simple stories to help free us from current, legacy views of the problem at hand.  He then provides a toolbox containing practical exercises - to stretch our thinking, to collaborate more effectively, to find strangers - all focused on getting us to view problems from different perspectives.  The Necessity of Strangers is a quick read that I keep on the desk as a constant reminder to seek novel views from new sources.  Like matter to anti-matter, The Necessity of Strangers is the perfect and completing complement to his earlier Surrounded by Geniuses.  Gil Miller, Chief Technology Officer, Noblis", "summary": "The World from Different Perspectives", "unixReviewTime": 1381363200}
{"overall": 5.0, "verified": false, "reviewTime": "10 9, 2013", "reviewerID": "A1HOG1PYCAE157", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Rebecca Ripley", "reviewText": "Alan Gregerman is a smart, funny, entertaining writer who will jostle your point of view. Through every encounter with a stranger, Alan opens his mind and heart to new possibilities. His ability to spot meaningful connections and weave them into compelling stories allows us all to learn vicariously. His rich life experiences become our learning playground. I highly recommend this book and encourage you to share what you learn from strangers--as the result of your delightfully modified worldview.", "summary": "Strangers are Your New Best Friends", "unixReviewTime": 1381276800}
{"overall": 5.0, "vote": "10", "verified": false, "reviewTime": "09 7, 2013", "reviewerID": "A26JGAM6GZMM4V", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Robert Morris", "reviewText": "As I began to read this book, I was again reminded of how deceptively complicated the word \"stranger\" is. It could refer to someone we have never heard of, of course, but it could also refer to someone we have met or heard about. We know their name but nothing else about them. Then there is another type of \"stranger\": someone we think we know well but really don't. We have false assumptions, a mindset, about who they are and aren't, what they can and can't do, and whether or not they would be willing to provide or receive assistance.\n\nAlan Gregerman wrote this book to explain how and why - with all due respect to the importance of one's family members, friends, and associates -- it is imperative to engage, learn from, and collaborate with strangers. \"People who are very different from us are essential to our growth and success as individuals and organizations.\" Just as Henry Chesbrough has devised an open business model, it could be said that Gregerman offers an open people model. How so?\n\n\"Each day we pass by more than one hundred people that could change our lives but we never make the time or effort to connect. The best way to solve any challenge or create any new opportunity is to begin by being curious about the world around us and realize that it is filled with remarkable people, insights, and possibilities.\" Nonetheless, there are those false assumptions and, perhaps, at least some concern about being rejected and feeling embarrassed or even foolish.\n\nHe suggests a new paradigm individuals and organizations \"wise enough\" to incorporate exploration and openness in their DNA. Here's its formula:\n\nBusiness and Personal Success =\nWhat I Already Know +\nMy Knowledge or Understanding Gap +\nA Stranger (or Strangers) Who Can Fill It\n\nHis citation of one of my favorite Charles Kettering quotations is dead-on:\n\n\"Where there is an open mind there will always be a frontier.\"\n\nGregerman devotes a great deal of attention to explaining how to develop the necessary mindset, one that embraces rather than recoils from exploration and openness. There are four core principles that provide its foundation: humility, curiosity, respect, and purpose. For those who are especially reluctant to become explorers of what is -- for them -- not only unfamiliar but perhaps terrifying territory, I presume to suggest one other: the courage to which Jack Dempsey refers when explaining that \"champions get up when they can't.\"\n\nThese are among the passages that caught my eye:\n\no Questions that strangers can help to answer (Page 9)\no The Race to the South Pole (20-28)\no What Science Tells Us (30-39)\no From Mindset to Guiding Principles (51-56)\no Helicopters. Hairstyles and Cars That Won't Collide (64-73)\no Finding the Right Strangers (78-84)\no Recognizing the Genius in Everyone (89-93)\no Rethinking Employee Engagement (96-103)\no Why Collaborate? (110-118)\no The New World of Customers (131-134)\no Understanding and Empowering Strangers (138-143)\no The Promise of Strangers (152-155)\no Changing the Game (158-163\no Getting Past the First Bite (174-176)\no Essential Tools for Implementation (189-201)\n\nWhen concluding his book, Alan Gregerman acknowledges the difficulty while stressing the importance of \"taking the first step\" toward understanding the potential importance of strangers to us and (yes) our potential importance to them. He observes, \"As humans we have the amazing ability to be open and to dream, imagine, explore, learn, connect, share, collaborate, innovate, and grow, to go big instead of going home. So get out there and find the stranger or the [strange] idea that could change your life.\" Who knows? We may be that stranger or have that idea that someone else needs. Nothing ventured....", "summary": "How and why it is imperative to engage, learn from, and collaborate with strangers", "unixReviewTime": 1378512000}
{"overall": 5.0, "verified": false, "reviewTime": "05 11, 2014", "reviewerID": "A17K8WANMYHTX2", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "mark h wellman", "reviewText": "I teach a class on innovation and I used the Necessity of Strangers as one of the required books. The students loved the book. The book is an insightful piece of literature that turns the common knowledge of networking on its head. The main point of the book is that random strangers are able to be much more beneficial in the growth of a product or business, because strangers have outside perspectives without bias.\n\nI would highly recommend the book. Also, Mr. Gregerman is a wonderful public speaker!", "summary": "Insightful & Very Useful!", "unixReviewTime": 1399766400}
{"overall": 5.0, "verified": false, "reviewTime": "05 9, 2014", "reviewerID": "A13IW3A6W43U0G", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Mmf", "reviewText": "I so appreciated the insights and perspective this book.  Allen Gregerman organIzes and presents ideas beautifully - reminding us that seeing things in new ways is so very valuable.  So much about life encourages us to seek the known and comfortable and yet so infrequently is that where growth and progress is realized.\n\nThe writing style is wonderful. I've given copies of the book to my HR friends - and it has been very well received\n\nImagine if more organizations embraced this thinking!", "summary": "The necessity of this book!", "unixReviewTime": 1399593600}
{"overall": 5.0, "verified": true, "reviewTime": "05 7, 2014", "reviewerID": "A1ECEGG1MP7J8J", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "G. Deatherage", "reviewText": "As with \"Surrounded by Genius\", Alan Gregerman brings simple ideas to create inspiration.  Never underestimate the human spirit and those around you to bring creativity and innovation to any challenge.  Alan has once again put a tool in our hands to invite us to look to those around us for solutions and guidance.", "summary": "Great insight-Great book", "unixReviewTime": 1399420800}
{"overall": 5.0, "verified": false, "reviewTime": "05 4, 2014", "reviewerID": "A2D5X9G9S3A7RN", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Teresa Fritsch", "reviewText": "Alan Gregermans book provides valuable ideas for leaders who are required to continually scan and look for new and better ways to engage their employees and customers and innovatively grow their business.  His stories and guidance empower leaders to take actions that lead to possibility while broadening connections.", "summary": "The Necessity of Strangers dares you to be open and explore to realize personal and organizational growth.", "unixReviewTime": 1399161600}
{"overall": 5.0, "verified": false, "reviewTime": "05 2, 2014", "reviewerID": "AP2F86JFRQ205", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Ken Harris", "reviewText": "I am a believer in Alan Gregerman.  I have enjoyed his blogs, lectures and books for several years.  Alan offers fun and practical guidance on not only getting the most out of our work, but out of our lives.\n\nAlan encourages us to get out of the comfort zone.  When faced with an urgent problem, most of us buckle down, bring in our closest advisors, lock the doors, order in dinner and make very important decisions.  Alan argues that we need to get out of the office, walk around and see what other great companies are doing.\n\nWhy?  In his latest offering, Alan reminds us the importance of strangers in our lives and the companies and organizations where we work.  In this Facebook world we live in, where many of us may have thousands of friends, Alan reminds us that friends can only get us so far..they are often reflections of ourselves.  While these might be comforting in a scary, for us to grow we must get out of the comfort zone in order to reach  our full potential?\n\nWe are a society that worships great ideas and often think that you must be brilliant like a Jobs or Zuckerberg.  Alan reminds us that most great ideas are borrowed from strangers and that the answers to our problem might be right and front of us.  He references  the Census, a process remained unchanged for nearly two centuries, and how it was improved by learning from our friends at UPS . That ITunes is merely a takeoff of The Great Library in Alexandria.  That most new drug discoveries are not being uncovered in isolated laboratories, but in faraway places that have treated these diseases for hundreds of years.\n\n99% of all ideas embrace the brilliance in the world around us. Curiosity. Humility. Respect.  While we all cannot be brilliant, we all can be curious, humble and respectful.  It is these arrows we need in quivers to reach our full potential,", "summary": "Review: The Necessity of Strangers", "unixReviewTime": 1398988800}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "04 11, 2014", "reviewerID": "A3VF3A5A3O04E1", "asin": "1118461304", "style": {"Format:": " Kindle Edition"}, "reviewerName": "spsanders", "reviewText": "A compelling book about why we should not be afraid to ask for help from the strangers around us. Unexpected ideas can develop that enhance our talents.", "summary": "Strangely Interesting", "unixReviewTime": 1397174400}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "03 20, 2014", "reviewerID": "A14DW5UMQ1M96O", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Mike Jannini", "reviewText": "Alan Gregerman's consulting work and writings have helped me and many fellow executives keep our businesses competitive through enhancing our innovation capabilities.  In his most recent book, The Necessity of Strangers, Alan gives us additional pathways and processes to boost the quantity and quality of innovation in our organizations.  I used Alan's insights to enhance my efforts at Marriott International and the Cheesecake Factory Incorporated and will continue to refer to Alan's insights to assist me in my future professional endeavors.\nMike Jannini", "summary": "The Power of Innovation", "unixReviewTime": 1395273600}
{"overall": 4.0, "verified": false, "reviewTime": "02 27, 2014", "reviewerID": "A2V7UVKOFG57IW", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "William Dahl", "reviewText": "So refreshing to read something that provides unique insights into a subject area few authors have dared to explore. The authors young daughter piqued his interest in the subject and launched this noble literary endeavor. In an age that seems to be enamored in what we have in common - The Necessity of Strangers provides a landscape of confirmation about the value of the unfamiliar, difference, and things strange. A book that would be of interest to management consultants, marketing types and those involved in learning professions of all types. Like I said, I adored this work. I believe you will too.", "summary": "Adored this book", "unixReviewTime": 1393459200}
{"overall": 4.0, "verified": false, "reviewTime": "01 30, 2014", "reviewerID": "A2BM5NTLX7CES1", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Taylor Ellwood", "reviewText": "In this book, the author argues that strangers are an essential part of innovation and that to truly cultivate creativity and innovation we need to be open to new ideas, meeting strangers and learning from different cultures and disciplines outside of our own culture or discipline. The author illustrates this point through a variety of case studies in both business and everyday life to demonstrate how contact with strangers can be helpful for sparking innovation. While the case studies are interesting the author doesn't really explain how to implement these ideas. This is a good book to read to inspire you to be open to learning from other people, but while the author provides a couple of ideas on how to do that, for the most part what he discusses is shared as ideas as opposed to really examining how to implement these ideas meaningfully.  Still I recommend reading this book to challenge yourself to be more open to new ideas.", "summary": "Why strangers make innovation occur", "unixReviewTime": 1391040000}
{"overall": 5.0, "verified": false, "reviewTime": "01 18, 2014", "reviewerID": "A1EQ5D5JRSW23K", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Erol Esen", "reviewText": "What a great title this book has, The Necessity of Strangers! If you read Jared Diamonds book \"Guns, Germs, and Steel\", and then read this book, youll get a much better appreciation why this title matters in todays world. Its about exploring, connecting with new people and ideas, and to combine these ideas to create new, and to grow intellectually, spiritually, and wealth. The World as we know it didn't happen overnight.", "summary": "we're all born a stranger, let's get to know one another", "unixReviewTime": 1390003200}
{"overall": 4.0, "verified": false, "reviewTime": "01 17, 2014", "reviewerID": "A1R2JUOGIYH6HO", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "The title of this book is what caught me and I was hooked from there. This is a great read full of studies and insight into how we work as individuals and as groups. I learned a lot and was impressed with how easy it was to wade into.", "summary": "insightful read", "unixReviewTime": 1389916800}
{"overall": 5.0, "verified": false, "reviewTime": "01 16, 2014", "reviewerID": "A3JRW716H3AX14", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Scott Lloyd", "reviewText": "This is a well written book that reveals many counterintuitive ideas regarding how we think about those outside out tribe. This is an excellent book to shake up your thinking about social groups.", "summary": "Easy to read, counterintuitive", "unixReviewTime": 1389830400}
{"overall": 4.0, "verified": false, "reviewTime": "01 15, 2014", "reviewerID": "A3KGLXW3EYDTUH", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "ck", "reviewText": "Common sense and openmindedness are at the heart of Alan Gregerman's tome in praise of strangers. In clear and affable fashion, Gregerman guides his readers in an almost Socratic manner to embrace the insights and wisdom that are available to us once we look beyond the known.\n\nOddly -- or fortuitously -- enough, you and I are engaging in one of the practices he suggests in his book. One of the hallmarks of Amazon is its growing library of peer reviews and images. We don't know each other, and yet you paused in your consideration of this book to find out what earlier readers thought about it. And this is not a one-way street; there's every chance that you may use the \"comment\" function to add a question or other thought that would transform this from one person's observations and reflections into a conversation.\n\nMeantime, back to&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/The-Necessity-of-Strangers-The-Intriguing-Truth-About-Insight-Innovation-and-Success/dp/1118461304/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Necessity of Strangers: The Intriguing Truth About Insight, Innovation, and Success</a>. Gregerman begins with context, reviewing reasons for the common mistrust of strangers before illustrating how small even the largest personal network is likely to be. The nod to Socratic method begins with him asking readers to think about effective ways of gathering information, improving product, and thoroughly understanding our underlying mindset -- why we think the way we do, and how we can stretch ourselves beyond the status quo.\n\nAfter exploring context, which he calls framework, Gregerman asks readers to consider how to translate interacting with strangers from abstract to concrete: using these new relationships to spur innovation, collaboration, leadership, and customers, both existing and new (yet more \"strangers\"). Before setting us loose on a newly inviting world, Gregerman provides a succinct toolkit of strategies and techniques that we can begin using in everyday situations, as well as ways to spur our thinking and reflection.\n\nHe makes many thought-provoking points, and I believe they are best read in sequence. In fact, if you have an e-reader, you may want to buy the digital version so that you can highlight and annotate particularly salient thoughts.\n\nHowever, it is worth touching on the four guiding principles that are at the heart of this book. \"Humility--the belief that we don't know everything and that we can always be better at the things that matter most. Curiosity--our innate gift for being open to new ideas, new people, and new possibilities. Respect--the belief that everyone matters and that we learn and grow by engaging other people on their own terms. Purpose--our reason for being that guides our efforts to learn and grow.\"\n\nAlthough most of  Gregerman's examples and prescriptions deal with the workplace, they are readily applicable to life beyond the office, and even to one's own reflective practice. Indeed, one of the overarching principles is to seek out differences -- different outlooks, different areas of expertise, and even different lands -- and almost immediately to build human bridges of commonality. Particularly dear to my heart is his repeated statement that travel enriches the traveler and brings the world closer. In that vein, if you'd like, please do feel free to treat this review as the start of a conversation.", "summary": "Friends we have yet to meet", "unixReviewTime": 1389744000}
{"overall": 3.0, "verified": false, "reviewTime": "01 11, 2014", "reviewerID": "A1B70ZEWQ6UH1A", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "JustMe", "reviewText": "The stated premise of the book, that strangers can improve your insight, innovation, and success, is true and is a relevant topic.  Gregerman presents a genial book that I wanted to like. OK, I did like it, but was still left disappointed because it didn't really deliver what it promised.  This isn't really a book about strangers, or being open to the influence of strangers, it's about openmindedness in general.  That's a fine topic too, but one that I have already read and thought extensively about.  That is why I was excited to find a book that would delve deep into one aspect of that -- openmindedness toward strangers.  Alas, this did not deliver.  IF you are looking for a fun and light, but still useful, book on openmindedness, in general, you should be very pleased.  This book offers a shallow look at many dimensions of openmindedness.\n\nEarly on, Gregerman writes, \"It may seem counterintuitive that strangers are to be embraced rather than ignored or avoided, but they are a necessity -- precisely because of their differences and what they know that we don't know; their objectivity and ability to be open and honest with us about the things that really matter; and their capacity to challenge us to think very differently about ourselves, the problems we face, and the nature of what is possible.  Finding and engaging the right strangers has the power to make all of us more complete, compelling, innovative, and successful.\"  This is exactly what I wanted, but Gregerman doesn't go into details on this.  He basically just tells us to talk with people.  Very general.  Indeed, the first chapter, Necessity, would have made a great article or Kindle Short, as that is where the heart of the idea is.  It's a great chapter in an otherwise average book.\n\nIn chapter 4, Innovation, Gregerman tells us to ask ourselves these 8 questions:  What's our best thinking to date?  What's the best thinking in our industry?  What's the best thinking in other industries?  What's the best thinking from popular culture?  What's the best thinking in other cultures?  What's the best insight from nature?  What's the best insight from science?  What are the best possibilities from science fiction?  OK, good questions, and Gregerman gives each a paragraph telling us why it is a good question, but does not give guidance on how to actually answer the questions.\n\nGregerman really stretches the definition of stranger.  At one point he uses fish as a \"stranger\" and discusses how the schooling behavior of fish led to innovations in accident avoiding cars.  Really, fish as strangers?  Isn't this really about openmindedness in general, and not openmindedness to strangers specifically?  Gregerman explicitly sidesteps the issue of strangers by stating that his approach is \"driven by the reality that in many ways almost all of us are strangers.\"  So, are we talking about openness to strangers, or about openness to people in general?  Why did the title of this book not refer to openmindedness rather than strangers?\n\nSome other books also offer insight into what strangers have to offer.  Check out Give And Take, by Adam Grant, which has more to offer than this book does, even though the premise is a bit different.  The Geography of Happiness may also be worth a look, though it is primarily about personal benefit, not business; but of course, these are entwined.  Another book, that Gregerman refers to is Carol Dweck's Mindset: The New Psychology of Success, which is specifically about openmindedness and closemindedness.\n\nGregerman seems like someone I would love to meet in person and talk with.  Really wish that he had examined the stated topic in more detail so that I could leave a more enthusiastic review.  Gergerman's last paragraph is a good summation of his book, so I present it here.  If this is what you actually want to read about, rather than an in-depth look at strangers, then you should enjoy this book:  \"Use these resources as a starting point for stretching your thinking or as a call to action to look in new places for ideas that could make a real difference to you and your organization.  Then commit to the regular habit of picking up a book or ebook, reading a magazine or blog, or watching a movie or TV show that takes you off of your well-beaten path -- not because everyone else around you is doing so, but because it might take you to a new and remarkable place where the possibility of a breakthrough awaits.\"", "summary": "Fish are strangers?", "unixReviewTime": 1389398400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "01 8, 2014", "reviewerID": "A2I5QME4S7CLFI", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Laura F.", "reviewText": "I usually find business books a re-hash of the same old advice, but \"The Necessity of Strangers\" certainly disproves that theory.\nAlan Gregerman offers a smart, common sense approach to thinking outside the box and being open to the possibilities all around us. If you want to challenge your thinking on innovation and collaboration, this is the book for you.", "summary": "A New Twist on Out-of-the Box Thinking", "unixReviewTime": 1389139200}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "01 6, 2014", "reviewerID": "A33HIV8RXRDM88", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Kanishk Rastogi", "reviewText": "Seriously! We always get this career advice \"you gotta know the right people\", but no one else ever talked about the \"necessity of strangers\" in a successful professional life. Strangers are a necessity because of their differences and what they know that we don't know.\n\nThe author has described his work as Explore, Connect, Innovate, Grow...a simple 4 word approach each of which is self-explanatory in the context of professional growth. It is \"Innovate\" area where strangers can help you most by providing an objective opinion and being able to challenge you to think differently, and drive you out of your comfort zone.\n\nFurther, the author compares the small limits of exploring only within your network by comparing the magic number of \"150 active connections of an averagely connected person\" with the overall population of strangers i.e. 7 billion.\n\nAlmost all the chapters have some \"key points to remember\" which you may find redundant if you read management and leadership books, but overall the text does not get boring or mundane since there are small stories and anecdotes to draw comparisons and analogies.\n\nHowever, the key lesson learned is that interaction with strangers will always help you to fill the knowledge gap which you or your own existing network may not be able to fill. So, one need to keep expanding his network and seek their help to innovate and grow.", "summary": "First 20 pages will convince you to read it full cover to cover", "unixReviewTime": 1388966400}
{"overall": 5.0, "verified": false, "reviewTime": "01 6, 2014", "reviewerID": "ASHO96ZB8AL1Z", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Lindsey W", "reviewText": "As church leader, I'm often trying to find new and innovative ways to do things, and I'm fortunate enough to have a near constant stream of \"strangers\" come through the doors of the church each week.  I would love to learn how to utilize this opportunity more effectively.  This book does a great job demonstrating the power of working with strangers as well as giving some terrific practical advice about how to gather ideas and implement them.  A terrific book for leaders in any industry!", "summary": "Really interesting, great for leaders!", "unixReviewTime": 1388966400}
{"overall": 4.0, "verified": false, "reviewTime": "12 30, 2013", "reviewerID": "A3ANAWYJOX02BE", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "WendyWoman", "reviewText": "As a former job seeker 2 times over, I was told again and again to build my network and rely on that network of friends and close contacts to help me in my job search. It makes a lot of sense and it's what you're told again and again.\n\nMany job seekers in organizations I joined were on LinkedIn, but they didn't want to link to anyone that they did not know well enough that they would not give them a stellar recommendation. The thinking is, don't link in with anyone who might not have a stellar reputation or they might drag down your reputation. I can see that point, but if I met you at a networking event and you seem reasonably nice and helpful, why not link in with you? Why be so suspicious? If I make it clear to others in my network who might inquire about someone I'm linked with, why not be completely candid and say \"I met them in a networking event and they seemed nice, but I haven't worked with them before so I can't vouch for their work habits or reliability\". How often do you really get asked about someone in your LinkedIn network anyway?\n\nThis book served to encourage my more open-minded view of growing my network. I wouldn't link with someone I knew nothing about, but if you've met them and have a positive impression why not offer to help them?\n\nIt is important to know what this book defines as a \"stranger\" as you begin to read. Most of us think of strangers as someone we know nothing about. The author broadens this to include people we think we know well but really don't. Or someone we know very casually. I wouldn't categorize these types of people as \"strangers\" but I think it makes a better book title to say \"The Necessity of Strangers\" than \"The Necessity of Acquaintances and Strangers\". The latter title would be more accurate, but I guess it doesn't have the concise sizzle for selling books.\n\nThe book is an interesting concept. Opening yourself to insights and possibilities offered by people who have been raised in a different environment/culture is a good idea. Even just listening to viewpoints from others could help you consider avenues you did not consider earlier and help lead to greater success in your personal and business life.\n\nAll in all, I consider this a good book. It encourages thinking beyond your immediate circles which is good encouragement for those of us who are New Englanders and tend to stick to our circles rather than venturing out and listening to new ideas.", "summary": "Your best network may not be those you know best", "unixReviewTime": 1388361600}
{"overall": 4.0, "verified": false, "reviewTime": "12 29, 2013", "reviewerID": "ABEAUXVVB2E1M", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Linda Armstrong", "reviewText": "Author Alan Gregerman, ([...] a business consultant and adjunct professor at Georgetown University offers eight pages of additional resources at the end of his fascinating book, saying, \"..these books articles, and websites,,,have formed an essential part of the mix that became 'The Necessity of Strangers.' You might say that I started with a large pot and a simple idea, threw in some water, and a few stones, and then wandered around looking for ideas, insights, and perspectives from a world filled with strangers.\" As you can tell, he includes the authors of books, articles, and websites, as well as ordinary people he encounters in the course of performing the small and large duties of life, in his definition of stranger inspiration. His business audience (Jossey-Bass) is very familiar with the former. Coming out of MBA programs, they look for help from books and articles all the time. It is the latter source of fresh thinking that they may, apart from surveys and polls. ignore. He also points out the importance of the fact that in many interactions, the parties are strangers. Smart business people take this into consideration and make every effort to establish relevant common ground. This seems obvious, but it is a significantly different way of thinking about customer service, collaboration, personnel relations, technological change, innovation, and leadership. The book is well-written, well-organized, and peppered with interesting examples, but it mainly argues for a change in attitude, and if you are a bottom-line business type looking for a quick, ready-made prescription to solve your problems, you may be disappointed. There are no charts or graphs or results of studies. Instead the author offers a road map and directions to set you off on your own journey. If you accept his challenge, he will be the first of a legion of strangers who will transform the human landscape around you.", "summary": "A New Way of Looking at the Sources of New Ideas", "unixReviewTime": 1388275200}
{"overall": 5.0, "verified": false, "reviewTime": "12 29, 2013", "reviewerID": "AQCJWSMSURQI2", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "A Customer", "reviewText": "With talk constantly of \"working your network\" and leveraging your friendships, we lose the importance of expanding our friendships beyond a comfort zone:  to strangers.  Strangers are intimidating, may not want to be engaged, but are valuable to expand your universe and world view.\n\nOnce I went to a conference (as a junior person) with some executives from my company.  The executives interacted with each other, and with some people who worked at another location for the same company.  I leveraged my contacts to meet others at the conference, and just downright introduced myself to people.  I was far better at solidifying new business contacts than people who had far more experience than I, only because I was more gregarious and wanted to meet others.\n\nGregerman expands on this concept very well, and points out the many advantages of dealing with \"new blood\" as opposed to the same old people.\n\nWell written with good examples, \"The Necessity of Strangers\" is an important book for someone looking to expand beyond their sphere and learn from, and teach, others.", "summary": "\"A stranger is just a friend I haven't met yet\"", "unixReviewTime": 1388275200}
{"overall": 3.0, "verified": false, "reviewTime": "12 27, 2013", "reviewerID": "A2RQ0AT4XZUIXL", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Dr. Cathy Goodwin", "reviewText": "In  this engaging, readable book, author Gregrerman argues that business and personal growth come when we are open to interacting with strangers. This advice isn't especially new; as the author notes, Granovetter's concept of \"weak ties\" has become familiar. However much I wanted to like this book, I found it hard to identify insights that were truly new and novel and the recommendations, in some cases, impractical.\n\nFor instance, on page 26, the author suggests tips to create a plan for success. It's pretty standard: set an objective, develop a plan and so on. One step, \"Find strangers to fill those [knowledge] gaps,\" makes a lot of sense; it's the essential premise of networking. But these days, getting strangers to share information requires fairly sophisticated networking skills.\n\nWhile the book's premise relates to the importance of strangers, a good part of content is about overcoming resistance to people who might seem to have nothing to teach us. The issue here doesn't seem to be about strangers but about topics related to stereotyping and false appearance. It's important to differentiate true strangers from those we meet in a familiar setting that confers credibility.\n\nAdditionally, the people who gain most from dealing with strangers tend to transform the relationship so they're now dealing with friends and personal acquaintances. The stranger factor disappears! For instance, the author describes a meeting with a university administrator who becomes a mentor and advocate. Although the two were strangers initially, they met in a fairly structured situation that was conducive to creating a relationship, and at some early point they stopped being strangers\n\nPerhaps our real challenge is not about breaking down barriers with strangers, but deciding which strangers to approach and how to assess their input. Career changers are urged to seek help from experts in their industry, yet often the \"advice\" they get is inappropriate; however, these people can be valuable as informational resources when approached with carefully designed questions.\n\nIn the end, the stranger question becomes both simple and complex. Yes, we will grow by interacting with diverse people who are outside our inner circles. However, sometimes resistance to strangers can help us avoid traps, especially when we're paying or placing ourselves in a vulnerable position.\n\nFor instance, the author says he met his wife by connecting with strangers in a particularly clever way - offering a big reward to friends who'd set up an introduction. Sure, these women were strangers, but they were already connected through his own friends, creating an effective filter.\n\nThe toolkit at the book's end includes some useful but not entirely novel ideas. In my experience the best way to meet new people in a meaningful is to engage in some new activity. His idea to \"get out of the office\" is a good start, but what about joining a new gym or a new club, trying new networking events, or even taking a class that brings you in contact with people you wouldn't meet otherwise?\n\nOverall the book entertains.  You might have some interesting conversations and talking points when you share the examples But the title leads us to expect something that radically shifts our mindset ... sort of like what happens when we connect with strangers.", "summary": "Good topic, very entertaining, not truly new and novel", "unixReviewTime": 1388102400}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 24, 2013", "reviewerID": "ALZ2S4839OZUQ", "asin": "1118461304", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Darrell A. Kammer M.D.", "reviewText": "Very thought provoking. Hits the nail on the head when I look at my own experiences with strangers on airlines, etc. Most of these encounters have been very educational giving me insights I would never have realized. I work with a non-profit organization that continues to benefit from international exposure resulting from a meeting with a reporter while on an airliner.  I would strongly recommend this book to anyone. The fact that I depend on reviews, like this one, to help with my purchases makes his point!\nD.Kammer", "summary": "Best recent book purchase!!", "unixReviewTime": 1387843200}
{"overall": 5.0, "verified": false, "reviewTime": "12 18, 2013", "reviewerID": "A1INE33UQ1B4Q3", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "booktalk29", "reviewText": "The insights this book provides are remarkable -- Gregerman delivers actionable advice concisely with a clear, even playful prose. His observations on the importance of spontaneity are thought-provoking and remind me of other books like \"Anti-Fragile.\"\n\nOverall, a short but information-packed read! Definitely recommend.", "summary": "Fantastic Ideas!", "unixReviewTime": 1387324800}
{"overall": 4.0, "verified": false, "reviewTime": "12 14, 2013", "reviewerID": "A1H6JP5UC5WVT7", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Edward G.", "reviewText": "When I first read through The Necessity of Strangers, it seemed to tell the same old stories about innovation that you see told over and over again. Yet another consultant out there making money telling clients to do this and do that to improve their business, where almost any action will help. Not much unique or valuable about those kinds of consultants.\n\nSo after skimming a few chapters I put the book on my unread books pile for a while and moved on to other books. When I picked the book up later, though, I was more impressed. I tried some of the practical suggestions Alan Gregerman gives at the end of his chapters, and they seemed to work. They were more than just gimmicks, but helpful tools.\n\nThat said, I'm still not sure which book most readers will experience. The trite rehash or the helpful guidance. Perhaps it's worth reading the book to find out.", "summary": "My feelings about this book are mixed", "unixReviewTime": 1386979200}
{"overall": 5.0, "verified": false, "reviewTime": "12 10, 2013", "reviewerID": "AHUT55E980RDR", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Neal Reynolds", "reviewText": "As children, we were all warned against strangers.  Some of us carried that feat and distrust of people we haven't been introduced to into adulthood.  As business people, this fear and distrust now works against us.  We need to be more open to what we hear from all sources.\n\nWell, Alan Gregeman himself is a stranger to me, but he sure makes sense in his book.  Our friends make up an insignificant percentage of the world's poulation so closing our ears to strangers is closing ourselves to most of the world.\n\nThis book makes lots of sense.  Gregeman in a conversational, rather than academic, tone illustrates the value these \"strangers\" hold for us.\n\nThis is a book that will open your eyes, ears, and heart to new perspectives and perceptions.  This is a book for all of us and although I'm a stranger to most of you, heed my advice and read this book.  Trust me.", "summary": "Splendid advice", "unixReviewTime": 1386633600}
{"overall": 5.0, "verified": false, "reviewTime": "12 7, 2013", "reviewerID": "A1DGVGJ55SB5PV", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Mara", "reviewText": "Dr. Gregerman presents an important message for leaders in a range of organizations in an entertaining, motivating format. He forces the reader to challenge basic assumptions about how we develop networks and how to prioritize relationships. It's a great read for those interested in topics from change management to innovation.", "summary": "Challenging assumptions", "unixReviewTime": 1386374400}
{"overall": 5.0, "verified": false, "reviewTime": "12 7, 2013", "reviewerID": "A1F1A0QQP2XVH5", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Mark B", "reviewText": "I like business books that approach topics and issues  (even if they are obvious topics and issues) from a new perspective.  This book specifically addresses the need for us to overcome our natural, built-in aversion to dealing with \"strangers.\"  The books spends a lot of time demonstrating that this aversion is something that is part of the human make-up, and then shows how this aversion hinders our innovation, creativity, collaboration,  and ability to lead.  I read two or three business books per month, and none of them have yet addressed this interesting point of view in quite this way.  It seems like an obvious point, but this book really made me think about how to engage with \"strangers\" and I actually now find myself seeking out others and engaging in better conversation.  At a conference I recently went to, I actually found myself making an effort to meet other vendors to learn more deeply about what they do.  When we do this, we expand our horizons, get out of our limited point of view, and can innovate and lead better.  So, I gave the book five stars for presenting a new approach to something \"obvious\" and making a difference in the way I approach business.  I knocked it one star for being way too lengthy in some places (a typical business book problem these days).  But I gave it one star back for providing a \"Toolkit\" at the end of the book to help the reader apply the principles presented throughout the book.  This is a great idea and I wish every business book did this.  So, did I learn something? Yes.  Is it something I can apply that will make a difference? Yes.  Did I find a few \"a-ha!\" moments and did I find myself highlighting and taking notes?  Yes.  This is a business book that I can highly recommend.", "summary": "Good business book with a new perspective", "unixReviewTime": 1386374400}
{"overall": 3.0, "verified": false, "reviewTime": "12 5, 2013", "reviewerID": "A2QKCOX5ACRHC5", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Jijnasu Forever", "reviewText": "In a breezy, conversational book, Gregrerman implores the reader that a \"growth\" mindset predicted on recognizing the gaps in one's personal/business plans and the willingness to reach out to strangers to learn from and fill that gap - is a dependable way to innovate/grow.  For a book that is billed as \"counterintuitive\" and \"provocative\", that advise may seems fairly formulaic.  Nevertheless, the ample use of anecdotes and some personal experiences are used to illustrate some simple (to understand, at least) techniques that can reduce one's reluctance to reach out and collaborate with \"strangers\".  The message is elegant, simple, and can be quite useful - one wishes that the editing was a little stricter (with about 200 pages, the message is amplified many times in the book) and more careful in some of the recommendations (some brilliant ones related to orientation of new hires get mixed with not-so-great ones regarding promotions).  With ample references to other pop psych books on incentives, motivation and leadership, Gregerman provides a potentially powerful message to reframe one's approach on growth.", "summary": "An elegant and simple message", "unixReviewTime": 1386201600}
{"overall": 5.0, "verified": false, "reviewTime": "12 4, 2013", "reviewerID": "A2SY92ZXU2FOEU", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "sanoe.net", "reviewText": "I had zero expectations of Alan Gregerman's \"The Necessity of Strangers.\" In fact, I forgot that I got it until it arrived and I probably would have set it aside except that I read the book flap and was intrigued again.\n\nI'm a creature of habit but Gregerman's theorizes (successfully) that it isn't the team you know but perhaps the constructive team that you don't know that pushes individuals and businesses towards innovation.\n\nAfter reading this very concise and well laid out book, I'm inclined to agree when I think of my own work history. It was when there was a constant flow of 'strangers' that I stayed on my toes and my mind was sharp.\n\nBeing in the 'back' now, I'm not as exposed to clients, internal or external, so this book is actually very timely for me.\n\nGregerman organizes the book into 3 parts. The first is Framework that explains why we need 'strangers' and the second part is 'Practice' in how it can work and it makes up the bulk of the book. The final part is Possibilities which is almost superfluous compared to the previous parts but it was like a reward of sorts.\n\nVery well done.", "summary": "Definitely something that I needed to read", "unixReviewTime": 1386115200}
{"overall": 5.0, "verified": false, "reviewTime": "11 27, 2013", "reviewerID": "A3MWXF2CLXHBRI", "asin": "1118461304", "style": {"Format:": " Hardcover"}, "reviewerName": "Catherine Jo Morgan", "reviewText": "For some reason I found it hard to get into this book, although I dipped into it here and there for a while. The basic premise -- that communicating with strangers is a key to new creative ideas -- seemed unarguable but -- so what? A whole book about it?\n\nWhen I read the last section, though, I found so many useful ideas that I was startled into real enthusiasm. I found ideas I could readily apply to my own one-person business, my church, and to my daughter's department in a large corporation. There are also suggestions for further reading that look very useful. So I'd definitely give this book a thumbs-up!", "summary": "Some great ideas with wide applicability", "unixReviewTime": 1385510400}
{"overall": 5.0, "verified": true, "reviewTime": "03 20, 2015", "reviewerID": "A3SHVDMM83IHJ4", "asin": "B00002N7IL", "style": {"Size:": " Pack of 1"}, "reviewerName": "steve crumpler", "reviewText": "Just what I needed for my electric range. Matched pigtail cord and works great.", "summary": "Matched pigtail cord and works great.", "unixReviewTime": 1426809600}
{"overall": 5.0, "verified": true, "reviewTime": "04 20, 2013", "reviewerID": "A2OXDRWBASV91Y", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Harold E. Ewing", "reviewText": "I like the fact that the wire ends have mounting tips assembled and that the cord has a strain relief clamp included.\nI'd recommend this to any diy person", "summary": "complete package", "unixReviewTime": 1366416000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "03 16, 2013", "reviewerID": "A2KG6AWJSWILPR", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Christopher J Park", "reviewText": "Needed another couple of feet with new dryer, perfect fit.  Gives you more options then the shorter cords normally sold.", "summary": "Perfect Fit", "unixReviewTime": 1363392000}
{"overall": 5.0, "verified": true, "reviewTime": "02 14, 2017", "reviewerID": "A2CBE6VYOARZN4", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Gerry", "reviewText": "Good quality at a reasonable price", "summary": "Everything works", "unixReviewTime": 1487030400}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2016", "reviewerID": "AVKOTZD5ZIOX5", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Dan W.", "reviewText": "Planning on hooking this to my RV", "summary": "50 amp cable", "unixReviewTime": 1482278400}
{"overall": 5.0, "verified": true, "reviewTime": "04 15, 2016", "reviewerID": "A33DUVUIC7G553", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Ryan", "reviewText": "This product is a pretty simple one.  I do like prettymuch any product made by Southwire, they make good stuff. Coleman cable is now a subsidiary of Southwire.  If you go to your big box stores, most of the Romex you'll buy is made by Southwire, same with THHN / THWN you'd buy for conduit.\nI like to stick with brands I trust to make good products.\n\nI have no particular complaints about this, fits well in Leviton 14-50r as expected.  Well constructed and sturdy.  I like the 6-foot model so it's easier to install and pull out my range if needed.  Installation is simple with the prongs crimped on.", "summary": "Good range cord, standard nema 14-50p fits with nema 14-50r", "unixReviewTime": 1460678400}
{"overall": 4.0, "verified": true, "reviewTime": "12 27, 2015", "reviewerID": "A2E8Q13IQL62XN", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "ken", "reviewText": "WORKED GREAT", "summary": "Four Stars", "unixReviewTime": 1451174400}
{"overall": 5.0, "verified": true, "reviewTime": "06 17, 2015", "reviewerID": "A217M6GCFYSEVT", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Randy D Etheridge", "reviewText": "very good quality.  used as a feeder line to my 50amp fuze panel box in my enclosed trailer", "summary": "very good quality. used as a feeder line to my ...", "unixReviewTime": 1434499200}
{"overall": 5.0, "verified": true, "reviewTime": "05 14, 2015", "reviewerID": "A7S6BILPA0K7K", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Bill S.", "reviewText": "Excellent", "summary": "Five Stars", "unixReviewTime": 1431561600}
{"overall": 3.0, "verified": true, "reviewTime": "05 6, 2015", "reviewerID": "A2Y7GJMFR0886X", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "JI", "reviewText": "The cable works well and does what it should, so why only three stars? Maybe my expectations were unrealistic, but it was very difficult to maneuver the wire around, and difficult to get attach the ends in. They aren't the loops as pictured, rather squared prongs, which you can find pictures on other products. This made it more difficult in the application I had.", "summary": "The cable works, but was hard to maneuver and wasn't exactly as picture", "unixReviewTime": 1430870400}
{"overall": 5.0, "verified": true, "reviewTime": "02 11, 2015", "reviewerID": "AWHWKFAVSH827", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Chad T.", "reviewText": "Most range cords are barely aduaqute for the amps they claim. This one is spot on and is great for anyone who likes to over do things like myself. The ones for sale at most home stores are for the \"typical\" install of 30-40 amps. This one is sized for a full 50 and it great because for my project I wanted to run a 50amp circuit to be used for other things like a welder. Although I am currently only using it to power a car charger that can at max pull 30amps. It's better to over size all the wiring which means less heat. Especially when you are charging a car for up to 10 hours.", "summary": "Largest Gauge I Could Find", "unixReviewTime": 1423612800}
{"overall": 5.0, "verified": true, "reviewTime": "01 29, 2015", "reviewerID": "A3UBM76TF3P37B", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Jordan Cooper", "reviewText": "product worked well, delivered on time", "summary": "Five Stars", "unixReviewTime": 1422489600}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2015", "reviewerID": "A2SNAR3RIPRR9B", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Dave", "reviewText": "Very good quality.  Just as advertised.", "summary": "Great cable", "unixReviewTime": 1421107200}
{"overall": 5.0, "verified": true, "reviewTime": "12 17, 2014", "reviewerID": "A22U6Z2M9TO90N", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "ChrisB.", "reviewText": "Cheaper than locally, cant go wrong.", "summary": "Five Stars", "unixReviewTime": 1418774400}
{"overall": 5.0, "verified": true, "reviewTime": "10 25, 2014", "reviewerID": "AQ6PDHDC227KE", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Ralph Baker", "reviewText": "Thank you done as promised", "summary": "Five Stars", "unixReviewTime": 1414195200}
{"overall": 5.0, "verified": true, "reviewTime": "10 22, 2014", "reviewerID": "A25RLL7WVGMH9B", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Eaglesnest", "reviewText": "Exactly what I needed and priced right!", "summary": "Five Stars", "unixReviewTime": 1413936000}
{"overall": 5.0, "verified": true, "reviewTime": "09 27, 2014", "reviewerID": "A9EJSFFDNX7ZT", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "CQB Techno", "reviewText": "Very well made, Sturdy. It performs as advertised. Delivery was fast, packaging great.", "summary": "Well made", "unixReviewTime": 1411776000}
{"overall": 4.0, "verified": false, "reviewTime": "09 3, 2014", "reviewerID": "A1GYDCCJW8CORK", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Loretta H", "reviewText": "did what it was intended for", "summary": "Four Stars", "unixReviewTime": 1409702400}
{"overall": 5.0, "verified": true, "reviewTime": "07 26, 2014", "reviewerID": "A3BJS0U3PZM3X1", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "malaqua", "reviewText": "I bought this cord as the power cord for the Connecticut Electric CESMPSC41GRHR power box reviewed elsewhere. It worked perfectly, using the proper cable gland nut to mount it into the power box. The 4 ft length of flexible cable and the installed 4 prong plug allowed me to conveniently plug the cord and CE power box into a 4-wire 50 amp rv pedestal and have 2 additional power circuits available for use on my RV. The cost of the cable was much less than fabricating the same size wire and building the cord from scratch.", "summary": "Nice power cable", "unixReviewTime": 1406332800}
{"overall": 5.0, "verified": true, "reviewTime": "07 21, 2014", "reviewerID": "A3CJX4WBAVRK01", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Debbie", "reviewText": "easy to install.  just what I needed for my new stove.  fast delivery.", "summary": "Five Stars", "unixReviewTime": 1405900800}
{"overall": 5.0, "verified": true, "reviewTime": "05 13, 2014", "reviewerID": "A11QC8XY4UEWI7", "asin": "B00004SQHD", "style": {"Size:": " 6 ft", "Style:": " (Old)"}, "reviewerName": "Hawaii Shopper", "reviewText": "Used for my Bosch EV car charger so it is not hard wired.  Allows the device to be unplugged and no crimping tools needed to terminate the main electrical wires feeding the device.", "summary": "Great price and quality", "unixReviewTime": 1399939200}
{"overall": 5.0, "verified": true, "reviewTime": "12 10, 2013", "reviewerID": "A216Q289O6I5BD", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (New)"}, "reviewerName": "GlacierBabe", "reviewText": "Due to the nature of this item there is really not much to say except that it works and appears to be a high quality cord.  It meet the specifications for the range it supplies power to and met the approval of our electrician.  I would purchase another one if I had need of it.", "summary": "Good quality cord", "unixReviewTime": 1386633600}
{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2013", "reviewerID": "A1F8KMYRU1WEF2", "asin": "B00004SQHD", "style": {"Size:": " 4-Foot", "Style:": " (Old)"}, "reviewerName": "Darlene and David", "reviewText": "Worked perfect and was cheaper than the same thing at Lowes. I put it on my oven and plugged it in. No complaints.", "summary": "It's an over cord", "unixReviewTime": 1383955200}
{"overall": 5.0, "vote": "30", "verified": false, "reviewTime": "12 9, 2007", "reviewerID": "A2UAX5WTHHKBBF", "asin": "B00004YWK2", "reviewerName": "Mark S. Holden", "reviewText": "This allows you to switch from venting your dryer outside in the summer to venting it inside for the heating season - with a fine screen lint trap for the inside outlet.\n\nIf you vent outside, you're throwing away moist warm air.\n\nThis is a dirt cheap way to save a little on your heating bill and get extra humidity in the air.\n\nThey're very easy to install.  And once it's in it'll last for years.\n\nYou'll probably save enough to pay for it at least once a year.", "summary": "A wonderful idea.", "unixReviewTime": 1197158400}
{"overall": 3.0, "verified": true, "reviewTime": "06 6, 2017", "reviewerID": "A2DHQKNGSYEHLS", "asin": "B00004YWK2", "reviewerName": "Radek", "reviewText": "The bands are quite useless.\nThe mesh is not fine enough", "summary": "Three Stars", "unixReviewTime": 1496707200}
{"overall": 4.0, "verified": true, "reviewTime": "03 14, 2017", "reviewerID": "AZ1F62XGI25RS", "asin": "B00004YWK2", "reviewerName": "Jocivus lopez", "reviewText": "This was just what I was looking for. The service and price were very good. It works great.", "summary": "The service and price were very good. It works great", "unixReviewTime": 1489449600}
{"overall": 5.0, "verified": true, "reviewTime": "03 13, 2017", "reviewerID": "A2G1T9MVZLOHNG", "asin": "B00004YWK2", "reviewerName": "Poodlehead", "reviewText": "Works great!", "summary": "Five Stars", "unixReviewTime": 1489363200}
{"overall": 5.0, "verified": true, "reviewTime": "03 10, 2017", "reviewerID": "A17109KS0DCTOG", "asin": "B00004YWK2", "reviewerName": "roger erwin", "reviewText": "It is a good .put the heat in my house when needed. And out when not needed.", "summary": "It is a good. put the heat in my house when needed", "unixReviewTime": 1489104000}
{"overall": 4.0, "verified": true, "reviewTime": "01 30, 2017", "reviewerID": "A1JDEW40HQHX0R", "asin": "B00004YWK2", "reviewerName": "Harv", "reviewText": "It was what I expected.", "summary": "Four Stars", "unixReviewTime": 1485734400}
{"overall": 5.0, "verified": true, "reviewTime": "01 23, 2017", "reviewerID": "A370HU5Y7P5354", "asin": "B00004YWK2", "reviewerName": "jamie ames", "reviewText": "as expected", "summary": "Five Stars", "unixReviewTime": 1485129600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "01 16, 2017", "reviewerID": "ALNRBNT7WMHCQ", "asin": "B00004YWK2", "reviewerName": "Keeya Judd", "reviewText": "This works exactly as expected. Installation was quick and easy. The supplied clamps are useless, I used metal hose clamps. The heat keeper is pretty cheaply made but for 9 dollars my expectations were pretty low. In some of the reviews, users have commented on the little round flap in the larger flap that directs the air flow. It is a bypass door. It is a safety feature so when the screen gets plugged up, air can still vent. Under normal operation, my bypass door is closed or mostly closed directing the majority of the air into my house. Some reviews comment on the screen also. The screen openings are on the larger side, I would say it is like a window screen. Yes it does blow a tiny bit of lint into the room. My dryer is in the basement, so it doesn't really bother me. Overall I'm pleased with the heat keeper and would recommend it.", "summary": "Cheap but does the job", "unixReviewTime": 1484524800}
{"overall": 3.0, "verified": true, "reviewTime": "01 15, 2017", "reviewerID": "A38MHYWL7RBQO6", "asin": "B00004YWK2", "reviewerName": "Nathaniel Moseley", "reviewText": "This item does what it's intended for, and does it moderately well. It allows you to redirect the heat from your dryer into your home instead of the outside in the cold months. Unfortunately, there is a significant design flaw, which makes little sense to me. I'll get into that at the end.\n\nFirst, it's cheap. It's molded plastic that is folded in half to make a tube shape and fit the flapper inside the box. Unfortunately, mine doesn't fold completely and the natural stress in the plastic makes it slightly not circular. This isn't a problem for connecting tubing, but it is a problem for the flapper, as it doesn't seat fully in the outside-flowing tube, so it allows cold air in. Second on the cheap scale are the zip ties it comes with. They are a step up from your standard single-use zip ties, as they have a lever to unlatch and expand them. However, the lever is impossible to push without taking the whole thing off and getting a pair of pliers on both sides of the zip, so it's pointless. Use a standard metal worm clamp instead.\n\nThe lint trap is useless: Take a stocking or cut off pantyhose and fit it over the end instead of the lint filter, like you probably do on your washer outlet. It's a much better filter.\n\nNow to the biggest design flaw, which I can only partially try to explain: There is a hole in the flapper, with a small flimsy inner flapper covering it. The effect is that when the flapper is up, to redirect hot air into your home, much of it is still pushed outside. And when it is in the other position, moving air will pull it open and suck out inside air, and/or push hot air into your home (I'm not sure which, as it's winter now and I don't want to test it right now). My only guess why this inner flapper exists at all is that it is to make up for the poorly closing main flapper, so you don't get stagnant moist air hanging out in the section between the \"heat keeper\" and your outside vent. The effect it has is that the heat keeper doesn't rully redirect air, is leaky, and forces you to mount it in one specific orientation, otherwise the inner flapper will hang open and let in outside air.\n\nTLDR: It works, but leaks and could be better, and unfortunately there doesn't seem to be a better option made anymore.", "summary": "Functional, cheap (good and bad), seems to be only option available unfortunately", "unixReviewTime": 1484438400}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2017", "reviewerID": "A3MG7YZ06MX68N", "asin": "B00004YWK2", "reviewerName": "Deanareno", "reviewText": "I really like the removable lint screen that comes with the diverter. Makes it easy to clean and helps reduce any lint dust getting into the house. Well worth the money especially during cold winter months.", "summary": "Nice for additional heat.", "unixReviewTime": 1484092800}
{"overall": 3.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A3INCBCPJNK1PW", "asin": "B00004YWK2", "reviewerName": "Amazon Customer", "reviewText": "Let's a lot of moisture in the air for us.", "summary": "Three Stars", "unixReviewTime": 1482969600}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/61de7fM-mKL._SY88.jpg"], "overall": 4.0, "vote": "2", "verified": true, "reviewTime": "12 24, 2016", "reviewerID": "AJUJNCLKHWJD4", "asin": "B00004YWK2", "reviewerName": "Rezin", "reviewText": "I considered this a starting point. I assumed it would be flimsy based on other reviews but I ordered it anyway. When I got the item, I immediately reinforced it with duct tape, sealing  any potential leaks and reinforcing the ring part.\n\nI used hard ducting cut to size. The one end fit smoothly into the ducting, and I sealed it well with duct tape. For the other side I had an extra pipe joiner that was almost the perfect size. You can get these at Home Depot for about $6. It includes a rubber grommet that has a butt seal inside, a metal band and 2 integrated hose clamps. The two ends met seamlessly and there are zero air leaks.\n\nThe unit works great. And we have even run the dryer empty for supplemental heat.\n\nOnly complaint is the lint catch system could be a little better, but if it was too fine it would probably blocked much of the air flow, as we use a dryer sheet inside the air filter as well. We prefer to just clean a little lint off the floor from time to time for the enhanced heating.\n\nIf you know what you're doing, this is a great little starting point.", "summary": "This is a great starting point", "unixReviewTime": 1482537600}
{"overall": 4.0, "verified": true, "reviewTime": "12 20, 2016", "reviewerID": "A2CKQ1NIJ2PGRX", "asin": "B00004YWK2", "reviewerName": "Special", "reviewText": "Re routs the heat from the dryer to the house, I can turn off the humidifier on the furnace", "summary": "Good product, easy install", "unixReviewTime": 1482192000}
{"overall": 3.0, "verified": true, "reviewTime": "12 12, 2016", "reviewerID": "A3MJ4NJE1XSZUQ", "asin": "B00004YWK2", "reviewerName": "Mark F.", "reviewText": "ITS WHAT I WANTED BUT NOT INSTALLED YET", "summary": "Three Stars", "unixReviewTime": 1481500800}
{"overall": 5.0, "verified": true, "reviewTime": "12 3, 2016", "reviewerID": "A1MOCOOVT406R4", "asin": "B00004YWK2", "reviewerName": "Dean H.", "reviewText": "Hook up was easy and works just fine.", "summary": "Heat saver close dryer.", "unixReviewTime": 1480723200}
{"overall": 4.0, "verified": true, "reviewTime": "12 1, 2016", "reviewerID": "A2DNTFTG3SMV6", "asin": "B00004YWK2", "reviewerName": "Debby Schroll", "reviewText": "Just what was needed.", "summary": "Four Stars", "unixReviewTime": 1480550400}
{"overall": 1.0, "verified": true, "reviewTime": "11 30, 2016", "reviewerID": "A3USRRBMKQ4TX1", "asin": "B00004YWK2", "reviewerName": "Chuck", "reviewText": "Very cheaply made! To make this thing work properly you will need to seall all the seams and find a way to prevent lint from coming through the coarse screen. I used plastic glue to pull the seams together. I used caulk to seal the seams. I am usingredients used dryer sheets under the screen to prevent lint from escaping. This exact vent can be purchased at Menards for $5.", "summary": "Over priced poor quality", "unixReviewTime": 1480464000}
{"overall": 3.0, "verified": true, "reviewTime": "11 7, 2016", "reviewerID": "ARN8PNPHTO5VQ", "asin": "B00004YWK2", "reviewerName": "J&amp;J", "reviewText": "Its definitely smaller then the picture makes it appear. Which is good in a small space. It doesn't really have what I would call a lint guard its basically metal window screen. For the price its a good base to modify and make what you need.", "summary": "meh", "unixReviewTime": 1478476800}
{"overall": 5.0, "verified": false, "reviewTime": "10 16, 2016", "reviewerID": "A1M69NRKJA3SJO", "asin": "B00004YWK2", "reviewerName": "monleigh", "reviewText": "This has been going strong for a few winters now.  Really helps heat up the basement on those really cold NJ days.", "summary": "A great invention. LOVE IT", "unixReviewTime": 1476576000}
{"overall": 3.0, "verified": true, "reviewTime": "09 30, 2016", "reviewerID": "A1EZRX9PAEW4L6", "asin": "B00004YWK2", "reviewerName": "Jeremy", "reviewText": "Great for basement washroom. It does leak air in the normal operating position, but not enough to worry about. I did add a piece of electrostatic air filter to collect the fiber particles this lets pass.", "summary": "Works good but not perfect.id recommend for basement washroom.", "unixReviewTime": 1475193600}
{"overall": 5.0, "verified": true, "reviewTime": "07 19, 2016", "reviewerID": "A1ISAGPQ7AIBY1", "asin": "B00004YWK2", "reviewerName": "JAN CHIN", "reviewText": "WORKS", "summary": "WORKS", "unixReviewTime": 1468886400}
{"overall": 5.0, "verified": true, "reviewTime": "07 15, 2016", "reviewerID": "APZQR34IVXV6Z", "asin": "B00004YWK2", "reviewerName": "jess", "reviewText": "Works great", "summary": "Five Stars", "unixReviewTime": 1468540800}
{"overall": 2.0, "verified": true, "reviewTime": "06 15, 2016", "reviewerID": "A1YFOFB03DCCFZ", "asin": "B00004YWK2", "reviewerName": "L. Eilander", "reviewText": "Not wow-ing me.  The product is flimsy, with gaps between the plastic halves.\n\nWorse, there is NO SEAL around the flapper on any side.  In summer you will still get some dryer air inside, and in any season you will get outside air and bugs in through the valve.\n\nStill trying to decide if I even want to install this or send it back.", "summary": "Cheaply made with NO SEAL!", "unixReviewTime": 1465948800}
{"overall": 1.0, "vote": "4", "verified": true, "reviewTime": "05 26, 2016", "reviewerID": "A2WJIDZ6PKRE8R", "asin": "B00004YWK2", "reviewerName": "Rachael", "reviewText": "First I'll say that I am very happy these boxes exist. I love using them. That being said this box is no better than any other. Same old cheap crap in a different form. I have no idea why these manufacturers cannot add gaskets or silicone rings to these things! I'd be willing to pay 10 dollars more if there was a gasket on the outside of the inlet and outlet, around the closer (door) and on the inside of the little lid. These things leak air like crazy. I use thin foil heat tape and wrap every possible area that might leak. The zip ties do nothing, there is nowhere for them to grip to. There is no lip to keep it from sliding off. Taped that too. The door that swings with the adjuster leaks air too. It's fine in the winter. Horrible in the summer. I also had to tape over the screen and around the lid to seal it. I'll just remove the tape for winter.\n\nI spent 40 minutes taping and testing. It's on and working like it should but one should not have to put so much time and effort into such a simple contraption. I do recommend these boxes but you have to have realistic expectations. It's not going to work without lots of fuss.", "summary": "Leaks air like using nothing at all", "unixReviewTime": 1464220800}
{"overall": 3.0, "verified": true, "reviewTime": "05 23, 2016", "reviewerID": "A3MAPTXCPC25W9", "asin": "B00004YWK2", "reviewerName": "brandon w curnutte", "reviewText": "This is very handy at adding a little heat that would have been otherwise wasted.  My only complaints are that the included zip ties don't really get a good hold on the stiff wire in the vent hose, and the lint collection screen falls off too easily.  Add some metal clamps to your order and you will be set.", "summary": "Zip ties are weak but this is a very handy device.", "unixReviewTime": 1463961600}
{"overall": 4.0, "verified": true, "reviewTime": "05 17, 2016", "reviewerID": "A5WWB6YQHV56I", "asin": "B00004YWK2", "reviewerName": "jmnixonexp", "reviewText": "I live in an older home with an very cold basement during the winter so I purchased this in hopes of recycling some of the heat produced by my dryer. So far I've been pleased with the results. I gave 4 stars because I replaced the plastic clips with metal clamps and added an extra layer of filtration.", "summary": "Dont let your heat go wasted anymore!", "unixReviewTime": 1463443200}
{"overall": 4.0, "verified": true, "reviewTime": "05 6, 2016", "reviewerID": "A3P4P6X8IY50ZJ", "asin": "B00004YWK2", "reviewerName": "John Kisser", "reviewText": "Appears to be what I need. Have not installed it yet.", "summary": "Four Stars", "unixReviewTime": 1462492800}
{"overall": 5.0, "verified": true, "reviewTime": "05 4, 2016", "reviewerID": "A21S4H8SA607ED", "asin": "B00004YWK2", "reviewerName": "Ron Mack", "reviewText": "Utility cost cutter.  Use to help heat home heat in the winter.", "summary": "Utility cost cutter. Use to help heat home heat ...", "unixReviewTime": 1462320000}
{"overall": 5.0, "verified": true, "reviewTime": "04 20, 2016", "reviewerID": "A201AJMX23BKDB", "asin": "B00004YWK2", "reviewerName": "Peacock", "reviewText": "Easy to hook up, I am a woman that likes to save money and energy", "summary": "Fantastic product", "unixReviewTime": 1461110400}
{"overall": 1.0, "verified": true, "reviewTime": "03 30, 2016", "reviewerID": "A22MHK32MIG7JD", "asin": "B00004YWK2", "reviewerName": "Hehr", "reviewText": "not worth the bother.  there was dust all over.  I threw it out", "summary": "not worth the bother. there was dust all over ...", "unixReviewTime": 1459296000}
{"overall": 5.0, "verified": true, "reviewTime": "03 22, 2016", "reviewerID": "A3TXZB2ZPTXY76", "asin": "B00004YWK2", "reviewerName": "P. Chandra", "reviewText": "What a great simple, little product. I live in Connecticut, so the winters are cold. Sometimes darn cold! So we are always looking for ways to heat the home efficiently. This little thing does just that. It not only warms up the basement, but the heat also rises to the main floor. Also, a little bit of moisture from the drying clothes comes back in the house. I have a humidity monitor which I can see bumps up just a bit when the dryer is working. This devise may not bring our heating bill down tremendously, but any savings at all is great.", "summary": "Graet Little Devise", "unixReviewTime": 1458604800}
{"overall": 5.0, "verified": true, "reviewTime": "03 17, 2016", "reviewerID": "AHBTM311TEMZM", "asin": "B00004YWK2", "reviewerName": "Andy L.", "reviewText": "Has good bypass to outside if screen is blocked. Have to clean screen regularly.", "summary": "works good", "unixReviewTime": 1458172800}
{"overall": 5.0, "verified": true, "reviewTime": "03 14, 2016", "reviewerID": "A38GLVHCB0IIEA", "asin": "B00004YWK2", "reviewerName": "Thomas McIntosh", "reviewText": "This is great for winter. Run your cloths drier & put both moisture & heat in your house. With the door, you can put the first 10 - 20 minutes of the moistest air outside if your house get too damp.", "summary": "Switchable inside/outside dryer vent.", "unixReviewTime": 1457913600}
{"overall": 3.0, "verified": true, "reviewTime": "03 13, 2016", "reviewerID": "A7U32QMCN3QDN", "asin": "B00004YWK2", "reviewerName": "Bigshow", "reviewText": "Works ok there is a rubber flap in the middle of the door that still let's the heat go out side instead of in the house", "summary": "Works ok there is a rubber flap in the middle ...", "unixReviewTime": 1457827200}
{"overall": 3.0, "verified": true, "reviewTime": "03 5, 2016", "reviewerID": "A3MGDDCHGBYTY3", "asin": "B00004YWK2", "reviewerName": "badssloumd", "reviewText": "It works but the filter is way too small.", "summary": "It works but the filter is way too small.", "unixReviewTime": 1457136000}
{"overall": 5.0, "verified": true, "reviewTime": "03 2, 2016", "reviewerID": "A1HO83SG7HPQ11", "asin": "B00004YWK2", "reviewerName": "Christopher M. Myers - IS", "reviewText": "Great device, boy did it do the job!  Thank you.", "summary": "Five Stars", "unixReviewTime": 1456876800}
{"overall": 3.0, "verified": true, "reviewTime": "03 2, 2016", "reviewerID": "A3B82VK1GATCX4", "asin": "B00004YWK2", "reviewerName": "jeff nelson", "reviewText": "over flow hole not shown in ads", "summary": "Three Stars", "unixReviewTime": 1456876800}
{"overall": 5.0, "verified": true, "reviewTime": "03 1, 2016", "reviewerID": "A3K8ZMC0FJXN86", "asin": "B00004YWK2", "reviewerName": "Amazon Customer", "reviewText": "works well.", "summary": "Five Stars", "unixReviewTime": 1456790400}
{"overall": 3.0, "verified": true, "reviewTime": "02 28, 2016", "reviewerID": "A26BVWNZEENVJM", "asin": "B00004YWK2", "reviewerName": "Nick Goodman", "reviewText": "This will work for what I need but I would have payed more for one better constructed.  I will be glueing the seams on this before use.  It is just snapped together with some small clips and seems to be made from a very brittle plastic.  I have a feeling if I used it the way it came the clamps might break it.", "summary": "... need but I would have payed more for one better constructed. I will be glueing the seams on ...", "unixReviewTime": 1456617600}
{"overall": 1.0, "verified": true, "reviewTime": "02 25, 2016", "reviewerID": "AJ5Y46YVA99KI", "asin": "B00004YWK2", "reviewerName": "Amazon Customer", "reviewText": "Piece of junk.", "summary": "Junk", "unixReviewTime": 1456358400}
{"overall": 5.0, "verified": true, "reviewTime": "02 22, 2016", "reviewerID": "A1FN6R8IVG3LH0", "asin": "B00004YWK2", "reviewerName": "jeffrey pietryga", "reviewText": "Item is great and easy to install.", "summary": "Five Stars", "unixReviewTime": 1456099200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "02 19, 2016", "reviewerID": "AOYXV10BM183J", "asin": "B00004YWK2", "reviewerName": "Mellissa", "reviewText": "This is a very cool and creative item to have it attaches to the hose of the dryer and in the winter you can help your heat bill when running the dryer So I am total electric in my hope furnace and all and when I am running the dryer in the winter it helps heat and instead of using my furnace heat the dryer heat that I was using any way is keeping the area warm and prevents the furnace from kicking on saving electricity by not having both running at the same time then when summer comes I flip a switch and the goes back out side again so this is saving money but one of my favorite things about this IS wait for it your house will smell like your favorite fabric softener  as it heats the heat coming from dryer smells of whatever fabric softener you like it is awesome", "summary": "Greatest Invention ever", "unixReviewTime": 1455840000}
{"overall": 5.0, "verified": true, "reviewTime": "02 15, 2016", "reviewerID": "A2XXJ8HIFK64EP", "asin": "B00004YWK2", "reviewerName": "Ka2004", "reviewText": "This works great in our basement laundry room.  Helps warm it up and not waste the heat outside.", "summary": "Five Stars", "unixReviewTime": 1455494400}
{"overall": 5.0, "verified": true, "reviewTime": "02 14, 2016", "reviewerID": "A2ZHUVG0QENYR3", "asin": "B00004YWK2", "reviewerName": "Grammish", "reviewText": "Got it put in a few days ago and wish I had had it for years.  What a treat to feel that warm moist air blowing back into the laundry room instead of paying to heat the outside.  It was simple to install, too.  Didn't use the ties included with the kit but chose to use sturdy metal clamps instead.", "summary": "Money saver!", "unixReviewTime": 1455408000}
{"overall": 3.0, "verified": true, "reviewTime": "02 2, 2016", "reviewerID": "A3AEBLRC7DXA4L", "asin": "B00004YWK2", "reviewerName": "Grover", "reviewText": "love the idea but front cover pops off as soon a tiny bit of lint gets on it and the outside handle keeps closing so i had to rig it", "summary": "love the idea but front cover pops off as soon ...", "unixReviewTime": 1454371200}
{"overall": 4.0, "verified": true, "reviewTime": "02 1, 2016", "reviewerID": "A2TPCUVV4A98H3", "asin": "B00004YWK2", "reviewerName": "GC", "reviewText": "Still working on getting it in, but a great idea.", "summary": "but a great idea.", "unixReviewTime": 1454284800}
{"overall": 1.0, "verified": true, "reviewTime": "01 25, 2016", "reviewerID": "APNPL97OP9SPQ", "asin": "B00004YWK2", "reviewerName": "Christe", "reviewText": "I was so excited about this new device and I loved it for the first couple weeks after it was installed. But, the screen has now come detached from the plastic circle which it needs to be attached on the front. So, now I have this all hooked up and it worthless. I am so very disappointed as the concept is amazing, but the product was not made well at all.", "summary": "Disappointed and frustrated", "unixReviewTime": 1453680000}
{"overall": 3.0, "verified": true, "reviewTime": "01 24, 2016", "reviewerID": "A1EEHWC45FJJUL", "asin": "B00004YWK2", "reviewerName": "Rich P", "reviewText": "I enjoy bringing in the moisture and the heat.\nThe 'challenges' are very real ...\n  attaching to both ends of the venting cannels.\n  opening & closing are problematic. I finally used some screws and thin wire to keep the door open or closed.\n  securing it firmly to 'something/anything' was not easy.\n  some 'double lint collection' system is needed. It does vent very fine particles into the air.\nFor the money it is worth the value to gaining the heat & moisture.\nNo product seems to have come up with ways to deal with my difficulties with the system.", "summary": "I enjoy bringing in the moisture and the heat", "unixReviewTime": 1453593600}
{"overall": 4.0, "verified": true, "reviewTime": "01 22, 2016", "reviewerID": "A2O1FQUEY2WZ5S", "asin": "B00004YWK2", "reviewerName": "Ben", "reviewText": "The price is low and it blows out the hot air.  Don't leave it venting inside at all times.  If your drying clothes close it for the first 5 to 10 minutes then let it vent inside.  This will prevent a large amount of moisture from venting inside.  I have mine venting into my garage in the winter so it puts some moisture inside.  I made the mistake of leaving it open after three cycles of drying clothes and it put out too much moisture.  It does blow a little bit of lint out.  I clean the mesh screen before I vent it into the garage.  Overall a good product that will pay itself back in heating.", "summary": "Overall a good product that will pay itself back in heating", "unixReviewTime": 1453420800}
{"overall": 5.0, "verified": true, "reviewTime": "01 15, 2016", "reviewerID": "A1JTOC1VSCY2N", "asin": "B00004YWK2", "reviewerName": "Amber", "reviewText": "Great", "summary": "Five Stars", "unixReviewTime": 1452816000}
{"overall": 2.0, "vote": "4", "verified": true, "reviewTime": "01 7, 2016", "reviewerID": "AUFMOG33T7YNH", "asin": "B00004YWK2", "reviewerName": "gjd618", "reviewText": "There is a small flap inside the blocking door which opens when your dryer is on so that some of the hot air goes outdoors when set to vent indoors, and if you have the product placed horizontally, it doesn't close back up after the dryer has stopped, which allows cold air to come into the house from the vent.  So evidently this cannot be used horizontally, only vertically.  I guess when it is vertical, the small flap sits down and closes.  When I called Dundas Jafine to ask questions about the product, I was treated like an idiot by the customer service representative.  Will not purchase anything from this manufacturer again due to their customer service representative's demeanor.", "summary": "Can only be used vertically, poor customer service", "unixReviewTime": 1452124800}
{"overall": 3.0, "verified": true, "reviewTime": "12 4, 2015", "reviewerID": "A3AU84PUQSIWK0", "asin": "B00004YWK2", "reviewerName": "anonymous", "reviewText": "It's pretty cheaply made, doesn't close as tightly as I would like.  But I couldn't find anything better and it does the job.  Used real metal clamps on it rather than the glorified zip ties it comes with.", "summary": "It's pretty cheaply made", "unixReviewTime": 1449187200}
{"overall": 5.0, "verified": true, "reviewTime": "12 2, 2015", "reviewerID": "A1HZNVXZLXUP6J", "asin": "B00004YWK2", "reviewerName": "Bob", "reviewText": "Nicely made and it works well. A much better design than my previous model.", "summary": "Winner", "unixReviewTime": 1449014400}
{"overall": 5.0, "verified": true, "reviewTime": "11 26, 2015", "reviewerID": "A93QX12JVL8MP", "asin": "B00004YWK2", "reviewerName": "T-n-T Handywork", "reviewText": "Had a similar product from another manufacturer before. I found this unit to be of thicker plastic and the lever is easier to operate. The screen is easy to remove, but stays in place after cleaning and replacement.", "summary": "The screen is easy to remove", "unixReviewTime": 1448496000}
{"overall": 5.0, "verified": true, "reviewTime": "11 24, 2015", "reviewerID": "A3B87RJRG5IFC2", "asin": "B00004YWK2", "reviewerName": "Dennis T Pymm", "reviewText": "good product", "summary": "Five Stars", "unixReviewTime": 1448323200}
{"overall": 2.0, "verified": true, "reviewTime": "11 18, 2015", "reviewerID": "A3T4ALWRORPSEY", "asin": "B00004YWK2", "reviewerName": "R Reece", "reviewText": "The biggest liability of this unit is the handle to operate the door.  It is much too flimsy.  The handle is already deforming and I expect it to break soon  .The unit is ok and works, however it is not the best design or the best built or the best value that I have seen.", "summary": "however it is not the best design or the best built or the best value ...", "unixReviewTime": 1447804800}
{"overall": 5.0, "verified": true, "reviewTime": "11 18, 2015", "reviewerID": "A372WOLTH6J2OF", "asin": "B00004YWK2", "reviewerName": "Ethan Drew", "reviewText": "Love this, took minutes to install. Works great I would buy another in a heartbeat", "summary": "Great product, quick and easy", "unixReviewTime": 1447804800}
{"overall": 5.0, "verified": true, "reviewTime": "11 17, 2015", "reviewerID": "AOIEPZDMAYLX0", "asin": "B00004YWK2", "reviewerName": "alen morissette", "reviewText": "saves on heat and moisture in the house", "summary": "Five Stars", "unixReviewTime": 1447718400}
{"overall": 3.0, "verified": true, "reviewTime": "11 12, 2015", "reviewerID": "A3ICUCIAURQ5LK", "asin": "B00004YWK2", "reviewerName": "Some Guy In Ohio", "reviewText": "It's an okay temporary solution.", "summary": "Three Stars", "unixReviewTime": 1447286400}
{"overall": 3.0, "verified": true, "reviewTime": "11 11, 2015", "reviewerID": "A2THOOS0IZ056G", "asin": "B00004YWK2", "reviewerName": "Maurice Sanders", "reviewText": "Separate in the middle wish it would have been one piece, next time I would try a different one.", "summary": "Not what I expected", "unixReviewTime": 1447200000}
{"overall": 4.0, "verified": true, "reviewTime": "11 2, 2015", "reviewerID": "ANG3NR7NBQ27N", "asin": "B00004YWK2", "reviewerName": "runner bob", "reviewText": "it works great. i used better zip ties to secure it in place. the stuff they give you is junk.\n\ni use the socks you put around drain tile as an air filter (on the exhaust into your house...otherwise the fabric dust fills your whole house). worked GREAT. i plan to change it every year, but know i never will.", "summary": "not bad", "unixReviewTime": 1446422400}
{"overall": 5.0, "verified": true, "reviewTime": "10 31, 2015", "reviewerID": "A2AAJMKGGCWEOT", "asin": "B00004YWK2", "reviewerName": "Jonathan Schwartz", "reviewText": "Most of the heat keepers out there are made by Deflecto and sold under different brand names.  After I got tired of putting mine back together (extremely flimsy and fell apart every use) I tossed it and bought this one.  It is solid, works very well.  I did use metal screw clamps instead of the plastic ties that came with the product, but that was because I had some.  I assume that the plastic ties would work just as well.\nHappy with the product.", "summary": "Solid, works well.", "unixReviewTime": 1446249600}
{"overall": 5.0, "verified": true, "reviewTime": "10 30, 2015", "reviewerID": "A21YS2PSI5APWP", "asin": "B00004YWK2", "reviewerName": "DLBise", "reviewText": "Sweet way to keep heat in the garage when drying clothes in the winter, great way to direct it out in the summer.", "summary": "Excellent Heat Saver", "unixReviewTime": 1446163200}
{"overall": 5.0, "verified": true, "reviewTime": "10 23, 2015", "reviewerID": "A177DKAQC9MKW2", "asin": "B00004YWK2", "reviewerName": "eburgguy", "reviewText": "It works!", "summary": "Five Stars", "unixReviewTime": 1445558400}
{"overall": 5.0, "verified": true, "reviewTime": "10 1, 2015", "reviewerID": "A1FQ5PQ5C7XVSK", "asin": "B00004YWK2", "reviewerName": "TheFitz", "reviewText": "Shopped at several local stores and they mostly looked at me as if I was an idiot. Even 'older' sales persons didn't know what I was talking about. Duh.\n I have used these for over 35 years and this one works just fine.", "summary": "Time to VENT !", "unixReviewTime": 1443657600}
{"overall": 4.0, "verified": true, "reviewTime": "09 23, 2015", "reviewerID": "A3R5NAWSQQS9AS", "asin": "B00004YWK2", "reviewerName": "Douglas W.", "reviewText": "Good unit", "summary": "Four Stars", "unixReviewTime": 1442966400}
{"overall": 5.0, "verified": true, "reviewTime": "09 17, 2015", "reviewerID": "A1HK3NTFR9WWUB", "asin": "B00004YWK2", "reviewerName": "JHODER", "reviewText": "works great easy hook uparrived on time. would purchase again.", "summary": "Five Stars", "unixReviewTime": 1442448000}
{"overall": 5.0, "verified": true, "reviewTime": "09 10, 2015", "reviewerID": "A3B8RHP44EO9QB", "asin": "B00004YWK2", "reviewerName": "RLY", "reviewText": "This clever but inexpensive attachment is great if your laundry room is in the basement! Switches the heat to vent it indoors, with a screen for lint catching. Some finer forms of lint may pass through, but you can always attach another screen to catch more lint. Easy to install.", "summary": "Why waste dryer heat in the winter?", "unixReviewTime": 1441843200}
{"overall": 5.0, "verified": true, "reviewTime": "09 1, 2015", "reviewerID": "A27X1VISTUJ5TB", "asin": "B00004YWK2", "reviewerName": "Redline7", "reviewText": "excellent  saved us a lot of electricity heating when we diverted it into the condo in the winter", "summary": "excellent saved us a lot of electricity heating when we ...", "unixReviewTime": 1441065600}
{"overall": 5.0, "verified": true, "reviewTime": "08 23, 2015", "reviewerID": "A1Y4KUBA7V4D7W", "asin": "B00004YWK2", "reviewerName": "Alan", "reviewText": "Great and easy to use", "summary": "Exactly what I wanted", "unixReviewTime": 1440288000}
{"overall": 4.0, "verified": true, "reviewTime": "08 22, 2015", "reviewerID": "A1F0C0KIYPL47X", "asin": "B00004YWK2", "reviewerName": "norman bedillion", "reviewText": "Works well. Adds some warmth and humidity the basement in the winter.", "summary": "Four Stars", "unixReviewTime": 1440201600}
{"overall": 4.0, "verified": false, "reviewTime": "07 20, 2015", "reviewerID": "A22DX9XOT1CUQ5", "asin": "B00004YWK2", "reviewerName": "marie stoves", "reviewText": "I am actually glad to have found this.  Years ago we had a similar thing in Navy housing.  In the winter it was wonderful to have that extra heat from the dryer.  In the summer, we just vented it outside.  We just ordered this for our house.", "summary": "I am actually glad to have found this", "unixReviewTime": 1437350400}
{"overall": 5.0, "verified": true, "reviewTime": "07 15, 2015", "reviewerID": "A1FZ28AXBUF6B1", "asin": "B00004YWK2", "reviewerName": "JM", "reviewText": "Great vent.  I'm a humidity connoisseur and the house was at 15% constantly.  After adding this and doing a few loads of laundry, the whole house was at 50% for quite a while.  I realize now that the screen comes right off so you can vac any lint out - easy to clean.  Happy with this product.", "summary": "Easy to clean, easy to install, and easy to make a LOT of humidity in your house, quickly!", "unixReviewTime": 1436918400}
{"overall": 4.0, "verified": true, "reviewTime": "07 14, 2015", "reviewerID": "A5POJ3A2LVFB1", "asin": "B00004YWK2", "reviewerName": "Becky", "reviewText": "For the money it was good", "summary": "Four Stars", "unixReviewTime": 1436832000}
{"overall": 5.0, "verified": true, "reviewTime": "07 5, 2015", "reviewerID": "A3NFA6HF5LLYT", "asin": "B00004YWK2", "reviewerName": "Dtoff1", "reviewText": "Saves me $$$$$$-----Love it!", "summary": "Five Stars", "unixReviewTime": 1436054400}
{"overall": 4.0, "verified": true, "reviewTime": "06 26, 2015", "reviewerID": "A3BXP2INWAWLNN", "asin": "B00004YWK2", "reviewerName": "DMac", "reviewText": "It works as advertised.  Only longer term usage will determine whether the air-flow flapper stays in the desired position *and* prevents air leakage around the perimeter, i.e. seals well enough that hot air during use doesn't come inside when in the bypass position, nor continues to the outside when directed to the indoors position, which is what happened to the previous one we had from a different manufacturer.", "summary": "It works as advertised. Only longer term usage will ...", "unixReviewTime": 1435276800}
{"overall": 4.0, "verified": true, "reviewTime": "06 23, 2015", "reviewerID": "A2JF3Q95DMVC8I", "asin": "B00004YWK2", "reviewerName": "showmegrad", "reviewText": "works fine for winter, but lets a good deal of heat & moisture in the basement in summer", "summary": "Four Stars", "unixReviewTime": 1435017600}
{"overall": 5.0, "verified": true, "reviewTime": "06 23, 2015", "reviewerID": "A160Y8BJWHYOER", "asin": "B00004YWK2", "reviewerName": "Bob Carter", "reviewText": "Worked like it was suppose to and made great energy savings in the winter.  Setting it up again this winter and looking forward to the savings.  As dry as our home gets from a fireplace and central heating, the warm air and moisture this puts into our home isn't a problem.  The lint trap is easy to clean and setup is easy for anyone used to putting on a dryer vent.  You do have to figure out a way to hang it up to blow the warm air cleanly and easily into your open room otherwise the humidity would obviously become a problem in a small or tight enclosed space.  But, in an open room? This thing is great!", "summary": "Thanks Dundas Jafine! :)", "unixReviewTime": 1435017600}
{"overall": 5.0, "verified": true, "reviewTime": "06 21, 2015", "reviewerID": "A144SNMRKANIQA", "asin": "B00004YWK2", "reviewerName": "Lillian Keller", "reviewText": "Works good. Not hard to set up or use.", "summary": "Five Stars", "unixReviewTime": 1434844800}
{"overall": 3.0, "verified": true, "reviewTime": "06 10, 2015", "reviewerID": "A396M3Q5HC9MQD", "asin": "B00004YWK2", "reviewerName": "Charles Anderson", "reviewText": "Did the Job.  It would be nice if it had mounting tabs that held it away from the wall enough to mount the hoses.  Just put a block of wood in back and open the screen door and drill a couple of holes inside and mount to wood block in back.  Go easy on the thin plastic.", "summary": "Did the job", "unixReviewTime": 1433894400}
{"overall": 4.0, "verified": true, "reviewTime": "05 26, 2015", "reviewerID": "AE5GAVA81O3DP", "asin": "B00004YWK2", "reviewerName": "K. Phippin", "reviewText": "Simply works", "summary": "simply work", "unixReviewTime": 1432598400}
{"overall": 5.0, "verified": true, "reviewTime": "05 16, 2015", "reviewerID": "A1NSZTTH0LLIU2", "asin": "B00004YWK2", "reviewerName": "Michael Terwilliger", "reviewText": "As I hoped it would be for my situation and on time.", "summary": "Five Stars", "unixReviewTime": 1431734400}
{"overall": 2.0, "verified": true, "reviewTime": "04 29, 2015", "reviewerID": "A3MFS7T9BGNHJ1", "asin": "B00004YWK2", "reviewerName": "AR", "reviewText": "Good idea, but the bypass flap in the diverter door is a weak link.  Within two months of use, the bypass flap fell off its hinge and down into the dryer hose.  If you buy this, inspect the flap and hinge closely before you install it.", "summary": "Good idea, but the bypass flap in the diverter ...", "unixReviewTime": 1430265600}
{"overall": 5.0, "verified": true, "reviewTime": "04 23, 2015", "reviewerID": "A2A33I5BISEN03", "asin": "B00004YWK2", "reviewerName": "Alestair David", "reviewText": "Does a great job. This is my 2nd purchase. The 1st one still works fine, but I wanted to get another one, in case it is discontinued. This is ideal for our home since the dryer vent goes thru the garage. In the winter months, we open it to the garage to get the hot and moist air. Important consideration - clean the filter regularly.", "summary": "Five Stars", "unixReviewTime": 1429747200}
{"overall": 5.0, "verified": true, "reviewTime": "04 18, 2015", "reviewerID": "A38EYWZGI5S14W", "asin": "B00004YWK2", "reviewerName": "Cindy Jones", "reviewText": "helps to heat my basement while I am working in it. I will put an additional screen (nylon) on it to help cut down on dust.", "summary": "helps to heat my basement while I am working in ...", "unixReviewTime": 1429315200}
{"overall": 4.0, "verified": true, "reviewTime": "04 11, 2015", "reviewerID": "AN63ZGJT5LO9B", "asin": "B00004YWK2", "reviewerName": "Steve", "reviewText": "Kind of \"meh.\" Does what it's supposed to do, I suppose. However, if you have a laundry \"room\" I'd caution using it as we just spent a lot $$$ removing mold from this area and the basement, and when this thing is on \"inside\" mode it is like walking into a sauna in the laundry room: mist in the air, water coating every wall and dripping down them. But it does bring the heat inside as well!", "summary": "Like a Florida summer--in your laundry room!", "unixReviewTime": 1428710400}
{"overall": 5.0, "verified": true, "reviewTime": "04 9, 2015", "reviewerID": "A9I5JCYVJ381O", "asin": "B00004YWK2", "reviewerName": "Tatiana Ballreich", "reviewText": "works great", "summary": "Five Stars", "unixReviewTime": 1428537600}
{"overall": 1.0, "verified": false, "reviewTime": "04 6, 2015", "reviewerID": "A102NN67BWELB0", "asin": "B00004YWK2", "reviewerName": "MJDick", "reviewText": "I bought a much better one made in USA to replace this one.  leaks too much air in summer and doesn't hold together very well.", "summary": "I bought a much better one made in USA to replace this one", "unixReviewTime": 1428278400}
{"overall": 1.0, "verified": true, "reviewTime": "04 3, 2015", "reviewerID": "AUFUHSYECYIAG", "asin": "B00004YWK2", "reviewerName": "DonPedro", "reviewText": "Flimsy and missing parts, not very nice", "summary": "Cheaply made", "unixReviewTime": 1428019200}
{"overall": 4.0, "verified": true, "reviewTime": "03 29, 2015", "reviewerID": "AXCC3KVNCBAP9", "asin": "B00004YWK2", "reviewerName": "Pat", "reviewText": "This works fine but the one it replaced was a little nicer because it was designed to be attached to something stationary like a stud.  So I drilled small holes in the plastic and attached it to the wall where the other one was. That keeps the dryer vent hose from moving and maybe coming loose. It does seem to be constructed very well but there is one drawback. My dryer vent hose is not plastic so the plastic clamps did not work. I used metal clamps that can be screwed tight. Otherwise, I'm satisfied with the purchase.", "summary": "Works well", "unixReviewTime": 1427587200}
{"overall": 5.0, "verified": true, "reviewTime": "03 26, 2015", "reviewerID": "A24EAX9PUWHNYA", "asin": "B00004YWK2", "reviewerName": "Kindle Customer", "reviewText": "Works as expected. Great price.", "summary": "Great price.", "unixReviewTime": 1427328000}
{"overall": 3.0, "verified": true, "reviewTime": "03 19, 2015", "reviewerID": "A37PLC0YOKGGEM", "asin": "B00004YWK2", "reviewerName": "Ed Lilley", "reviewText": "I use this for to heat my garage while I'm working.  Works but is poorly built and will flip open at random.  Couple of rubber bands to keep it locked shut so I'm not blowing humid air into my shop while clothes are drying fixed it.", "summary": "I use this for to heat my garage while I'm ...", "unixReviewTime": 1426723200}
{"overall": 5.0, "verified": false, "reviewTime": "03 15, 2015", "reviewerID": "AHYOFCGXMYESN", "asin": "B00004YWK2", "reviewerName": "JC in VT", "reviewText": "This is a nice solution if you have reason to recapture the dryer heat. Installation is easy, product is well made and works fine. Made in Canada, not China...", "summary": "Well made, does the job!", "unixReviewTime": 1426377600}
{"overall": 3.0, "verified": true, "reviewTime": "03 13, 2015", "reviewerID": "A17IA8JCLJE2UM", "asin": "B00004YWK2", "reviewerName": "ALLEN C OLHEISER", "reviewText": "It only allows for one direction of flow, would have been nice to be reversable. The lever to direct the flow ended up against the wall in my situation.", "summary": "would have been nice to be reversable", "unixReviewTime": 1426204800}
{"overall": 4.0, "verified": true, "reviewTime": "03 11, 2015", "reviewerID": "A3968HHZQ78L6F", "asin": "B00004YWK2", "reviewerName": "D.L.H", "reviewText": "Used metal worm gear clamps instead of supplied plastic. Heat keeper works fine", "summary": "Works well", "unixReviewTime": 1426032000}
{"overall": 3.0, "verified": true, "reviewTime": "03 11, 2015", "reviewerID": "A3QKLZIBGBP9Q7", "asin": "B00004YWK2", "reviewerName": "Floris Brownstone", "reviewText": "Works as advertised.  However, the flap that is supposed to seal the connection to the outdoors (when venting inside) does not seal well.  This seems to let a lot of outdoor air in when the dryer is not in use.", "summary": "Lets in Cold, Exterior Air When Dryer is Not In Use", "unixReviewTime": 1426032000}
{"overall": 5.0, "verified": true, "reviewTime": "03 6, 2015", "reviewerID": "A3AP0QM3HZ54U2", "asin": "B00004YWK2", "reviewerName": "Lyle", "reviewText": "great product.", "summary": "Five Stars", "unixReviewTime": 1425600000}
{"overall": 5.0, "verified": true, "reviewTime": "03 5, 2015", "reviewerID": "A368PWGJ7NBIKG", "asin": "B00004YWK2", "reviewerName": "GarbageMan", "reviewText": "This was more work than I thought with the lack of tools on hand at the time. Cutting into aluminum wasn't as smooth as I thought it would be. Well worth the investment. My basement is getting heat in the winter and there's a noticable difference in humidity as well.", "summary": "Awesomesauce", "unixReviewTime": 1425513600}
{"overall": 5.0, "verified": true, "reviewTime": "03 4, 2015", "reviewerID": "A1WUSY40L8N9SK", "asin": "B00004YWK2", "reviewerName": "victor adkins", "reviewText": "Item was what I wanted!!!! Great service", "summary": "Great", "unixReviewTime": 1425427200}
{"overall": 1.0, "verified": true, "reviewTime": "02 28, 2015", "reviewerID": "A2G797N2QKWW96", "asin": "B00004YWK2", "reviewerName": "Karen Walter", "reviewText": "The straps didn't fit, the handle doesn't stay on. Very cheaply made...", "summary": "One Star", "unixReviewTime": 1425081600}
{"overall": 4.0, "verified": true, "reviewTime": "02 22, 2015", "reviewerID": "A1ZOAYD5SX4NR2", "asin": "B00004YWK2", "reviewerName": "Jeff", "reviewText": "This is awesome, it heats the basement well everytime we dry the clothes. I didn't get the clips to work but got it attached with large zip ties and some duct tape.", "summary": "This is awesome, it heats the basement well everytime we dry ...", "unixReviewTime": 1424563200}
{"overall": 4.0, "verified": true, "reviewTime": "02 18, 2015", "reviewerID": "A2F0IJ0GKOR1S", "asin": "B00004YWK2", "reviewerName": "dman", "reviewText": "Works as designed. Could be stronger construction but priced correctly", "summary": "Four Stars", "unixReviewTime": 1424217600}
{"overall": 5.0, "verified": true, "reviewTime": "02 17, 2015", "reviewerID": "A39VE18NEOJCMC", "asin": "B00004YWK2", "reviewerName": "RICK S", "reviewText": "works great", "summary": "Five Stars", "unixReviewTime": 1424131200}
{"overall": 3.0, "verified": true, "reviewTime": "02 10, 2015", "reviewerID": "A19FFCF2KRGTOZ", "asin": "B00004YWK2", "reviewerName": "triathlete", "reviewText": "Cheaply made but works for the most part. You'll need to buy proper clamps because the ones it comes with don't work. While I was at OSH buying the clamps, I saw better quality products for about the same price (~$20). I have already used duct tape to keep the product intact.", "summary": "some times it's better to buy in the store and really know what you're getting.", "unixReviewTime": 1423526400}
{"overall": 3.0, "verified": true, "reviewTime": "02 10, 2015", "reviewerID": "A1LI8Z93ZJCCCJ", "asin": "B00004YWK2", "reviewerName": "Alyssa Hawksley", "reviewText": "Product works but is very cheaply made.", "summary": "Very cheaply made", "unixReviewTime": 1423526400}
{"overall": 5.0, "verified": true, "reviewTime": "02 8, 2015", "reviewerID": "A17L2NP1E97XQJ", "asin": "B00004YWK2", "reviewerName": "mark hiatt", "reviewText": "The heat keeper is well built and meets my expectations.", "summary": "Five Stars", "unixReviewTime": 1423353600}
{"overall": 5.0, "verified": true, "reviewTime": "02 4, 2015", "reviewerID": "AD79A31C8WQ7O", "asin": "B00004YWK2", "reviewerName": "Virginia A. Meyers", "reviewText": "Works great.", "summary": "Five Stars", "unixReviewTime": 1423008000}
{"overall": 5.0, "verified": true, "reviewTime": "01 25, 2015", "reviewerID": "ASY95GZBBVV9M", "asin": "B00004YWK2", "reviewerName": "SaRAoRAH", "reviewText": "Use with LTF Supurr-Flex Lint Trap Kit ... to keep heat and humidity in house in winter", "summary": "User with LTF Supurr-Flex Lint Trap Kit ...", "unixReviewTime": 1422144000}
{"overall": 4.0, "verified": true, "reviewTime": "01 23, 2015", "reviewerID": "A2WE4JPZIFA4K9", "asin": "B00004YWK2", "reviewerName": "Amazon Customer", "reviewText": "A good device to redirect air from a dryer. This unit was easy to install and use. Some lent always gets through the dryer filter so you will need to clean out the filter on this unit every so often or it will clog up. It is made of plastic so be careful with the damper arm. Suggest not opening damper until dryer has run about 10-15 minutes so you will not get so much humidity-unless you want the humidity.", "summary": "Dryer Vent Redirector", "unixReviewTime": 1421971200}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "01 22, 2015", "reviewerID": "A2DIQTZPF26T1L", "asin": "B00004YWK2", "reviewerName": "Snowmass", "reviewText": "First this is best for dry climates and only electric clothes dryers. for the past few years i have bit by bit made our home more energy efficient. i do so for both the long and short term benefits. a few weeks back when it was -20F i happened to walk by the outside vent to the dryer and felt all the hot air just going out and being wasted. i thought somebody must have come up with an idea to trap, save and make use of that warm air. after looking at several i finally decided on this one. it has a simple basic design and works fantastic! it arrived two days ago. i forgot to order an extra 8' section of the exhaust hose (makes the install much easier) so i buzzed into town, came back and was good to go. you might pick up two extra plastic ties just in case. they cost very little but good to have on hand.\n\nmake sure when installing that the \"in\" side and \"out\" side are connected properly and not reversed. i did one extra thing myself not in the instructions. the \"flapper\" inside has a small round hole about the size of a half dollar. i don't want part of the hot air coming inside i want it all. so i put a strip of gorilla tape over it so no more doughnut hole.\n\nthe first time we ran the dryer you could tell immediately that it was working. the entire house smelled like fabric softner sheets, like you'd sprayed the place with fresh linen scent febreeze. you can feel the humidity but for us that is good as often we get in the single digits for humidity. you must ensure NOT to close up your laundry area when drying clothes. if you do all that hot humid air will just fill your laundry room. then rather than saving you money it will cost you. your dryer will have to run longer and harder to dry clothes with all that extra moisture in the air. the hot air will have no means to circulate in the larger household.\n\ni have my \"heat keeper\" vent on the wall placed at chest level and aimed directly at the doorway so the hot air goes where it should. this is such a simple yet awesome idea and i am so glad for that one -20F degree day or i'd never thought about doing this.", "summary": "Awesome simple means for us to save and be more energy efficient, especially living in a more drier, less humid climate", "unixReviewTime": 1421884800}
{"overall": 5.0, "verified": true, "reviewTime": "01 20, 2015", "reviewerID": "A4FT45VC2WK1R", "asin": "B00004YWK2", "reviewerName": "JR", "reviewText": "As described!", "summary": "As described!", "unixReviewTime": 1421712000}
{"overall": 3.0, "verified": true, "reviewTime": "01 18, 2015", "reviewerID": "A1JOENOEO13HZN", "asin": "B00004YWK2", "reviewerName": "D. Chestnut", "reviewText": "It serves it's intended purpose and produces less dust/lint in the laundry room than simply detaching the hose.", "summary": "Three Stars", "unixReviewTime": 1421539200}
{"overall": 3.0, "verified": true, "reviewTime": "01 14, 2015", "reviewerID": "A33J83QZLL0JAG", "asin": "B00004YWK2", "reviewerName": "Jeffrey Travis Butler", "reviewText": "I use this in the winter, it does add a bit of humidity to the room", "summary": "Three Stars", "unixReviewTime": 1421193600}
{"overall": 1.0, "verified": true, "reviewTime": "01 9, 2015", "reviewerID": "A1T7AB4QD7J1JA", "asin": "B00004YWK2", "reviewerName": "K.M.", "reviewText": "Came cracked along the seems.  You'd pretty much have to tape this thing up to the point where you might as well make your own.  I could tell just by looking at it that not only would you not get all that wonderful warm air but you would get hosed down with every molecule of lint and be picking it out of your teeth for weeks. Sorry guys. Great idea.  Please up the quality - build it like you mean it.", "summary": "Wasnt impressed.  Poor construction. Came damaged but wouldnt have kept it anyways.", "unixReviewTime": 1420761600}
{"overall": 4.0, "verified": true, "reviewTime": "01 8, 2015", "reviewerID": "AUA72XT8IDM6F", "asin": "B00004YWK2", "reviewerName": "ThorMJ", "reviewText": "Needs mounting tabs to hold it to the wall, and the filter could be better.\nBut it warms up the house quite nicely.", "summary": "8KW heater for your house!", "unixReviewTime": 1420675200}
{"overall": 4.0, "verified": true, "reviewTime": "01 3, 2015", "reviewerID": "A1QK0RUV1ERTPV", "asin": "B00004YWK2", "reviewerName": "J. Styba", "reviewText": "Works great, recommend to save energy and add moisture in home. Easy to swap from indoors to outside airflow. Sometimes doesn't stay in the up (inside) position, but mine is jammed between the drywall and a stud, so it works for me.  Need to clean the lint screen every load, but not the fault of the device. So glad I got it.", "summary": "Works great, recommend to save energy and add moisture in ...", "unixReviewTime": 1420243200}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2015", "reviewerID": "A2MVWBVM0CIAQ4", "asin": "B00004YWK2", "reviewerName": "Rev. William Bodnar", "reviewText": "good deal", "summary": "Five Stars", "unixReviewTime": 1420243200}
{"overall": 2.0, "verified": true, "reviewTime": "01 1, 2015", "reviewerID": "AU6BBJ3GGR296", "asin": "B00004YWK2", "reviewerName": "TechGuy", "reviewText": "It works but it's cheaply made. The handle that moves diverter falls off easily and needs to be glued on. The wire mesh is coarse. I used a small bungie cord and a piece of panty hose over the wire mesh to catch any lint. The worst thing is the diverter does not seal tightly. Even when set to direct all the hot air outdoors you can still feel a lot of hot air entering the living space. So it will make your home warmer in the summer as well. It needs a seal or a gasket to make it air tight. I would pay twice as much for one of these if it was well made.", "summary": "The diverter does not seal tightly", "unixReviewTime": 1420070400}
{"overall": 4.0, "verified": true, "reviewTime": "12 31, 2014", "reviewerID": "A15GIKJZMKRBSY", "asin": "B00004YWK2", "reviewerName": "Henry D. Chin", "reviewText": "Works as advertised.", "summary": "Four Stars", "unixReviewTime": 1419984000}
{"overall": 4.0, "verified": true, "reviewTime": "12 27, 2014", "reviewerID": "A2OLBZMK0CSSN", "asin": "B00004YWK2", "reviewerName": "John H. Lambert", "reviewText": "This heat exchanger works quite well for the price. If you're handy or talented with bending sheet metal you could \"knock\" this product off fairly easily. The only issues are that the unit is a thin grade of plastic and feels a bit flimsy. I'll probably make one from sheet metal only for myself now that I see how it's made, works and is hooked up.", "summary": "Okay for the price.", "unixReviewTime": 1419638400}
{"overall": 4.0, "verified": true, "reviewTime": "12 25, 2014", "reviewerID": "A1DLJ89ZKZYNKQ", "asin": "B00004YWK2", "reviewerName": "Travis T.", "reviewText": "I had one of these years ago when I lived in a large old victorian home in Iowa.  It didn't really do much to help heat the house and it introduced way too much humidity into the gas heated house.\n\nNow that I'm in the Northwest, in a small house, with an open floor plan, and dry electrical heat, it works pretty darn well...\n\nThe added humidity is pleasant and the plants love it.  I'm heating approximately 1000sq ft and in about a half an hour after the dryer is running, the temperature in my back bedroom is up by 3 degrees.  I also bought some nicely scented dryer sheets and my entire house smells nice...\n\nI wish I needed to do laundry more often since it really does make a positive difference...LOL\n\nOnly 4 out of 5 stars since construction is quite flimsy; but it was ten bucks...", "summary": "it works pretty darn well", "unixReviewTime": 1419465600}
{"overall": 2.0, "verified": true, "reviewTime": "12 22, 2014", "reviewerID": "AJI6TL781ML9P", "asin": "B00004YWK2", "reviewerName": "phil  stockbridge", "reviewText": "NICE", "summary": "Two Stars", "unixReviewTime": 1419206400}
{"overall": 4.0, "verified": true, "reviewTime": "12 18, 2014", "reviewerID": "A2RD2YDV08F3Q1", "asin": "B00004YWK2", "reviewerName": "Randy", "reviewText": "The heat keeper was what we expected but the clamps weren't sufficient enough to hold the exhaust hose on and I had to use duct tape!", "summary": "none", "unixReviewTime": 1418860800}
{"overall": 5.0, "verified": true, "reviewTime": "12 17, 2014", "reviewerID": "A1M8RQ9IKLJP4W", "asin": "B00004YWK2", "reviewerName": "Jeffrey Goodell", "reviewText": "It is what it is for the price, satisfied", "summary": "satisfied", "unixReviewTime": 1418774400}
{"overall": 3.0, "verified": true, "reviewTime": "12 14, 2014", "reviewerID": "A16A7NQ3OENN62", "asin": "B00004YWK2", "reviewerName": "Tekla Tafoya", "reviewText": "Does exactly what it's supposed to--send that heat into the house.  Wish it had a square back or at least something to help secure it to the wall though so it doesn't have to rely only on the vent pipe for support.  Used two more \"ties\" to secure it to cup hooks on the wall.", "summary": "Does exactly what it's supposed to--send that heat into the ...", "unixReviewTime": 1418515200}
{"overall": 4.0, "verified": true, "reviewTime": "11 30, 2014", "reviewerID": "A1WM3L904FRRU2", "asin": "B00004YWK2", "reviewerName": "FRANK L KRAUSE", "reviewText": "I like adding the extra heat and humidity into the house during the winter. I recommend a nylon leggings over the end also for a finer filter", "summary": "works great", "unixReviewTime": 1417305600}
{"overall": 5.0, "verified": true, "reviewTime": "11 29, 2014", "reviewerID": "A38A7YZ8SLXIXH", "asin": "B00004YWK2", "reviewerName": "jk", "reviewText": "Easy to install. Heats the laundry room, the one room in my house that has no heat installed.", "summary": "does the job", "unixReviewTime": 1417219200}
{"overall": 5.0, "verified": true, "reviewTime": "11 28, 2014", "reviewerID": "AYJ6PQVLLZNSL", "asin": "B00004YWK2", "reviewerName": "Tripezius", "reviewText": "It's exactly what I wanted.  An inexpensive way to divert hot and humid air back into my house.  I did buy metal hose clamps, but I used the white ties it came with to hang the unit from underneath my cabinets which are mounted over the dryer.  Just screwed some hooks into the bottom of the cabinet and hung it.  Easy 15 minute project. My house is old, dry, and drafty.  The more moisture I can get the better. The more heat I can retain, the better.", "summary": "Easy 15 minute project", "unixReviewTime": 1417132800}
{"overall": 4.0, "verified": true, "reviewTime": "11 28, 2014", "reviewerID": "A2Y7SMAVZNBZSK", "asin": "B00004YWK2", "reviewerName": "Jeffrey N. Galin", "reviewText": "Works fine, just as expected.", "summary": "Four Stars", "unixReviewTime": 1417132800}
{"overall": 2.0, "verified": true, "reviewTime": "11 13, 2014", "reviewerID": "A12G2WSNGK58BK", "asin": "B00004YWK2", "reviewerName": "Brandan McCartan", "reviewText": "It is the thinnest plastic.  When flapped to Summer it doesn't seal very good.  I don't understand the drive to make things as cheap and thin as possible, I would easily spend $30 for a good one -- if it existed.", "summary": "When flapped to Summer it doesn't seal very good. I don't understand the drive to make things ...", "unixReviewTime": 1415836800}
{"overall": 4.0, "verified": true, "reviewTime": "11 6, 2014", "reviewerID": "A1GLL2VDHUWP5O", "asin": "B00004YWK2", "reviewerName": "P. Jarrett", "reviewText": "Great idea for adding humidity back that your normal heat sources steal from your home.  Would have given a 5 star if not for the fact that you need to buy metal rings instead of cable ties to hold it.  Also, invest in kneehigh stockings to cover the vent to prevent lint", "summary": "Great idea for adding humidity back that your normal heat ...", "unixReviewTime": 1415232000}
{"overall": 3.0, "verified": false, "reviewTime": "11 2, 2014", "reviewerID": "A3K9IRC89IN1TI", "asin": "B00004YWK2", "reviewerName": "Acqua Crush", "reviewText": "It broke at the swivel and I bought another one.", "summary": "Three Stars", "unixReviewTime": 1414886400}
{"overall": 5.0, "verified": true, "reviewTime": "10 26, 2014", "reviewerID": "A3MD7BIU52EXFX", "asin": "B00004YWK2", "reviewerName": "Nancy Ella Frye-swope", "reviewText": "Using it as I type...works great and puts plenty of warm humid air in a dry Eastern OR home.", "summary": "works great and puts plenty of warm humid air in a ...", "unixReviewTime": 1414281600}
{"overall": 4.0, "verified": true, "reviewTime": "10 7, 2014", "reviewerID": "A2LZXLVXKVE0N0", "asin": "B00004YWK2", "reviewerName": "Alaskan Guy", "reviewText": "This thing is awesome. Super easy to use and lets the heat that would otherwise be pumped outside be used in the house. Bonus if you live in a dry climate and need some humidity. Just open it from the start of the cycle for lots of humidity or about 15mins in for dryer heat", "summary": "This thing is awesome. Super easy to use and lets the heat ...", "unixReviewTime": 1412640000}
{"overall": 4.0, "verified": false, "reviewTime": "10 4, 2014", "reviewerID": "A2JY5CBH8Q7I2D", "asin": "B00004YWK2", "reviewerName": "Ken Berkowitz", "reviewText": "Warms the chilly basement area, as advertised.", "summary": "Why not use that heat?", "unixReviewTime": 1412380800}
{"overall": 2.0, "verified": true, "reviewTime": "09 27, 2014", "reviewerID": "A10FT9CYOHPU7E", "asin": "B00004YWK2", "reviewerName": "D. Carroll", "reviewText": "Plastic construction is too cheap to be effective and durable.  After the first 2 months of use, the plastic lever wouldn't catch to keep the valve closed.  A small accumulation of lint hindered the moving parts from achieving their full range of motion.  I removed it after 3 months and threw it away.\n\nThe seams were loose and allowed a lot of air to escape.  Some HVAC tape helped seal it up, but couldn't overcome the fact that this is an $11 piece of hardware.\n\nThe concept is great.  Build it to greater tolerances and improve durability, and I'd pay $50 for the ability to switch between external and internal drier vent exhaust!", "summary": "Cheap Materials and Construction", "unixReviewTime": 1411776000}
{"overall": 1.0, "verified": true, "reviewTime": "09 25, 2014", "reviewerID": "A1BB00SC9W8P7U", "asin": "B00004YWK2", "reviewerName": "McGuire SITE", "reviewText": "The box itself and the flap does not have a tight closure so a lot of air leaks out even when closed for \"summer\", It heats the room up very quickly. I pulled it out and will just disconnect my pipe and put a nylon around the end in the winter.", "summary": "Too hot for summer", "unixReviewTime": 1411603200}
{"overall": 5.0, "verified": true, "reviewTime": "09 21, 2014", "reviewerID": "A1J4H55CZMNTIN", "asin": "B00004YWK2", "reviewerName": "Mike B.", "reviewText": "This item works great in the winter.  Our washer and dryer are in our basement and it adds head and humidity to our house.  Also adds a fresh odor to the air from the drying cloths.  It is very easy to keep clean but you do have to keep the screen clean for efficiency.  Get one!  Mike", "summary": "This item works great in the winter", "unixReviewTime": 1411257600}
{"overall": 3.0, "verified": true, "reviewTime": "09 14, 2014", "reviewerID": "A2XXG5LYLAHU39", "asin": "B00004YWK2", "reviewerName": "EZ", "reviewText": "It's ok but the seams are not air tight.", "summary": "Dundas Jafine CHK100ZW Heat Keeper Kit With 2 Clamps", "unixReviewTime": 1410652800}
{"overall": 5.0, "verified": true, "reviewTime": "07 12, 2014", "reviewerID": "A2DRX3YDB4I4YG", "asin": "B00004YWK2", "reviewerName": "Tom in Tipp", "reviewText": "Warm", "summary": "Five Stars", "unixReviewTime": 1405123200}
{"overall": 4.0, "verified": true, "reviewTime": "07 10, 2014", "reviewerID": "AQ7HA3PPR7103", "asin": "B00004YWK2", "reviewerName": "wayne", "reviewText": "works pretty well, doesn't let in much lint at all.  Turning off/on not as great as would like.", "summary": "Decent product", "unixReviewTime": 1404950400}
{"overall": 2.0, "verified": true, "reviewTime": "07 5, 2014", "reviewerID": "A2LIKVWD9JJKHE", "asin": "B00004YWK2", "reviewerName": "Thomas E. Rance III", "reviewText": "The latch doesn't keep it closed.  Don't care for it.", "summary": "Cheap made.", "unixReviewTime": 1404518400}
