{"overall": 5.0, "verified": true, "reviewTime": "07 17, 2002", "reviewerID": "A1N070NS9CJQ2I", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Teri Adams", "reviewText": "This was the first time I read Garcia-Aguilera.  I came upon the name of this book on Live with Regis and Kelly. This book was exactly what I was looking for ... it hit the spot.  I really enjoyed this book because it was well written. Once I started this book it kept me coming back for more. It had culture, family, friendship and romance. I was looking for a little more romance when I picked this book but in the end it turned out to be just right.  I love the main chartachter Margarita (aka Daisy). I've never been to Miami but the way Daisy told the story I certainly felt I'd been there.\nAlso after going through all of Daisy's perils ... I closed the book with a feeling I had grown emotionally as well.", "summary": "Hit The Spot!", "unixReviewTime": 1026864000}
{"overall": 5.0, "verified": false, "reviewTime": "07 6, 2002", "reviewerID": "A3P0KRKOBQK1KN", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Willa C.", "reviewText": "As with all of Ms. Garcia-Aguilera's books, I think this is a MUST READ, impossible to put down. Successful deviation from past Lupe Solano series-captures the very essence of the excitement, local color and diverse fabric of MIAMI. Sensual and culturally enlightened!", "summary": "one hot summer is HOT HOT HOT!", "unixReviewTime": 1025913600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "07 3, 2002", "reviewerID": "A192HO2ICJ75VU", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Kit", "reviewText": "I've not read any of Ms Aguilera's works before, but after having just finished One Hot Summer I'm going to check out the Lupe Solano series I've heard so much about.  One Hot Summer is sooo steamy! Made me want to move to Miami!  Couldn't put the book down.", "summary": "One Hot Summer", "unixReviewTime": 1025654400}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "06 30, 2002", "reviewerID": "A2T278FKFL3BLT", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Andres", "reviewText": "This romance novel is right up there with the rest of her amazing mystery novels.  Being a guy, I was a little hesitant about reading a romance novel but I just had to give this book a shot because I have been such a huge fan of Garcia-Aguilera's books.  And to be honest, I absolutely loved this book.  I love the way she presents funky Miami and its crazy Cubans in not just this book but all her books.  Garcia-Aguilera did a superb job with this book, and I can't wait till her next book.  You gotta read this book!!!!", "summary": "I love this book!", "unixReviewTime": 1025395200}
{"overall": 5.0, "verified": false, "reviewTime": "06 28, 2002", "reviewerID": "A2ZUXVTW8RXBXW", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "John", "reviewText": "Carolina Garcia Aguilera has done it again.  She's written another highly enjoyable book and infused it with the right amount of Cuban-American tidbits.  My family and I cannot put her books down once we start and this one was not a let down.", "summary": "One Hot Book", "unixReviewTime": 1025222400}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "06 25, 2002", "reviewerID": "A21JDG4HA6OLPF", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Mari", "reviewText": "Not only can she write mysteries,but she sure can write a love story! This was \"ONE HOT SUMMER\" read that I couldn't put down !!!", "summary": "Carolina does it again!", "unixReviewTime": 1024963200}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "06 22, 2002", "reviewerID": "A2NCADLQY962YD", "asin": "0060009810", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "Once again Garcia-Aguilera has written a book that I just can't put down. I have read and love all her mysteries- so I picked up this romance with eager anticipation. I was not disappointed. The main character Margarita is easily likeable, which makes the trials she faces that much more intriguing. Sometimes you want to yell at the book and tell Margarita what she should (and shouldn't) do. But the author is measured in the development of the plot and keeps you turning the pages all the way to the end. Mix that in with an interesting take on Cuban exile politics and humorous insights on the world around Margarita and the picture of wild, steamy Miami is complete. Another winner from Garcia-Aguilera.", "summary": "It's no mystery, Garcia-Aguilera can do romance", "unixReviewTime": 1024704000}
{"overall": 5.0, "verified": false, "reviewTime": "01 26, 2006", "reviewerID": "A2UNA438B0FRA8", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "J. Belfield", "reviewText": "The timing is just right for a good book. Actually, it's long overdue. Therefore, I highly recommend you read this book. I promise you won't be disappointed. If this doesn't make the bestsellers list something is definitely wrong here. This well written story is so engaging, funny, almost true, etc. The character Beryl was funny and sad. Unfortunately, there are women just like her and people take advantage of them. What we won't do for love. Penn said, women can be so stupid. He told her he love her on their first night together and she belived him. That was her demise right there.", "summary": "A breath of fresh air for reading", "unixReviewTime": 1138233600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "01 21, 2006", "reviewerID": "A2NQQSHSQKKGEX", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "E. D. Davis", "reviewText": "Engaging. Dark. Reading the book you could almost feel the train wreck about to happen.  The collision of characters is painful yet stimulating.  Files show the depth of her writing in this book especially by showcasing her ethnically diverse cast.  It wasn't what I was expecting, but if you can get past the initial character introductions you'll be hooked!  The sex and graphic violence can be overwhelming and hard to stomach, but it's what makes this book...the book.  If you like tidiness this isn't the book for you...it's everything, but tidy.  Personally, I was slightly disappointed in the final direction of the book, but from a literary perspective this is close to a masterpiece.  Her books just keep getting better and better.  This one really pushes the reader mentally and educationally through her use of real literary terms and vocabulary words that may require a quick tour through Webster's.", "summary": "Well written page turner with fully develped characters", "unixReviewTime": 1137801600}
{"overall": 3.0, "vote": "7", "verified": false, "reviewTime": "01 18, 2006", "reviewerID": "A5EXND10WD4PM", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Mocha Girl", "reviewText": "Set amid the backdrop of New York City's impervious and highly competitive literary world, a disinherited, struggling writer, Penn Hamilton, plots his course to stardom.  Born with dastardly good looks and a genius I.Q., Penn seduces the top editor in the business, Beryl Unger.  Beryl is a homely, narcoleptic, obsessive-compulsive workaholic who instantly falls for Penn's charms and his manuscript.  The spin-doctors are engaged and Penn, as much as his novel, is an overnight sensation.  The money, power, respect, and women ensue.  When Beryl discovers that Penn has another lover and threatens to expose him and ruin his budding career, Penn ends the charade by committing a heinous crime.\n\nThis novel is a dark comedy, filled with cynicism and wit, and a touch of satire surrounding literary figures (editors, agents, etc.) and concepts (Wagner's Gesamtkunstwerk).  Files offers a credible plot behind the evolution of Penn's ascent as an artist and embodiment of himself as a \"brand\" spanning all genres - music, fashion, literature, cinema, even legal scandals - the total package.  He becomes an infamous, opportunistic, conniving, heartless protagonist - and yet, he is still fairly likeable.  Files keeps the novel fresh and hip.  Through Penn, the reader hangs with the \"in crowd\" and meets modern icons in today's entertainment arena.\n\nIf readers are adventurous enough to veer away from the \"Reesy and Misty\" novels and are patient enough to appreciate the rather lengthy passages dedicated to character development, the underlying ripples of black humor, and the clever infusion of actual literary works and personalities, I think File's fans may appreciate this book as an enriched departure from her traditional `girlfriend' type of novels.\n\nReviewed by Phyllis\n\nAPOOO BookClub", "summary": "The Title Tells The Story!", "unixReviewTime": 1137542400}
{"overall": 5.0, "verified": false, "reviewTime": "01 18, 2006", "reviewerID": "AVJ37XQN3ID16", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Kirsten A. Bischoff", "reviewText": "A guilty pleasure of a book with characters so well formed, dialogue so entertaining and a story so well plotted that you want to consume it whole, gorge yourself on it and then call up everyone you know and love and recommend it to them.  That is exactly my reaction to \"Sex. Lies. Murder. Fame\" by Lolita Files.\n\nIn the tradition of Kurt Andersen's fictional dissection of the nineties in \"Turn of the Century\", and Tom Wolfe's mining of the excesses of the eighties in \"The Bonfire of the Vanities\", Ms Files has written a titillating exploration of fame and branding in the twenty-first century.  Sex. Lies. Murder. Fame is a wild adventure through a pop culture world spinning on the axis of the NYC publishing industry and all it's media related tentacles.\n\nBeryl Unger, top editor at Kittell Press, sufferer of narcolepsy and obsessive compulsive disorder is on the hunt for \"him\".  The one.  The man of her dreams.  (But reader - I beg you - before the past six years of \"chick lit\" that has been thrown at us clouds your judgement  - please hold back your pre-conceived notions about reading a book about a woman looking for love.  Make no mistake - this is a bona fide novel - with no cutesy \"lit\" categories to describe it.)  When Beryl finally meets \"him\" he comes in the form of one Pennbook Hamilton, a murderous, mentally warped, Ivy League genius that just so happens to have written a novel.\n\nWhat follows is a tale of love, murder, deceit, fame, fortune and cross merchandising.  It is a mental feast chock full of real time culture, witty dialogue, fascinating multi-dimensional characters, and bedroom (and bathroom stall) scenes that would make Judith Krantz blush.\n\nThe book flap says Kanye West has optioned one of Ms. Files other novels for film development and I sincerely hope that the lucky Hollywood executives who have (or will) stumble onto this story take note of Beryl's marketing genius and cross promote the hell out of Ms. Lolita Files.  Well done.", "summary": "So much fun", "unixReviewTime": 1137542400}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "01 10, 2006", "reviewerID": "A21NVBFIEQWDSG", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Armchair Interviews", "reviewText": "I'd never before read a Lolita Files' book, and was unsure what to expect. By the title I expected a dreary story about the sexual reawakening of an unimaginative married woman, whose sister is sleeping with her husband, in a town where an old friend arrives who likes to video tape frank interviews.... This story is far from that.\n\nThe novel's narrative style is attention grabbing, and the story itself has a modern \"feel\" to it. Three lead characters run through most of the story and all jockey for lead position at some point in this comedy of flaws, rather than errors.\n\nIt is centered on the New York publishing world, and because it manages to paint such an unflattering picture of the profession, it's amazing the story got published at all. It probably because it is funny, and delightfully cynical.\n\nIf you like modern black humor, then this book is for you. Let's just say that the title of the book is fairly accurate.\n\nBeryl Unger is a narcoleptic who also has Obsessive Compulsive Disorder and just happens to be an editor to a major publishing house. Gradually over the span of the story, you grow in sympathy towards this abrasive powerhouse, as she's her own victim.\n\nAnother character is Sharlyn Tate, a major star in the publishing world and author of many books, several of which were best sellers. Trouble is, she's bored. Her billionaire husband is never home, and she's got writer's block. Whether she realizes it or not, and despite her awareness of the seedier side of life, she's just waiting to be taken advantage of.\n\nEnter Pennbrook A. Hamilton, Penn to the world now. A genius with a 210 IQ, but a humility rating of zero. This superficially perfect specimen of a man is the puppet-master of the story, whose calculating logic and ambition is the meat of the book.\n\nArmchair Interviews says: This story is so sharp that it should cut itself to shreds. If this is the benchmark of Lolita Files' work, then we'll be keenly looking out for more books by this author. Delightfully wicked.", "summary": "Delightfully wicked!", "unixReviewTime": 1136851200}
{"overall": 5.0, "verified": false, "reviewTime": "10 9, 2008", "reviewerID": "A1KWVR13XUOGQG", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Lawence A. White", "reviewText": "Wow, I was totally blown away by this book.  Just when I thought that I had gotten to the good part, it got better.  I was shocked by the plot twists and turns.  I would recommend this book to anyone who is a fan of the author.", "summary": "Lolita Files Does It Again", "unixReviewTime": 1223510400}
{"overall": 4.0, "verified": false, "reviewTime": "04 24, 2008", "reviewerID": "A2PH70X2FVDDGH", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Book Princess", "reviewText": "Lolita Files is one of my favorite authors. She is an excellent writer, and her stories are very entertaining. Also, she creates believable characters. And if it wasn't for all those reasons, I would have hated this book. In the beginning, the story is so gripping and funny. Then at some point, it's no longer funny because of immoral acts committed. And then when you reach the end, you are left hanging. I wanted to rip this book into pieces. Such a disappointing ending, but I'm glad I read it.", "summary": "A superb storyteller", "unixReviewTime": 1208995200}
{"overall": 3.0, "verified": false, "reviewTime": "08 16, 2007", "reviewerID": "A25R6KND6KDDCU", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "S. L. Jackson", "reviewText": "This book is...I don't even know what to call it. It's truly is horrible for the first 100 pages. It's nothing like you've ever read or ever would expect from Lolita Files. I bought it (for like a quarter) despite all the bad reviews cause I just had to see for myself. Besides I usually like different stuff anyway. But as I was reading it, I couldn't believe this was the same author who wrote Child of God. BUT WAIT, HERE'S THE CRAZY PART, after about the 100th page, this novel gets insanely good! I mean it gets AMAZINGLY good!!! So if you can hang in there for that long (and the first part is terrible) then this is a really good story. I don't know what was going on with Miss Files when she penned this one, but it's definitely a bittersweet achievement.", "summary": "Crazy, Just Crazy", "unixReviewTime": 1187222400}
{"overall": 4.0, "verified": true, "reviewTime": "08 5, 2007", "reviewerID": "A1X7HRXX3BJXQ8", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "a reader", "reviewText": "EXTREME WARNING: Unless your computer has updated Norton Anti-virus protection or comparable protection against covert & malicious software (which infects your computer & then downloads all your files at night by spies) DO NOT ACCESS ANY OF MY REVIEWS!!! [This is no hype or joke.]\n\nRegarding sex in literature, I try not to be prudish in my sensibilities, but I have sometimes been offended by \"filth\"--openly self-serving, very often freakish, and explicit sex--which serves no literary function other than as TNA & DNA pornography--usually written in a \"blue\" language of sexual explitives and expressions--and used only for the sake of selling smut books to lonely, sexually unfulfilled, mostly middle-class women. Most books such as these are terribly written by wanna-be and talentless writers.  A few do have real talent, but nonetheless are still manipulative seekers of mass-market suckers.\n\nIntrigued by the wide disparity of reviews expressed (hated-it/loved-it) for Lolita Files novel SEX.LIES.MURDER.FAME I decided to read it for myself and form my own opinion.  Here it is:  I think this novel was excellent!! Yes, the sex was raunchy and explicit, but it is exactly this which pimps, sexual predators, and sociopaths use to manipulate and/or degrade women--because it's women they hate--and think are all stupid. The novel's protaganist, Penn, is a sociopath, or as we old-schoolers would say, a psychopath. (A book which I correspondingly recommend for reading is THE SOCIOPATH NEXT DOOR.  Sociopaths are often CHARMING PEOPLE!!! Sometimes with very high IQ's. But god help those who live next door to or who fall under the spell of any such \"pretty boys\"...like the notorious serial killer, Ted Bundy.\n\nLesson to be learned??? Plain men who get a \"pretty girl\" will almost certainly lose their money (perhaps, someone like Russell Simmons.) But plain or pretty women who get \"pretty boys\" might also lose their lives.\n\nI appreciated the wit and intelligence of Lolita Files in SLMF, particularly the way she used literary and philosophical theories and quotes as appropriate examples of the novel's characters. Had some of the language and sex been less explicit and openly \"blue\" and a little more implied, it might be perceived as a masterwork of literature. Even so, I enjoyed the book, and read selected passages (sans some of the blue notes) to my 22 year old and very religious daughter. Because women--all women--need to hear and know the things Lolita Files teaches--things which are much more effective (Straight, no chaser) when told by other women. I say, Thanks, to Lolita Files.\n\nFrom a Black Man, a Black Father, and a reader.", "summary": "Suckers Always Pay For Beauty----One Way or Another", "unixReviewTime": 1186272000}
{"overall": 4.0, "verified": false, "reviewTime": "07 19, 2007", "reviewerID": "A4KWKERR4FVWC", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "L. Davis", "reviewText": "I don't want to say it was a bad book. Ms. Files has once again demonstrated her command of the written word, but the story was just overall a dark comedy, if I could call it that. Some parts were funny, and the ending, I wanted-if I could borrow a term from one reviewer-closure. All matters resolved. I got to the end and was like, 'okaay, now what?' If you're looking for her usual sistah-girl lit, you won't find it here. A great departure (not her first) but her talents as a writer still keep me as a fan.", "summary": "Um....well...", "unixReviewTime": 1184803200}
{"overall": 4.0, "verified": false, "reviewTime": "04 10, 2007", "reviewerID": "A1A4KLWL4O1JXY", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Tracey Cee", "reviewText": "I've been a Lolita Files since day one, but was leary of this book because of the title. So unlike \"Scenes From A Sistah\" and \"Getting To The Good Part.\" I generally don't read books with the word sex in the title because I want to get more out of book than that. The first chapter of this book was just a little too much Beryl, but I guess Ms Files felt like we needed a solid understanding of Beryl and she was right. Though this book is unlike her others (along with Child Of God)I thought it was an excellent page turner and was amazed that the woman who wrote \"Scenes From A Sistah\" could flip the entire script and invent these characters and add them to paper. Lolita Files is a SERIOUS talent who can write damn near anything you're interested in reading and I hope that this show of skills leads to bigger and better things for her. You go, girl!!!", "summary": "Shocking, funny, sexy", "unixReviewTime": 1176163200}
{"overall": 1.0, "verified": false, "reviewTime": "01 11, 2007", "reviewerID": "A33CQQQ6H25GGD", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Candice Savage", "reviewText": "I consider myself a true fan of Ms Lolita Files, I have been following her career since Scenes from a Sistah and for her to release something like this is disappointing. I haven't even finished the book, because I have yet to understand what it's about. If she released another book I wouldn't hesitate to buy it because I know her talent, she just slipped up on this one.", "summary": "Disappointed!", "unixReviewTime": 1168473600}
{"overall": 2.0, "verified": false, "reviewTime": "11 16, 2006", "reviewerID": "A2RH8YVDQRRPNV", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Corinthia A. Jones", "reviewText": "I do not like the fact that my book was a library book. If that was the case, I would have went to my own library and got the book. I do like the book but I don't like all the labeling over it. I had to take off stickers from the book!", "summary": "Library book!", "unixReviewTime": 1163635200}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "10 29, 2006", "reviewerID": "A1OXHHS3LUGPTQ", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "K. A. Jones", "reviewText": "I thought the theme of the book was interesting, but the book had too much going on. It had too many characters and the plot was EXTREMELY far out there. The graphic nature of Penn's behavior is sickening. I read another reviewer say that she understood why he was so cruel. I would have to disagree. There is no justification for him being such an arrogant maniac. Also with the technological advances of forensics today wouldn't the police be able to track him down ? The language was a challenge which I liked, but I would not recommend this a read for those who want a \"light\" read. Too heavy for me :|", "summary": "Difficult to follow", "unixReviewTime": 1162080000}
{"overall": 3.0, "verified": false, "reviewTime": "10 3, 2006", "reviewerID": "AUMYX5PJBJVNJ", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "DevJohn01", "reviewText": "If so then it deserves 5 stars and all the praise some of the other reviewers gave it.  If not then I can only, in good conscience give it 3 stars...and maybe that is being generous. It said on the back flap that this was supposed to be a satire, a satire of what I am not sure though.  I enjoyed this book up until about half way through when it just became so preposterous that I kept finding myself laying it down to have a good laugh.  Everything about the second half of this book was utterly ridiculous and had the feel as though it was written by someone who does not live in the real world.  Also the ending, in my opinion, left a lot to be desired.  There were many questions left unanswered and no real feeling of closure.\n\n`SEX.LIES.MURDER.FAME' is the first book by Lolita Files that I have read but despite my particular distaste for this book I do plan to pick up some of her previous works as I hear they are supposed to be very good.  The one saving grace for `SEX.LIES.MURDER.FAME' was the prose, Lolita Files is obviously a talented writer who should stick with story lines based somewhat in reality.", "summary": "Was this supposed to be funny???", "unixReviewTime": 1159833600}
{"overall": 4.0, "vote": "7", "verified": false, "reviewTime": "07 31, 2006", "reviewerID": "A2BZ7MYTSNYMEW", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Michelle L. Beck", "reviewText": "I am one of the few, it would seem, that enjoyed this book. First I must say that I normally do not Lolita Files' (with the exception of \"Child of God\" which I thought was brilliant!! A++). I grew tired of the sister girl themed books a long time ago. But this one (like Child of God)I could not believe that she had written. There was the usual stuff...sex and betrayal...but there was also subplots that I enjoyed immensely. I thought this book was very creative and an easy read, although there were a few things that I would have liked to change or see.\n\nIf you need a brief narrative of what the novel is about....Meet Penn Hamilton(handsome and sexy - I think there was a reference to him supposedly resembling Brad Pitt in the book; and intelligent-apparently he has an IQ of 210) who should by all accounts be a success, but hasn't found the right person to promote his book. Enters Beryl, a narcoleptic, obsessive compulsive individual who dresses nicely, but apparently is nothing to look at. You guessed it, they secretly become a couple...she wants to live her fantasy in real life, and he wants his book published. Not only did she promote the book, but Apple/IPOD, Starbucks, and other large entities (including a rap artist) bidding for the newly discovered Penn, and they didn't even know what the book was about.  You guessed it, there are a series of twists and turns in a book filled with secrets and surprises. There are several interesting characters and a lot of character building. Now, this is the problem that I had with the book, I thought that there was a lot of ground work in the beginning that wasn't necessary. All the good stuff was in the end...and some of that could have been explained more. I thought the relationship between Penn and his best friend Mercury should have been discussed more, especially at the end.\n\nOne thing that I loved about the novel was that the character that you were suppose to hate (Penn), you didn't. His complexities and nuances became endearing qualities...or at least you definately didn't hate him, and in a way you understood him. His background is interesting (parents, musical prodigy..etc).\n\nBut what I enjoyed the most at the end was the way Files left it to your imagination if Penn is up to his murderous ways once again, and if he is...who will protect him now.", "summary": "It would seem that I am in the minority!", "unixReviewTime": 1154304000}
{"overall": 3.0, "verified": false, "reviewTime": "07 24, 2006", "reviewerID": "A1R6DXXISX0FI2", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "C. M. Jones", "reviewText": "i've read \"Scenes from a Sista\" and \"Blind Ambitions\" and i love them both. this book just pissed me off. first, i thought that Beryl would find this man she was looking for. then on being introduced to Penn, the amazingly smart and sexy writer who treats women like play toys, i knew it was all going to end badly. Penn pissed me off. the ending pissed me off. this damn book just pissed me off.", "summary": "what the hell?", "unixReviewTime": 1153699200}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "07 9, 2006", "reviewerID": "A27385LU50J4JJ", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Kim Burlee F.", "reviewText": "I bought this book thinking that it was the normal Lolita Files..Not the \"New and Improved Lolita Files\" I thought this book was really great. However, If you would have asked me that when I was on chapter's 1 and 2 I would have told you I'm going to throw this book out the window. I thought where is she going with this book. However, by the time you get to chapter's 3 and on it all comes together. You really get a feel for the people in the book and I was really glad I hung in there. Great, great book. Bravo Lolita!", "summary": "Kim's thoughts...", "unixReviewTime": 1152403200}
{"overall": 5.0, "vote": "5", "verified": false, "reviewTime": "06 7, 2006", "reviewerID": "A1DGKH6MTDLWNG", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "M. N. White", "reviewText": "I was a bit leary about this book based on the other reviews I had read.  This was my first time reading a book by Lolita Files.  I didn't quite know what to expect.  I must admit, I was not let down!  This book is a very well developed story, a page turner, a jaw dropper and a tad bit funny, to say the least.  Anyone reading this book must give it a chance to develop, it is well worth it.  Ms. Files is brilliant and obviously diverse in her craft.  I can't wait to talk about it with my fellow book club members.", "summary": "Loved it!!", "unixReviewTime": 1149638400}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "06 7, 2006", "reviewerID": "A4OV8BBDDLRZ5", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Katherine Jones", "reviewText": "Anyone that says they didn't like this book, needs their head checked! Ok, I admit the first 40 pages were slow; but it was necessary to setup the characters personalities; after that, the book took off, and I couldn't put it down. Yes this book was nothing like her other fabulous books; but that's not a bad thing. Anyone that is open-minded to new ways of writing, will love this book.\n\nPenn Hamilton is a bitter, wounded, genius, trying to become famouse. I wanted to hate him so bad, but I found myself understanding how he became the man he was. Although he took it to the extreme.\n\nBeryl on the other hand was just down-right crazy.\n\nAll the twists and turns in this book made this the best Lolita Files book to date. I loved it and can't wait for the next book.", "summary": "I Loved This Book!!!", "unixReviewTime": 1149638400}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "05 25, 2006", "reviewerID": "A2NKZK0VM5JB9P", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Sand", "reviewText": "Great Job.  The characters, story and attention to detail are what I enjoy most about Ms. Files' writing.  I was really impressed.  Ms.  Files takes you on a rollercoaster ride of intensity that stops, suddenly, making you want more.  I can't wait for the next one.  Keep up the good work!", "summary": "I Loved It - Strap On Your Seatbelt and Hold On!!!!", "unixReviewTime": 1148515200}
{"overall": 3.0, "vote": "4", "verified": true, "reviewTime": "05 23, 2006", "reviewerID": "AC0N6E128OYZH", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Paula Marshall", "reviewText": "This was the second book that I've read by this author and will be my last.  I found this book to be very difficult to get into and just couldn't finish.  If you do decided to read this book, make sure you have your dicitionary close by...", "summary": "I Couldn't Finish", "unixReviewTime": 1148342400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "05 18, 2006", "reviewerID": "AQAA34NX136AP", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Darlene D. Gamble", "reviewText": "Ms. Files has once again left me breathless! I got educated,  got mad, got excited and then finally just wanted to smack Beryl up side her head for being just too desperate, too needy and just plain old stupid...but then again what can you expect from a woman who has some serious mental deficiencies!\n\nWhat I can I say about Penn Hamilton...unbelievable, arrogant,  conceited and just CRAZY DERANGED!!!\n\nI loved the book but in the end I felt that there were still some unresolved issues with Penn. Have we heard the last from Penn Hamilton?\n\nThanks Ms. Files for a most intriguing read! You have once again fulfilled my expectations of delivering a great story with such spice. You are a master storyteller and you have the gift of making your characters come to life for your readers.\n\nYour imagination is just so overwhelmingly vivid that it can only be a gift from God! I am looking forward to your next master piece!\n\nThis deserves a 10 star rating!!!!!!\n\nDarlene Bullock-Gamble", "summary": "Oh my goodness...this book is just too much!!!!!", "unixReviewTime": 1147910400}
{"overall": 5.0, "verified": true, "reviewTime": "05 8, 2006", "reviewerID": "A12CK830R4WVMY", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Sydney Molare&#039;", "reviewText": "I've read the Reesy and Misty novels and was not impressed. But because I'd read Child of God, I did pick up this novel. And boy am I glad I did. Lolita Files outdid herself. The writing was superb. It was as if someone else wrote the Scenes from a Sistah and this one. As the pieces of the puzzle fell into place, two things stood out in my mind: We can be quite foolish even when we know better and money can paved under many, many sins. Either way, Sex. Lies. Murder. Fame is worth the money!", "summary": "Best Work to Date!", "unixReviewTime": 1147046400}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "05 7, 2006", "reviewerID": "A2VKWLCNZF4ZVB", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "The RAWSISTAZ Reviewers", "reviewText": "Beryl Unger, a high school dropout, narcoleptic, obsessive-compulsive young woman, moves up quickly in the publishing world. She is the editor you need if you want to be a best selling author. Sharlyn Tate, her only friend and best selling author of romance novels, knows this. Penn Hamilton, young, handsome, a brilliant writer with an IQ of 210 wants it - money plus fame, so he begins to woo Beryl. As a just-in-case scenario, he keeps his eye on Sharlyn too. If he can't get in with Beryl by himself, he has no qualms about using Sharlyn to get to Beryl. As it turns out, Beryl is immediately smitten with him. She has waited her entire life for this wonderful man. Soon, Penn is the man to be: every woman in America wants him. Will Beryl be able to hold onto him? What about Sharlyn's growing feelings about him even though she is married to a billionaire? This volatile mixture has surprising results. Look out world!\n\nLolita Files has written a superb novel, SEX.LIES.MURDER.FAME. The suspense grows and grows as you wonder who is going to get murdered since there are so many characters that invite this disaster. There is plenty of steamy sex and almost everyone in the novel has some ulterior motive for behaving as they do. No one is straight. It is an interesting study of the world of people seeking wealth and fame. Ms. Files develops the characters so well you feel as if you know them. It is a book well worth reading.\n\nReviewed by Alice Holman\n\nof The RAWSISTAZ Reviewers", "summary": "What won't be done for fame?", "unixReviewTime": 1146960000}
{"overall": 4.0, "verified": false, "reviewTime": "05 4, 2006", "reviewerID": "A2IERWULVCFCEK", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "It was kind of hard to get into. If I hold on to a book longer than 3 days...it's not that good & I had this for a week. Not the typical Lolita in my opinion.", "summary": "Hmmm", "unixReviewTime": 1146700800}
{"overall": 5.0, "verified": false, "reviewTime": "04 30, 2006", "reviewerID": "A1KQY3BIGXW2KV", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "author S. Locklair", "reviewText": "Addictive. Dangerous. Satisfying.  Bad for my health AND social life. Simply put: ON FIYAH! Lolita Files' writing scorches; her character Penn Hamilton's charm (and looks) sears; together they will burn a spot in your heart (and fantasy-filled mind) and put your bookshelf in a serious blaze.\n\nsex.lies.murder.fame. is ab-so-liciously incredible! I loved every word...every minute....I savored every second I spent between the covers. Pure genius; excellent talent!\n\nFiles' writing oozes talent; it reaches out, grabs you, plays with you, and leads you along the journey of a story that's full of the drama, the sex, the lies, the Life we all dream of living and love to read about. sex.lies.murder.fame. is THE book you won't let out of your sight or out of your hands. You will tell your friends about it and then make them go buy their own copy because they WILL NOT be getting their hands on yours.\n\nGo ahead and \"shoop\" now, because after you read this book, you will...exhale.", "summary": "Abs-Fab; all the way----a must read!!!", "unixReviewTime": 1146355200}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "04 29, 2006", "reviewerID": "AQY1WFRJ2XH7E", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "K. Walton", "reviewText": "Kudos to Lolita Files for leaving Misty & Reesy behind and charting new territory with Sex. Lies. Murder. Fame!\n\n(I loved Misty and Reesy too, but it was REALLY time to move on after 3 books.)\n\nSex. Lies. Murder. Fame is not an easy read for the average reader.  It does start slowly for the purposes of character development, but, because Lolita is such an excellent writer, your interest increases as the storylines develop.  By the book's end, I was literally sitting on the edge of my chair, reminding myself to read - not skim - to the last page.\n\nSo much of current African-American fiction has been dumbed down and \"ghetto-fied\" to appeal to the under-educated masses that many will not appreciate the rich texture of this book.\n\nI absolutely loved it!  SLMF is a breath of fresh air in a very tired and sometimes frightening genre of poorly-edited, self-published African-American fiction that increasingly features hoochie-mamas, baby mamas, pimps, drug dealers, knocked up teenagers, and simple sorry azz characters.\n\nKudos again to Lolita Files.  Please keep it up!  There are MANY readers who want more of this style and content of writing!!!", "summary": "Excellent!", "unixReviewTime": 1146268800}
{"overall": 2.0, "vote": "3", "verified": true, "reviewTime": "04 26, 2006", "reviewerID": "A1H0J4Y7FIPL7N", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "B. Eaves", "reviewText": "A friend told me about Sex. Lies. Murder. Fame. Sorry I bought this one. I had a hard time finishing it. What a boring read. I like Ms. Files novels, but this was not her stye. Almost like someone else wrote this. This will not be a book club book.", "summary": "Use Your Library Card", "unixReviewTime": 1146009600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "04 22, 2006", "reviewerID": "A2EOXPEU0CEWGD", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Newyorkdreads", "reviewText": "First of all I have to give props to Amazon for allowing us a place to \"Big Up\" or \"Down Grade\" our favorite authors, Nuff said.\n\nI was like a few of my fellow Amazonings Readers and Commentors, I almost returned the book without finishing it. However, thank all the lucky stars I did. Also like many readers, I am a huge Lolita Files fan. Yo, check out \"Child of God.\"\n\nNow, let me give you my insight into an amazing book. Yes, this book will have you questioning what the Hell is going on! But don't stop, and stop thinking that all black writer should stay put, White writers don't. Jackie Collins has a mulititude of things going on in her novels. I am finding that many writers are adding race to their novels, Ann Rice, Jude Deveraux, and some others. However staying on track, this writing is about Lolita's Fantastic book.\n\nIn my opinion, this book was about a white boy who epitomies the word \"Slave Master\" in the realest sense of the word. I blame Penn's parents for his outlandish behavior. I blame women for being as Penn states \"the stupidest creatures on earth\"  Yo dude even had a best friend \"a brother\"  A black man no less, being his \"Igor\" you gotta love it.  This dude had it all Two black women at his beck and call, a black man at his beck and call, a full population of people at his beck and call. He was a scary dude, a genuis no less, a Frankinstien of our own making.\n\nDon't let the other commentors sway you from reading this book. You don't have to buy it if you don't want to however, you should at least give it a chance and read it. Let's try to allow our writers to move back and forth with their writings, like they allow us to be so free with our comments.\n\n However, when it all said and done this was a book, a work of fiction, a writer who took a story and did her damn research, even if her Beryl didn't have the same kind of OCD as the \"Veil of Flowers\" had she not added that part into her story you would not have be so amp to go check on it, would ya.  I also did my own research I wanted to know if the Mcclosky was a real bed owned by a real company, it was!\n\nGirlfriend had me doing a lot of dictionary and Google searches. For Real!\n\nYo \"Lo\" you did your thing with this one, it was off the hook for sure!\n\nstill a fan!!!", "summary": "If you are a Filies Fan Stay Put for an Adventure!", "unixReviewTime": 1145664000}
{"overall": 5.0, "verified": false, "reviewTime": "04 21, 2006", "reviewerID": "A2GQ0WGM9BYX9O", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "NaughtiLiterati", "reviewText": "It is a true shame that some people can write reviews; people who have NO IDEA WHATSOEVER what they are talking about because they don't understand or appreciate literature, but rather garbage peddled to them on streetcorners just like crack. People are missing out on terrific books because of ish like this. *sigh*\n\nThis is a REMARKABLE satire of the publishing and entertainment industry, written extremely well and very funny; a send-up to each profession and the celebrity-driven greed that fuels it, leaving you turning the pages and disappointed ONLY in the fact that the story is over.\n\nI'm looking forward to a sequel, and while I'm not going to give a synopsis cause it's already THERE, I had to chime in and give a counter opinion to those slamming the book because they thought it was gonna be another \"you go gurrrrrrl, he ain't ish\" story. Worth checking out and if you don't, your loss! It will wow you!", "summary": "Wittiest book I've read in years!", "unixReviewTime": 1145577600}
{"overall": 2.0, "vote": "3", "verified": false, "reviewTime": "04 20, 2006", "reviewerID": "A3XQ698O5V3SY", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "D. Henderson", "reviewText": "I am a big fan of Lolita Files work but this novel stunned me into dissapointment. It was extrememly hard to get through and I only finished it to see if the ending would be highlite of the book. The character development went on forever and she seem to repeat herself a lot in this book. I'm all for my favororite authors to veer off to another stlye of writing but this is just strange and I hope I never have to read a book like this from Miss Files ever again. Please bring back Misty and Reese or even a story like Child of God would be better.", "summary": "A big dissapointment", "unixReviewTime": 1145491200}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "04 17, 2006", "reviewerID": "A153ACYVEKV1QF", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "book mirage", "reviewText": "I'm a fan of Lolita Files books that this book did not grab me. I started one week ago and I'm still struggling to finish.", "summary": "not a page turner", "unixReviewTime": 1145232000}
{"overall": 3.0, "vote": "2", "verified": false, "reviewTime": "04 17, 2006", "reviewerID": "A2V9AQK1OV6H3X", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Terri P.", "reviewText": "I'VE NEVER HAD TO FORCE MYSELF TO FINSIH A BOOK BY LOLITA FILES, BUT THIS ONE I DID STRUGGLE WITH, AND I'M NOT SURE IT WAS WORTH THE STRUGGLE, BUT IT'S CERTAINLY NOT THE WORST BOOK I'VE READ ALL YEAR.\n\nI USED TO RECOMMEND MS. FILE'S BOOKS, BUT I'M GONNA STOP THAT FOR AWHILE AND WAIT AND SEE HOW HER NEXT COUPLE OF BOOKS TURN OUT BECAUSE I THINK SHE'S FALLEN OFF A BIT.\n\nMY HOPE IS THAT SHE'LL COME BACK, THOUGH, CAUSE I THINK SHE'S VERY TALENTED, AND I LOVED HER MISSY AND REESE CHARACTERS.", "summary": "NOT AS GOOD AS OTHER LOLITA FILES BOOKS, BUT OKAY", "unixReviewTime": 1145232000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "03 31, 2006", "reviewerID": "A2YN51EGQGBD48", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Donna Hill", "reviewText": "Sex. Lies. Murder. Fame is one of the best books I've read in ages.  Not only was it intelligent, it was brilliantly crafted and the characters whether you liked them or not were fully formed ready to walk off the page. Finally a book that requires some thought and introspection and not the usual light fare that you can read while doing one hundred other things at once and not miss a beat. If you want a book that will challenge you as well as entertain, this is the book for you.  I will be using it in my writing course.\n\nCongrats Lolita on a job more than well done!", "summary": "Brilliant!!!", "unixReviewTime": 1143763200}
{"overall": 1.0, "vote": "3", "verified": false, "reviewTime": "03 30, 2006", "reviewerID": "A2IKMA0VS49JNY", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "LOVING&#034;O&#034;", "reviewText": "This book was awful.  I made myself read it thinking it would get better--it never did.  I had to force myslef to complete it.  I truly like this author but she missed the boat this time!", "summary": "What the ????", "unixReviewTime": 1143676800}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "03 24, 2006", "reviewerID": "A3BJYYTYPPZZPD", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Stephanie Hicks", "reviewText": "This book was very disappointing. This was the first time I ever bought a book from an author I didn't know anything about and I'll never do it again. I started to return the book when I first got it because it had a slow start but I forced myself to read it. I don't know if this author meant to sound cruel or mean but she did. The characters were so unbelievable, I couldn't picture them in my mind. There was so much unimportant fluff in this book, it was crazy.  At the end of the book, I just started skipping over the drawn out parts, which were many. I don't think I really know the ending but I wasted enough time on it.", "summary": "The word \"disappointed\" does not say enough.", "unixReviewTime": 1143158400}
{"overall": 1.0, "vote": "5", "verified": false, "reviewTime": "03 20, 2006", "reviewerID": "A2VVSPHNZXHXJO", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "L.R.", "reviewText": "THIS BOOK IS SO FAR REMOVED FROM THE REESY/MISTY SAGA THAT I DIDN'T EVEN RECOGNIZE THE AUTHOR UNTIL NEAR THE END.  WHAT WAS THE POINT IN GOING ON AND ON ABOUT PENN'S \"GOOD LOOKS\" ( A SUBJECTIVE TERM BY THE WAY)?\n\nAS FOR BERYL'S \"HIDEOUS\" APPEARANCE, WHEN YOU HAVE THAT MUCH MONEY, ARE YOU REALLY TRAPPED WITH WHAT YOU WERE BORN WITH?  NO MENTION EVER OF POSSIBLE PLASTIC SURGERY.  AND WHAT EVER HAPPENED TO INNER BEAUTY?  DID SHE LOOK LIKE THE ELEPHANT MAN, OR WHAT?\n\nPLEASE DO NOT WASTE YOUR MONEY ON THIS GARBAGE.  THIS IS THE LAST OF LOLITA FILES' BOOKS I'LL READ.  IT WAS FILTHY, UNREALISTIC, AND SIMPLY IN BAD TASTE.", "summary": "WHAT IS THIS!!!!!", "unixReviewTime": 1142812800}
{"overall": 2.0, "vote": "20", "verified": false, "reviewTime": "03 11, 2006", "reviewerID": "A3AU9FL6SU1JAM", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "rcarey22", "reviewText": "First I'd like say I believe Lolita Files to be wonderful writer but I just finished sex.lies.murder.fame (three days worth of forced reading) and am still scratching my heading and muttering to myself \"this can't be the same author who wrote Scenes from a Sistah and Getting to the Good Part\"?\n\nsex.lies.murder.fame started out slow and ended on the same note.  The main characters,  Beryl Unger and Penn Hamilton are both mental cases, one who should have stayed under a doctor's care and the other a  genius who doesn't realize he has a problem.  Oh yea, I did pick up two things from this novel which I researched:\n\n1.  Narcolepsy (a chronic neurological disorder caused by the brain's inability to regulate sleep-wake cycles normally) for which there is not cure but is treatable through the use of specific drugs; and\n\n2.  Obsessive-compulsive disorder is a neurobiological disorder defined by recurrent, unwelcome thoughts (obsessions) and repetitive behavior (compulsions) that OCD sufferers feel driven to perform.\n\nsex.lies.murder.fame was the most boring novel I've read in some time.  The only reason I finished sex.lies.murder.fame is because this is \"Lolita Files\", her novels are fabulous but not this time.  sex.lies.murder.fame does not live up to Ms. Files' past novels in no shape or form and now I'm not sure if I'll ever chance another of this author's works, at least not in hardcover.\n\nI'm sitting here wondering what to do with this novel, I can't give it to anyone I know as they'll probably end up beating me across the head with it and I hate throwing out novels as they are precious to me but I may have to make an exception this time cause this novel is not worth taking up space in my residence.\n\nI would love to have said I should have waited for the paperback release but it wouldn't make me feel any better, I would have just waited a whole year and still end up scratching my head in wonder.", "summary": "You've Got to Be Kidding Me", "unixReviewTime": 1142035200}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "03 10, 2006", "reviewerID": "AUKZVLXRIVBOV", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Barbara", "reviewText": "I am so disappointed with this book!  I have been trying to read it for two weeks, and I'm only on page 20.  I find the beginning so boring, it puts me to sleep.  I can't follow the characters, I can't follow the language(tone)...  Maybe I will pick it back up when I don't have anything else to read.", "summary": "I can't get into this one!", "unixReviewTime": 1141948800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "02 28, 2006", "reviewerID": "A3G0N44BYSZNZW", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Duriechee Lynch", "reviewText": "For the first time in my life, I performed a covert reading operation while at work! If that doesn't let you know how good this book is, then keep reading, and I'll see if I can help you.\n\nLolita has always been one of my faves. As in \"can't wait for Amazon delivery, rush to Barnes and Noble, need to caress cover of book immediately\" faves. \"Sex. Lies. Murder. Fame.\" is her sixth book, and all of her books are wonderful. But this time, she's outdone herself.\n\nI was definitely drawn into the story immediately. Beryl is the ugly underdog, but a successful superachiever editor. Penn is the ultimate man in every sense, super handsome, wonderful body,genius IQ, musically talented, wonderfully charismatic--the list doesn't end. Except he's ruthless and immoral. And I forgot to say, he's written a book. And of course he's got an evil plan. Add Beryl. Stir in sexy superstar author Sharlyn Tate, who also happens to be black and unhappily married to a billionaire. Add a heavy dose of pop culture for good measure. Oh and don't forget the MURDER. And that's how I ended up sitting at my desk with a Post-It pop up container to hold my pages open, pretending to work all day with the book sitting on top of a pile of papers on my desk to the left of my keyboard.\n\nWI came upon that dastardly blank page at the end of the book...I must say that I have never, and I do mean never, been so pissed to make its aquaintance.\n\nThe best part to me about this book is that Lolita has written a book that mainstream readers just might be adventurous enough to pick up. And if they do, her star will rise even further. As it should. Congratulations to the Author. And congratulations to the fortunate folks who are about to buy this book. You WILL NOT be disappointed.", "summary": "Damn that Blank Page at the End!", "unixReviewTime": 1141084800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "02 26, 2006", "reviewerID": "A1SXOW3PGJA84J", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Jacqueline Battle", "reviewText": "This writer has shown us so many different parts of herself as a writer each book she has written after the first 2 have been differnt and I thought the last one was tops this only was better.  Its no need of repeating what others have said its a novel worth reading,the characters are strong in there own way and I am sure you can identify them.  It was a GREAT READ.", "summary": "Well worth the read,a book that made you think even use the dictionary", "unixReviewTime": 1140912000}
{"overall": 5.0, "verified": false, "reviewTime": "01 29, 2006", "reviewerID": "A16LP3AJH4938G", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Janine S", "reviewText": "As with all of Lolita Files books, this captivates you from the beginning. As I read more into the book, I understood how the characters complimented each other. At first, I didn't quite understand why there were so many backstories with these characters. However, as I continued to read the book it made sense, and that's when I really became engrossed. I mean, I could not put it down! My biggest issue is that the end of the book, became so juicy I found myself attempting to read pages that weren't there. I can't wait for the sequel, without a doubt it's going to another page turner.", "summary": "Wonderful Read!", "unixReviewTime": 1138492800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "01 29, 2006", "reviewerID": "A3ETPZ4XGRDAVB", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Diedre A. Ware", "reviewText": "Lolita is a contemporary African-American writer who writes along the lines of Eric Jerome Dickey, E. Lynn Harris and other African-American contemporaries. She is a thought-provoking writer who weaves interesting and intricate stories with lively characters that could easily remind you of someone you know, or even yourself. She writes about women who are movers and Shakers in the business world; some have what it takes to\n\nmove up while others have to work a little harder to prove themselves.\n\nShe delves right into relationships, giving them a touch of realism and fantasy. And what is a book, really, without a little \"drama\"?  \"Sex. Lies. Murder. Fame,\" without telling you too much, is an interesting read that explores the publishing and the music industries.\n\nIn essence, you have your successful writers; one in particular who is not successful at first, but has an IQ of 210. His very wealthy parents,who are killed in a plane accident, don't leave him their money,however; they formally will him something more valuable than money,which he resents. Penn Hamilton (the character's name) will do anything to rise to the top to become a successful writer, even if it means getting romantically involved with a few important women in the publishing business. Get ready for a ride of deception, adventure, humor, suspense, and sexy, sizzling, drop-it-like-it's - hot love scenes.\n\n\"Sex. Murder. Fame.\"  should be housed on your bookshelf.  \"Sex. Lies.\n\nMurder. Fame. is an excellent read!\n\nDiedre A.Ware", "summary": "LOLITA DROPS IT-LIKE-IT-IS-HOT W/SUSPENSE AND DRAMA", "unixReviewTime": 1138492800}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 26, 2006", "reviewerID": "A3ARKIXBV6T22T", "asin": "0060786817", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "If you are looking for a good read instead of the same ole love story this is definately the book to buy. Ms Files keeps you guessing and wondering which way the story is going to go. If anyone enjoyed Child of God by the same author (also good) then this book is for you.", "summary": "Keeps You Guessing", "unixReviewTime": 1138233600}
{"overall": 5.0, "verified": false, "reviewTime": "08 24, 2006", "reviewerID": "A2SL45WQVB3B5G", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "Sudhir Joshi", "reviewText": "The best and the fastest service. On top of these, the seller spent his own additional money( $2.61) for the shipping.\n\nThank you Mr. John W. Carter. I and my daughter really appreciate you for this.\n\nGod bless you.", "summary": "College Physics", "unixReviewTime": 1156377600}
{"overall": 4.0, "vote": "13", "verified": false, "reviewTime": "02 14, 2005", "reviewerID": "AG35NEEFCMQVR", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "W Boudville", "reviewText": "Well, the artwork in the book is certainly gorgeous. A pleasure to read. But I am uncertain how distinctive the text really is, in providing any unique and advantageous insight to a university undergraduate struggling with a physics course.\n\nWhich is not to say that the material is wrong or poorly written. Clearly, the authors have distilled a lot of effort into composing the text, and assembling a diverse set of problems and examples. Where these are often chosen to pique the reader's interest, by invoking real life situations that might be germane to her.\n\nThe biggest problem this book faces is that there are several other long standing physics texts, now deep into their n-th editions. Mindshare is a difficult thing to acquire under these circumstances.", "summary": "competing in a crowded market", "unixReviewTime": 1108339200}
{"overall": 4.0, "verified": true, "reviewTime": "08 12, 2014", "reviewerID": "A171K1UOL11JMD", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "LINDSAY BUENA", "reviewText": "I thought the book was fine, we didn't use it very much. I thought the examples were too basic or at least our teacher gave us more difficult problems and I wish the book had more examples of those.", "summary": "College Physics", "unixReviewTime": 1407801600}
{"overall": 4.0, "verified": true, "reviewTime": "05 13, 2014", "reviewerID": "A27HAOA8O7HZ81", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "Hassan", "reviewText": "I have return this book two weeks ago. I don't know why I got the message saying that \"Your textbook Rental Is Due Soon\"\nPlease let me know if there is any problem.", "summary": "Return", "unixReviewTime": 1399939200}
{"overall": 5.0, "verified": false, "reviewTime": "02 23, 2014", "reviewerID": "A3LZSLF818WPIO", "asin": "0070524076", "style": {"Format:": " Paperback"}, "reviewerName": "Nena", "reviewText": "The book was not in perfect condition but that's expected when you are renting a textbook I think. Overall, it was a good choice to rent.", "summary": "Rented book was as expected", "unixReviewTime": 1393113600}
{"overall": 3.0, "vote": "6", "verified": true, "reviewTime": "03 4, 2013", "reviewerID": "A3T80FWJ20CWCW", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "Kathryn Sakai", "reviewText": "This was the required text selected for the 2 semester basic physics course at my college, in a course made up of biology, architecture and pre-med students. Some of us have had calculus, but many of us haven't. I'm a biology major and I have not yet taken calculus.\n\nI found the book to be a bit difficult to understand. It relies too much on math formulas, without enough pictures, graphics and descriptions. The problems at the back of every chapter are good, but I haven't found the text to be helpful at all. It seems to be a good book, but it wasn't the right choice for a basic college physics course.", "summary": "A little overkill for a basic physics course", "unixReviewTime": 1362355200}
{"overall": 1.0, "verified": true, "reviewTime": "12 6, 2012", "reviewerID": "A3D9CW64TXJVM4", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "Adam Tuchinsky", "reviewText": "never came give it an f bad bad bad bad bad bad. i would never buy something from this person again", "summary": "bad bad bad", "unixReviewTime": 1354752000}
{"overall": 4.0, "verified": true, "reviewTime": "06 6, 2012", "reviewerID": "A2S3LIZP1ST3RS", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "yani", "reviewText": "Book was in a really good shape,the hardcover is a little bent but no torn or missing pages.i really love the price i bought the book for.good buisness!", "summary": "very good", "unixReviewTime": 1338940800}
{"overall": 3.0, "verified": true, "reviewTime": "07 10, 2011", "reviewerID": "A5EIRSOASPY0V", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "JTY", "reviewText": "The book was fine.  It had good details, but needs a good teacher to be able to understand the materials.", "summary": "Physics I and II for non-majors", "unixReviewTime": 1310256000}
{"overall": 1.0, "verified": false, "reviewTime": "08 28, 2009", "reviewerID": "A2VAEIU0B4MFVH", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "COgirl", "reviewText": "I ordered the book over a month ago and never received it.  Very unreliable.", "summary": "Never received book", "unixReviewTime": 1251417600}
{"overall": 5.0, "verified": false, "reviewTime": "02 19, 2009", "reviewerID": "A27JVWU65ZA143", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "kesh622", "reviewText": "The book arrived on time and it was almost perfect.  worth way more than i paid.  Thank you!", "summary": "almost perfect- 100% satisfied!", "unixReviewTime": 1235001600}
{"overall": 5.0, "verified": false, "reviewTime": "02 1, 2007", "reviewerID": "A99MTBXJYA1LY", "asin": "0070524076", "style": {"Format:": " Hardcover"}, "reviewerName": "Bechani Banda", "reviewText": "Is the $20 price for the solution manual or is it actually for the text book. Please highlight me before i make a purchase. Email me as soon as possible.\n\nemail: bechband@yahoo.co.uk", "summary": "Is the $20 price for the text book or solution manual", "unixReviewTime": 1170288000}
{"overall": 5.0, "vote": "67", "verified": true, "reviewTime": "09 18, 1999", "reviewerID": "AAP7PPBU72QFM", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "D. C. Carrad", "reviewText": "This is the best novel I have read in 2 or 3 years.  It is everything that fiction should be -- beautifully written, engaging, well-plotted and structured.  It has several layers of meanings -- historical, family,  philosophical and more -- and blends them all skillfully and interestingly.  It makes the American grad student/writers' workshop \"my parents were  mean to me and then my professors were mean to me\" trivia look  childish and silly by comparison, as they are.\nAnyone who says this is an  adolescent girl's coming of age story is trivializing it.  Ignore them.  Read this book if you love literature.\nI was particularly impressed with  this young author's grasp of the meaning and texture of the lost world of  French Algeria in the 1950's and '60's...particularly poignant when read in  1999 from another ruined and abandoned French colony, amid the decaying  buildings of Phnom Penh...\nI hope the author will write many more books  and that her publishers will bring her first novel back into print -- I  want to read it.  Thank you, Ms. Messud, for writing such a wonderful work.", "summary": "A star is born", "unixReviewTime": 937612800}
{"overall": 3.0, "verified": true, "reviewTime": "10 13, 2014", "reviewerID": "AIMPBO9K5SQ5X", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Sande", "reviewText": "I keep reading Messud, but I don't know why; I don't seem to click with her characters or her writing.  I finished it, and it was ok, but hardly memorable or moving.", "summary": "Just ok", "unixReviewTime": 1413158400}
{"overall": 2.0, "verified": true, "reviewTime": "10 2, 2014", "reviewerID": "A2QCVDCCZ3ABAC", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "MSY", "reviewText": "Sorry,  just could not get into this rambling, boring book.  At times I thought that it had promise but never delivered", "summary": "disappointment", "unixReviewTime": 1412208000}
{"overall": 3.0, "verified": true, "reviewTime": "08 31, 2014", "reviewerID": "A1C0Y8AFKTIRWY", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Patricia Reckrey", "reviewText": "Claire Messud has an impressive ability to help us know her characters inside and out.  And because we know them we grow concerned about them.  This very ability works to her disadvantage when she just drops them off at the end of the book and we are left \" hanging\" , wondering, unsatisfied.  I had the feeling Claire turned in her final manuscript far before it was really finished", "summary": "ending?", "unixReviewTime": 1409443200}
{"overall": 1.0, "verified": true, "reviewTime": "08 10, 2014", "reviewerID": "A3M96C2MSACALP", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Eleanor Winchester", "reviewText": "Story  was well written using  every \"big\" word the author could think of.  For a college exam it would possibly get a good grade but as a story it missed the boat completely.  Did not 'speak\" to the reader at all....did not incite interest or anticipation with a few exceptions.\nI was not impressed.", "summary": "For a college exam it would possibly get a good grade but as a story it missed the boat ...", "unixReviewTime": 1407628800}
{"overall": 1.0, "verified": false, "reviewTime": "08 10, 2014", "reviewerID": "A3JNMQZ0EUZVGY", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "zoe", "reviewText": "The editor should find a new job!  Over written and painfull to read", "summary": "One Star", "unixReviewTime": 1407628800}
{"overall": 5.0, "verified": true, "reviewTime": "08 10, 2014", "reviewerID": "A28EC1YY62SVRQ", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Carmel", "reviewText": "I ENJOYED IT VERY MUCH IT KEEP ME INTEREST IN IT", "summary": "Five Stars", "unixReviewTime": 1407628800}
{"overall": 4.0, "verified": true, "reviewTime": "08 10, 2014", "reviewerID": "A3DDTW92Y8VGGV", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Gisella", "reviewText": "The story is a long one....probably a bit too long but incredibly well executed,going into detail with great knowledge and a profound love and tenderness for the subject. A longing for innocence and carefree days complicated by politics,family ties and struggling to find identity.", "summary": "A story from the old world into a new one", "unixReviewTime": 1407628800}
{"overall": 1.0, "verified": false, "reviewTime": "08 6, 2014", "reviewerID": "AE54CQG4THB7Y", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Rebecca West", "reviewText": "THis is not a good book.  It's pretentious and worst of all, booooring.", "summary": "THis is not a good book. It's pretentious and worst of all", "unixReviewTime": 1407283200}
{"overall": 2.0, "verified": true, "reviewTime": "04 25, 2014", "reviewerID": "A1O7WUHVV5HH53", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "The Last Life is an easy read but I didn't find it terribly engaging.  Historical information about the troubles in Algeria was very interesting but I didn't find the characters very engaging", "summary": "Easy Read", "unixReviewTime": 1398384000}
{"overall": 4.0, "verified": true, "reviewTime": "01 26, 2014", "reviewerID": "AMAHN50UWYB9Y", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Dr. B. C. Rozaire-brown", "reviewText": "The book contains so many typing errors it is hard to follow this otherwise good book. Where was the proof reader", "summary": "Typos", "unixReviewTime": 1390694400}
{"overall": 4.0, "vote": "7", "verified": true, "reviewTime": "12 14, 2013", "reviewerID": "A1DOWPEELWQ7AO", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "a happy reader", "reviewText": "The reviews of this book in the press have been great, but I found Claire Messuds The Last Life to be very mixed.  The book basically concerns an adolescent girl (named Sagasse LaBasse) growing up in a very troubled family.  This is a pretty worn topic.  On the positive side, since the family is French-Algerian, the reader learns a lot about French and Algerian history, and a little about Algerias two most famous denizens, St. Augustine and Camus.  Also the authors perspective on Sagasses severely disabled brother Etienne is inspiring;  Messud and members of the LaBasse family consistently view Etienne as a full-fledged human. The authors writing style vacillates between lyrical on the one hand and gushy and verbose on the other.  Although some of the dialogue rings crystal clear and true, other dialogue seems suitable for a soap opera script.  In addition to the major coming-of-age narrative, Messud provides many minor characters, cameos, and vignettes.  However, she is not Dickens or Tolstoy, so the reader is sometimes left trying hard to keep track of sequencesto what purpose?", "summary": "The Last LIfe gets a mixed review", "unixReviewTime": 1386979200}
{"overall": 3.0, "vote": "5", "verified": true, "reviewTime": "10 23, 2013", "reviewerID": "A2E168DTVGE6SV", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Evy", "reviewText": "Pages and pages of introspection, in the style of writers like Henry James.  I like this kind of  novels and the writer occasionally delights me with her descriptions and observations.  But it's way too repetitious for me and, I think, some parts could have been cut out while still preserving, and probably more tightly crystallizing, the themes and \"truths\" within the story.\n\nIt's a story I could relate to but I wish it hadn't been too tedious to read.", "summary": "A stream of consciousness novel", "unixReviewTime": 1382486400}
{"overall": 2.0, "vote": "9", "verified": true, "reviewTime": "09 21, 2013", "reviewerID": "A1ARTNPA3VALD3", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Kim10024", "reviewText": "Like many others reviewing this early novel by Claire Messud, I loved her breakout book The Emperor's Children. I realized after about 150 pages into this one, however, that I couldn't wait for it to end. I reads like a writing workshop. Yes, she can write beautifully, but what about the adage of show, not tell? This book is one long, long, long droning monologue, recited by a not very interesting young girl/young woman. Her quotidian dramas are made interesting only by the fact of her family's origins in French Algeria. It was more interesting to dip into wikepedia and read about the conflict there in the late 50's-early 60's, the pied noires, etc. The circular ponderous nature of Sagesse's memories and musings nearly drove me mad. (And that name! come off it, wisdom!) The only part of the novel that I really liked, that gripped me, was sans-Sagesse, and felt immediate rather than a trip down someone else's memory lane where you can't figure out a polite way of excusing yourself.  That was the tale of how her adolescent father stayed in Algeria with his dying grandmother after the rest of the family escaped to France, and the country is collapsing in chaos. This book badly needed an editor to stop the writing and give it more focus. All in all, disappointing and definitely not recommended.", "summary": "Interminable", "unixReviewTime": 1379721600}
{"overall": 4.0, "verified": true, "reviewTime": "07 5, 2013", "reviewerID": "A3ELN7IRFZTVIO", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Karen A., Dunphy", "reviewText": "The story of this young girl's family is told by her in the keen eye of an unsympathetic teenager.\nA meloncholy theme runs to all family members....", "summary": "Worth the read", "unixReviewTime": 1372982400}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "06 17, 2013", "reviewerID": "A24D95RTPMGY2Z", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Linda Dreibelbis", "reviewText": "diary that jumped from place to place and people. Then it was like adding words to make it a novel.", "summary": "This was horrible,I only finished the book because I paid for it. I read alot of free books. It was like reading a teenage girls", "unixReviewTime": 1371427200}
{"overall": 4.0, "verified": false, "reviewTime": "05 8, 2013", "reviewerID": "A1UWHK0U1MD7L", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Laurent Lerusse", "reviewText": "When a chile call her grand father 'Grand-Mre' it is confusing. 'Grand-Pere' is what can be found in the read inside on the amazon website. A simple letter error/confusion that bothers careful readers of the kindle edition.\n\nMy wife is reading the book but does not believe the comment will reach whoever is responsible to edit the book kindle version.", "summary": "Do call me 'Grand-Pre'", "unixReviewTime": 1367971200}
{"overall": 3.0, "verified": true, "reviewTime": "02 18, 2013", "reviewerID": "AKVNQ5EJQ4STG", "asin": "0151004714", "style": {"Format:": " Kindle Edition"}, "reviewerName": "francine", "reviewText": "Easy read, not compelling or complex but informative about Algerian/French nationals who were displaced by politics..\nI had heard so much about Claire Messud, I suppose I expected more.", "summary": "well written", "unixReviewTime": 1361145600}
{"overall": 1.0, "vote": "77", "verified": false, "reviewTime": "07 18, 2012", "reviewerID": "AUPYB4D77G80K", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Sabrina_1975", "reviewText": "For the first time of my life,  I felt like dumping a book in the bin after reading it. I am French Algerian  (Algerian mother, French father), I grew up on the French Riviera, and like Sagesse, I was 14 in 1989. For me, this book is to Algerians what Margaret Mitchell's 'Gone with the Wind' would be to black Americans, full of nostalgia for a period of history where the French colons were the masters in Algeria and could happily live separated from the indigenes in a country that was truly paradise. The 'arabs' in the book (the ones in France, as the sections about Algeria are of course devoid of all mention of the native population), so the 'arabs' are either servants, cleaners, or drug dealers and the female \"arabic'  caracter does of course very badly at school and has disgusting curly and oily hair.  It does not matter as Sagesse is just using these 'arabic' paupers momentarly anyway to have access to dope and because her other friends (you know the cool white rich kids) won't talk to her anymore (the only one in the group she really seems to care for is white and rich).  Sagesse knows that she is not going to hang around with them  for too long anyway  because after all, they are poor and she is rich, and you know, they have different destinies.  I could not help but notice a certain compacency toward the National Front from the author. The horrible woman in the market who accuses Sagesse's mum to be from the National Front is very ugly and extremely unfriendly (that might also be due to the fact that she is poor too and as you know, poor people are vile anyway) and there is never, in the whole book, a sentence that could make you think that actually no, Sagesse's family are not National Front adepts ( we are talking here about a Party that considers that the Holocaust is a mere detail in WW2, as stated by their President JM LePen in the 80's). Furthermore, calling Algerians 'arabs' in the 80's is as offensive as calling black people 'negros'. Algerians are not arabs, they are berbers and are usually called 'Maghrebins' or for the young ones, 'beurs' (still in the 80's). There is only one category of people in France calling Algerians 'Arabs' after the decolonication: they usually vote National Front and don't like couscous. The book is also filled with factual errors that show that Claire Massud has never lived in France and has absolutely no clue about the life of a teenager in France (e.g. no, philosophy is not taught to 3emes, you have to wait hight school and Terminale in order to have it in the curriculum). I could go on and on but without being pedant about it, you would expect the author to actually do some research before describing the supposed life of a French teenager. Same for the silly name of the heroin, no French person (especially from a privileged background) would call their kid 'Sagesse'. It may sound sexy to anglo saxon ears, but believe me, the name is utterly ridiculous in French. And there is no way Sagesse's father could have convinced their local mairie/prefecture to accept the name as the French government refuses systematially to register silly names for new borns as a measure to protect children and future adults from crazy parents.  Claire Massud is an American citizen who grew up in Australia, Canada and the US. There is nothing French about her writing, her life experience or her description of France. She should have written a book about an american teenager growing up in Bondi beach, that might have been more plausible.", "summary": "From a REAL French Algerian perspective....", "unixReviewTime": 1342569600}
{"overall": 5.0, "verified": true, "reviewTime": "05 7, 2012", "reviewerID": "A35VNTKN8VW4AW", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "jrh25", "reviewText": "Messud is one of the best writers alive.  Period.  I think this is her best.  (And I cannot wait for a new book from her.)  It is both a fascinating tale and also a profound statement on, well, lots of things.", "summary": "incredible", "unixReviewTime": 1336348800}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "12 1, 2010", "reviewerID": "A3D2FEHWHKK4GY", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Andrea Broomfield", "reviewText": "Claire Messud's The Last Life sat on my bookshelf for upwards of four years, bought on impulse for $2.00 at Half-Priced Books and then fogotten until Messud's more recent novel, The Emperor's Children, caught my eye and brought her earlier novel back into focus.\n\nThe story of Sagesse LaBasse was interesting enough to hold my attention to the novel's final pages, but at times  the writing seemed turgid and stilted, as if Messud  became too conscious of her own biography to allow Sagesse's voice and point of view to take full command.  Particularly dull were the chapters between the grandfather's trial and his release from prison.\n\nThere were highlights.  When Sagesse's grandmother takes her grandaughter aside in an effort to convince her not to leave the family and attend boarding school in New England, the power of the grandmother's narrative is remarkable.\n\nAt other times, this novel seemed less artistic than it did the author's self-indulgent exploration of topics that clearly fascinated her: stereotypes and assumptions that the French and the Americans (presumably) harbor towards one another, and the ways that the most privileged Americans and French live thier lives and think about their importance in the world and in their own country.\n\nThe legacy of French colonial exploits was clearly a major theme, however, and it is perhaps because I learned something about the Pied-noir that I pesisted in reading to the end.  A story makes the bitter medicine of history go down more easily, in other words.", "summary": "A Story Can Make the Bitter Medicine of History Go Down More Easily", "unixReviewTime": 1291161600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "09 2, 2008", "reviewerID": "A1ER5AYS3FQ9O3", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Kcorn", "reviewText": "This is the kind of novel to read when you have time to lose yourself in a book for days, possibly weeks. I had to go back and reread it as soon as I finished it because it is so rich in historical and psychological  details, particularly themes centering on painful family dynamics and history.\n\nPotential readers of this novel by Claire Messud should know it isn't exactly a sunny, bouncy work. If you are looking for that you'll want to look elsewhere. It also moves between countries, including sections based in France, the U.S. and Algeria.\n\nThe focus of the novel is the LaBasse family and the story is told from the viewpoint of Sagesse, a woman who conveys the weight of a turbulent family history. Starting with Sagesse's grandfather, a man who owns the Hotel Bellevue in France,the family dynamics begin to play themselves out, connecting to larger themes of France and Algeria's history as well, with stunning consequences.\n\nSagesse's parents, Alex and Carol, reveal plenty about the kind of problems that can arise when there are cross-cultural challenges to face in a marriage. Carol, coming from America, marries Alex, but is unable to see the potential sacrifices and problems she'll face as she moves overseas to live with her husband...or the impact the marriage will have on her daughter and the rest of the family, including a handicapped son.\n\n It is a bit hard to categorize this book because it covers so many areas. It is part mystery because Sagesse is trying to separate truth from myth when figuring out her family's history. It is part suspense because of Sagesse's short love affair and a moment of violence (and I don't want to give the details of that moment or I'll spoil it for you). It is also a historical novel, rich with information about events in Algeria and France and the United States.\n\nFor me, also, this one centers on themes of personal identity and displacement,primarily for Sagesse, a woman trying to figure out where she belongs in the world and how to make peace with her difficult family as well as coming to grips with history's impact on her family.", "summary": "I'm a huge fan of the author and this one did not disappoint", "unixReviewTime": 1220313600}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "03 16, 2008", "reviewerID": "A192QM9Z2QKVME", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Pat Biswanger", "reviewText": "Well written, but the plot is thin, padded in layers of analysis, self-examination, etc.  I found myself skimming long parts of it, looking for some substance, for something to actually happen.  Key events are telegraphed well in advance, and some of the symbolism is terribly heavy-handed.  Sometimes writing well just isn't enough; this one was tedious!", "summary": "Disappointing", "unixReviewTime": 1205625600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 16, 2007", "reviewerID": "ATRCOW9I4MLUX", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "K. Hutchinson", "reviewText": "I read Claire Messud's \"The Emperor's Children\" first, and while I was disappointed with the plot, the writing and the characters leapt out at me.  This was the frame of mind that I began with when I opened \"The Last Life.\"\n\nThe story is simple and not simple; it is the story of one family told through the eyes of one daughter, and is made wondrously complex by the layers of myth and story related second and third hand.  The narrator, Sagesse, deals with the struggle of her father and his parents, her parents' difficult marriage, and her brother's disabilities, all the while seeking out her own autonomy.  She is aware of the web of words and images drawn by her family's history, and both tries to place herself within and escape it.\n\nSagesse is a beautifully multi-faceted character, one that I will remember for a long time.  Her story and the stories of others that she appropriates are written with clarity and mystery, foreshadowing, and expert structure.\n\nThis is probably the best book that I have read this year.", "summary": "Beautifully Woven", "unixReviewTime": 1197763200}
{"overall": 3.0, "verified": false, "reviewTime": "07 5, 2007", "reviewerID": "A1Z7RN6NDG85NC", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Camel Boy", "reviewText": "I read this book after reading the hunter.  I didn't think it was as good, but didn't regret reading it either.  Claire is very detail oriented which gets a little tiring.  Is it a case of the author getting lost in the details or a case of an impatient reader remains to be judged.  I liked it and I am glad that I read it but it is not going to make my favorite list.", "summary": "Enjoyable", "unixReviewTime": 1183593600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "05 8, 2007", "reviewerID": "AT2R7ZVT7QYOU", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Daniel Myers", "reviewText": "The novel extraordinarily manages to incorporate two things that are not easy for the finest, most accomplished writers to pull off: stylistically virtuosic prose par excellence, as well as a heart-rending story without descent into bathos.  It is not my won't to endow many books or novels of any sort with such high laud.  But this book fully deserves it. It is at once a coming-of-age story, a deep meditation on identity, a dive into history, and a plot riven with a deep sense of loss; all tendered to the reader in nearly unassailable prose.  The book deserves three stars merely for the original, affecting phrase: \"...the bloody spill of dawn just washing over the black sea.\"\n\nUnfortunately, my copy of the book has a cutesy \"Reader's Guide\" at the end full of questions requiring pat answers.  Sorry, this book provides none.  It is easiest (and most effective) to demonstrate this with a quote:\n\n\"What would the opposite of nostalgia be?  That is the kernel for which I groped, and still grope; that is the answer to the question of whether life is worth living.  In committing suicide, my father denied any such answer, or certainly, any such answer that he could accept upon this earth.  With such an act, the fabric is rent, the stage behind the drop cloth nakedly revealed: we live \"as if\" as if we knew why, as if it made sense, as if in living this way we could banish the question and the \"as if\" ness itself, the way we speak and act as if our words could be comprehended; and such a moment as my father's death exposes again the thinness of that curtain, the unreality - although surely sweat and blood and sex are real, as real as death - of the quotidian.  Severed from our surroundings, we have to ask, or else to throw ourselves again into pretending, as though nothing were more real than that.\"\n\nThis book cries out to be reread and read again by all lovers of literature.", "summary": "As if...", "unixReviewTime": 1178582400}
{"overall": 4.0, "vote": "5", "verified": true, "reviewTime": "01 20, 2007", "reviewerID": "A8IPQ1Q1O7YX5", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Roger Brunyate", "reviewText": "This beautifully-written novel opens and closes in America, where Sagesse LaBasse, its narrator, resides as an exile in her mother's homeland. She shapes a memoir that is thoughtful beyond her years, mingling the everyday events of her own French childhood with the history of her father's family. They too are exiles. Ousted from their home in Algeria by the revolution of 1962, the LaBasses have settled as hoteliers on the Cte d'Azur, only to find themselves treated as outsiders even in France. Of course, adolescence can be a form of exile too, and despite some of the dramatic events that occur around her, the emotional trajectory of Sagesse's coming-of-age is fairly normal; she writes about it with honesty and clarity, though in a style that is sometimes self-conscious in its refinement.\n\nDepending on your viewpoint, Messud's narrative style either focuses the rest of the story, or complicates it. She is brilliant at interweaving episodes from the more distant past with those of only a few years back; the \"last life\" of the title might refer either to Sagesse's teens or to the family's lost life in Algeria. But the book does involve a lot of jumping around in place and time and the introduction of more characters than can be easily remembered. Reading it also requires something of a knowledge of French life, more than a few words and phrases of the language, and especially the history of French Algeria. If you already know something of the tragedy of the exiled colonists, the so-called pieds-noirs, Messud's novel will add insight and  depth. But as it is unlikely to stand on its own as a key to those troubled times, I would suggest that even such simple research as looking up \"pieds-noirs\" on Wikipedia might make all the difference to your enjoyment.\n\n[My title, incidentally, comes from a&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/collection-of-fine-stories-by-Mavis-Gallant/dp/1590170601/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">collection of fine stories by Mavis Gallant</a>, but it really does seem to fit Claire Messud also.]", "summary": "Varieties of Exile", "unixReviewTime": 1169251200}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "01 9, 2007", "reviewerID": "A1MKYJ5S1PT9LZ", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "J. Castner", "reviewText": "I really enjoyed this book, my first encounter with Messud.  Written from the perspective of a teenage girl, the characters are really interesting and well-developed.  While some coming-of-age books can have annoyingly navel-gazing central characters, this novel manages to avoid that problem.  I enjoyed the various flavors of France, Algeria, the US, and history that were brought in.  Coincidentally, I had just seen \"The Battle of Algiers\" which really enriched my reading of this book.  Not a prerequisite, by any means, but really useful if you don't know much about Algeria, which I didn't.\n\nAfterward, I went right out and read Messud's latest - The Emperor's Children - also a good read but not a well written/edited, as I found the text a bit clunky.", "summary": "Good read, great characters", "unixReviewTime": 1168300800}
{"overall": 5.0, "verified": false, "reviewTime": "01 9, 2007", "reviewerID": "A1ZTLBSKNSDN5D", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Hillary Hutchinson", "reviewText": "A really interesting take on this subject told from the granddaughter's point of view who was raised in France by those who had to return to France after the Battle of Algiers.  Interesting stylistically as well as an interesting story line.", "summary": "On Algerian Refugees to France", "unixReviewTime": 1168300800}
{"overall": 3.0, "vote": "8", "verified": true, "reviewTime": "10 30, 2006", "reviewerID": "A2ZBSCHHT8KFGV", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Aaron Percefull", "reviewText": "I want to like Claire Messud.  Her writing is beautifully crafted, and I was prepared to encounter a novel as subtle as the prose, but it was not to be.  Messud's craft is so ill-matched with her subject matter that I can only hope she will mature into material that will allow her to use her gift.  As it is her exquisite style seems to stand outside the book, trying to lend the musings of her teenage protagonist more gravitas than they can hold.  Sagesse is no ordinary teenager, to be sure, but her intelligence seems to keep her detached from her life and her own feelings (as might well be the case for a literary descendent of Camus' Meursault).  Messud's style would be much better suited to a story of psychological subtlety, not a story of existential anomie.", "summary": "More Style Than Substance", "unixReviewTime": 1162166400}
{"overall": 1.0, "vote": "7", "verified": true, "reviewTime": "10 6, 2006", "reviewerID": "A5P0G326AZ58X", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Roni Jordan", "reviewText": "Having just finished and been mesmerized by \"The Emperor's Children\", I had high hopes for delving into Claire Messud's earlier works.  This book just fails to engage me on any level, and I tried - truly, gave it about 150 pages worth of trying, but was tempted to leave it in the seat pocket of my flight home last night.", "summary": "Thoroughly disappointed.", "unixReviewTime": 1160092800}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "09 25, 2006", "reviewerID": "A3HV0NZUZZA6BJ", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Ms. Mencken", "reviewText": "I suppose there is some dramatic action to this novel -- we do have the obligatory scandal and ensuing suicide.  And yet the writing feels static, as if it can't move forward.  Perhaps that sense is due to the writer's belabored prose.  There's an inappropriate metaphor or simile every other sentence.  (I can't believe she uses the adjective metonymic twice.  Obviously she spent too much time in graduate school.)  And also is due  to the long and often repeated authorial lectures on the pains of adolescence, exile, and the hopes of Camus and Augustine for a free Algeria.  For her, Algeria is a pretext, a prop, which she gets to use without really doing anything.  It's all a bit much in this contrived paint-by-the-numbers literary product that appears to have been written primarily to further a career.  At this, Messud, judging by her current bestsellerdom, has apparently succeeded brilliantly.", "summary": "metonymic overkill", "unixReviewTime": 1159142400}
{"overall": 4.0, "vote": "13", "verified": false, "reviewTime": "07 4, 2003", "reviewerID": "A106016KSI0YQ", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Jay Dickson", "reviewText": "Claire Messud's second novel is so far her masterwork: an impressively constructed and written account of a wealthy French Algerian family falling to pieces, and their history of how they got to the point they're at. The breaking of the narrative down into numbered sections is beautifully done, and you find yourself deeply caring for what happens to the narrator, Sagesse (who unfortunately becomes a bit of a pill by the end) and her family members. Her troubled grandfather, snobbish grandmother, exuberant father and (especially) her emotionally wounded mother emerge off the pages as full and breathing characters, and the changes they go through seem extremely natural and believable. The novel is an account of what it means to be an alien in one's own country, and how this particularly becomes inflected by France's traumatic colonial involvement with Algeria. While Messud's prose at times becomes a bit precious, the novel is for the most part masterfully written and quite moving. This is a writer from whom to expect great things in the future.", "summary": "Life in exile... at home", "unixReviewTime": 1057276800}
{"overall": 5.0, "vote": "11", "verified": false, "reviewTime": "08 13, 2002", "reviewerID": "A2Y8VNTJE15K6F", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "sbastien", "reviewText": "I won't comment on the writer's perfect prose but rather on how she perfectly managed to write about feelings which are so characteristic to French Algerians.\nTheir wistfulness, their exuberant but aloof manners, the sentiment that they had not yet completed their journey from Algeria to France and somehow got lost in between - probably into the depths of their beloved Mediterranean sea. This is a story of a shipwreck and its stranded victims, people who were sent away from Algeria and proved incapable to integrate in the new haven provided by their motherland. In this way, this book is a not only a feat of storytelling but a profound description of a collective malaise. Anyone who - as an individual or a member of a minority - has experienced estrangement could read and learn from the Sagesse's experience.", "summary": "Great book", "unixReviewTime": 1029196800}
{"overall": 5.0, "vote": "5", "verified": false, "reviewTime": "01 11, 2002", "reviewerID": "A2U723LLPV2A8A", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Cherrie", "reviewText": "What a beautifully written, perfectly executed book! I loved how Messud intertwined each generation's family history into the present history of the teen girl narrator, Sagesse. The sins of the father will visit upon the son, indeed....or in this case, the granddaughter. Messud's command of language is impressive and her prose is so lyrical and magical---perhaps a bit too lyrical for a 15-year old Algerian girl---but that is a minor point. The book itself is perfectly paced and exquisite. I highly recommend it.", "summary": "A delight to read!", "unixReviewTime": 1010707200}
{"overall": 5.0, "verified": false, "reviewTime": "01 2, 2002", "reviewerID": "ARYCLXPK853K7", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "I found this book to be quite remarkable and very timely.  The story moves back and forth between France and Algeria and tells an intricate story of a very complex family.  The relationships between the family members and their connection to their heritage is fascinating.  The language is superb and many of the descriptions literally raised goose bumps.  I only hope there will be more books to enjoy by this young author.  Her writing is exceptional and her story provides a valuable insight into what it is NOT to be an American.  I loved it and plan to buy it for several friends.", "summary": "The Last Life", "unixReviewTime": 1009929600}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "12 25, 2001", "reviewerID": "A3UDYY6L2NH3JS", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Dr Jacques COULARDEAU", "reviewText": "Claire Messud is a great storyteller. The story is that of the initiation of a young French teenager to adult life. That would be trite if some extra elements were not mixed to this basic line. First she has a handicaped brother who is condemned to remain in a wheelchair all his life. Second her father has his own story and the end of this story is both poignant and sad, divided as it is between the emigrating boat in Algiers Harbor and the coffin of the refusal of the French defeat. But most of all she is of  pied-noir  origin, her father and her grand parents having been born and bred in Algeria and having lived the war and the independence of this country in blood and loss. This is already something to set her aside from her fellow French teenagers. But her mother is also American by origin and that projects her directly into that split culture, between the lost culture of Algiers under French rule, a culture entirely attached to a disappeared past, and the American culture entirely open, she says, to the future. So we see her playing a part in every situation since she has no past, except a dream, and she has no future, except a dream too she is the only one to be able to make true. You then add to that the dual inspiration from her religion and Saint Augustine's City of God, on one side, and from the revolutionary Camus's City of Man on the other side, and  you may think both are equally impossible and that life is nothing but compromises in real present circumstances. And yet it is a lot more than that, and you can only discover it by reading this very fascinating book.\nDr Jacques COULARDEAU", "summary": "Between the past and a dream", "unixReviewTime": 1009238400}
{"overall": 3.0, "vote": "3", "verified": false, "reviewTime": "04 13, 2001", "reviewerID": "A17I7SCJIHHZY1", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "Manthos A. Mattheou", "reviewText": "I was led to read this novel by an extract I read in \"Granta\" magazine. I am glad to say I was not disappointed in my decision to actually read this novel. Reading this novel is quite a tireless experience really, since this is a book you can stop reading at any point and then return to it without in any way losing the atmosphere you were immersed in during your last reading of it. This is made possible both by the quality of the writing as well as the brevity of most chapters. This is not an exciting book in the sense of providing you with an endless series of thrills so as to sustain an illusion of suspense. Instead, you enter the mind and body of an adolescent girl whose life is affected both by the history of her family as well as the developments taking place still within her family. In a sense this is a story of a family related to the reader in an absorbing way by someone who cannot truly be impartial about the story since she too forms a part of the story. Yet somehow she manages to maintain the distance necessary to allow her to tell this story without getting lost within the whirlwind of her own emotions.", "summary": "A translation of the world inside", "unixReviewTime": 987120000}
{"overall": 4.0, "vote": "6", "verified": false, "reviewTime": "03 4, 2001", "reviewerID": "A30KEXFT9SILL6", "asin": "0151004714", "style": {"Format:": " Paperback"}, "reviewerName": "frumiousb", "reviewText": "A novel about generations and about expatriates, _The Last Life_ is told from the point of view of Sagesse, the daughter of a French-Algerian father and an American mother. She lives with her parents and grandparents in their family hotel in France and grapples with the crumbling facade of family unity as she herself comes of age. Sagesse is a classic literary teenager-- charming and infuriating and awkward. Her parents can only view her changes from a helpless distance as they themselves are caught within their own crises and betrayals. Messud's writing style is lyrical (if occasionally a little too lyrical for my tastes) and crafts her images with confidence and flair.", "summary": "Strongly written and moving", "unixReviewTime": 983664000}
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "02 11, 2001", "reviewerID": "A19D816DMGI44L", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Lynn Adler", "reviewText": "Three generations of La Basse, a French-Algerian family.  The narrator is the teenage granddaughter, Sagesse, who feels she is inappropriately named because her name means wise, although the reader will disagree.  As a young teenager she begins to see and confront the family for its false appearances but does not completely understand or know the ties and the lies that bind it together until almost the end of the novel, which spans some years.  The authoritarian grandfather and icy grandmother run the family with a tyrannical kind of love that imprisons Sagesse, her brother Etienne, who suffers from a birth defect, her American mother Carol, and her father, Alexandre.  Grand-pere owns the resort hotel that he built himself and hopes to make into his dynasty.  The grandparents and Alex mourn the loss of the family home in Algiers, which they left when French rule was over in 1962, and which is referred to in anecdotes.  As two tragedies converge in the present, the early 1990's, the past or last life, the Algerian life intrudes, the family and its myths crumble, as does Sagesse's innocence, and she is the one left to find out the truth about her family, who she is, and who she wants to be.  A moving, sad story, yet with hope finally, well plotted and intelligent, with complex characters fully rendered.  Long, but not overbearing passages in which Sagesse is grappling with what is real, what is truth as she learns about  Camus, Sarte, and St. Augustine in school act as seamless metaphors.  In beautifully rendered descriptions, the story travels alternately between the French Mediterranean Coast, Algeria, and the East Coast of the U.S.", "summary": "The Meaning of Existence and Family", "unixReviewTime": 981849600}
{"overall": 5.0, "vote": "13", "verified": false, "reviewTime": "09 4, 2000", "reviewerID": "A1T17LMQABMBN5", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Caf Girl Writes", "reviewText": "What gorgeous language! What an incredible writer! The Last Life is one of  the best written novels I have ever read. This incredible novel contains  various elements of fiction: historical, philosophical, and just the right  touch of magical realism.\nThe story is about a French-Algerian family  and the constant moving to different parts of the world -- the South of  France, the East Coast of the U.S. and Algeria -- has affected each of  their lives. It seems as though each family member has found his or her  identity in one of the many places they have been. As a result, they never  feel like they have found a home. The thing that struck me most when  reading this book was how the author described life in the lost world of  French Algeria in the 1950's. The historical part of the novel is  incredibly accurate. Let me tell you that I have learned a lot of important  parts of history in this book. I also love the fact that the story is told  through the eyes of fourteen-year-old Lagesse, seen through the eyes of  innocence indeed!  The Last Life is -- without a  stretch of doubt -- the best historical fiction novel I have ever read.  This novel should not be overlooked. Run along and get it!", "summary": "The most beautiful book I have ever read!", "unixReviewTime": 968025600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "08 30, 2000", "reviewerID": "AN5RSF8TJ62NW", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "natasha lovett", "reviewText": "this book is a very good one i love the way that the words flow so  smoothly.  it is very well written and i think that it deserves not only 5  stars but 6! it was awesome iand i've never read anything like it.", "summary": "One of the best stories ever.", "unixReviewTime": 967593600}
{"overall": 3.0, "verified": false, "reviewTime": "03 21, 2000", "reviewerID": "A1IWWRZJOXOSYP", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Lee Armstrong", "reviewText": "Perhaps this is a novel more for women.  Like a slice of life, a series of experiences do not necessarily equal a plot.  I found the characters interesting enough to keep reading, but had to wade through parts where  Sagesse was being philosophical.  She grossed me out with all the oozing  boils on her back.  Why wasn't her mother taking her to a doctor?  Much of  this story seemed a consequence of neglect or unwise love. Certainly, no  one prayed to God to help them through their anxieties.  Even though he was  practically a vegetable, brother Etienne seemed one of the most refreshing  characters.  Everyone else seemed neurotic.  The setting in Algeria was  interesting.  The idea of being an alien in your own county provokes  thought.  But as much of this novel as is devoted to this girl's virginity,  one would think she could at least have a little more fun losing it.  Maybe  you have to be a woman to get this book.  It was okay.", "summary": "Washes over the reader as a series of experiences", "unixReviewTime": 953596800}
{"overall": 3.0, "vote": "8", "verified": true, "reviewTime": "02 4, 2000", "reviewerID": "A3QHJ0FXK33OBE", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "W. Shane Schmidt", "reviewText": "I was taken in by reviews that compared this book with The Leopard or promised a bildungsroman set in a family that is isolated and on the move.  Well...I didn't feel any parallel with The Leopard and the author overstuffs her story with so many events that isolation is lost in the opportunity for  so many subplots.  And who's moving - in any sense - in this novel?  Where's the \"bildung?\"  The denouement?  The dsillusionner?  I must have  skimmed the wrong paragraph.\nI do agree that parts of the novel are very  engaging.  They are.  And, like some other readers, I did enjoy the events  in Algeria.  This is the strongest part of the novel, perhaps because it is  not so deeply stuck in the protagonist's life that had the unfortunate  knack of boring me in the first-person!  (Yeah, that's what I mean.)  Overall, the novel is just a bit overdone.  I prefer a bildungsroman - if  that's what this should be - to show me a growth, not tell me all about the  all-too-interesting things that happened along the way.\nIf you're the  kind of person who can sit for hours and listen to a friend tell you  endless stories about herself that you can't help but suspect are just a  tad trumped up, then you might really dig into this novel.  Otherwise you  might have an experience more like mine which was one of detached interest.  For my part, I was relieved that I could close the book whenever I wanted  to quiet my jabbery friend.", "summary": "A dissenting view--In part.", "unixReviewTime": 949622400}
{"overall": 5.0, "vote": "13", "verified": false, "reviewTime": "01 15, 2000", "reviewerID": "A2CGDQGHUN3DMM", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Trapicia", "reviewText": "This was one of the best books I read in 1999.  The writing is hauntingly beautiful. The narrator(Sagesse) tells the story of the fracturing of her life and family- And the fracturing and restructuring of the family in the  past. But the story is not just this simple. Messud explores nationality,  the ideas of belonging-and not belonging simultaneously. This is always the  outsider's view of the culture. Sagesse's family is not truly at home  either in Algeria or France- anymore than Sagesse is later at home in The  U.S.  Besides being beautifully written, the book forces the reader to  think and re-examine ideas. I found my mind did not leave this book even  after I put it down.", "summary": "Hauntingly Beautiful", "unixReviewTime": 947894400}
{"overall": 5.0, "vote": "14", "verified": false, "reviewTime": "12 5, 1999", "reviewerID": "A3QLL55JUBXDNT", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Dr. Richard S. Beach", "reviewText": "Just a stunning achievement, this book builds steadily from an already impressive beginning, leaving little time to even catch one's breath. Messud's prose bears the mark of someone who can see the English language  as an observer, yet manipulate it only as a native speaker could. What a  breathtaking combination. I have not read a better book this year and can  only compare it to last year's The Hours by Michael Cunningham. This is a  book to cherish, to give to friends, epecially those who 'get it,' and to  reread again and again as the years go by. It has gained a steady berth on  my bedside table.", "summary": "as if 5 stars were enough.....", "unixReviewTime": 944352000}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "11 25, 1999", "reviewerID": "A2QK7SB0J3NG59", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "readernyc", "reviewText": "I just finished The Last Life and feel emotionally drained--a testament to the author's powers. At times yes it is overwritten... but that flaw is minor compared to the intensity of feeling and seeing and knowing.. Hats  off to Ms. Messud.", "summary": "A Sad, Beautiful Tale", "unixReviewTime": 943488000}
{"overall": 5.0, "verified": false, "reviewTime": "10 28, 1999", "reviewerID": "A2BOZUUPBD9P3N", "asin": "0151004714", "style": {"Format:": " Hardcover"}, "reviewerName": "Kiran", "reviewText": "This is a wonderful book, fine writing and a story to keep you engrossed. This should be recommended reading for anyone that loves a good read.", "summary": "This book shows the longing of any person from young to old.", "unixReviewTime": 941068800}
{"overall": 5.0, "verified": false, "reviewTime": "08 23, 2006", "reviewerID": "A1LMFOG4L6IB08", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Andrew Toth", "reviewText": "Great fundamentals for life and basketball.  From overviews to extreme detail.", "summary": "Practical Modern Basketball", "unixReviewTime": 1156291200}
{"overall": 5.0, "verified": false, "reviewTime": "10 7, 2005", "reviewerID": "A2K6AYUAP5O9NH", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "I HIT THE LOTTERY WHEN I ORDERED THIS BOOK. IT COVERS EVERYTHING ANY COACH NEEDS TO BE SUCCESSFUL. YOU WILL NEVER USE EVERYTHING CONTAINED IN THIS BOOK BUT USE THIS BOOK AS AN ENCYCLOPEDIA OF CHAMPIONSHIP BASKETBALL. THIS BOOK COULD BE USED AS THE TEXT FOR A COLLEGE COURSE. IT COVERS ABSOLUTELY EVERYTHING", "summary": "Practical Modern Basketball (3rd Edition)", "unixReviewTime": 1128643200}
{"overall": 4.0, "verified": true, "reviewTime": "07 2, 2001", "reviewerID": "A25NR1UCHLDEML", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "George Rose", "reviewText": "This book is helpful for a coach trying to start a program.  There are many things that a new coach could use.  The ideas worked well for Wooden 30+ years ago, so some of it could be outdated.  But most of it is pretty good. The diagrams are confusing.  You need a magnifying glass to follow the cuts of the players.  More time could have been spent on the stall section.", "summary": "OK", "unixReviewTime": 994032000}
{"overall": 5.0, "vote": "23", "verified": false, "reviewTime": "05 30, 2000", "reviewerID": "A3LLVLOAE6YYK4", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Jon D. Brewer", "reviewText": "When you think of Success, you should recognize John R. Wooden as the leader in this area. This book expands upon his Pyramid of Success philospophy through his coaching regiment. Here again, what was the reason  for UCLA's success. It was through the attention to detail and preparation.  This book is very detail oriented. It is a working example of what it takes  to become successful in coaching basketball. If you are coaching youths  that are below the high school ranks, then this book is probably to  advanced for knowledge transfer. But, there are many drills, offensive sets  and defensive alignments that are teachable to young basketball players.  For coaches involved in youth leagues, CYO, AAU, Intramurals, Junior High  School, this book can help if you are trying to improve upon specific areas  of teaching basketball. For instance, I found the 3-1-1 or \"T\"  Half Court Zone Trap to be quite effective and provided a new look defense.  There are a multitude of offensive sets, systems, and drills that may help  as well. What you'll find in the book is there is no magic to winning as  the label \"Wizard\" would suggest. It is accomplished through hard  work and for coaches it is the details. Thanks again Coach Wooden.", "summary": "Practical Modern Basketball", "unixReviewTime": 959644800}
{"overall": 5.0, "verified": true, "reviewTime": "07 29, 2014", "reviewerID": "A1P8MC8W52MCC4", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Andrew L Jones", "reviewText": "Great thanks!", "summary": "Five Stars", "unixReviewTime": 1406592000}
{"overall": 5.0, "verified": true, "reviewTime": "07 15, 2014", "reviewerID": "A1Z65BLAQRQQTA", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Jai", "reviewText": "Amazing book", "summary": "Five Stars", "unixReviewTime": 1405382400}
{"overall": 5.0, "verified": true, "reviewTime": "11 3, 2013", "reviewerID": "A3NMOHKJR8JRRD", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Parker", "reviewText": "An absolute must have for any coach or aspiring coach. The Coach that recommended it to me called it his bible for basketball. It is so remarkable the attention to detail that Coach Wooden gives to his work. The first half of the book on his philosophy was my favorite, most enlightening part. It is great to have as a reference book.", "summary": "Must have for any Coach", "unixReviewTime": 1383436800}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "03 8, 2013", "reviewerID": "A2G0MMMLHISVSG", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Kyle", "reviewText": "If your looking for an in depth look into basics and a step by step on how to teach those basics this book is exactly what your looking for. Thanks Coach!!!", "summary": "Unbelievable", "unixReviewTime": 1362700800}
{"overall": 5.0, "verified": true, "reviewTime": "11 27, 2012", "reviewerID": "AFRDRBLFPL59A", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "John E. Ziegler", "reviewText": "By the \"master\" basketball coach.  Best single book available on coaching all phases of basketball!!!  A book for the ages!", "summary": "Practical Modern Basketball (3rd Edition)John R. Wooden", "unixReviewTime": 1353974400}
{"overall": 5.0, "verified": false, "reviewTime": "03 7, 2011", "reviewerID": "A3SGKX9XALPWW", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Matthew Dodd", "reviewText": "This book was an amazingly detailed and organized coaching tool from the legendary master coach/teacher, the late Coach John Wooden. The logical result of Coach's passions for teaching and basketball, this 'textbook for an advanced degree in basketball coaching' is recommended for anyone interested in learning more about the art and science of the game of basketball. I cannot imagine anyone possibly knowing more of the intricacies associated with teaching, playing, and practicing basketball in a fundamentally sound way.\n\nCoach did not miss anything related to basketball. He had a rare combination of abilities that were showcased in this book: to observe everything on or near the court; to understand completely what he observed; to analyze his observations and figure out how to improve or maximize them; and to organize his thoughts and methods to effectively teach what he learned to his players and all those around him. When you add these abilities to Coach's character and integrity, and his effective leadership style, you have an unbeatable formula for a definitive basketball handbook.\n\nAfter just coaching my son's fourth grade basketball team, I found most of the book much more suited for older kids and adults. Should my son and I continue on our basketball paths, I will definitely keep this book handy and use it often.", "summary": "Amazing Coaching Tool", "unixReviewTime": 1299456000}
{"overall": 4.0, "verified": true, "reviewTime": "01 28, 2011", "reviewerID": "A3W29R3L4CGW0E", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "CHRIS LINZ", "reviewText": "For the book Practical Modern Basketball, the information content is great for basketball coaches; however, the quality of the printed copy I received was bad.  It was supposed to be a new copy, but the pages and photographs look like the were produced with a copier machine, and the binding is bad.  The pages are already falling out.", "summary": "Practical Modern Basketball", "unixReviewTime": 1296172800}
{"overall": 5.0, "verified": false, "reviewTime": "12 9, 2008", "reviewerID": "A2PFAEZIYVHIDU", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "S in SoCal", "reviewText": "This book is a fantastic text book for coaching.  As one might expect from coach Wooden, it is incredibly thorough covering aspects of coaching from practice organization, to game preparation, tactics, fundementals, selecting and working with assistant coaches, as well as coaching philosophy and theory.  If you only have one book on coaching basketball this should be it.  I review it every year prior to the start of the season.", "summary": "Definitive text book for coaches", "unixReviewTime": 1228780800}
{"overall": 5.0, "verified": false, "reviewTime": "03 30, 2008", "reviewerID": "A14X7U05TCBFPP", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "R. C. Ray", "reviewText": "I have a ton of books on various aspects of coaching basketball, and this is by far the most comprehensive resource I own. I particularly appreciate Coach Wooden's attention to detail and his down-to-earth, methodical approach.\n\nI'd give it 4.5 stars if that were possible, just because this edition looks like it was run off on a photocopy machine, particularly the photos, but in terms of content, it's almost certain to be the most valuable book in a basketball coach's library.", "summary": "Could use an update", "unixReviewTime": 1206835200}
{"overall": 5.0, "verified": false, "reviewTime": "08 25, 2007", "reviewerID": "AIDUXKP8JG007", "asin": "0205291252", "style": {"Format:": " Paperback"}, "reviewerName": "Sylvia Haidet", "reviewText": "I found this book to be very informative.  This was purchased for my grandson who is a basketball fan and player (age 14) and I am sure that he will be delighted with the book (a Christmas present for him)", "summary": "Basketball Book", "unixReviewTime": 1188000000}
{"overall": 5.0, "verified": true, "reviewTime": "12 31, 2009", "reviewerID": "AQ2UN38CMK119", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "P. Mann", "reviewText": "Like many Christmas novellas, this is one you can read in under an hour. You end up with a well-spent hour.\n\nThe heart of the story is about two boys growing up in a moderately poor 1950s North Carolina town. The narrator and Whitey Black meet at a part-time job and end up fast friends. Whitey's sister, who is afflicted with polio, is fascinated with angels, so Whitey looks all over to find an angel doll. I won't give away much more of the plot since to do so is to encroach on the ending.\n\n\"The Angel Doll\" has quite a bit going for it. The writing rings true, capturing the mood of the narrator, both as a boy and as an adult, and the time. There is no artifice here; the writing is to the point, and the story stays focused without meandering unnecessarily. Nor does Mr. Bledsoe allow the writing to interfere with the story. In short, this is what the late&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/William-Tapply/dp/0312379781/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">William Tapply</a>&nbsp;called \"invisible writing.\" The story is the star here, as it should be.\n\nThis story was made into&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/a-film/dp/B0000CEB59/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">a film</a>, but no matter how lazy you are, read the book, either instead or in addition. It's that good.", "summary": "An true Christmas gem", "unixReviewTime": 1262217600}
{"overall": 5.0, "verified": false, "reviewTime": "02 12, 2004", "reviewerID": "A2Y32Y19FT75E3", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "chupchup", "reviewText": "A touching christmas story, about the devotion of a little boy who tries to give his four year old polio cripple sister an angel doll as a christmas gift.\nThe story is narrated by his best friend and  paper-route partner.\nThis is a simple story about devotion and love... Good read.", "summary": "Touching Christmas Story", "unixReviewTime": 1076544000}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "12 25, 2001", "reviewerID": "A3HTKV1AW14EDB", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "Denise Holmes", "reviewText": "Whitey Black has a chronically ill younger sister Sandy and all she wants is a Christmas angel doll. It is the 1950's and Whitey and his friend are working together on a paper route.  The setting is the rural south and friendship is at the center of this wonderful story.\nThis is the premise to a blessed event that will fill the lives of many sick children for years to come. It is a story of remembrance and benevolence. It is a heartrending tale of a young boys love for his sister. For those of you who enjoy THE CHRISTMAS ANGEL there is a sequel titled, A GIFT OF ANGELS. This is a superb pair of books with appeal for the whole family, a Christmas tradition. Kelsana@yahoo.com 12/25/01", "summary": "A Story of goodwill for the Christmas season.", "unixReviewTime": 1009238400}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "11 9, 2000", "reviewerID": "A1QIQE5T1GBK7X", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "JP", "reviewText": "The Angel Doll is a quick read and one to surely bring tears toyour eyes.  It is a beautiful story, (definitely one for the holidayseason), set in the South in the 50's.  This is the kind of story thatone would want to read to their children each and every Christmas. With the \"me\" generation is full force, this tale will bringhome, in full force, the power of love and caring and friendship. This tale will leave its full impression on your heart and leave youwondering about the mystery of the dolls.  I just discovered on ...,that there is a sequel to this lovely tale and can hardly wait to readit!  Uplifting tale for the entire family and I strongly encourageparents to have their children read it!", "summary": "Touching Holiday Tale", "unixReviewTime": 973728000}
{"overall": 5.0, "verified": false, "reviewTime": "10 30, 2000", "reviewerID": "A2B343N1IY0A9J", "asin": "0312171048", "style": {"Format:": " Audio Cassette"}, "reviewerName": "Cynthia Osborne", "reviewText": "We've known Jerry and Linda just over a year as neighbors.  While our interactions with them were somehow special as Jerry walks his dog past our home each day, reading The Angel Doll opened an entirely new journey deep into the heart of the person we knew only casually.  Aside from the fact that it is an \"easy read\" for anyone, the book opened the soul of what we have come to love about the people of the Blue Ridge Country.  It epitomizes all that is so genuine and real about those who touch us on a daily basis.  As you step each step with Jerry through the lives of those involved in his story, it also takes you through the world in which he lives.  Mountain people have always been an interesting study, but somehow the people of the Blue Ridge are different and Jerry has enabled those people to absolutely come to life.\nIt has a universal appeal to both women and men, children and adults and puts a mirror in front of all of us.  There are stories scattered throughout the book to which all of us can relate in our own little worlds.  I would strongly advise anyone contemplating ordering the book to go ahead and order the sequel since the two are inseparable and the sequel is a true continuum of the first.\nI am amazed at the diversity with which Jerry is so talented and skilled.\nThanks so much, Jerry and Linda for not only the book but your friendship!  Also, on a personal note, thanks Linda for the delicious chocolate pie you brought, it was yummy and we could literally taste the love!\nBig Huggggzzzzzzz", "summary": "Journey through reality", "unixReviewTime": 972864000}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "01 20, 2000", "reviewerID": "A3NWD11XKY4S4O", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "Geneva Edwards", "reviewText": "This is one of the best books I've ever read.  It's sad that the boys sister is sick, but glad because he cares so much for her, he wants to by her a book called THE ANGEL DOLL. After he reads her the book she wants an  Angel Doll for Christmas. In order to figure out what happens in the story,  you have to read the book. I would reccomend this book to anyone who likes  Christmas stories, and to anyone who likes sad and happy stories.", "summary": "THE AWSOMEST!", "unixReviewTime": 948326400}
{"overall": 3.0, "verified": false, "reviewTime": "04 13, 1999", "reviewerID": "A1BAGB0MH4ZVO1", "asin": "0312171048", "style": {"Format:": " Hardcover"}, "reviewerName": "Nelson Jimenez", "reviewText": "The Angel Doll is a nice story of 2 little boys who deliver newspapers. One of the boys (Whitey) is saving money to buy an angel doll for his sick sister. My favorite aspect of the book is the theme of love shown by the  characters like Whitey,  Mrs. Barnes, and others. It is a nice little story  that can be read year round with a heartwarming end involving angel dolls.", "summary": "Heatwarming Christmas tale of love and loss......", "unixReviewTime": 923961600}
{"overall": 5.0, "verified": false, "reviewTime": "12 4, 1997", "reviewerID": "A3B12RM18TB8OQ", "asin": "0312171048", "style": {"Format:": " Audio Cassette"}, "reviewerName": "dhanken@hotmail.com", "reviewText": "We bought this book yesterday and on the way home my 11 year-old daughter read it out loud to me. We only were part way through by the time we got home so we had to stop.. Well, needless to say ,my daughter took it to bed with her. The first thing she said to me this morning was about the book. She said she cried and cried because it was so sad, but it was a good sad. She said it was the best story she has ever read. This meant alot coming from  a kid who reads all the time but very rarely comments on a book. I can't wait to get home tonight so I can read the last 50 pages and find out the ending.", "summary": "Not Just for Grown-ups", "unixReviewTime": 881193600}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "09 22, 2004", "reviewerID": "A2W0A93538NK0T", "asin": "0312331363", "style": {"Format:": " Hardcover"}, "reviewerName": "Fuzzball", "reviewText": "Fans of Jeremiah Spur and Clyde Thomas will be hard-pressed to put this book down once they've started it. Hime has managed to top his first novel with this excellent mystery that I enjoyed all the way to the last page. I highly recommend Scared Money to anyone who likes a smart novel, not even just a mystery. There's nothing rote about Hime's plots, and there's no easy wrap-up that you can see coming a mile away. Do yourself a favor and read this book!", "summary": "A fantastic sophomore novel!", "unixReviewTime": 1095811200}
{"overall": 4.0, "verified": true, "reviewTime": "04 16, 2007", "reviewerID": "A3JABB4NAPKLC0", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "33 year old lawyer", "reviewText": "I finished this rather long book in only 2 days, getting little sleep, because I was on the edge of my seat trying to see if Graff could meet Prince Charming, and was riveted by her sometimes depressing, sometimes hysterical dating tales.\n\nGraff details many years of her dating and relationships, which necessarily include some of her career and family issues, which I personally found to be enjoyable and touching.\n\nBut, the dating is the main course. Some of the most memorable stories? 1) When Graff pretends to be Christian so that her new Jewish boyfriend gets to feel like a badboy for dating a Shiksa; 2) Graff's mixup from the personals column where she grabs the wrong man at the meeting place; and 3) the time she goes on a long weekend in New England with a boyfriend, and as she is contentedly relaxing in the car on the drive home, he commences to tell her that, all in all, the weekend wasn't worth it, because he had to spend too much money, and proceeds to count down his expenditures. Doh!\n\nThe other thing about this book that I liked is that there isn't a nice, pat ending. Like life! If you are tired of dating, you will find a lot of support, and some good laughs, in this book.", "summary": "Poignant and laugh out loud funny in the same read", "unixReviewTime": 1176681600}
{"overall": 3.0, "verified": false, "reviewTime": "01 13, 2007", "reviewerID": "A33BCA0O4N3DWD", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Elizabeth Behring", "reviewText": "A good friend lent this book to me but warned it was not the typical \"girl meets boy\" read.  I am glad she told me that because I was prepared for what I got.\n\nDo not expect this book to be like the \"Shopaholic\" series, \"Bridget Jones,\" or anything along the same lines.  It is nothing of the sort.  It is more of a mini-memoir.  I believe several of the other reviewers expected it to be like that and when they began reading, were so disappointed they had nothing positive to say.  Go into this book in the right mindset and you may just find yourself enjoying parts of it, or even the whole thing.\n\nThat said, the review:  Instead of adopting from her fellow writers by presenting a character with her normal job and normal everything else and watching as she finally finds \"THE ONE,\" Laurie Graff wrote from the heart and presented a \"non-feel goodie\" that most single women over the age of 20 can relate to in one way or the other.\n\nThe dates she goes on range from pathetic to pretty funny, albeit appalling.  Are men really like this?  Well, in fact, I have been on crappy dates before where the men truly did act the same way but with a different context.  I did laugh at a few of the men, and I felt alarm alongside Karrie when some of them showed severe anger problems at the first date, but there were times I felt exasperated with Karrie, especially when she continued to date certain guys she truly did not like nor was even happy with.  It drove me crazy that she wasted so much time on them but then I realized Karrie was so desperate for love in some sense that she kept going back, as do many of us whether we realize it or not.  That was the single way I symphathized with Karrie.\n\nHonestly, while I enjoyed most of the book, it simultaneously managed to scare the crap out of me.  I am 20 years junior to Karrie, and while I am not looking for matrimony anytime soon, Karrie signaled to me what it very well could be like two decades from now.  So while I was rooting for Karrie, a neurotic actress sort, I also felt much trepidation throughout, making this book hard to put down yet incredibly depressing.", "summary": "Don't Read This if you are Expecting Bridget Jones or Becky Bloomwood!", "unixReviewTime": 1168646400}
{"overall": 1.0, "vote": "5", "verified": false, "reviewTime": "04 5, 2006", "reviewerID": "A2NVPUJ6A1MF6V", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "J. Sullivan", "reviewText": "A rambling, self-obsessed, horrendously written bore. If you don't know any obnoxious NY princesses, and you are simply desperate to feel like you're at a really bad party, monopolized by a self-absorbed narcissist, you will find your own personal ring of hell with this book!! Otherwise, steer clear!", "summary": "Like being trapped at a party by a narcissistic princess...", "unixReviewTime": 1144195200}
{"overall": 1.0, "vote": "4", "verified": false, "reviewTime": "02 25, 2006", "reviewerID": "A1N6KD9WEU3AWE", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "C Note", "reviewText": "This book is TERRIBLE.  It is all over the place, and seems to have no structure whatsoever.  The dates the author describes are in no way funny or entertaining, just boring and pathetic.  Definately do not waste your time on this book.", "summary": "Don't Waste Your Time....", "unixReviewTime": 1140825600}
{"overall": 2.0, "verified": false, "reviewTime": "02 12, 2006", "reviewerID": "AOSIE5ITEDVCL", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "L.P", "reviewText": "I am an avid reader, I got this book for free, and I'm glad I did.\n\n I found her \"tales\" self absorbed and she came across as unlikable, not what she was trying to do I'm sure.\n\nI could see why men leave her or don't call her.\n\nHer desire to be an actress never clicked , and it did make me think about how many people waste their lives trying to get steady work as an actor.\n\nAs a women, I found her irritating, and as a reader I found myself getting real bored about halfway into the book.\n\nThe story I think she has in her to tell, is the one about her real Dad.\n\nThat was interesting. ( but did she make up that part on how she finally met him??, that seemed fake)\n\n She is on firmer ground as a writer when discussing her family.\n\nI think her dating/relationship problems stem from her issues with her real Dad. (who abandoned her mother and her when she was 4) (like some stranger pop analyzing helps!)\n\nAnyway, at least she wrote a book and got it published, and that is huge, so Congratulations to you Laurie!\n\nI would be interested in a true story about your family. :)", "summary": "wanders all over the place and then fades off....", "unixReviewTime": 1139702400}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "12 20, 2005", "reviewerID": "A3B6ZC60PL7CGE", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Robin Gorman Newman", "reviewText": "Fun, clever read!!\n\nRobin Gorman Newman\n\nauthor, HOW TO MARRY A MENSCH", "summary": "A GOOD READ", "unixReviewTime": 1135036800}
{"overall": 1.0, "vote": "5", "verified": false, "reviewTime": "09 27, 2005", "reviewerID": "A3PBZ6WYBLLMU1", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Pamby", "reviewText": "Only those who have no problem following an incessant rambling about guys who truly are stranger than fiction will be able to enjoy this book.  It is essentially a bunch of words that have somehow made it into print, with no real beginning, middle or end.  I suppose the holidays and years are nice, but halfway through each chapter, when I am still trying to find a point, I forget which day it is anyway.  This book is so all over the place, and a downer to boot, that I wish I had not wasted my money on it.", "summary": "Schizophrenic dating disaster", "unixReviewTime": 1127779200}
{"overall": 1.0, "vote": "7", "verified": false, "reviewTime": "08 7, 2005", "reviewerID": "A1QFD2P78PYTZ5", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "AMG", "reviewText": "Halfway through the book, you are left wondering two things: why doesn't Karrie take a break from dating for a while, and why doesn't she try a new career? She seems to not have much luck in either arena, and the results are a rather tedious read. While cute at times, Bridget Jones diary it ain't.", "summary": "I'd rather kiss a frog than read this book!", "unixReviewTime": 1123372800}
{"overall": 1.0, "vote": "10", "verified": false, "reviewTime": "06 18, 2005", "reviewerID": "A32MX4VY6TWHXP", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Erika Reviews", "reviewText": "It's rare that I do not finish a book, but I had to put this one down. It was nothing like I expected it to be. The writing just was not captivating enough to make me force myself to finish it. I feel a book is only good if you can care about the characters in one way or another, and this book made me think, \"So what?\"\n\nI wouldn't waste my money. Well, actually, I did. But if I was you and I hadn't bought the book yet, I wouldn't waste my money.", "summary": "So what?", "unixReviewTime": 1119052800}
{"overall": 1.0, "vote": "8", "verified": false, "reviewTime": "05 3, 2005", "reviewerID": "A3U5CZ3PV82JXD", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Danielle", "reviewText": "I am a massive chick-lit reader and I had noticed this book for a while and I finally decided to buy it. Boy, I wish I hadn't. The book just goes on and on. The character of Karrie is not very likeable and by the middle of the book, I couldn't have cared less whether she found a man or not and whether she got a big break in acting. The men that she dated seemed to be all the same character with just a name change and I have a hard time believing that Karrie would have just one bad relationship after the other without having at least one good relationship. It was just too much. Also, Karrie is Jewish and uses a lot of Jewish phrases or words but the author doesn't bother too explain them, so if you're not Jewish or know someone who is, you will have no idea what she is talking about. Also at the beginning of each chapter, the date will be given. But inside some chapters, the character will just suddenly start talking about a different time in her life and I was left confused about what she was talking about.  Like you may have guessed, I found this book to be too long, I believe that it could have been cut in half and cut out half of the stories-because they're all basically the same-the book would have been much better. I think you can tell that Laurie Graff is an actress first and a writer second because I think it shows in her writing. I wouldn't recommend this book to anyone and I will not be reading anything else by Laurie Graff.", "summary": "The book that wouldn't end", "unixReviewTime": 1115078400}
{"overall": 4.0, "verified": false, "reviewTime": "04 7, 2005", "reviewerID": "A1S3IN6CSTBPY6", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Tonya Speelman", "reviewText": "This was a very cute and entertaining book about dating ALL the wrong men and finding out what is important and when enough is enough! IF I were her, I would have given up long ago! Everything from the cab driver to Elliot.\n\nIt also dealt with family and how important their role is in your life. It proves you may think you are happy to pretend to be someone else, but in the end you are better off being yourself.\n\nAnd heck in the end, if all else fails, go buy a dog!!!! Enjoy!", "summary": "Very cute!", "unixReviewTime": 1112832000}
{"overall": 4.0, "vote": "5", "verified": false, "reviewTime": "02 8, 2005", "reviewerID": "A31V0LTFU8JGR0", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "D. Weeks", "reviewText": "This book is not chick lit.  That's why it confused the readers who were expecting a chicklitty read all about designer labels and shopping.  This book is a literary novelization of the author's actual life, or at least that's how I understand it from reading the back blurb.  It deals with issues far deeper than chick lit.  Moreover, Laurie Graff has talent and has that special way with words and a turn of phrase.  (Lots of authors now just don't.  Their prose clunks.  The no-style style.  Clunky.)  It was a pleasure to read her narrative and escape into the world of the character.  Unlike some reviewers, I experienced her viewpoint character (a somewhat modified version of herself, I gathered, with the author winking at us from the distance of the years) as being charming and deep, if a bit ditzy about men.  It's an episodic novel about all the guys she dated.  I do have to say that she (the main character--and perhaps the author, by extension, though you should never assume a character represents the author, even when you're told it's based on real life!) was unwise in sleeping with all those men, protection shrotection.  She slept with more guys than I have ever even flirted with, let alone dated!  But I realize that's a typical lifestyle as portrayed, yadda yadda.  The episodes all have some meaning to her life.  She doesn't have a big character arc, just a small one, but that's more realistic anyway.  At the end, she chooses not to take back the last guy who dumped her and says she'll wait for what's really hers to show up.  That was her character change.  I realize that most romance novels and chick lit take a brick and pummel the reader over the head with the paradigm of being rescued by a man and so forth, so this novel wouldn't suit their reading tastes.  But if you are used to more literary and more lasting works, give this one a try.  She writes well, and I'll be looking forward to seeing more of her work.", "summary": "Not chick lit, but a novelized memoir--PhilipRoth-like", "unixReviewTime": 1107820800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "01 9, 2005", "reviewerID": "A30GESVUFJTTZF", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "T. DeBrock", "reviewText": "To any woman who's kissed (and may still be kissing) her share of frogs- you'll adore this book. The protagonist is a 45yr old single jewish actress. The novel is written as an account of her 20+ years of dating. Karrie Kline (the main character) looks back over all the blind dates, relationships and strange occurrences of the male kind she has had with humor and wit. The book is a great find and I would highly recommend it to anyone who enjoys 'chick-lit' or can appreciate another woman's man trials and tribulations.", "summary": "To all the frogs I've loved before....", "unixReviewTime": 1105228800}
{"overall": 1.0, "verified": false, "reviewTime": "01 6, 2005", "reviewerID": "A2UYWE97KME0M", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "C. A Scovel", "reviewText": "It takes a lot for me to put a book down without finishing it.  In the history of me reading there have only been 3 books that I have put down without finishing.  This is one of them.  The premise is that a lady is on the hunt for a man to settle down with.  The chapters are written as if a diary history of 10 years of dating.  The chapters are not immediately connected and the main character is so slimly designed that you could care less if a bus hits her.  I would put this on one of the all time worst chick-lit books ever written.  And to top that off probably one of the worst books ever.  I find more interest in reading bathroom wall graffiti than this.", "summary": "Save your money", "unixReviewTime": 1104969600}
{"overall": 2.0, "vote": "3", "verified": false, "reviewTime": "09 22, 2004", "reviewerID": "A3L212W5YX3P6B", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Colleen", "reviewText": "Having kissed my share of frogs I had high hopes for the story, but it dragged.  You never really get attached to the character and just keep reading to get the end.  don't bother.  There is no end.  Very anticlamactic.  She has no big character growth, no life altering event, no real conclusion at all.  I can only assume Karrie's life will go on as it has for the first 45 years, I'm just glad I don't have to read about the next 45.  don't waste your time.", "summary": "Disappointing", "unixReviewTime": 1095811200}
{"overall": 1.0, "vote": "4", "verified": false, "reviewTime": "08 30, 2004", "reviewerID": "A24IJ75QHRC15A", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Dee Gomez", "reviewText": "I'm all about books that are written from the single girl's point of view (i.e. Bridget Jones's Diary, The Devil Wears Prada, etc.) but this book, which details the life of the heroine in non-chronological order, is not a fun read. The reader never feels any true empathy for the Karrie Kline, nor does her romantic exploits satisfy the reader's imagination. There are better written, more interesting, and poignant books one could read instead. Don't waste your time flipping through over 400 pages waiting to like the book. Because even the ending, not the content, but how it is written-- cut short and dry, leaves the reader frustrated.", "summary": "Lots of pages, but not much fun", "unixReviewTime": 1093824000}
{"overall": 3.0, "vote": "2", "verified": false, "reviewTime": "07 23, 2004", "reviewerID": "A2F8BS9DQZS70J", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "D. Burke", "reviewText": "Each chapter is a different date or guy she dated. It gets monotonous until halfway through the book when you start to see some repeats of characters. It just seems like bad date after bad date, and it's a lot of bad dates before she learns not to be so desperate.\n\n  I had a hard time relating to the main character because there are a lot of cultural factors that come with being Jewish and trying to date. There is, however, an opportunity to learn about the Jewish culture from this book. You can also learn about being an actress in the dating world.\n\n  I thought the book dragged, and the ending disappointed me. I?m 25 right now and still single, and the thought of spending another 20 years in the dating world is depressing to me.", "summary": "Good if you're a 45 year-old Jewish actress in New York", "unixReviewTime": 1090540800}
{"overall": 5.0, "verified": false, "reviewTime": "04 4, 2004", "reviewerID": "A15ZKYHMT1K6VA", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Abby Weissman", "reviewText": "If you think the stories in this book are extreme you haven't dated lately. And these guys aren't even the froggiest! Graff has been there, back, and finally realizes something all single women should. The love of a boyfriend is usually temporary while the love of a dog is forever. Entertaining from cover to cover.", "summary": "Tells it like it is, was, and will be", "unixReviewTime": 1081036800}
{"overall": 5.0, "verified": false, "reviewTime": "04 3, 2004", "reviewerID": "A2111DMOIHRMKA", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Steve", "reviewText": "In the 50's it was Rona Jaffe. In the 70's it was Erica Jong. Now 2004 has brought us a diarist of breadth and wit, Laurie Graff. Taking a page from Gogol's \"Madman\" and a few more from Cynthia Heimel, Graff weaves an entertaining, insightful and always engaging fiction leavened with the truth of experience.\nThe lead character Karrie Kline is an everywoman adrift in the sea of humanity that is Manhattan with an emphasis on the 'Man'. With colorful supporting characters and intricate behavioral insight this novel on the hazards of the dating profession is a must-read for anyone with a regard for the follies and fantasies of the human comedy.", "summary": "Chick Lit Comes of Age", "unixReviewTime": 1080950400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "04 2, 2004", "reviewerID": "ADPPYDK40DSLZ", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Benita M Hill", "reviewText": "I bought a copy of \"You Have To Kiss Alot of Frogs\" hoping to be amused and entertained by a light novel aimed at those of us who are single, middle aged, and still hoping to find Mr. Right. And not only was I amused and entertained, but the character of Karrie Kline possesses such an enterprising romantic spirit, that, no matter how many times Mr. Right turns out to be Mr. Wrong, she never gives up her quest to keep putting her heartaches behind her and moving forward to the next possibility of true romance. Karrie, and the men she dates, have the kind of 21st century neurotic sensibilites that I think alot of women can relate to!\nI, for one, was instilled with the desire to jump right in and get back in the dating game, after a long hiatus. The book inspired me to get over those past heartbreaks and string of Mr. Wrongs and get out and take chances again!", "summary": "Hope for the Hopelessly Romantic", "unixReviewTime": 1080864000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "03 31, 2004", "reviewerID": "A3W2ZDNN4J3E7L", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "jill cohen", "reviewText": "I have to say that with the abundance of all the chic-lit kind of books about being single and all that, I kind of stopped reading them. They all seemed the same more or less.\nBut then, this one caught my eye in the store and I took a chance......!!!!! and i was crazy about this book!\nNow i have been purchasing it for friends, and even for my Mom, who laughed and cried through the whole thing.\nThe author writes with such an honest,  insightful perspective that the reader can't help but to feel the life of the single gal in the book, Carrie.\nI picked up the book every night before bed and read a story or two, and was just blown away.\nEven the way the book was organized and set up is pretty cool.\nbut don't just take my word for it, read it for yourself and share with others who are or were single!", "summary": "a very uniquely written book: Clever/Creative/Funny/Poignant", "unixReviewTime": 1080691200}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "03 31, 2004", "reviewerID": "A24ILBQBSYSFUN", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Ashley Formento", "reviewText": "I was exhausted from a day chasing after the kids, weary beyond belief.  I finally had some quiet time and thought I'd read a chapter of this new book, You Have to Kiss a Lot of Frogs.  I was giggling as I read the first chapter and guffawing my way through the rest.  I had my share of frogs and Laurie Graff's book brought back some of my own fond and laughable memories.  Reading this make me appreciate even more the husband I have and married life.  Great story.  Fun reading!", "summary": "Even married folks love this book!", "unixReviewTime": 1080691200}
{"overall": 5.0, "verified": false, "reviewTime": "03 31, 2004", "reviewerID": "A16LWELL5MT33X", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Searchsage", "reviewText": "I can never get enough of \"Sex in the City\" stories and this is whole other take on that world that cracked me up. Laurie Graf has a knack for knowing just how to put any bizarre or mundane moment or dude into the perfect words. When is her next book coming out? I want it now!", "summary": "Had me in stitches!", "unixReviewTime": 1080691200}
{"overall": 5.0, "verified": true, "reviewTime": "03 31, 2004", "reviewerID": "A3E08AFRACRRSR", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "E. Byron", "reviewText": "I LOVED this book!!  It's so smart and funny and well-written.  The writing is so natural it feels like one of those great conversations with a girlfriend that you never want to end. Any woman who's been single will relate to the heroine's journey. I bought five copies and gave them to my friends, and they raved about the book too.  It's our lives!", "summary": "A Great Read!!  Funny, smart and real", "unixReviewTime": 1080691200}
{"overall": 5.0, "verified": false, "reviewTime": "03 31, 2004", "reviewerID": "ASFBAAUC6ISQD", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Lynn Glazer", "reviewText": "I thoroughly enjoyed reading Laurie Graff's You Have To Kiss A Lot Of Frogs. Laundry got wrinkled in the dryer and meals burned, but I had to read \"just one more chapter.\"  I felt as if I was actually there, listening in to the characters as they created different situations and relationships.  In this instance, easedropping was rewarded with a variety of emotions.  I laughed, I cried, and I pondered.  What more could I want from a reading experience?  I am anxious to read what is waiting to be created by Laurie Graff next.", "summary": "Covering All the Bases", "unixReviewTime": 1080691200}
{"overall": 5.0, "verified": false, "reviewTime": "03 31, 2004", "reviewerID": "A2PID1OWRDA8OP", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Nancy Wielunski", "reviewText": "I laughed so much while reading this charming collection of stories that my husband kept asking me what was so funny.  He ended up reading it, too, and loved it as much as I did.  Not just for ?chicks? or ?singles,? it is a hilarious and touching look at people and their feeble, frantic and flat-out funny attempts to make connections with one another.  We?ve read chapters aloud at family gatherings, to the delight of all present.  In the end the book is more than the sum of its parts, as Karrie?s poignant perceptions about life and love add a dimension that renders the term ?chick-lit? utterly inadequate.", "summary": "Funny, touching and oh-so-real!", "unixReviewTime": 1080691200}
{"overall": 5.0, "verified": false, "reviewTime": "03 30, 2004", "reviewerID": "A3OC7BDYTUADQP", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "donna rosenstein", "reviewText": "Karrie Klein is relatable to every woman, Jewish or not, New York, LA or Kansas.  The plight of the single woman is a universal one and it nice to read an honest account by a woman who is not 28 and blonde. Its funny, sad and engaging, I highly recommend it to anyone who has every been on a date!!!", "summary": "You have to kiss alot of books and this is a great one", "unixReviewTime": 1080604800}
{"overall": 4.0, "vote": "11", "verified": false, "reviewTime": "01 25, 2004", "reviewerID": "A1T17LMQABMBN5", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "Caf Girl Writes", "reviewText": "I was duly impressed with this novel. Karrie Kline's insights on her dating life are full of wit, intelligence and poignancy. Since she turned thirty, Karrie has searched for Mr. Right all over New York -- only to encounter a load of Mr. Wrongs. Now that she's forty-five, the struggling actress may have to come to terms with her singleton ways. But life has its surprises. Will she finally find her prince?\nI marvel at Laurie Graff's wit. She's created an endearing heroine who tackles issues centered on her wayward father, her Jewish customs, and the fact that she does not want to \"get married and live a normal life in Queens,\" as her grandmother puts it. This is another great one from Red Dress Ink. A fellow frog kisser, I'd say this is one of the most relatable chick lits out there.", "summary": "Takes from a fellow frog kisser...", "unixReviewTime": 1074988800}
{"overall": 4.0, "vote": "18", "verified": false, "reviewTime": "01 3, 2004", "reviewerID": "AZRZLJGVMICD1", "asin": "0373250460", "style": {"Format:": " Paperback"}, "reviewerName": "J. Robinson", "reviewText": "I love all of the Red Dress Ink books I have read, and when I spotted this one in the bookstore, it looked like it would be right up my alley. And it was. The protagonist, Karrie Kline, had a strong voice that came through clearly in these series of humorous vignettes about dating. The author was also able to keep what could be a depressing subject mostly upbeat. She seemed to observe her experiences in a positive light and move on into the next experience. I think everyone has a little of Karrie Kline in them, especially when it comes to the dating world. Though the novel was quite long, it did move very quickly and actually made me laugh out loud at several parts! I have recommended it to all of my friends who are dating and need a good laugh. And, of course, I recommend it to anyone who is in the mood to read a great book.", "summary": "Immensely entertaining", "unixReviewTime": 1073088000}
{"overall": 4.0, "verified": false, "reviewTime": "10 18, 2000", "reviewerID": "AKCMMX00HO8OX", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Nancy Hochman-McGreal", "reviewText": "\"What She Saw\" is a lighthearted, humorous novel about a woman named Phoebe Fine who introduces the reader to all of the important men in her life. She does this in chronological order so we begin with Phoebe's first crush, moving on to a first kiss, and so on....I identified with so many of Phoebe's experiences that I began highlighting passages that were similar to to my own life experiences and the result was both depressing and reassuring at the same time.\nPhoebe's character is believable because she is flawed, just as we all are. Readers will most likely relate to her humanness which makes the book all the more readable. Rosenfeld writes with just the right amount of emotion, irony, humor and in-depth characterization. Each man Phoebe dates represents her own personal growth and maturity. There are two wonderfully stylistic chapters, \"What She saw in Anonymous,\" and \"What She Saw in No One\" that are like a musical-montage-growth- spurt. In these chapters Rosenfeld strings together Phoebe's raw emotions regarding her then promiscuous sex life. There were a couple of chapters I didn't like because I felt they were disjointed and broke-up what could have been a perfect flow.\nThis book is definitely worth reading. I can't imagine any woman not being able to identify with Phoebe's experiences. Whip out the highlighter while you're at it!!!", "summary": "A Wonderful First Novel", "unixReviewTime": 971827200}
{"overall": 2.0, "vote": "13", "verified": false, "reviewTime": "10 12, 2000", "reviewerID": "A10MBVNVX1RD3T", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Bryan Charles", "reviewText": "This marginally entertaining \"novel\" is a shining example of big publishing bandwagon-jumping. (Its antecedents are Sex and the City, Bridget Jones' Diary and The Girls Guide to Hunting and Fishing.) It is peppered with thinly drawn characters with obvious names like Holly Flake and Spitty Clark and lazy, self-satisfied lines like \"She couldn't imagine a time in life she'd ever aspired to going anywhere--except maybe back to sleep.\" Rosenfeld does a pretty good job bringing to life Phoebe Fine's many neuroses, but to what end? Any tension she creates is almost immediately dismissed, as in the case of Spitty Clark, an aging frat guy who may or may not have committed rape. How does Phoebe Fine deal with this knowledge? She offers herself to him sexually after a miserable Greek formal but is spared consummation when Spitty vomits during their make out session. Two pages later it's on to another ill-fated relationship, again defined by Phoebe Fine's predictable insecurities her current male foil's supposedly humorous one-dimensionality. It all goes on far too long and none of it is particularly inspired. I was excited by the Pablo Miles section when I read it recently in The New Yorker, but whatever charm that piece may have had on its own is not enough to sustain a novel. What She Saw reads less like a finely constructed piece of literature and more like an ambitious grad school manuscript. Look for the movie sometime next summer.", "summary": "A slight, vaguely entertainng read.", "unixReviewTime": 971308800}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "09 30, 2000", "reviewerID": "AOP1CZ6RGRF3N", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "R. Steiner", "reviewText": "\"What She Saw...\" is funny, clever, insightful, sophisticated, sad, and quite a good psychological case study of a girl/young woman struggling with issues of self-esteem.  From a clinical standpoint, the main character suffers from what psychoanalyst's call \"narcissistic depression,\" and the novel does an excellent job providing a subjective sense of that experience  (replete with wit that one doesn't find in case studies).  Reader's might complement the reading of \"What She Saw...\" by also reading Alice Miller's \"The Drama of the Gifted Child\" which gives a psychoanalyic perspective of the impact of parental narcissism on children's development.  The sub-title is something like \"how narcissistic parents form and deform the emotional lives of their children.\"  Rosenfeld captures the essence of that impact in an altogether touching and memorable fashion.  She must have suffered it, at least somewhat, to understand it so well.  She's transformed her suffering into a delectable account of growing up and sorting it all out.  I hope that Rosenfeld, who appears to be both lovely and vulnerable, keeps growing as both a woman and writer.  Five stars for this lovely debut.", "summary": "From a psychologist who loved this book", "unixReviewTime": 970272000}
{"overall": 5.0, "verified": false, "reviewTime": "09 27, 2000", "reviewerID": "A13W9L1AIZOSSA", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Sebastian Thaler", "reviewText": "Fast-paced, intelligent, funny, and profound!", "summary": "She saw a lot", "unixReviewTime": 970012800}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "09 19, 2000", "reviewerID": "AEJZW376HQDL6", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "doc_theo@yahoo.com", "reviewText": "In my compulsion to read something tragically endearing and self-deprecatingly funny, I devoured this over the weekend on the strength  of The New Yorker excerpt. As you might expect, that excerpt contained the  best chunk of her novel. However, it fell into line nicely as part of the  evolution of one young woman's bout with insecurity and promiscuity, her  trials with too much cellulite and not enough eating. The novel's  post-feminist, woman-defined-by-man tone succeeds where Ally McBeal  disappoints, but I found the initial chapters awkwardly paced while the  finale seemed truncated, misplaced, almost, amongst the fourteen prior  pieces that tended to read more like memoir than fiction. Rosenfeld's an  obvious talent, a delicious stylist whom I'll watch with interest. But  ultimately, like her character, I was left unfulfilled in that way you  sometimes feel after a one-night stand even though the sex was great.", "summary": "from a young male writer", "unixReviewTime": 969321600}
{"overall": 5.0, "verified": false, "reviewTime": "09 19, 2000", "reviewerID": "A1PLR2C71CMT5R", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Titicaca Pupuplatter", "reviewText": "Loved Phoebe Fine, the good-girl hosebag! A fast-moving and very funny  book. Smart, too.", "summary": "Dirty and funny!", "unixReviewTime": 969321600}
{"overall": 4.0, "vote": "9", "verified": false, "reviewTime": "09 14, 2000", "reviewerID": "A24FMTIYPI9Y99", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "This book reads like a cross between Welcome to the Dollhouse and a John Hughes movie.  It is funny and brutally honest look at the trouble in  looking for yourself in relationships.  This has a great, self knowing  heroine and is an andedote to all of the glossy girls dating books out  there.  The eighties stuff is hilarious to anyone who lived through roller  disco, pac man and leg warmers. This is not a perfect book, but it sure was  quirky, smart and fun to read.", "summary": "Sharper than Bridget Jones", "unixReviewTime": 968889600}
{"overall": 2.0, "verified": true, "reviewTime": "08 22, 2013", "reviewerID": "A22KI0RS8TQ4NU", "asin": "0375503757", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Megan", "reviewText": "This book is super boring. I never found myself engaging with the characters at all. I really wouldn't recommend it.", "summary": "Booo.", "unixReviewTime": 1377129600}
{"overall": 3.0, "verified": true, "reviewTime": "07 16, 2013", "reviewerID": "AW7Q39SFEY27U", "asin": "0375503757", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Megan Nicole", "reviewText": "The book was alright. I appreciated the weird men she attracted but it just ended suddenly. Her friends were a little funnier than she was.", "summary": "It Was Ok", "unixReviewTime": 1373932800}
{"overall": 3.0, "verified": true, "reviewTime": "07 12, 2013", "reviewerID": "A1SXFU150K5ZX5", "asin": "0375503757", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "I liked Lucinda Rosenfeld's writing, but I found the female protagonist very frustrating. Phoebe's character development didn't seem to go very far and I found it very difficult to relate and like her. But I did really like the author's writing and would definitely read something by her.", "summary": "Easy read to pass the time", "unixReviewTime": 1373587200}
{"overall": 5.0, "verified": false, "reviewTime": "07 10, 2013", "reviewerID": "A3638QG7SBZM5Z", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Lakellh", "reviewText": "This book was very well written. A very real perspective of life and the journeys through love and lust. A novel that everyone can relate to at some point or another. Keeps you gripped the entire time.", "summary": "Great book, great sender", "unixReviewTime": 1373414400}
{"overall": 4.0, "verified": true, "reviewTime": "07 3, 2013", "reviewerID": "AS7DNTUUPA4WP", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Annie  Garea", "reviewText": "I really enjoyed this book. It was unlike any that I've ever read. It starts when the main character is in elementary school and follows her through every relationship. I found myself analyzing my own past relationships as I analyzed hers. Great read for someone in their early twenties!", "summary": "interesting read", "unixReviewTime": 1372809600}
{"overall": 1.0, "verified": true, "reviewTime": "06 14, 2013", "reviewerID": "ANRKNKMRLFCRS", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Ryan K", "reviewText": "This book was difficult to finish but I did. and I will never read it again.  If you are a confident, young women who has her life together don't waste your time reading about how someone hates their life.", "summary": "If I could give it zero starts, I would", "unixReviewTime": 1371168000}
{"overall": 2.0, "verified": true, "reviewTime": "02 18, 2013", "reviewerID": "A2U7CDL5T8Q72W", "asin": "0375503757", "style": {"Format:": " Kindle Edition"}, "reviewerName": "Amazon Customer", "reviewText": "The chapters in this book run long. I thought it would be funnier or sweeter. It does not keep me interested.", "summary": "I would pass next time", "unixReviewTime": 1361145600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 22, 2005", "reviewerID": "A3OAS2ILJ1H1PW", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "lina", "reviewText": "because I felt for Phoebe.  In each of the little vignettes, I could see a little bit of myself and my life.  In her neurotic-isms, and in her self doubts and in her hopes as cliche as it sounds (but I'd hope I am a little bit more together than this character!).  Seriously, though, I flew through this book in a day.  I was expecting a light, fluffy read, and while it was light, on one level, it was also true to the realities of the educated-20-something-in-the-city.  Reminded me of Bridget Jones and of Sex and the City.  Lots of fun pop culture references.  Lots of sarcasm.  Lots of what I found to be witty points.  Just an enjoyable, although at moments frustrating and searing, read.", "summary": "I am compelled to share my enthusiasm for this particular piece of chick lit...", "unixReviewTime": 1135209600}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "01 22, 2005", "reviewerID": "AKPQSBU4BZNZY", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "CaliforniaMDS", "reviewText": "This book was very well written. I think Lucinda Rosenfeld is a talented author, and I will look for other books by her.  That said, I found the book to be a \"much of a muchness.\"  In ten years, (age 16 - 26) Phoebe Fine never seemed to grow up, mature, reflect, or just grow, period.  By the 10th or 12th man, I was a bit tired of her go nowhere, do nothing, victim mentality.  I was also a bit tired of the men she chose--- never really seeing what she DID see in them.  I'd give the writing style 5-stars, and the first half of the book 4-stars, but it was too much of the same thing to be more than a 3-star book overall.\n\nCertainly worth reading though.", "summary": "But what did they see in Her?", "unixReviewTime": 1106352000}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "10 11, 2004", "reviewerID": "A2MJJ3ZD9K6U2M", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Erika", "reviewText": "This story made me laugh and cry, both inspired and frustrated me.  Whether we'd like to admit it or not, I think that almost every woman and girl can relate to a certain aspect of the heartbreakingly funny lead character, Pheobe Fine.  While I did begin to tire of the book's concept toward the end, and was not particularly impressed with it's ending, I ultimately thought it was a refreshing and beautifully written read, and one that I would definitely recommend to my girlfriends.", "summary": "Made me smile", "unixReviewTime": 1097452800}
{"overall": 2.0, "vote": "5", "verified": false, "reviewTime": "04 23, 2004", "reviewerID": "A3GFWSB3VUEG20", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "English major", "reviewText": "Sadly, while reading this book, it is shoved down the reader's throat that Phoebe is a girl who suffers from the fact that every man she meets wants to have sex with her, and since she's basically a [prostitute], it usually happens. This takes away from Phoebe's intelligence and her other qualities that would make her a good person and a person worth knowing and caring about. Also, at about the hundredth mention of how beautiful and attractive she is to the opposite sex, the subtlety wears a little thin. Having said that, the book does have its moments, and I thought in general it had a lot of potential but ultimately fell short. It had a lot of promise in the beginning, but didn't follow through. Phoebe ends up coming across as an unlikable and empty sort of person, one of those annoying women who are always trying to call themselves victims and blame everyone else for their so-called unhappiness. I couldn't relate to her at all and it's unfortunate that the author chose to write a character who is such a cliche`. Also, the sexual references are disgusting, crude and totally gratuitous. I would recommend Why She Went Home instead.", "summary": "disappointing", "unixReviewTime": 1082678400}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "08 23, 2003", "reviewerID": "A2WZBMC52ULVBX", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Kristin Scott", "reviewText": "Haven't we all gone through a list of our boyfriends and/or crushes, to figure out why we were attracted to them in the first place?  Lucinda Rosenfield has based her book on just that element of a woman's life, from the first crush to the latest man.  While Phoebe does have issues of her own to deal with, it is quite interesting and humorous to see each man described by her.\nThis was a first novel for Lucinda Rosenfield, and a good one at that.  Looking forward to future works!", "summary": "Worth the Read", "unixReviewTime": 1061596800}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "05 16, 2003", "reviewerID": "A1PBD00SFGOV3B", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "lady detective", "reviewText": "dreadful and fun is the conundrum i'm put in when i begin to go back through the quite thick entanglement of the boys, boys, and men i've dated, and in the book \"what she saw\", i was given the chance to delve into someone else's mess.\neach chapter takes a look at a different boy/man the main character dated/went with/screwed. a fun idea, but there's such a distance on the page... it's difficult to understand her convictions. i wanted to laugh, and groan in aggreeance, but was left slightly unsympathetic and befuddled. the book begs to be written in the first person, but for some bizarre-o reason lucinda rosenfeld gave us a third person story.\nafter reading the first chapter i thought it was clunky, and decided to shut it for good, but i was at work, with nothing elese to read, so i kept going, and somehow fell in. i still didn't really like it, but felt hooked nonetheless. weird.\ni gave it four stars due to the 'it hooked me factor;' what does it all mean? i suppose it's just as confusing as what she really did see in all of those guys.", "summary": "i didn't really like it, but i couldn't put it down", "unixReviewTime": 1053043200}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "03 11, 2003", "reviewerID": "A32O4GWGVV9VAG", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "jumpy1", "reviewText": "Wherein we observe the development of a girl from 5th grade to about age 27, a girl that we eventually realize is quite attractive, though she has the persistent belief that she's a Dawn Weiner. It could make a great film. While I think Lucinda Rosenfeld has a good ear for dialogue and gives us painfully well-executed visuals, to the point where I felt I had been there myself (because, what young self-involved American female hasn't?) I thought the writing tired and too desperately-trying-to-be-trendy. It's the kind of book that would've made an impression about 10-15 years ago, but now the market is just too saturated, and let's face it - descriptive language a la Confederacy of Dunces has been immitated ad nauseum. Judging by the age of the character, Rosenfeld probably did write like this 10 years ago (in college), so it's too bad she didn't try to get it published then. Now, though, I think she'd be great writing for current female TV characters -- could give them something interesting for us to watch!", "summary": "good indie chick film?", "unixReviewTime": 1047340800}
{"overall": 4.0, "vote": "16", "verified": false, "reviewTime": "01 7, 2003", "reviewerID": "ARYF8JUHY2S1X", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Dianna Setterfield", "reviewText": "I really enjoyed What She Saw....  I thought it was a very well-written piece of work, despite the fact that the main character, Phoebe, has serious issues.  Lucinda Rosenfeld has done a wonderful job with this novel, and I will be sure to look out for her next offering.\nPhoebe Fine begins her story in the late 70s during her fifth grade year in school.  The boy's name is Roger \"Stinky\" Mancuso, and Phoebe has a crush on him that won't quit.  However, Stinky becomes more than just a dream for Phoebe, in ways both good and bad, and this experience becomes the stepping stone for a long and twisted journey.\nWhat She Saw... takes the reader through the odyssey that is Phoebe's love life.  It is interesting to watch Phoebe grow up before our eyes, beginning with a sweet, curious kid to a messed-up adult still in search of love and fulfillment.  The men that come into Phoebe's life sometimes stay, most often go, but always leave behind a piece of themselves that Phoebe carries with her.  It is also interesting to see how each relationship develops and how, ultimately, they crumble.  By the book's end, readers are left wondering about Phoebe -- does she make it; does she find true love; does she finally mature and realize that she is more than just the other half of a man?\nI recommend this novel with confidence.  However, it won't be for everyone.  Phoebe is not a wholly likeable character.  She is quite frustrating at times.  But she is also human with the most basic of desires -- to find love and be loved in return.  I could relate to Phoebe on this level, and I think that is the part that cinched the book for me.  What She Saw... is indeed a wild ride, but definitely one worth taking.", "summary": "A wild ride...", "unixReviewTime": 1041897600}
{"overall": 2.0, "vote": "10", "verified": false, "reviewTime": "05 20, 2002", "reviewerID": "A3LPD7NTGFH7V4", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "bowery boy", "reviewText": "Soon after I read this book, I tossed it out along with my retro polyester pants and orange creepers.  The concept of the novel is a clever one and it starts out as being cute and funny.  Even as a gay male, I could identify with Phoebe and a lot of her unwise choices in men.\nThen somewhere along the line, the book loses what little bit of charm it has and suddenly you're finding yourself not liking Phoebe that much.  As each man revolves his way through her life, you begin to dislike her and her choices more and more. Some of the boyfriends listed aren't even boyfriends but rather fantasy characters, penpals and in the case of Arnold Allen (the only Black guy who stereotypically appears on her list) a criminal. By the end of the novel you're thinking that she deserves everything that has happened to her. Some guys aren't good enough, others are too good and why doesn't she have any friends? One word for you Phoebe:  THERAPY!!\nAt first I thought this was going to be a Sheila Levine for the new millenium. Whereas Sheila's self-depreciating humor and poor choices in men endeared you to her, Phoebe's self depreciating humor had you hoping she would grab a bottle of sleeping pills and end it all. I guess Mrs. Rosenfeld is a fairly talented writer as she was able to evoke such dislike for her protagonist from me, but overall this novel went absolutely nowhere and was a complete waste of my time. I liked Bridget Jones better and that's a stretch.  I wouldn't really recommend this to book anyone.  If you can find a copy, check out Gail Parent's 'Sheila Levine is Dead and Living in New York'.  Although it's well over trhity years old now, it still maintains a crisp, hip, cutting edge feel to it unsurpassed by any other writer writing in the same vein as What She Saw.", "summary": "SHEILA LEVINE IS BETTER", "unixReviewTime": 1021852800}
{"overall": 4.0, "verified": false, "reviewTime": "12 3, 2001", "reviewerID": "A15LA3S0PO4P22", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "A \"Welcome to the Dollhouse\" or \"Heathers\" sort of novel that guides us through the the dating life of Phoebe Fine. From her sexual discovery years through to her diverse forms of promiscuity, she tests the boundaries of her conscience. The author writes with a dark wit that allows us to feel her experiences as if they were our own while also allowing us to laugh at the fact they we may have already felt, done, and thought similar things.", "summary": "Welcome to the Dollhouse", "unixReviewTime": 1007337600}
{"overall": 4.0, "verified": false, "reviewTime": "10 27, 2001", "reviewerID": "A2QOI0S9Y457VW", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Clew", "reviewText": "This funny and coming of age book presented a girl, Phoebe Fine, who somehow managed to find one of every kind of guy there is out there.  Her classical background led to her having thousands of questions about what 'normal' life was like.  In her search, she came across all kinds of men, each one slightly different than the one before yet still not filling her empty spaces.  Every woman out there has known at least one of the guys that Pheobe becomes involved with.  Whether it be the captain of the high school lacross team or the man on the subway who reads the paper everyday, there is some level of connection.  The humor and somewhat cynical outlook on her life is what makes the book something that you can relate to.", "summary": "You've all met one of them....", "unixReviewTime": 1004140800}
{"overall": 1.0, "vote": "4", "verified": false, "reviewTime": "10 25, 2001", "reviewerID": "A6E01ZMPFHC3Y", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Davidson", "reviewText": "Lucinda Rosenfeld's book makes educated women look like absolute idiots.  Phoebe is lucky she didn't end up with a venereal disease for all the sleeping around she did, in a mental hospital for her miserable self esteem, or in jail for stealing food as a starving Manhattanite.  Just ridiculous and embarrassing.\nUnlike Bridget Jones or many of the female characters Candace Bushnell creates, Phoebe is not a character you would want to be friends with.  Or, in my experience, even read about.", "summary": "An embarrassment to educated women everywhere", "unixReviewTime": 1003968000}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "10 22, 2001", "reviewerID": "AE98X3B0W88QS", "asin": "0375503757", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "I had to read the book for a book club, and not a single one of us liked it.  We are all women in our 20's, consider ourselves \"normal\" and could not relate to the character of Phoebe at all!  Phoebe, the main character of this book, suffers from low self-esteem, eating disorders, other self-destructive behavior, pathetically poor choices and mentally-abusive relationships.  On top of all this, Phoebe doesn't have a single TRUE friend throughout the entire book! Not only are the boyfriends in this book completely pathetic, but Phoebe's few, temporary friends turn out to be cruel and selfish as well.  This book is incredibly depressing.  It's also unbelievable that Phoebe could have so MANY \"issues\" when she did not appear to have suffered any major trauma during her life.  It is very confusing that there doesn't seem to be an apparent reason for Phoebe's laundry list of neurotic troubles.\nThe book club member who suggested this book did so because she had heard that it was \"funny\".  Unless you think self-destruction is humorous, you will not find this book \"funny\"!", "summary": "What did she see?", "unixReviewTime": 1003708800}
{"overall": 4.0, "verified": false, "reviewTime": "07 27, 2001", "reviewerID": "A2BN175O2GI490", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Trish", "reviewText": "This was such an entertaining book. The narratives on the various crushes and loves in the character's life were incredibly real. She goes through so many intimate feelings about men, career, and body image that were described so well. This is a great book for women to read. It made me feel like many of my own past experiences and feelings weren't so weird. I'm definetly sharing this one with my sister.", "summary": "Excellent Read!!!", "unixReviewTime": 996192000}
{"overall": 4.0, "verified": false, "reviewTime": "07 19, 2001", "reviewerID": "A25BOD7WUV10UD", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "bandaid818", "reviewText": "The first time I heard about this book was when I read an excerpt in a magazine.  The excerpt was very amusing so I eventually bought the book itself.  I practically couldn't put it down.  The beginning started out great but there were certain points in the book that lagged for what seemed liked forever.  I don't know why a couple of chapters are 2-3 pages long, when others drone on and on.  The only not-so-good comment I have about this book is that there was no definite ending.  Lucinda Rosenfeld's first book is a great one and I look forward to her next one.", "summary": "Overall, a pretty involving book", "unixReviewTime": 995500800}
{"overall": 4.0, "verified": false, "reviewTime": "05 26, 2001", "reviewerID": "A2A7DR7FNKR8A6", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Aimee Schory", "reviewText": "What She Saw ... is a fun read that is light and humorous.  Although some of the stories can go on a little too long, the majority of the book is filled with quirky anecdotes that all females can relate to starting with the fifth grade \"coolkid\" and working towards adulthood.  Following the narrator as she tries to find meaning behind her unsuccessful love affairs reminds us of the neroses shared by women everywhere!", "summary": "Ahh . . . the memories!", "unixReviewTime": 990835200}
{"overall": 4.0, "verified": false, "reviewTime": "03 2, 2001", "reviewerID": "A3W2FXLOW52NAO", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Theresa Mcdonald", "reviewText": "...followed by a mediocre middle, and a litte redemption at the end. I was SO excited to get my hands on this book. The idea of chronicalling someone's lovelife by the men she has been involved with was a great idea. The chapter titles were good too. The main character, Pheobe and I are the same age, so I could certainly relate to and remember many of the events (and disaterous '80s fashions) described in this book. All in all it was a pretty good book, it just had some parts that were way too long and drawn out, especially in the middle of the book. Sadly, some of the best parts of the book were too short and could have been fleshed out more. It wasn't the laugh a minute I expected, but it was a decent book and one I would recommend to any female who spent her adolescence in the 1980s.", "summary": "It was a great beginning...", "unixReviewTime": 983491200}
{"overall": 2.0, "verified": false, "reviewTime": "02 16, 2001", "reviewerID": "A1SGPOVRCKSAMG", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "Brook Neumann", "reviewText": "This is probably the most boring book I have ever read . I could however relate with some amusement the secret thoughts of her adolesccent Psyche. I don't recommend.", "summary": "Boring!!!!", "unixReviewTime": 982281600}
{"overall": 5.0, "verified": false, "reviewTime": "01 29, 2001", "reviewerID": "A1MG56X36JEZKO", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "MacFong", "reviewText": "Quite possibly a future classic in the ranks of Catcher in the Rye and the like.  It could even be banned in some states.  So get it while you can.  I really enjoyed it and laughed out loud at times.  While there were some cheap thrills, it still had many qualities that rose above the TV novel.", "summary": "Future classic?", "unixReviewTime": 980726400}
{"overall": 3.0, "vote": "5", "verified": false, "reviewTime": "11 2, 2000", "reviewerID": "A31KUQKJHUM0E3", "asin": "0375503757", "style": {"Format:": " Hardcover"}, "reviewerName": "M. Yung", "reviewText": "Though extremely refreshing and witty during the first few vignettes, Rosenfeld's tiring dissertation in her repertoire of ex boyfriends and crushes become rather dreary and flat towards the end. I began to dislike the main character more and more as I witnessed her self-loathing and over self-analysis throughout the pages. At one point you just need her to start loving herself and get over it, so to speak. Perhaps its not about what she saw in Spitty Clark \"The Gentle Rapist\" or Humphrey Fung or Jack Geezo, but rather what she doesn't want to see in herself. Rosenfeld however does exhibit great moments in her prose when she is able to capture the awkwardness and timidnes of sexual intimacy, especially during the formidable teenage years. She also has a great hand at characterization. Nonetheless, a fair read (especially for post-break up times) even if one doesn't read all the way through.", "summary": "What we see in Lucinda Rosenfeld ...", "unixReviewTime": 973123200}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "07 29, 2002", "reviewerID": "A3DGX5GGGNEBBH", "asin": "0375505458", "style": {"Format:": " Hardcover"}, "reviewerName": "James Tsai", "reviewText": "Otto tries to make a parallel with the Japanese pillowbooks (a Japanese courtisan's version of a journal with random thoughts scrawled in bed) with this particular book.\nThough the metaphor works to an extent, it is difficult to follow as a novel, with a huge cast of characters and leaves the reader wanting something more -- specifically more of plot development instead of momentary snaphsots.\nAll the snapshots involve love affairs or some particular hookup for that particular chapter. Now, I'm sure a lot more happened in the 80's than the latest drama of your friend by three degrees. So, the reader, unless he or she's looking for a romance book is left slightly nauseated.\nBut, I have to say the book is very pretty. Nice typography, layout and even a nice colophon at the end. (for what it's worth, right?)", "summary": "Artsy artsy...", "unixReviewTime": 1027900800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "05 21, 2002", "reviewerID": "A3O7A20C9A5SHC", "asin": "0375505458", "style": {"Format:": " Hardcover"}, "reviewerName": "Deborah Condon", "reviewText": "I found this book very charming. The front page of each chapter contains a lovely pictorial reference to the Japanese floating world of Edo, a reinforcement of the feeling the book evokes, of an ephemeral age and time - a signature of a particluar generation - this one in the 1980's in a city that itself is a delight - San Francisco.  Its characters are an ensemble of detached, almost superficial, visually cued men and women (boys and girls?) of late twenties redeemed by their sense of kindness and by open caring and affection.  It reminded me very much of a book of equal sweetness set a decade ealier in the 1970's - Vibram Seth's The Golden Gate, a lyrical poem set in the Bay Area that captured the mixed up romances and changes of a different, more hopeful, pre-AIDS generation.  Both books have a lightness and loving nature with the City itself more a stage than stadt.\nThe chapters intertwine characters and timelines like a Shakespearean Oberon, Titania and the path-crossing lovers. The only shortfall is that we never get to know any one character very well.  All educated, some are users, some self-consciously detached, a few with a described past, none with exact ambitions.  What they all share is a \"floating\" before landing into the not yet arrived-at weight of jobs, marriage, committment, irrevocable choices or downhill slides, as they pass into their 30's.  Maybe many of us landed earlier, especially now that marriage is a sooner thing than it was in the 70's and 80's.  But even without a connection to either a belated coming of age, being young in the 80's or a feeling for S.F. (I lived in S.F. in the 70-80's), this is still a reading pleasure, at least a light read for the beach, a cut above the predictable romances. It's bound to refresh.", "summary": "a world to float away to", "unixReviewTime": 1021939200}
