{"reviewerID": "A108J5O7DG2WIM", "asin": "0219400083", "reviewerName": "Julio Csar", "helpful": [0, 0], "reviewText": "I loved the look and the great improvement at night drivingA bit expensive but work great.Installation took me about 3 hours.", "overall": 4.0, "summary": "Great improvement for my Spyder", "unixReviewTime": 1376697600, "reviewTime": "08 17, 2013"}
{"reviewerID": "A1QBLUSZW281TA", "asin": "0715000322", "reviewerName": "Angelo Aresco", "helpful": [0, 0], "reviewText": "Put these on my 2011 can am outlander 800xt, easy to install, and being oem everything just plugged right in , even like the power switch they came with", "overall": 5.0, "summary": "Warm and toasty hands", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"}
{"reviewerID": "A3B40ZIZJ3HEP7", "asin": "0970408641", "reviewerName": "derrick", "helpful": [1, 1], "reviewText": "Don't buy this item  , its not a 4 window roll up , its look nothing like the picture , they sent me some crap,  and the seller is charging me 20 % restocking fee plus I have to pay for shipping , I will never buy from them again , YOU HAVE BEEN WARNED ...", "overall": 1.0, "summary": "garbage", "unixReviewTime": 1332115200, "reviewTime": "03 19, 2012"}
{"reviewerID": "A1DUAXYX5WHSX1", "asin": "1940825172", "reviewerName": "Craig Sheeley", "helpful": [0, 0], "reviewText": "Nice. A decent model, and at a better price on Amazon than anywhere else. Warning: This model starts the new despicable business practice of selling each vehicle with only one weapons configuration, instead of the multiple weapons we're used to. Which makes the MSRP price hike even more despicable. But this walker is worth getting - it puts German anti-tank on near par with Sov anti-tank capability, for fewer points - as long as you're not paying Battlefront's despicable prices.", "overall": 4.0, "summary": "Nice. A decent model", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A1VS7YWE0NCAS3", "asin": "2409862403", "reviewerName": "DOC HOLLADAY", "helpful": [0, 0], "reviewText": "I used this rating because I liked the key fob very much but I haven't had achance to install it yet. I don't know yet how it will work or how difficult it will be to install or how well it will work. I think it will be OK though when I do install it..", "overall": 4.0, "summary": "Good Key Remote Fob", "unixReviewTime": 1381363200, "reviewTime": "10 10, 2013"}
{"reviewerID": "AY04DS9CPM1YH", "asin": "2409862403", "reviewerName": "timothy a hickle", "helpful": [0, 0], "reviewText": "There aren't any instructions included so I haven't got it hooked up yet and I'm not happy with this product.", "overall": 1.0, "summary": "where are the instructions to this gadget", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "A2HHDDYLFIQWYA", "asin": "3293390102", "reviewerName": "Jonathan", "helpful": [0, 0], "reviewText": "I was very pleased with this LED.  I used it as a reverse light on my 2003 Explorer.  It has very bright light output and easy to install.  I give 3 stars because the product only lasted about 13 months before malfunctioning.  I was under the impression that LEDs outlasted incandescent bulbs by years.", "overall": 3.0, "summary": "great light output but did not last long", "unixReviewTime": 1364342400, "reviewTime": "03 27, 2013"}
{"reviewerID": "A12T7O6K54JTJM", "asin": "3696387606", "reviewerName": "James M. Sueverkruepp", "helpful": [0, 0], "reviewText": "Delivery was faster than expected. Installed and both worked for a couple weeks, didn't really preovide the illumination I was looking for. One has already quit working.", "overall": 2.0, "summary": "Short life", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}
{"reviewerID": "A1UXFMMV5CPPJQ", "asin": "3696387622", "reviewerName": "Bill", "helpful": [0, 0], "reviewText": "Use these in addition to an LED license plate on the reverse switch to light up behind my truck. My truck with cap has terrible blind spots while backing up. Now at night I can actually see while backing down the trails. Yes a camera would help as well. As my wife said after I showed her &#34;Im blind!&#34; The pattern is a little spot lite like but in conjuction with the plate lights...outstanding", "overall": 5.0, "summary": "Wow brite", "unixReviewTime": 1381881600, "reviewTime": "10 16, 2013"}
{"reviewerID": "AR040DQNCVR0H", "asin": "3696387622", "reviewerName": "d. man", "helpful": [0, 0], "reviewText": "Replaced by reverse light with these and the are like mini-spot lights now.  They light directly behind me very well.  Very good at being noticed while in reverse.", "overall": 5.0, "summary": "SUPER BRIGHT", "unixReviewTime": 1362182400, "reviewTime": "03 2, 2013"}
{"reviewerID": "A9XSCMBQVNUPS", "asin": "3696387622", "reviewerName": "dontpanic88", "helpful": [0, 0], "reviewText": "Tinted windows are great untell you go to back up at night. These lights are much brighter than stock and now I can see backing up. They also cam in a nice pakage .", "overall": 5.0, "summary": "great", "unixReviewTime": 1359936000, "reviewTime": "02 4, 2013"}
{"reviewerID": "A2U288JVS184R8", "asin": "3696390119", "reviewerName": "easton shew", "helpful": [0, 0], "reviewText": "Hoping the longevity holds up, they seem to be built very tough but that doesn't say how the light itself will work.. They have helped out a lot with my tinted windows I can see pretty good. Plus they look pretty cool too.", "overall": 5.0, "summary": "Works as advertised.", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
{"reviewerID": "A30J791OQS1LU", "asin": "3696390119", "reviewerName": "Richard", "helpful": [1, 1], "reviewText": "The product is exactly as pictured, and is the well-made LED light come to expect from CREE.  Although the price is steep, it's significantly brighter (and a pure white brightness) than the original on my 2001 Volvo S60 reverse lights.  They're the correct fit, they send no faults to my car's automated lamp-out detection.  Only issue is with the radio on and putting into reverse, I suddenly get radio interference which didn't occur with the incandescent bulbs.", "overall": 4.0, "summary": "Very bright, well-made - but RF interference", "unixReviewTime": 1382918400, "reviewTime": "10 28, 2013"}
{"reviewerID": "AWFIO1S25JKXN", "asin": "4678615123", "reviewerName": "Laval A. Thibodeau \"mr.t.\"", "helpful": [0, 0], "reviewText": "This product was bought with some reservation.  We were told by some that we would need to replace our seat covers at the cost of some 2400+$.  But I can say that 75$ later and some 12 hrs. of sweat we now have new seat covers.  Would recommend this product for the DIY person.", "overall": 5.0, "summary": "Party Boat", "unixReviewTime": 1380931200, "reviewTime": "10 5, 2013"}
{"reviewerID": "A21HW7FS5GF0UA", "asin": "4678615173", "reviewerName": "Jay Powers", "helpful": [1, 1], "reviewText": "I build and restore Jeeps and this product is amazing. Got a sun-bleached center console? Spray a couple coats of this on it and its back to factory like-appearance. It is a match for Jeeps &#34;spice trim color. sweet.", "overall": 5.0, "summary": "Perfect match for Jeep spice trim", "unixReviewTime": 1374969600, "reviewTime": "07 28, 2013"}
{"reviewerID": "ARY7KUJ25UXFD", "asin": "4678615173", "reviewerName": "Joe Hanna", "helpful": [0, 0], "reviewText": "Really really good product. I'm restoring my 1980 camaro and the paint is a great Match for the original finish. Very durable also.", "overall": 5.0, "summary": "Worth the buy", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "ARQ0EYIPPCCKM", "asin": "4678615173", "reviewerName": "Royo", "helpful": [0, 0], "reviewText": "I looked all over my area for a vinyl paint of any sort but all I found was substandard junk that either never dried or flaked off. This SEMS product is the best I've ever used, and an exact color match for my project. It goes on very nicely and dries to a beautiful finish.", "overall": 5.0, "summary": "Looked Everywhere", "unixReviewTime": 1381708800, "reviewTime": "10 14, 2013"}
{"reviewerID": "A2Z8DIDO8QUML2", "asin": "4678615173", "reviewerName": "Trevor", "helpful": [1, 2], "reviewText": "Product restored old fades miata tan 90-97 back to the oem colors. Looks great just remember, thin coats, but a lot of them. That way you don't fill in the vinyl grain.", "overall": 5.0, "summary": "Perfect match", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A3O6EBPH92YT9A", "asin": "4678615243", "reviewerName": "Jacob Estes", "helpful": [0, 0], "reviewText": "I used this product to recolor a 944 dash and it was great. The color appears factory. It has only been a year, but there has been a lot of handling and the dash color still looks new. It works exactly as it says it will.", "overall": 5.0, "summary": "Works exactly as it says", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A2YMOX70ITDQMU", "asin": "4678615243", "reviewerName": "R. Garcia", "helpful": [1, 1], "reviewText": "I used this because someone on a car forum recommended this. I painted my hood scoops on my car with this satin black spray paint and it came out AMAZING. But of course like all paint work, good results come from the prep. If you take your time in sanding your surface, this will come out very smooth. I like how the paint sticks well to the surface. Doesnt run and leaves a nice matte (or satin) finish. I did about 2 coats on my hood scoops and so far 7 months later, after the summer heat, all the rain, the winter weather i'm currently getting, it still looks like the day i painted it. I still have a 1/4 can left but i will buy one again for when i have to touch it up in the future. Def a top notch spray paint.", "overall": 4.0, "summary": "Top notch paint", "unixReviewTime": 1358208000, "reviewTime": "01 15, 2013"}
{"reviewerID": "AL04NP6DNUSRR", "asin": "4678615243", "reviewerName": "Robert Matera", "helpful": [0, 0], "reviewText": "Awesome paint, I used Max promotor as a prep and the Ford Ranger dash and door panels came out looking good.", "overall": 5.0, "summary": "Quality paint", "unixReviewTime": 1386374400, "reviewTime": "12 7, 2013"}
{"reviewerID": "A3JIMLA7PJ88FU", "asin": "4678615243", "reviewerName": "Steady Steve", "helpful": [0, 0], "reviewText": "I experimented with several paints while changing the interior color of my truck, now I'm having to go back over the areas where I didn't use the SEM paint.  That's sand down and re-prep, lesson learned SEM is where it's at.", "overall": 5.0, "summary": "The only paint for your auto interior", "unixReviewTime": 1382572800, "reviewTime": "10 24, 2013"}
{"reviewerID": "A3QEZ1LYHFB2B9", "asin": "4678615303", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I saw this recommended on the Honda Ridgeline owner's forum as a good match to the dark grey (graphite) interiors used on many of the 2006-2014 Honda Ridgelines.This is great stuff. It sprayed on very easily and evenly, with no perceptible surface build up. It's like it magically changes the color without changing any of the texture or surface detail.Although the color is ever so slightly lighter than my factory dash audio bezel and dash control areas, it's close enough to be usable. This is something to consider need to customize your auto interior or repair color, as long as the color matches.", "overall": 5.0, "summary": "Great for auto dashes and interiors if the color matches", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
{"reviewerID": "A13SNFA57TZU03", "asin": "4678615303", "reviewerName": "Gil M. Meyer", "helpful": [0, 0], "reviewText": "Their paints are a coatings, not just a paint.  Great for car interiors.  Spray lightly with multiple coats.  Use their texture spray first.", "overall": 4.0, "summary": "Need color chart from SEM to get a good color match.", "unixReviewTime": 1381363200, "reviewTime": "10 10, 2013"}
{"reviewerID": "A15RLZVJ91QA3I", "asin": "4678615303", "reviewerName": "the dude", "helpful": [1, 1], "reviewText": "This stuff is not like normal spray paint, it goes on like a stain and provides solid even color on the first coat. It is extremely thin, perfect for keeping the stock texture the same but bad for covering up scratches. Graphite matched my other Ford (color code \"T\") interior parts pretty well. The paint is durable and the only way you can even tell a part has been painted is that the finish is slightly rougher.Be sure to follow the instructions from SEM's website. It is essential that the part is perfectly clean. Any spot that is not will cause the paint to bubble and will leave a noticeably different texture after it dries. Thin coats are also important, as many as you want.", "overall": 5.0, "summary": "perfect for auto interiors", "unixReviewTime": 1340150400, "reviewTime": "06 20, 2012"}
{"reviewerID": "A3W6C90OZVI65", "asin": "4678615303", "reviewerName": "VinceC", "helpful": [0, 1], "reviewText": "Only time will tell. I applied this paint to a gasoline tank that is being mounted on the transom of a personal watercraft for long distant rides. Paint went on very smooth and looks awesome (graphite) but only time will tell how well it endures. It is expensive by at least twice as much as retail paints you would buy at a hardware store but it will be worth it if it lasts me 2-3 years.", "overall": 3.0, "summary": "Expensive but worth it?", "unixReviewTime": 1327276800, "reviewTime": "01 23, 2012"}
{"reviewerID": "A2S83TRVZHGHPN", "asin": "5926025338", "reviewerName": "Aldrin", "helpful": [0, 1], "reviewText": "Mediocre", "overall": 2.0, "summary": "Two Stars", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}
{"reviewerID": "A28YGXV9M762SH", "asin": "5926025338", "reviewerName": "Alison", "helpful": [0, 5], "reviewText": "This was a great quality for the price.  Haven't had a chance to wear it yet but have checked many rain suits for the bike and this seems to be the best.", "overall": 4.0, "summary": "Great quality product", "unixReviewTime": 1367971200, "reviewTime": "05 8, 2013"}
{"reviewerID": "A3FVIJSUGO0UZR", "asin": "5926025338", "reviewerName": "Brandon Rowe", "helpful": [6, 6], "reviewText": "Everything it says and more. Works great. Love it . Very happy. Shipped right on time. Works great on motorcycle in the rain, kept me perfectly dry in heavy rain going highway speeds. Awesome", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1345852800, "reviewTime": "08 25, 2012"}
{"reviewerID": "AGQTVNBJNSVJM", "asin": "5926025338", "reviewerName": "Clyde \"Clyde Forsland\"", "helpful": [0, 0], "reviewText": "... the zippers, on the other hand ...I have been out in a lot of different rain conditions, as my BMW Touring Cycle is my only transportation. The jacket and pants do a good job of keeping me dry in any conditions.The zippers on the lower legs of the pants catch the fabric constantly, and one of the zippers broke the first time I used the suit. Now I leave them zipped up and need to take off my boots to take off the pants.They would be 5 star if the zipper worked better.", "overall": 3.0, "summary": "The suit is very fine", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"}
{"reviewerID": "A2FP171YP527HV", "asin": "5926025338", "reviewerName": "customer69", "helpful": [0, 0], "reviewText": "the pants are to Large for each size. ask for one less. the quality are excelent and  the materials are warm.", "overall": 4.0, "summary": "ask for a One size less", "unixReviewTime": 1395360000, "reviewTime": "03 21, 2014"}
{"reviewerID": "A2UDT8QEXGE066", "asin": "5926025338", "reviewerName": "Cutter", "helpful": [0, 4], "reviewText": "The item arrived earlier than expected and was just as described in the product description. I haven't had touse the rain suit and I hope I never have to. It's the type of thing you buy for &#34;just in case.&#34; The price was right as well.", "overall": 5.0, "summary": "Joe Rocket rain suit", "unixReviewTime": 1351987200, "reviewTime": "11 4, 2012"}
{"reviewerID": "A2WCZ1UGR6NQMP", "asin": "5926025338", "reviewerName": "dino pescara", "helpful": [0, 5], "reviewText": "havent had the chance to use it yet hoping not to but in case i do i know i will be ready", "overall": 5.0, "summary": "rain gear", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}
{"reviewerID": "A1GEQIJ3OGL9DN", "asin": "5926025338", "reviewerName": "DVD woukd not play", "helpful": [6, 6], "reviewText": "I rode my motorcycle into work this morning in the rain.  It's about a 30 min drive and this morning it rained the whole way.  This suit kept me dry (except for a small part under my right knee, weird).  I'm very impressed with this suit.  I like the looks of it and the heavy duty feel to it.  I wish there was a pocket on tge pants but everything else is amazing! Thank you for this great rain suit!  I'm very happy with the price and the product !", "overall": 5.0, "summary": "Works great!", "unixReviewTime": 1372636800, "reviewTime": "07 1, 2013"}
{"reviewerID": "AE8STV069S1GD", "asin": "5926025338", "reviewerName": "firftremtp", "helpful": [0, 0], "reviewText": "I have only tried it on haven't put it to the test yet under any rainy conditions.I purchased it to use at a golf Tournament. I have used FroggToggs in  the past and was very happy with them, but this time i wanted something more and this seemed to fit the bill. I did not notice it came with no hood, Might have changed my mind if i had noticed, and the fact it has elastic in the back makes for a kind of snug fit which remains to be seen when i use it for the first time which will be in a frew weeks At my next golf tournament. So i will withhold my appraisal till then", "overall": 4.0, "summary": "Hasn't been put to the test yet....", "unixReviewTime": 1397952000, "reviewTime": "04 20, 2014"}
{"reviewerID": "A168ZGT0TNZOYN", "asin": "5926025338", "reviewerName": "Jeffrey Cooper", "helpful": [19, 19], "reviewText": "Great value for the money. I purchased this rainsuit for the rain, as well as to use for cold-weather commuting. The suit fits true to size (I'm 5'4\" and 130lbs and the small fits great). The stirups and elastic on the ankles of the pants are perfect for keeping a tight seal to avoid water (or cold air) from entering. Additionally, the pants have zipper expandable sides to allow for putting them on over my boots. Another plus is the heat shield on the lower inside of the legs...don't even think about buying a suit that doesn't have these (I've seen other suits melt on the exhaust, and then they're worth nothing).I'm not crazy about the jacket for cold weather riding, but it works great in the rain. The problems I have with the jacket are: I don't like the drawcord at the bottom (so I removed it, problem solved); the collar of the jacket is lined w/ corduroy or something, but it scratches my neck (this is the main reason I still wear my TNF jacket for cold weather riding).I ride 365 days a year, as my motorcycle is the only vehicle I own. In the past I've used ski pants and a North Face Gore Text jacket, and they work, but not anywhere near as well as the Joe Rocket RS-2 rainsuit.", "overall": 4.0, "summary": "Excellent rain suit for the money", "unixReviewTime": 1291766400, "reviewTime": "12 8, 2010"}
{"reviewerID": "A7ZPOEBQ6QOUU", "asin": "5926025338", "reviewerName": "Jerome G. Douaze", "helpful": [0, 0], "reviewText": "The pants are great and I am using them but the jacket is way too short!The elastic belt of the jacket is way to high to be comfortable", "overall": 2.0, "summary": "Careful with sizing- the jacket is too short", "unixReviewTime": 1385078400, "reviewTime": "11 22, 2013"}
{"reviewerID": "A2OX15EXYZ9D1I", "asin": "5926025338", "reviewerName": "Jonathan Rhoads", "helpful": [0, 0], "reviewText": "Haven't had much chance to use this yet, but the two times it poured here, it kept me dry. No problems at all.", "overall": 5.0, "summary": "Great so far", "unixReviewTime": 1391644800, "reviewTime": "02 6, 2014"}
{"reviewerID": "AS5KEO3NNP466", "asin": "5926025338", "reviewerName": "Karl Chillman", "helpful": [0, 0], "reviewText": "joe rocket is a well known name in motorcycle wear and i am a big guy 52 inches on chest and it has plenty of room for other clothing under neath", "overall": 5.0, "summary": "sizing was perfect", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"}
{"reviewerID": "A33JABAIRL4XOO", "asin": "5926025338", "reviewerName": "L-Con", "helpful": [4, 4], "reviewText": "Fit is good, but when I tried on the jacket for the first time the seam inside the left sleeve of the liner tore open. Apparently quality control missed the fact that the seam was not completely sewn together. Other than that the quality appears to be pretty good. I haven't had a chance to use it yet, but I think it will work as intended. I ordered the same size I would if I were ordering a regular jacket, and it has plenty of room for a jacket underneath.", "overall": 3.0, "summary": "Not bad", "unixReviewTime": 1347148800, "reviewTime": "09 9, 2012"}
{"reviewerID": "A1N3L2RXG71BNX", "asin": "5926025338", "reviewerName": "M. J. Mincey \"Electronics Geek\"", "helpful": [0, 0], "reviewText": "This thing keeps me completely dry in the Florida rainstorms. I just wish that A-I could get smaller pants as I'm only 5'4 and B-The pants totally unzipped to make it easier to put on with boots. It does get you warm, but I was surprised at how cool it keeps you while riding. That was a nice plus. I highly recommend and the material is really nice and you will be seen at night in this.", "overall": 5.0, "summary": "Keeps Me Dry and Then Some", "unixReviewTime": 1372982400, "reviewTime": "07 5, 2013"}
{"reviewerID": "A3KDHYRMGG1U23", "asin": "5926025338", "reviewerName": "Oleksii", "helpful": [0, 0], "reviewText": "I was pretty excited getting this suit. The size is ok, design good. BUT! The fabric itself is NOT waterproof. What makes it waterproof is the inner rubber layer. Only after 3 or 4 uses the inner layer started to peel off from polyester fabric, leaving non-waterproof areas. What's happening durina rain is that all water that bids from waterproof areas are running inside the pants where the non-waterproof areas are!! This is the second pair of this type of water of protection pants I have and both times it starts peeling in the crotch region, so all the water runs inside my underware. So, while your legs are perfectly dry, your undeware is soaked in water.I am trying rubber pants now, like Helly Hansen Voss pants. I hope those will work...As for the jacket, I haven't wore it yet, but I am fairly sure that the same problem might appear :(UPDATE 3/5/14The pants became useless in rain because the lamination peeled off in crotch region and all water runs inside. I bought Helly Hansen Voss pants and was not dissapointed. Voss is trully waterproof!", "overall": 2.0, "summary": "The inner waterproof layer peels after couple uses", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
{"reviewerID": "A1488JJI1XI313", "asin": "5926025338", "reviewerName": "Pen Name", "helpful": [3, 3], "reviewText": "This has come in handy on several occasions. The suit works very well. It doesn't flap around in the wind. It has a vent on the back that is adequate but not great. The jacket has a liner but the pants don't. It would have been nice to have. Overall I am pleased with my purchase. This is a great rain suit for the price.", "overall": 4.0, "summary": "Nice and dry", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "ANO6Q6EYNPH96", "asin": "5926025338", "reviewerName": "Sergio Murillo", "helpful": [0, 0], "reviewText": "In the second time when I use this rain suit, Pair of pant had holes and i got wet, I was te my money with this suit", "overall": 1.0, "summary": "Bad Quality", "unixReviewTime": 1394841600, "reviewTime": "03 15, 2014"}
{"reviewerID": "AP7AB5COY37XC", "asin": "5926025338", "reviewerName": "Steve R.", "helpful": [3, 3], "reviewText": "got the product,  find out that the pant were kind ofto large for me but the coat fit perfectly.so i bought the medium Joe Rocket RS-2 Rain Suit andthe pants fits me perfectly.  the rain suit is use for bicyclewhen raining.  the suit is 100% waterproof,  but have toput some very warm shirt under the rain suit when it is coldweather.  i am very happy from the product,  i would recommendthis rain suit to anyone that is sick and tire of getting wet from the rain.the velcro ajusting on the coat is really great, does not let the rain goin the coat.  great product.Sincerely,  Steve", "overall": 5.0, "summary": "Joe Rocket RS-2 Rain Suit Large", "unixReviewTime": 1375142400, "reviewTime": "07 30, 2013"}
{"reviewerID": "A2E3P2W9GTFJIK", "asin": "5926025338", "reviewerName": "steve skinner", "helpful": [0, 0], "reviewText": "Very happy with the joe rocket rain gear. Easy to put on and store on the bike. Have used it several times since my purchase. Great investment!", "overall": 5.0, "summary": "Joe Rocket rain gear", "unixReviewTime": 1401580800, "reviewTime": "06 1, 2014"}
{"reviewerID": "A3VHUPTQSRNG6X", "asin": "592702632X", "reviewerName": "Adolph M. Luhta", "helpful": [0, 0], "reviewText": "I thought I would really like it. The first time I used it, the leg zippers jammed, couldn't free them. Zippers and pulls are too fine for this use !!! Hassle getting warranty coverage. Will never buy any of their products again !!!", "overall": 1.0, "summary": "Chinese Quality control !", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
{"reviewerID": "A3V2ZD5WK6ZTQX", "asin": "592702632X", "reviewerName": "Ken", "helpful": [0, 0], "reviewText": "This rainsuit has kept me completely dry so far.  Very well built and seems durable.  Would have liked a storage bag, though.  Fits well, has good pocket storage throughout jacket and pants.  Excellent high visibility yellow as well.", "overall": 5.0, "summary": "Great rainsuit, reasonable price", "unixReviewTime": 1381708800, "reviewTime": "10 14, 2013"}
{"reviewerID": "A3BIQ4FIVBXHAN", "asin": "592702632X", "reviewerName": "Michael", "helpful": [0, 0], "reviewText": "Cons:When I opened the package I immediately saw defective stitching on the shoulder.  Not sure how this wasn't caught during quality control.  Cost me $10 in shipping to swap with the manufacturer.  Then, after first use the stitching that attaches the suspenders to the waist came apart.  Not worth another $10 to return.The cuffs at the wrists are crazy-huge.  When strapped down to their smallest size the cuff is still waaaay bigger than my entire fist. Very unusual fit.  No way to get a tight fit around any wrist.Pros:Comes with a nice storage pouch.  Bright colored.  Seems water to be tight.", "overall": 2.0, "summary": "I have quality concerns", "unixReviewTime": 1399420800, "reviewTime": "05 7, 2014"}
{"reviewerID": "A2ZB0D90H5PYJ7", "asin": "592702632X", "reviewerName": "MunkPuppy", "helpful": [0, 0], "reviewText": "The overall fit is superb and does not restrict body movements in comparison to the ST-6000 in the same size.I'm 5'9&#34; 38&#34; chest and 32&#34; inseam. Long arms.The material is more flexible and lighter than the SR-6000, and the liner in the AS-3000 makes all movements easier.The huge zippered gussets in the legs make getting these pants on over boots a breeze, and the wider cuffs and velcro on teh sleeves also helped immensely.The SR-6000 was a pain in general to get on, especially if your leathers got a little wet before putting on the rainsuit.The longer inseam and better stirrups, plus the addition of suspenders, make movement in the pants a lot less restrictive.The set-and-forget adjustable elastic waist is a lot more comfortable than the permanently tight waist on the SR-6000.I haven't worn this suit in the rain yet, but hopefully rain resistance is as good or better, given the price difference. The material seems to be the same as my Nelson-Rigg Boot Covers, and they remain waterproof after a year of above-average use.", "overall": 5.0, "summary": "Amazing fit and mobility!", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
{"reviewerID": "A1DPEPMEQ99K35", "asin": "592702632X", "reviewerName": "rodrigo", "helpful": [0, 0], "reviewText": "I used it just two times and the second time that I used it the water was filtering into my Jacket, when I got to my home I reviewed the Jacket to know why the water was filtering and surprise!!! The Jacket has some scratches on the PVC backing waterproof.I don't know how it happened because the backing waterproof is inside the jacket...", "overall": 1.0, "summary": "Quality concerns", "unixReviewTime": 1401926400, "reviewTime": "06 5, 2014"}
{"reviewerID": "A2SXHP3384ER6W", "asin": "592702632X", "reviewerName": "SailorJoe", "helpful": [1, 1], "reviewText": "This rain suit is just what I needed.  The material is breathable and has a mesh inner lining to help airflow.  The pants fit just right and have a reinforced rear end for wear and tear and reinforced inner legs for engine heat.Here's what I was looking for and this suit had it:A full velcro flap on the front of the jacket.A velcro collar with a corduroy liner and a concealed hoodVelcro cuffsA drawstring waist and jacket bottomHighly visible during reduced visibility rain stormsThe pants come with bootstraps to keep them down and zippers by the cuffs to allow ease in putting on and taking off.3M reflective striping throughout the top and bottomSuspenders to keep the pant waistband up and under the coat.If you get a one-piece suit you'll be most protected since there's no break in material.  If you have a two-piece suit you don't want rain coming in between the pants and the coat.  So it was important to me to find a set that had suspenders or a bib on the pants to keep them tucked up under the coat.  These do just that.As for fit, I'm 5'11\" 185lbs.  I wear a medium in most clothing.  I wanted a suit that would fit over my clothes.  So I ordered a large.  A large on my frame fits over my jeans perfectly.  The rain coat fits perfectly over my leather jacket.  If I were to just wear the rain coat over my shirt, I would want a medium.  But because I always use my leather coat when riding, I needed a large size suit to go over my leather jacket.  The collar is the only snug part of the jacket.  It probably should be the only snug part anyway to keep rain from running down your neck.Mobility is fine in the suit.  I can twist my torso and look over my shoulders with very mild resistance from the material.Bottom line: This 2-piece suit is a good buy.  It has suspenders to keep the pants up.  It's high-visibility green.  It fits great over clothes and a leather jacket.  The inner mesh liner provides adequate breathability.  The price is reasonable compared to other competitors.  I have NOT rain tested this material.  But I'm familiar with the material in general and believe it will provide acceptable coverage.  The product claims to be seam-sealed so that no water will leak in.  If it ends up leaking one could easily buy some seam sealing glue from your local Camping store.", "overall": 4.0, "summary": "Exactly what I needed", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A330D5WEVCW75B", "asin": "592702632X", "reviewerName": "W. Schultz", "helpful": [0, 0], "reviewText": "Loved it! First time I have had a rain suit for the Shovel Head. Rained for 400 miles and the only parts that got wet were my face, hands and boots. There was no rain blown up my sleeves or down the neck. Several commented on how well they could see me.", "overall": 4.0, "summary": "I'd buy another", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "AQ7ARU83HM7BC", "asin": "6095006791", "reviewerName": "R. VICKERS", "helpful": [0, 0], "reviewText": "First the voice was not always clear. Sometimes it would give the proper reading and sometimes it would say something nonsensical. I bought this to use on my motorcycle and the head is too big to get between my spokes. It is big and bulky. I am wearing reading glasses now and I thought this would be a way that I would not have to worry about having them to check my tire pressure. It is cheaply made and I would not recommend it.", "overall": 1.0, "summary": "Did not work well for me", "unixReviewTime": 1371513600, "reviewTime": "06 18, 2013"}
{"reviewerID": "AF9VJJRTTCWVA", "asin": "7138258720", "reviewerName": "alain", "helpful": [0, 0], "reviewText": "not only i love this plasma bulbs. the customer service is superb i give it a 5 star for the product and a 10 star for customer service", "overall": 5.0, "summary": "superb", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}
{"reviewerID": "A3J7SKRSM7IALJ", "asin": "7138258747", "reviewerName": "mb3240", "helpful": [0, 0], "reviewText": "I don't know if the wrong part was in the wrong package or what but I had to take a dremel tool and grind the plastic housing down so it would fit properly in the socket. It was kind of frustrating but I got them to work. So if you order these and have a dremel tool handy your ok.", "overall": 3.0, "summary": "Work great but", "unixReviewTime": 1373673600, "reviewTime": "07 13, 2013"}
{"reviewerID": "AVFOMV7EOZBN5", "asin": "7138259530", "reviewerName": "alfred", "helpful": [0, 0], "reviewText": "Garbage not bright yellow don't waste your money. Garbage not bright yellow it painted yellow Werry cheep.Cheep. Cheep.Cheep.Cheep.cheep.Don't buy it", "overall": 2.0, "summary": "Garbage not bright yellow, yellow color is painted I don't recommend.", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A36KQDIMNM7IFY", "asin": "7168258818", "reviewerName": "Michael in MD", "helpful": [0, 0], "reviewText": "I bought these because I was looking for a bulb that was brighter than the stock bulb.  I paid over $30 for these (along with several other bulbs from the same seller).  THEY ARE NOT ANY BRIGHTER THAN THE STOCK BULB I COULD BUY AT THE LOCAL AUTOZONE FOR FIVE DOLLARS.  WASTE OF MONEY.", "overall": 2.0, "summary": "no better than stock bulb", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A1JQCV1NTT7NFB", "asin": "7168258885", "reviewerName": "Alan", "helpful": [0, 0], "reviewText": "I am very disapointed with these, they are not as bright as the Sylvania Silver Star halogen bulbs I wanted to replace. & the silver stars are only $10 per pair. Going with commercial led taillights instead.", "overall": 1.0, "summary": "5 watt high power 1157 LED", "unixReviewTime": 1394409600, "reviewTime": "03 10, 2014"}
{"reviewerID": "A36KQDIMNM7IFY", "asin": "7168258958", "reviewerName": "Michael in MD", "helpful": [0, 0], "reviewText": "I bought these because I was looking for a bulb that was brighter than the stock bulb.  I paid nearly $40 for these (along with several other bulbs from the same seller).  THEY ARE NOT ANY BRIGHTER THAN THE STOCK BULB I COULD BUY AT THE LOCAL AUTOZONE FOR FIVE DOLLARS.  WASTE OF MONEY.", "overall": 2.0, "summary": "No better than stock bulb", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A3MFW73LNTZ35M", "asin": "7462847051", "reviewerName": "Doitlikechew", "helpful": [0, 0], "reviewText": "Easy to install.  One thing I do notice is a slight vibration in handle bars after installing bar ends.", "overall": 3.0, "summary": "Like", "unixReviewTime": 1312156800, "reviewTime": "08 1, 2011"}
{"reviewerID": "A2W374VIWR0XRQ", "asin": "7462847051", "reviewerName": "Fabio Alves", "helpful": [0, 0], "reviewText": "Much much lighter than the original ones from Yamaha. Great material. Very well made. Super easy fit. I'm very happy.", "overall": 5.0, "summary": "Yamaha R6 bar end", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "A3D5KJENY7KAWV", "asin": "7462847051", "reviewerName": "Joshua", "helpful": [1, 1], "reviewText": "Product seemed like it was going to be great. Until I started to put them on, and the hex bolt was way to long!! WTH? Use your old bolts or get a different set. Maybe mine was just a freak occurance, kind of hard to mess up something so easy on purpose. So I'll give the company benefit of the doubt. Didn't return them, just looking for those old bolts still.", "overall": 1.0, "summary": "Fail", "unixReviewTime": 1298592000, "reviewTime": "02 25, 2011"}
{"reviewerID": "ABC0504ZEDT5B", "asin": "7462847531", "reviewerName": "Lynxo", "helpful": [0, 0], "reviewText": "they will not stay on your motorcycle at all.. looks good looks cool but they will not stay on your motorcycle at all!!", "overall": 1.0, "summary": "stay away", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "AMIJOFEDKNQTG", "asin": "7462847531", "reviewerName": "Matt", "helpful": [0, 0], "reviewText": "These sliders look great on my bike, they also feel heavy and durable which is even better. I would have paid more for these then the price they have listed as It was hard to find the spiked spool sliders for my bike, so thank you!", "overall": 5.0, "summary": "Very good purchase!!", "unixReviewTime": 1339027200, "reviewTime": "06 7, 2012"}
{"reviewerID": "A1E36MS7102TTS", "asin": "7462847531", "reviewerName": "Thomas Kopec", "helpful": [0, 0], "reviewText": "It's really weird to tighten the bolt, it comes with a special tool. I lost one of them because i was unable to tie it hard enough. Looked really good when it was on.", "overall": 2.0, "summary": "not the best product out there", "unixReviewTime": 1378944000, "reviewTime": "09 12, 2013"}
{"reviewerID": "A3R5BNDP4FAOG9", "asin": "7462847981", "reviewerName": "jp999", "helpful": [0, 0], "reviewText": "Finally got these today for my 2005 CBR1000.  I bought them mainly because my right bar end was missing.  The polished aluminum looks real nice!But be aware that they are larger than the stock bar ends.  This caused them pinch my rubber grips and thus cause the throttle to stick.  To fix, I trimmed the edge of my throttle grip which allowed for some gap.  Unfortunately, the exacto knife I used was a bit dull so the trim job looks kinda crappy.  Oh well, beats having a sticky throttle.I still like them, though.", "overall": 4.0, "summary": "Look good but . . .", "unixReviewTime": 1303084800, "reviewTime": "04 18, 2011"}
{"reviewerID": "AWT603CR6Q6U7", "asin": "7462872161", "reviewerName": "Anna Gibbs", "helpful": [0, 0], "reviewText": "They look great and are real sharp looking. They are a little thin but it doesn't affect my driving ability. The good out weighs the bad and I would definitely by them again. I've read other posts and if the color of the grips change in the Florida sun i will be sure to make an update. Ride Safe!", "overall": 5.0, "summary": "A real mean look.", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A33O75YFI8EUVK", "asin": "7462872161", "reviewerName": "Chef", "helpful": [0, 0], "reviewText": "Hand grips look great in the beginning, black and nice, however this will not last hand grips will change color from black to brown will in my case they did, contacted seller I recommend a photo for damages they inclined, sent photo, however they informed me cant change re: 30 days return has ended.", "overall": 1.0, "summary": "Not durable", "unixReviewTime": 1340236800, "reviewTime": "06 21, 2012"}
{"reviewerID": "A11VG21KVOXTKD", "asin": "7462872161", "reviewerName": "Hector", "helpful": [0, 0], "reviewText": "Very happy", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
{"reviewerID": "A3P2W55HFLU19L", "asin": "7462872161", "reviewerName": "Jason Long", "helpful": [0, 0], "reviewText": "Thank you very much. My son was extremely happy. He couldn't wait to put them on as soon as I gave them to him.", "overall": 5.0, "summary": "Awesome grips.", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A13TJ260ZY2XYV", "asin": "7462872161", "reviewerName": "JAVIER J SANCHEZ JR", "helpful": [0, 1], "reviewText": "Really Stoked for my new grips, just got them on yesterday!! Feels natural and didnt have any problems installing. A lil time consuming and patients is key but definitely would do it again!! Great Product and For sure a Rubber Necker at the stop lights. Makes the bike look meaner and obiviously more custom with the GSXR on the grips.", "overall": 5.0, "summary": "Love It!!", "unixReviewTime": 1363651200, "reviewTime": "03 19, 2013"}
{"reviewerID": "A2P23K3FKF5X7T", "asin": "7462872161", "reviewerName": "KW", "helpful": [1, 2], "reviewText": "First off... they are hard to get used to and they are slippery with regular riding gloves. (get gloves with awesome silicon grips ALL OVER the palm and fingers).Installation: if you know what you are doing installation should only take about 20-30 min.If you have larger hands these might be iffy. They are a slimmer grip. If you look closely at the picture you can see the concave toward the center of the grip.As with all grips, I advise using some sort of adhesive spray, especially on the clutch side. The allen screws are there, but they are not nearly enough. I was riding to work one day and the grip slid off as I was bringing the front wheel back down because I did not spray enough glue. Took it home, sprayed a lot more glue and NEVER had another issue.Like I said, they are hard to get used to because of the lack of grip. But they look great.", "overall": 4.0, "summary": "Looks great and works", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A3CUJ2RGPUGM07", "asin": "7462872161", "reviewerName": "Lasonya Owens", "helpful": [0, 1], "reviewText": "they look good on my bike. really is a eye catcher, and the best part is ,they didnt hurt my pockets. i would buy from you again.", "overall": 5.0, "summary": "nice.", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
{"reviewerID": "A366ZOYHHPBMIA", "asin": "7462872161", "reviewerName": "liz", "helpful": [0, 0], "reviewText": "I ordered this product for my husband, and he loves them. They look great and he has had no problems as of yet with them slipping off. He has had these on for several weeks now. Gets tons of compliments", "overall": 5.0, "summary": "Very nice", "unixReviewTime": 1370995200, "reviewTime": "06 12, 2013"}
{"reviewerID": "AQY3UKFG77B7W", "asin": "7462872161", "reviewerName": "Michael Dorsey", "helpful": [0, 0], "reviewText": "This prouduct was great no problem I would buy again.  I loved it, it arived early it was more then what I expected.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
{"reviewerID": "AB37GFOKBM0C", "asin": "7462872161", "reviewerName": "michael", "helpful": [0, 0], "reviewText": "fast shipping. makes a good impression on the bike. bad part it when wearing gloves your hands will slip. other than that im happy", "overall": 5.0, "summary": "hand grips", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"}
{"reviewerID": "A2FJ2H6GN24BHO", "asin": "7462872161", "reviewerName": "Shaun Meads", "helpful": [0, 0], "reviewText": "I love the fact that is has the GSX-R logo all over it, but with gloves on they can be a bit slippery at times. But still, i get a lot of compliments on them so it's still a win for me", "overall": 3.0, "summary": "so so", "unixReviewTime": 1369526400, "reviewTime": "05 26, 2013"}
{"reviewerID": "A1MMR519EYWIHQ", "asin": "7462872161", "reviewerName": "Tim", "helpful": [0, 0], "reviewText": "These laser enhanced spike grips are great... They are very comfortable on the hands... I thouht at first I was going to have a problem with the grips getting hit it the sun but they dont... They also make my bike stand out a lot more too... For anyone who is thinking abt getting them for there bike, u are not making a mistake...", "overall": 5.0, "summary": "good product", "unixReviewTime": 1339286400, "reviewTime": "06 10, 2012"}
{"reviewerID": "A24X1DCXCMRT8B", "asin": "7462872161", "reviewerName": "Ty Robinson", "helpful": [0, 1], "reviewText": "Excellent.  Would recommend to everyone. Easy to install a little rough on palms but still worth every penny.. took a long trip to Daytona with them on", "overall": 5.0, "summary": "Excellent love them. easy to install", "unixReviewTime": 1382486400, "reviewTime": "10 23, 2013"}
{"reviewerID": "A1LVP3BQQBBZG8", "asin": "7462912651", "reviewerName": "alxinfla", "helpful": [0, 0], "reviewText": "Got these to bling out my 50 cc scooter and replace the cheap, hard grips that came with it.  Installation instructions made them a breeze to put on.  They feel great and look cool, hand fatigue is much reduced.", "overall": 5.0, "summary": "sweet and super soft grips for you ride!", "unixReviewTime": 1321488000, "reviewTime": "11 17, 2011"}
{"reviewerID": "A4SSMN422XEZB", "asin": "763525944X", "reviewerName": "Christopher", "helpful": [0, 0], "reviewText": "Loved the product easy to install, had an issue with one of the lights but they were quick to and didn't hesitate to send me another one! And for that they deserve a 5 star rating!! Love the service guys, keep up the good work!", "overall": 5.0, "summary": "Great seller great product...", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
{"reviewerID": "A1PGKPBGQY9X2I", "asin": "763525944X", "reviewerName": "R.", "helpful": [0, 0], "reviewText": "installed on a 2004 lexus rx330its a great looking addition for night time to see around the car and it looks cool! installation was simple, i took off my sideskirts and drilled even holes to fit 5 lights on each side. then i wired each side to the &#34;lexus&#34; logo by the bottom on the inside of the driver and passenger side so that it would gradually become brighter rather than abruptlyit was tricky finding a route to hide the wires, i had to go behind the front wheel wells and wired it up to the inside. it looks great and is very handy, highly recommend for a fun/easy mod", "overall": 5.0, "summary": "great looking aftermarket puddle lights", "unixReviewTime": 1370908800, "reviewTime": "06 11, 2013"}
{"reviewerID": "AVC6IBO40ZCZB", "asin": "7635259636", "reviewerName": "firejackal", "helpful": [0, 0], "reviewText": "So I bought these cause I was switching over to clear turn signal assemblies and still wanted that amber/orange color light and I couldn't find any this size as a regular bulb.Cons:* Not bright.* Barely visible during a sunny day.* Very loose in light socket.", "overall": 2.0, "summary": "Not bright during the day", "unixReviewTime": 1397174400, "reviewTime": "04 11, 2014"}
{"reviewerID": "A36KQDIMNM7IFY", "asin": "7888258948", "reviewerName": "Michael in MD", "helpful": [0, 0], "reviewText": "These bulbs are MUCH longer than a standard 194 bulb.  Consequentally, I can not even use the bulb because it wont fit in my tail light.", "overall": 1.0, "summary": "may not fit your application", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A1FLJF32QWAOZY", "asin": "7888258972", "reviewerName": "Simba_The_Lion", "helpful": [0, 0], "reviewText": "I was on my way for a delivery, when out of nowhere my car started beeping that I didn't have engine coolant and when I checked it it was perfectly fine then I checked the fuses and it burned a fuse and when I looked at the bulb it burned out in an instant so I replaced it with the stock bulbs and the problem was fixed but I won't buy them anymore.", "overall": 3.0, "summary": "Buned out my fuse and it smelled horrible", "unixReviewTime": 1387756800, "reviewTime": "12 23, 2013"}
{"reviewerID": "AA8LC9700MJKG", "asin": "7888259111", "reviewerName": "John", "helpful": [0, 0], "reviewText": "The product did everything it was intended to do. I unplugged the old bulb, plugged the LED replacement in. Light happened.", "overall": 5.0, "summary": "LED bulbs produced light when plugged in.", "unixReviewTime": 1392768000, "reviewTime": "02 19, 2014"}
{"reviewerID": "ASYNH3V00CED", "asin": "7888259111", "reviewerName": "John L. Bianca \"Butch123\"", "helpful": [1, 1], "reviewText": "Really bright, white light!  I think I will put them in all of my vehicles in the near future!  Good price also", "overall": 5.0, "summary": "Great turn signals", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
{"reviewerID": "ABQS1VVCJNRMW", "asin": "788825912X", "reviewerName": "PSilva70", "helpful": [1, 2], "reviewText": "I bought Red Dual Filament LED lights for my rear taillights and Brake light,s Big Mistake Should have used White Dual Filament lights because the lens are red and the red light makes it seem dimmer than the regular bulbs ! If your lens are red buy White Lights !!", "overall": 5.0, "summary": "dual filament red bulbs", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
{"reviewerID": "A2U1C1KATRWK34", "asin": "788825943X", "reviewerName": "Brenda Cordova", "helpful": [0, 0], "reviewText": "Super super fast shipping...easy to install....just plug in...... no tools needed ......look awsome in my car.....would highly recommend to anyone.....item was exactly as described......", "overall": 5.0, "summary": "Fast shipping....easy to install", "unixReviewTime": 1398988800, "reviewTime": "05 2, 2014"}
{"reviewerID": "AIFM54HONJ2FB", "asin": "788825943X", "reviewerName": "Rafael Rivera", "helpful": [1, 1], "reviewText": "Easy installation, improvement over standard car lights, description as advertised, saves in battery life - bright looking lighting for my SUV.", "overall": 5.0, "summary": "Brightness to my driving experience", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "AJ3LMG1A9FBHD", "asin": "7888259456", "reviewerName": "C. Hill \"CliffyPop\"", "helpful": [1, 1], "reviewText": "These seems fine so far and are bright like the glass bulbs they replaced. A few LEDs never lit up but not enough to care about.Worse part is the base of these LEDs is bigger than the old bulbs and the LEDs cracked the plastic mounts when I pushed them in. This made them loose fitting and I was forced to wrap my mounts tightly in electrical tape to keep them plugged in and working.Obviously, this is not a reliable situation and now I have to take the time to find new mounts which may or may not be too small as well. Kind of annoying for sure, but the taping has worked fine so far. Problems remains though of a nagging feeling that one LED might be loose at any time and that I'll get pulled over. I'm left wanting to check them all the time to see if they're working.", "overall": 3.0, "summary": "Decent LEDs, Base is Larger than Glass Bulbs and May Crack Your Mounts", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "A213A8FRQSO84Y", "asin": "7888259456", "reviewerName": "Hoonerific \"(optional)\"", "helpful": [2, 2], "reviewText": "about 70% as bright as the stock bulbs, which is not terrible. A good choice if you just need them for the instant on capability of LEDs, or to use in conjunction with a brake light modulator, or just to reduce current draw. They look kinda pretty but lack the coverage really necessary to properly utilize a standard reflector housing.", "overall": 4.0, "summary": "Not bad", "unixReviewTime": 1380326400, "reviewTime": "09 28, 2013"}
{"reviewerID": "AC5Z3JD82ZI55", "asin": "7888259456", "reviewerName": "Sam Schultz", "helpful": [0, 0], "reviewText": "These bulbs helped me blow another set of fuses! They are terrible stay away also the build qulaity was horrendous and the smds were not soldered professionally!", "overall": 1.0, "summary": "These bulbs are not dual intensity or at least not compatible with a dual intensity socket in a 2004 RAV4", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A3HAU1PNXAECBG", "asin": "788825960X", "reviewerName": "Joshua", "helpful": [0, 0], "reviewText": "Works but not the brightest.  On the normal setting they are fine.  The bright setting is not much brighter.  They are very red.", "overall": 3.0, "summary": "Works but not the brightest", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
{"reviewerID": "APOWJMGXQ8LAN", "asin": "8013826058", "reviewerName": "Will", "helpful": [0, 1], "reviewText": "Received the bulbs as described.. No issues.. Heavier bulb than expected and bright.. Appears a true heat sink around LEDS, not plastic..", "overall": 5.0, "summary": "AAA", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
{"reviewerID": "AM77LR1ZCSPLY", "asin": "8016868169", "reviewerName": "Jess from MD", "helpful": [0, 0], "reviewText": "I love this sticker. IT's perfect because it's not overwhelming Hello Kitty, but for those who love Hello Kitty it's the best subtle sticker you will find. However. they are bigger than what I imagined.", "overall": 5.0, "summary": "For any Hello Kitty Lover", "unixReviewTime": 1370995200, "reviewTime": "06 12, 2013"}
{"reviewerID": "A2IG056R3ZWVJE", "asin": "8016868169", "reviewerName": "YS", "helpful": [0, 0], "reviewText": "very nice product and good product, I will order again if more products will become and my daughter love it.", "overall": 5.0, "summary": "love it", "unixReviewTime": 1367971200, "reviewTime": "05 8, 2013"}
{"reviewerID": "AX5B9X4OMD7KR", "asin": "8016868193", "helpful": [0, 0], "reviewText": "I love my bows..They are a pretty decent size & they arrived on time. The seller also gave me a free bonus Hello Kitty decal of the outline of Hello Kitty's face. It was white and cute & will be added to my truck to make it even more cute. I will most definitely order from this seller again!", "overall": 5.0, "summary": "Review for Hello Kitty Bow Sticker Decals", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "A2KC50LQ0NFSM9", "asin": "8016868193", "reviewerName": "alawrence", "helpful": [0, 0], "reviewText": "Can we get a measurement on these.... Bigger sizes too? That's the only thing that bothered me about it. Like hard. But it was a gift for someone else, so, w/e.", "overall": 3.0, "summary": "I imagined it to be bigger.", "unixReviewTime": 1391990400, "reviewTime": "02 10, 2014"}
