{"reviewerID": "A1EE2E3N7PW666", "asin": "B000GFDAUG", "reviewerName": "Aaron L. Allen \"Orgazmo1009\"", "helpful": [0, 0], "reviewText": "CA Lewsi' review should be removed. he's reviewing a episode from season 10. If your gonna write a review do it for the whole season, not 1 episode thats not even on the season your reviewing it for.", "overall": 5.0, "summary": "Stupid", "unixReviewTime": 1202256000, "reviewTime": "02 6, 2008"}
{"reviewerID": "AGZ8SM1BGK3CK", "asin": "B000GFDAUG", "reviewerName": "Mind's Clay", "helpful": [1, 1], "reviewText": "I truly love the humor of South Park. It's social/political commentary and satirical wit and bathroom absurdity rules. No holds barred! I live to breathe another day in anticipation of Trey Parker's next installment, whether it be South Park or some other venture. South Park is truly the work of a genius. Thank you, Sir Parker. (In Britian they often \"knight\" certian individuals (usually after they are \"old\" or \"dead\") for their contributions to their society) :)Sometimes it is dry. Sometimes it is wet. And sometimes it is too moist for humor. But somebody has to do it!I would like to see new South Park episodes until the day I leave this mortal existence. However, I know that Sir Parker would want to \"move on\". However, I would much like to see South Park from the eyes of a 90 year old Trey Parker. What wisdom would we see then?....", "overall": 5.0, "summary": "\"More Moist Than Should Be\" Humor", "unixReviewTime": 1198195200, "reviewTime": "12 21, 2007"}
{"reviewerID": "A2VHZ21245KBT7", "asin": "B000GIOPK2", "reviewerName": "202_d \"202_d\"", "helpful": [0, 0], "reviewText": "This is a cartoon series pitting eight cartoon stereotypes in a pseudo reality TV environment.I have watched all three seasons (only three are on DVD), and this one is the funniest overall. All three are worth a watch, this one is best. The average price of this box set, here on Amazon,  makes it an affordable laugh.While it is possible to start watching with any season of this show, I almost always recommend starting with season one; not too much sequential  story line.This is parody/satirical humor. This type of humor is not for everyone. The smarter you are the more jokes you will understand; some jokes are subtle.", "overall": 4.0, "summary": "Overall, really like the series.", "unixReviewTime": 1215388800, "reviewTime": "07 7, 2008"}
{"reviewerID": "ACX8YW2D5EGP6", "asin": "B000GIOPK2", "reviewerName": "Alexandra Stephens \"dreamgirl0922\"", "helpful": [11, 13], "reviewText": "Yeah drawn together is great when it comes to the crude humor. The first season was hilarious but sometimes i found the second season lacking. But it still was a great season. A definite buy is you're a fan of crude humor and hilarious cartoons.", "overall": 4.0, "summary": "Crude cartoon humor...Check", "unixReviewTime": 1185840000, "reviewTime": "07 31, 2007"}
{"reviewerID": "A9RNMO9MUSMTJ", "asin": "B000GIOPK2", "reviewerName": "Andre Villemaire", "helpful": [0, 2], "reviewText": "Seems like today's generation is getting revenge on the censorship from the pastand is trying to open up all cans of worms. I guess nice cartoons with good storiesand some morals are out and crude in your face stuff is in.  Some of these arereally funny, have funny situations but its not for everybody and i would'nt let youngkids see it as you have male and female full frontal...characters urinating andother weird stuff....and also the writters must be gay...cause theres a lot ofgay situations...  But what would you expect from a generation of Reality show watchers.....Hope the next generation of cartoons brings back quality instead of quantity of crap.", "overall": 2.0, "summary": "not bad...", "unixReviewTime": 1281052800, "reviewTime": "08 6, 2010"}
{"reviewerID": "A3STFVPM8NHJ7B", "asin": "B000GIOPK2", "reviewerName": "A. Pierre", "helpful": [1, 2], "reviewText": "I dont agree with the reviewer who says the show wears thin after awhile. Ive watched each show about 3-5 times a piece and I cant get enough of the show, its a very funny and probably one of the best cartoons on tv today. I dont know how ratings are doing for the show but if they release them via dvd, i'll keep on buying them. Xandir and Tim, Sitting in a Tree is my favorite of the season but all the shows are funny. The more you watch, the more you pick up the little stuff you might have missed. Highly recommend this show to anyone who enjoys adult cartoons, its much better then South Park.", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1203897600, "reviewTime": "02 25, 2008"}
{"reviewerID": "A2582KMXLK2P06", "asin": "B000GIOPK2", "reviewerName": "B. E Jackson", "helpful": [0, 1], "reviewText": "Apparently I'm one of the few who really thinks Drawn Together is a fantastic animated show.  The animation is really good overall, second only to the Simpsons.  Very bright, colorful animation that makes everything look very nice.  A wide variety of creative characters each with their own special personality and goofy problems.  Solid storytelling that makes the characters more interesting, and a very wild adult sense of humor that has *so* much creativity you can barely keep up with the constant jumping around.  Imagine a more violent Simpsons or Futurama with the pacing in hyper mode.  That's basically what Drawn Together is all about.", "overall": 5.0, "summary": "drawn together nicely", "unixReviewTime": 1205884800, "reviewTime": "03 19, 2008"}
{"reviewerID": "A1TZCLCW9QGGBH", "asin": "B000GIOPK2", "reviewerName": "Ben Lawrence \"Ben Lawrence\"", "helpful": [0, 1], "reviewText": "I liked this product. I am a big fan of Drawn together and this is the best season so far. The extra features are cool and I can't wait until the next season comes out.", "overall": 4.0, "summary": "Drawn Together", "unixReviewTime": 1209427200, "reviewTime": "04 29, 2008"}
{"reviewerID": "A2E2I6B878CRMA", "asin": "B000GIOPK2", "reviewerName": "Big Dog", "helpful": [0, 0], "reviewText": "the show. it is really funny. it is a good show to get on Dvd. I like the show a lot.", "overall": 5.0, "summary": "it was cool", "unixReviewTime": 1378684800, "reviewTime": "09 9, 2013"}
{"reviewerID": "AD5MZA8SOVMPJ", "asin": "B000GIOPK2", "reviewerName": "Brandon Nolta", "helpful": [5, 5], "reviewText": "People who like cartoons must be thankful for DVDs, because that technology opened up the floodgates for fans for every kind of animation. Whether you like classic Looney Tunes, hippy-dippy sci-fi parables or Asian tentacle porn, it's all there for you to find and enjoy. It's only been in the last 20 years or so, however, that American TV networks have clued into the idea that many adults like cartoons that have content specifically aimed at adults, even though some cartoons did well in prime-time even fifty years ago or so. Now, with DVD, you can not only watch entire seasons at a shot, you can also see the shows in their unadulterated glory.Which brings us to the Comedy Central series Drawn Together. I've been a fan of this show for a while, partly because of the writing and partly because of the cheerful way in which it steamrolls political correctness and good taste. If South Park is the Mount Everest of crude, crass animation, then Drawn Together is K2; it doesn't stand as tall, but it's a tougher climb. The truth of this was brought home upon watching the second season of the show on DVD. Much to my surprise, watching the DVD turned out to be a different experience than watching it in first run.Part of this is due to one of the DVD set's selling points: it's unexpurgated. I didn't think this would make much of a difference, as it's generally pretty clear what's been cut. As it turns out, there was a lot cut out of the show, and not just language: genitalia, violence, enough racist abuse to make the KKK turn red under their sheets, sex in a vast array of configurations and a whole lot of other content that probably produces instant pucker in the unfortunate souls who work in Comedy Central's Standards and Practices department. Now, I'm not one for censorship, but the additional material works against the show to a certain degree. What's there is still funny in multiple senses, from satire to slapstick, but actually being able to hit the money words (and shots) dilutes the humor a bit.As far as taste goes, DT is not a show to start novices on. If adult animation is still a new concept for you, and you think The Simpsons is bleeding-edge in the sometimes fluid space between being socially acceptable and being a pariah, then DT may cause seizures. For people who like edgy animation, this will be just the ticket. The voiceover artists and writers take their material seriously, and they're willing to go wherever the jokes take them (the season finale has a running gag with historical dates and the episodes connected to them that manages to be both subtle and sick).In terms of presentation, the DT set is relatively bare-bones. The whole season of 15 episodes is crammed onto two discs, leaving just enough room for a handful of interviews with the voiceover artists (minus Adam Carolla, who has plenty to do outside the show) and a karaoke singalong. The visual quality is pretty sharp, and the sound quality is good, but this isn't the kind of material you use to do any THX certifications with, so it's not like you'd expect much. Still, it's the episodes that matter, and for you sick little monkeys out there who like this kind of thing, Drawn Together season 2 is a worthwhile expenditure. Just don't leave it out where Grandma or the kids might get a hold of it. Either you'll scar them for life (maybe shuffling Granny into an early grave), or you'll never get it back.", "overall": 5.0, "summary": "Funny, vulgar and sick: three of my favorite things...", "unixReviewTime": 1218240000, "reviewTime": "08 9, 2008"}
{"reviewerID": "A3IE1M3QVUKIJN", "asin": "B000GIOPK2", "reviewerName": "Brett Rumpelstiltskin", "helpful": [0, 0], "reviewText": "Very adult humor, cutting in sarcasm and dry take on reality shows in the least.", "overall": 5.0, "summary": "A great adult series", "unixReviewTime": 1251763200, "reviewTime": "09 1, 2009"}
{"reviewerID": "AZ1MUCW76BDL1", "asin": "B000GIOPK2", "reviewerName": "Candi", "helpful": [0, 0], "reviewText": "I already had seasons 1 and 3 so I'm pretty happy that I finally got season 2. If you haven't seen the show before, it's insanely offensive and hilarious. So you have been warned. Enjoy!", "overall": 5.0, "summary": "Finally completed my collection!", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}
{"reviewerID": "A2XNOB1T796Y6B", "asin": "B000GIOPK2", "reviewerName": "ChibiNeko \"Sooo many books, so little time!\"", "helpful": [0, 0], "reviewText": "Fans of the previous season of Drawn Together will both be overjoyed to see this DVD set & a little disappointed. Those who aren't into extremely crude humor won't be as entertained, though.This season picks up with the previous's cliffhanger of the plane crash, then quickly tries to top the previous season. It pokes fun at the shows & characters that it's based on as well as making jabs at it's critics. The DVD set is uncensored, which is nice but some of the jokes lose a bit of their punch. Half of the fun of watching it on TV is that things are blurred & curse words are bleeped. Even so, fans of this series will be glad to own this set. Anyone else? Better off renting it.", "overall": 5.0, "summary": "Always funny, but not for everyone.", "unixReviewTime": 1233532800, "reviewTime": "02 2, 2009"}
{"reviewerID": "A12DO7F3TT123V", "asin": "B000GIOPK2", "reviewerName": "Christopher Ward", "helpful": [3, 24], "reviewText": "Ok, I've watched at least 60 percent of Drawn together episodes out there. Yet i don't ever recall laughing past a grin. The characters are boxed into stereotypes leaving absolutely nothing funny to them but the obvious and predictable jokes . It has never displayed the wit of most \"adult themed\" animated shows out there. I cant see this show lasting many seasons more with the slight premise of the show. Tired stuff dawg!", "overall": 2.0, "summary": "Thin comedy disguised with predictable shock value", "unixReviewTime": 1189987200, "reviewTime": "09 17, 2007"}
{"reviewerID": "A2UN6AL460C8J4", "asin": "B000GIOPK2", "reviewerName": "Coral Twining", "helpful": [0, 0], "reviewText": "I gave it one star because of the quality of these videos. It looks like these were ripped from Comedy Central's website years ago. Also, there is a lot of censorship in these videos, contrary to what I've seen on the Drawn Together DVD collection (I only have season one on DVD), which I got for my birthday after graduating from high school back in 2006. This is what I dislike the most, even though I am a big fan of Drawn Together.I would not recommend this to anyone, even if they enjoy watching this show.", "overall": 1.0, "summary": "Completely dissatisfied with video quality and censorship.", "unixReviewTime": 1391299200, "reviewTime": "02 2, 2014"}
{"reviewerID": "AVYBQU4XX5QR4", "asin": "B000GIOPK2", "reviewerName": "David Meldrum", "helpful": [0, 0], "reviewText": "This short lived show has it's moments, and some episodes are pretty decent. I would recommend this show for any adult cartoon aficionado, a parody-spoof on stupid reality shows. For that reason and good voice work and interesting characters I would recommend this DVD for any adult cartoon fan.", "overall": 4.0, "summary": "Another vulgar adult cartoon, but pretty good overall", "unixReviewTime": 1363046400, "reviewTime": "03 12, 2013"}
{"reviewerID": "AVE3EF44DFS0C", "asin": "B000GIOPK2", "reviewerName": "Elliot Reed", "helpful": [2, 3], "reviewText": "Finally, this is out! The first season came out a few years ago and the long awaited season 2 finally gets a dvd release. Well this is a great show (although not for youngsters) and the laughs just keep on coming. The special features are kind of lacking, only given some commentaries and of course a karaoke sing along. There are 15 uncensored episodes, including the episode \"Terms of Endearment\" which was not included in the first season dvd due to legal problems. Anyways, a funny show filled with potty humor, not nessesarily smart or witty, but fun nonetheless. Get it before they take it off the shelfs!", "overall": 5.0, "summary": "Animation Domination!!", "unixReviewTime": 1190937600, "reviewTime": "09 28, 2007"}
{"reviewerID": "A27AWN5G5GT6RP", "asin": "B000GIOPK2", "reviewerName": "EvFan17", "helpful": [0, 0], "reviewText": "Im not sure why Drawn Together was cancelled but it needs to be back on tv and stay on tv forever cuz this show is funny and awesome. As a fan of Drawn Together this show is amazing and for anyone who has not herd of this show needs to look it up. Drawn Together is an amazing show and i support Drawn Together forever!", "overall": 5.0, "summary": "Awesome show !", "unixReviewTime": 1328745600, "reviewTime": "02 9, 2012"}
{"reviewerID": "A35KJPLBWHF5GJ", "asin": "B000GIOPK2", "reviewerName": "Faith Speed \"Mother Roar\"", "helpful": [0, 0], "reviewText": "Drawn Together is for MATURE ADULT audiences ONLY!!! Full frontal nudity, male and female, adult situations, sexual scenes, language, extreme violence, etc. I Love Drawn Together,it is hilarious,  but we only watch it at night when the kids are in bed. They can't see or hear any of it! But we are fans!!!!!!!", "overall": 5.0, "summary": "Drawn Together", "unixReviewTime": 1257033600, "reviewTime": "11 1, 2009"}
{"reviewerID": "ADP0IVFAH8EJF", "asin": "B000GIOPK2", "reviewerName": "Hallur Hallsson \"HH-0436\"", "helpful": [0, 0], "reviewText": "This one takes Season one and ramps it up .The jokes are dirtier, funnier and not getting stale at all. 12 year old and a donkey jokes makes a comeback and I loved the series.", "overall": 5.0, "summary": "Dirty, funny and a shame they ended in season 3", "unixReviewTime": 1357948800, "reviewTime": "01 12, 2013"}
{"reviewerID": "A2MBHFCT26IYQ6", "asin": "B000GIOPK2", "reviewerName": "James William Johnston \"ACE29\"", "helpful": [1, 1], "reviewText": "more great laughs picking up where the 1st season left off. 3 seasons. collect the whole set, its worth it. go captain hero!", "overall": 5.0, "summary": "DT2", "unixReviewTime": 1235433600, "reviewTime": "02 24, 2009"}
{"reviewerID": "AONBKXBKBR8BO", "asin": "B000GIOPK2", "reviewerName": "jamie rivera", "helpful": [0, 0], "reviewText": "One of the funniest shows ever insane and in your face! great price for this dvd collection, cant wait to get season 3!", "overall": 5.0, "summary": "still wildly funny", "unixReviewTime": 1379894400, "reviewTime": "09 23, 2013"}
{"reviewerID": "A2K72PJNBUP2TI", "asin": "B000GIOPK2", "reviewerName": "Jo Ann Mcbride", "helpful": [0, 0], "reviewText": "You have to love the Drawn Together series to own this.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A36ANEVX17XF9S", "asin": "B000GIOPK2", "reviewerName": "Karen James \"Musicfan\"", "helpful": [1, 1], "reviewText": "The fans of Drawn Together have waited so long for this DVD to come out and let me tell you it's was well worth the wait!In this uncut and uncensored DVD we get to see something that I had waited for since the show began we get to hear Xandir sing, however he doesn't sing very long and sounds like a cat being killed, plus we see him in the nude.I absolutely love the commentary and deleted scenes along with the cast interviews they were  such a crack up!It's fun to see the cartoons we grew up with be parodied in this sick but funny as hell adult cartoon!", "overall": 5.0, "summary": "Drawn Together Season 2", "unixReviewTime": 1191456000, "reviewTime": "10 4, 2007"}
{"reviewerID": "A3T0DNK02KT55Q", "asin": "B000GIOPK2", "reviewerName": "Ken", "helpful": [0, 0], "reviewText": "So disturbing, so disgusting, so over-the-top.  So great.", "overall": 5.0, "summary": "Raunchy goodness", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
{"reviewerID": "A2D18BJF9Z3QUS", "asin": "B000GIOPK2", "reviewerName": "montrell", "helpful": [0, 0], "reviewText": "I always live this show because they do an day the crazyist things in shows its very funny to me", "overall": 4.0, "summary": "Very funny", "unixReviewTime": 1361664000, "reviewTime": "02 24, 2013"}
{"reviewerID": "A7ZYU4SOLTUGB", "asin": "B000GIOPK2", "reviewerName": "M. Sellers \"Fade To ALS\"", "helpful": [0, 0], "reviewText": "I haven't laughed this hard and at the same time been totally offended, I love this series, I have the first 3 seasons", "overall": 5.0, "summary": "Drawn Together 2", "unixReviewTime": 1237420800, "reviewTime": "03 19, 2009"}
{"reviewerID": "AJKWF4W7QD4NS", "asin": "B000GIOPK2", "reviewerName": "N. Durham \"Big Evil\"", "helpful": [10, 20], "reviewText": "The second season of Comedy Central's animated, reality TV spoofing Drawn Together gets off to a great start, but sadly, it wears thin the further it goes on.  The season begins where the first one left off, with the house mates crash landing and eventually getting back to the house for plenty of animated insanity.  The visual gags are still quite funny, but the show's constant bombardment of homophobic jokes (especially with Captain Hero, which gets real boring and tired) and toilet humor without any kind of substance goes from hysterical to boring and contrived.  Granted we see the same kind of treatment on South Park, but with that show there's always an underlining hint of social commentary at the very least.  You won't find much of that here with Drawn Together, but then again, the show never really attempts to do such a thing either.  All that being said, there's still plenty to admire with the second season of Drawn Together, but it's nowhere near as funny as the first season was either.  All in all though, if you enjoy the show for what it's worth despite it's flaws, this DVD set is definitely worth picking up regardless.", "overall": 3.0, "summary": "Funny in the beginning, but wears thin", "unixReviewTime": 1186185600, "reviewTime": "08 4, 2007"}
{"reviewerID": "A17L10630VSW76", "asin": "B000GIOPK2", "reviewerName": "Nurse Palmer", "helpful": [0, 1], "reviewText": "The product arrived promptly as stated by Amazon.  Drawn Together is very funny.  Not for the faint hearted.  If you like your humour crude and full frontal this is the season dvd for you.  I loved it , very funny.", "overall": 4.0, "summary": "Very funny and borderline offensive", "unixReviewTime": 1204675200, "reviewTime": "03 5, 2008"}
{"reviewerID": "A3EP4NETI2AB94", "asin": "B000GIOPK2", "reviewerName": "R. Kline \"utgirl28\"", "helpful": [0, 1], "reviewText": "I received product very promptly and before my Hubby's birthday he was very surprised.  We have been looking for this item for awhile and I am glad once again Amazon was able to come thru.", "overall": 4.0, "summary": "birthday gift for husband", "unixReviewTime": 1194912000, "reviewTime": "11 13, 2007"}
{"reviewerID": "A2GV5HOVHKYDCC", "asin": "B000GIOPK2", "reviewerName": "Rmi du Crest", "helpful": [2, 3], "reviewText": "What more can one say about Drawn Together?! The show is self-explanatory! And season 2 is just the perfect embodiement of this. DT has no respect for anything, except for the length of an episode(the 30mns format - but that's just the rule for any tv show out there, 30 mns, commercials included, or an hour, but cartoons are always using the first format).And this is really the only thing DT obeys. For the rest... Anything's game (which means laughing material) for this show. They'll stop at nothing on the road to destroying all taboos! And that's how this satiric animated show found itself a place in a rather crowded category (by quality even more than by quantity), where The Simpsons, South Park and Family Guy reign. But DT pushes the limit even further, nesting in that dirty area where even the other three won't go.The only limit to that strategy is that DT is burning the candle by the two ends, and hadn't the show been cancelled at the end of the third season, they'd probably have run out of taboos to break, anyway, after 4 to 5 years.But let's salute the effort and appreciate the freedom of speech of the show, even if half of this liberty's wasted on filthy, disgusting, low-level jokes. The other half is just worth the buy!", "overall": 5.0, "summary": "DT at its finest", "unixReviewTime": 1194134400, "reviewTime": "11 4, 2007"}
{"reviewerID": "A25G7I1L842JX", "asin": "B000GIOPK2", "reviewerName": "Robin Lrbck \"Roblor\"", "helpful": [2, 2], "reviewText": "Just like the last season, this one gives you hours of laughter and tears.Uncensored and brutal, the Drawn Together gang will once again in the most twisted way show you how hard life on a reality show can be.With more episodes, more racist humor and even more stoned producers, this season will without a doubt be even more entertaining than the first one.If you liked the first season this is a must! If you didn't like the first season, well then go back to watching The Simpsons and miss out on this fantastic DVD.All my five are belong to this!", "overall": 5.0, "summary": "As good as it gets.", "unixReviewTime": 1217289600, "reviewTime": "07 29, 2008"}
{"reviewerID": "A25TRME1TXF4ZE", "asin": "B000GIOPK2", "reviewerName": "Roger R. Paradis", "helpful": [0, 1], "reviewText": "If you like politically incorrect humor and no holds barred slights then this is the toon for you.They went a little too gay this season but not totally outside of the realm for the characters.", "overall": 4.0, "summary": "My type of humor", "unixReviewTime": 1354752000, "reviewTime": "12 6, 2012"}
{"reviewerID": "A30EVNW3J601PN", "asin": "B000GIOPK2", "reviewerName": "Shadow", "helpful": [0, 0], "reviewText": "If you love the vulgar humor and cliches then buy all the seasons sucks they took them off air guess suits couldnt handle it.", "overall": 5.0, "summary": "Said it before", "unixReviewTime": 1358121600, "reviewTime": "01 14, 2013"}
{"reviewerID": "A3AV53EIA4EO41", "asin": "B000GIOPK2", "reviewerName": "Timothy Branik \"PKTACES\"", "helpful": [1, 4], "reviewText": "Hi, I am not usually embarrassed by adult humor, but this \"Uncensored\" version goes too far, I mean I did not need to see nude cartoons to enjoy this movie - on the contrary that ruined it for me and there was no \"clean\" version on the disk so i was stuck watching or trying to get through this filth.  I'm sure alot of you out there will like it, but as for me. I'll pass for now.  and i'll be selling mine here now.", "overall": 2.0, "summary": "MAYBE IT'S NOT JUST FOR ME", "unixReviewTime": 1259107200, "reviewTime": "11 25, 2009"}
{"reviewerID": "A05132041L0G3P5ASPHR0", "asin": "B000GIOPK2", "reviewerName": "travis pressley", "helpful": [0, 0], "reviewText": "Perfect. Prompt service. Painless. Product was exactly as described, given as a gift and receipient was thoroughly pleased. Thank you", "overall": 5.0, "summary": "Review", "unixReviewTime": 1353110400, "reviewTime": "11 17, 2012"}
{"reviewerID": "A3DIMK33JFV9ER", "asin": "B000GIOPK2", "reviewerName": "Travis W. Oliver", "helpful": [1, 1], "reviewText": "Drawn together is great. I love the jokes, the puns, the straight up silliness. The only thing is I think it's missing a scene in one episode on the DVD. Other than that it's great.", "overall": 4.0, "summary": "Drawn Together - Nice second season, but...", "unixReviewTime": 1216857600, "reviewTime": "07 24, 2008"}
{"reviewerID": "A28UGF8IFWKK8B", "asin": "B000GIOPK2", "reviewerName": "Truthiness", "helpful": [0, 1], "reviewText": "The funniest show on the planet!  The most creative, offensive show ever.  If you want your sides to hurt from laughing, get this DVD now!\"Foxy vs. The Board of Education\" is a classic!  \"I's got to get my mystery science license!\"", "overall": 5.0, "summary": "Oh God, I'm In Heaven!!!", "unixReviewTime": 1191110400, "reviewTime": "09 30, 2007"}
{"reviewerID": "A301CDXWK3GBBQ", "asin": "B000GIOPK2", "reviewerName": "William Slocumb", "helpful": [3, 6], "reviewText": "If you enjoyed the first season of Drawn Together, you'll certainly want to add the second season to your video library.My favorite episode is \"Super Nanny\", when Ling Ling is trying to get his drivers license.  That is FUNNY stuff!!If you weren't a fan of the first season, you won't like the second season (and why are you even reading these reviews?!).I personally can't wait to pick up my copy, and I'm looking forward to season three.", "overall": 5.0, "summary": "The only way to make it funnier would be to add George Bush to the cast!", "unixReviewTime": 1190332800, "reviewTime": "09 21, 2007"}
{"reviewerID": "A1ZAVMB4XZL8KA", "asin": "B000GIPKWY", "reviewerName": "Bookreader79424 \"I love Casa Ole!\"", "helpful": [12, 13], "reviewText": "I can't say enough great things about this wonderful tv-series! It makes the Bible and biblical events come to life. While I don't know how many of the \"mysteries\" are \"mysteries\" because to me as a Methodist Christian it appears that God has clearly stated what He means in the Bible by most of these \"mysteries,\" but other topics that are explored that God seems to be silent about in the Bible are fascinating to learn about via the professors and archaelogists that are in this dynamic series on the Bible. Do I agree with everything the scholars say about the Bible and some of the mysteries that are explored in this great series? Definitely no! However, if you love the Bible as much as I do as well as have an interest in knowledge; especially, biblical questions and mysteries, then this series is definitely worth buying! I haven't bought this dvd collection, yet, but I have rented the dvds and seen the tv series when it used to air on tv and it's a great DVD collection to add to your already pre-existing dvd collection! The price is affordable and well worth it! For the knowledge alone, I'm surprised that it doesn't cost well over $100 for this entire series! A & E should create new episodes of \"Mysteries of the Bible\" because no other documentary series about the Bible seems to be as good as this one.", "overall": 5.0, "summary": "Best documentary series on the Bible...EVER!", "unixReviewTime": 1289088000, "reviewTime": "11 7, 2010"}
{"reviewerID": "A223A5BICW5T32", "asin": "B000GIPKWY", "reviewerName": "bookworm \"Courage is not simply one of the vi...", "helpful": [20, 23], "reviewText": "I love the series. It's early episodes were not nearly as good as later ones. I avidly tivo'd the series until I discovered it was on DVD. Great narration, excellent diverse commentaries, powerful quotes from the Torah or Bible (as applicable). It's an awesome giftset for anyone who wants to learn more about Judaism or Christianity.", "overall": 4.0, "summary": "Great, informative series on the Torah and Bible", "unixReviewTime": 1196121600, "reviewTime": "11 27, 2007"}
{"reviewerID": "A3I8OURC83NM6V", "asin": "B000GIPKWY", "reviewerName": "Christopher M. Fulton \"Purveyor of Truth\"", "helpful": [4, 7], "reviewText": "I always enjoyed watching this when it aired on TV.  It gives fresh perspective on the Bible stories we all loved and wanted to know more about.  They go as in depth as you could expect for an hour long show.  Well worth the purchase price.", "overall": 5.0, "summary": "Good series", "unixReviewTime": 1214352000, "reviewTime": "06 25, 2008"}
{"reviewerID": "A284NRFS8VDI3X", "asin": "B000GIPKWY", "reviewerName": "David A. Stathopulo \"Cadfael22\"", "helpful": [20, 30], "reviewText": "I want to limit my comments to a review of Vol. 3 - King David: Poet Warrior. Since the middle of the 19th century skeptics have attacked the historical veracity of the Bible (both the Hebrew & Christian Scriptures). Since that time one new-found archaeological discovery after another has negated each of these objections (from the existence of the Hittites to King David to the use of nails in Roman crucifixion to affix people to crosses). Not content with the biblical accounts of these now historical figures this video series seeks to deconstruct them by projecting on them present-day academic political and philosophical \"theories behind the legendary figures and fabled stories of the Bible.\" If this one part of series utilizes this approach it is likely it is shared with the rest of the series. \"Twenty-two full-length programs from the acclaimed A&E series MYSTERIES OF THE BIBLE are featured in this collection providing a wealth of astonishing discoveries and unforgettable revelations.\" Unfortunately, the only \"unforgettable\" aspect of this series is that it is long on theory and short on facts.", "overall": 1.0, "summary": "Astonishing Theories", "unixReviewTime": 1208822400, "reviewTime": "04 22, 2008"}
{"reviewerID": "A13PPQ2GI1IJYM", "asin": "B000GIPKWY", "reviewerName": "DESERTMAN40", "helpful": [0, 0], "reviewText": "Mysteries of the Bible is an hour-long documentary series that was broadcast by A&E.Each; episode explored the authenticity and the accuracy of the greatest tales of the scriptures that has been bothering humanity for thousands of years.It was hosted by Richard Kelly,who acted as narrator and the late actress,Jean Simmons,who read the Biblical quotes which provides the scriptural basis on the topic being discussed.Many experts,scientists and Biblical scholars have participated and provided their input about the scriptures and their revelations will definitely astonish the viewers.Added to that,it was filmed on the exact locations where the supposed events happened where archaeological facts,evidences and surprisingly religious art were gathered.This is a joy to watch especially for viewers who want to learn more about the Sacred Scriptures.It is interesting,visually attractive and highly addictive.What's more is the fact that one will not only be enriched with knowledge not only about Christianity and Judaism but also surprisingly Islam.This will definitely make someone appreciate one's faith and religious beliefs.", "overall": 5.0, "summary": "The Documentary Series Explores Authenticity And Accuracy Of The Scriptures", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
{"reviewerID": "A38AAPXSJN4C5G", "asin": "B000GIPKWY", "reviewerName": "Edward J. Barton", "helpful": [3, 3], "reviewText": "This set is great for the casual learner.  The set is getting dated - going back to the mid-90's, but not much has changed dramatically in the field of Biblical Archeology - which is largely the premise.  The narration by Richard Kiley and Jean Simmons is pretty good, though cal lull you to sleep with the dulet tones.  The content is good as well, with interview of scholars, archaeologists, religious, and others who interweave the various components together to explore some of the Bible's unanswered and unanswerable questions. The integration of Jewish and Christian thought is well done, and I believe that either Christian or Jew will find this set entertaining and enlightening.  If you are a heavy duty Bible scholar, this is pretty light weight.  For the bulk of us, though, you will learn a lot, it will pique your interest, and you can feel comfortable that there isn't a great religious agenda behind the shows.", "overall": 4.0, "summary": "A Good Set For The Casual Learner", "unixReviewTime": 1310256000, "reviewTime": "07 10, 2011"}
{"reviewerID": "A3D8ZJ5Y8Z2GEG", "asin": "B000GIPKWY", "reviewerName": "G. Hill", "helpful": [21, 23], "reviewText": "I own the boxed set of this collection. Even though I was an avid fan of the show, I still re-watch the DVD episodes with rapt attention.  Unlike many religious themed films, this series does not promote a specific point of view. Viewers of all faiths and denominations will find that it deepens and enriches their understanding and appreciation for the spiritual lessons of the Bible. Each episode is well-rounded, beautifully photographed and a complete delight to watch.The Mysteries of the Bible series weaves questions about the Biblical figures, culture and spiritual meaning into a visual and intellectual feast. It combines actual footage of locations in the Bible with amazing religious art, captivating narration and answers from archeology and a spectrum of Biblical scholars. It's a formula that mesmerized fans for years. Who would have thought that a show like this would so captivate the non-scholars among us?This series succeeded for so long because it recognized that readers of the world's most popular book want to know and understand more about the culture, context and deeper meanings of the Bible. You won't regret purchasing any of the episodes or DVD's. This series represents the best of the best.", "overall": 5.0, "summary": "Mesmerizing and Addicting", "unixReviewTime": 1208908800, "reviewTime": "04 23, 2008"}
{"reviewerID": "AFM9DJYPNM7VT", "asin": "B000GIPKWY", "reviewerName": "Goldencat \"Carla\"", "helpful": [1, 4], "reviewText": "This set was a disappointment. I have the other set and it has better coverage of the topics in the episodes. This one was, for me, boring, shallow, and a waste of money. I learned nothing. Some episodes I could not even play through because the information was wrong, incomplete, or just insulting to my intelligence.If you want to study the Bible, listen to pastor Melissa Scott (great linguist and scholar), rabbi Daniel Lapin (relevant and understandable) or Chuck Swindoll (very experienced, patient teacher). Get a few actual holy land documentaries.What's on the discs? Lessee:disc 1 - Jesus holy child. Execution of Jesusdisc 2 -Abraham: one man one god. Herod the Great. 10 Commandmentsdisc 3 - Jacob's ladder. Joseph, master of dreams. Cain and Abel. Queen Estherdisc 4 - King Solomon. King David, poet warrior. the Last Revolt. Archenemy, the philistinesdisc 5 - lost years of Jesus. the last supper. Paul the apostledisc 6 -magic and miracles. Prophets, soul catchersdisc 7 - the bible's greatest secrets. biblical angels. heaven and hell. apocalypseSpend your money at Mcdonald's instead.", "overall": 2.0, "summary": "blah - other set much better", "unixReviewTime": 1351814400, "reviewTime": "11 2, 2012"}
{"reviewerID": "A10KA69V7ITA5S", "asin": "B000GIPKWY", "reviewerName": "Jimmy D. Lockhart", "helpful": [3, 6], "reviewText": "Excellent product. I would recommend it for all who study the Bible, as Paul says the mysteries are no more and Jesus says you can tell my disciple for they continue in my word.", "overall": 5.0, "summary": "Mysteries", "unixReviewTime": 1231200000, "reviewTime": "01 6, 2009"}
{"reviewerID": "A3RFDAOM1TBQ15", "asin": "B000GIPKWY", "reviewerName": "Jim osprey", "helpful": [1, 6], "reviewText": "I found this series to be very informative, well produced and thought-provoking. Enjoy it very much.", "overall": 5.0, "summary": "Mysteries of the Bible", "unixReviewTime": 1217462400, "reviewTime": "07 31, 2008"}
{"reviewerID": "A333G9I2SYHC0Y", "asin": "B000GIPKWY", "reviewerName": "John R.", "helpful": [6, 6], "reviewText": "This is a \"Best Of\" set.  Would like to see a volume 2 with eps like Job, Noah's Ark, Sodom and Gomorrah, etc.  Overall a good collection.", "overall": 5.0, "summary": "The Best Of", "unixReviewTime": 1292025600, "reviewTime": "12 11, 2010"}
{"reviewerID": "ALNQS7RJIYG6", "asin": "B000GIPKWY", "reviewerName": "Keys to the Abyss", "helpful": [14, 23], "reviewText": "While several of the videos were fairly well done, overall the \"mysteries of the Bible\" always seemed to be...did it ever really happen? or did it really happen the way the Bible says? To me it seemed to have an overall aura of attempting to discredit what the Bible says, not trying to find evidence to support it.In particular, \"the lost years of Jesus\" went over the top suggesting Jesus became a student of Buddha and His ministry was influenced by Buddhist philosophy. A few other videos were entertaining, but no new information was given, and I really learned nothing that I didn't already know from the Bible or other historical sources.", "overall": 2.0, "summary": "Secular, skeptical, and at times blasphemous; poor overall", "unixReviewTime": 1221782400, "reviewTime": "09 19, 2008"}
{"reviewerID": "A3410YP65KJQ3M", "asin": "B000GIPKWY", "reviewerName": "Mark \"mdippy\"", "helpful": [1, 1], "reviewText": "This is the seven disc series offered by A&E; and still does not cover all the episodes put out by this series. I guess the remaining ones are on volume 2? Okay, so the 22 episodes offered here are all interesting and informative. What I liked best about the series is that they are going on the premise that everything in the Bible is to be looked at as fact. However, the series does offer the opinions of scholars that sometimes suggest otherwise and they pose some interesting facts and questions that do not always line up with archeological finds. When asked for their opinions, scholars will offer beliefs that do not always line up with most dogmatic ways of thinking, In other words, I understood this series to be unbiased and presented the facts fairly and allowed different opinions to be heard. Many of them which surprisingly do support many held beliefs we have all been taught.When I first bought this series a few years ago, I watched it but really couldn't appreciate it. Now that I am actively involved in religious education, I see this series in a whole different light. It has the basic information for beginners, but also has many surprising facts that I still didn't know after many years of hard religious studies. I certainly recommend this set as a supplement to anyone's religious pursuits and it makes a great starting point for discussions as well. Well put together and well presented. Thanks for doing such a great job!", "overall": 5.0, "summary": "It's a Great Reference and Review", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A153NZD2WZN5S3", "asin": "B000GIPKWY", "reviewerName": "Michael Kerjman", "helpful": [8, 9], "reviewText": "This visually-attractive work consists of a range of forty five minute instalments accomplishing themselves separate segments to easy navigate through a huge volume of factual information to date supporting stories Torah/Old Testament/Koran present since the dawn of the human history recorded.No religious pressure at all but clever professional scientific information.Highly recommended, much new data has been disclosed to a reviewer.", "overall": 5.0, "summary": "Interesting Educative Work", "unixReviewTime": 1273017600, "reviewTime": "05 5, 2010"}
{"reviewerID": "A143UP2GFU795Z", "asin": "B000GIPKWY", "reviewerName": "Monica Migliassi", "helpful": [0, 0], "reviewText": "Awful!!!  The box and CD containers, in very good conditions.The subject, no doubt, very interesting.  The color, beautiful. The quality of the video is so bad that has taken me forever to decipher the content. The images and the sound disappear constantly so it is impossible to follow the storyline.  I have tried up to volume 5 in 3 different DVD players in the hope that the problem could be a faulty DVD player but unfortunately are the CDs.  How can I return them?", "overall": 1.0, "summary": "Mysteries of the Bible Collection, A&E", "unixReviewTime": 1392595200, "reviewTime": "02 17, 2014"}
{"reviewerID": "A1OBAJ2VJCAV0B", "asin": "B000GIPKWY", "reviewerName": "Robert E. Hadik \"Retiree\"", "helpful": [0, 12], "reviewText": "Cannot evaluate but must do so to dispose of reminders to do so. makes it difficult.", "overall": 4.0, "summary": "Wife ordered this cannot evaluate fairly", "unixReviewTime": 1264982400, "reviewTime": "02 1, 2010"}
{"reviewerID": "A1UUMBYR6F3VHA", "asin": "B000GIPKWY", "reviewerName": "Robert L. Brickey \"BrickMan\"", "helpful": [4, 4], "reviewText": "This was a great purchase.  I am thinking of buying sets to give as gifts.  The package arrived on time in excellent condition (Still cellophane wrapped.)  The series itself is informative enough without feeling like a lesson.  Jean Simmons voice is captivating -especially now that she is no longer with us.  The art works are unbelievably beautiful and fit the narrative perfectly.  I am no Bible scholar and cannot speak to the veracity of the content; all I can say is that I enjoyed this set even more than when I first saw it on television.", "overall": 5.0, "summary": "Mysteries of the Bible DVD Collection", "unixReviewTime": 1270944000, "reviewTime": "04 11, 2010"}
{"reviewerID": "A2QIYVBS2S0UAQ", "asin": "B000GIPKWY", "reviewerName": "Tamer Elsharouni", "helpful": [3, 11], "reviewText": "I was disappointed with this series which seems to be based on the 19th Century myth of German scholars who criticized and attacked Biblical and historical facts ( the higher and lower Criticism Theory ).They hadn't had any archaeological evidence at that time as opposed to present day check British Museum for example.I don't recommend this to anyone who is looking for truth and accuracy. Just a new misleading Series!!!!", "overall": 1.0, "summary": "Not scientific or based on real Facts!!", "unixReviewTime": 1271808000, "reviewTime": "04 21, 2010"}
{"reviewerID": "A2P7ED0A9AVCDU", "asin": "B000GIPKWY", "reviewerName": "Thena Lene", "helpful": [1, 7], "reviewText": "This set didn't impress me at all. It quoted the Bible incorrectly each time it quoted the Bible. The people didn't really know what they were trying to disprove and it only makes for proving the Bible.", "overall": 3.0, "summary": "It's okay.", "unixReviewTime": 1282608000, "reviewTime": "08 24, 2010"}
{"reviewerID": "A10VPZUGZAO0GG", "asin": "B000GIPKWY", "reviewerName": "Wildflower", "helpful": [4, 21], "reviewText": "I've often said, religion kills.  With all my heart, body and soul; I believe and worship God.  But religion? It's just like politics.  iT'S A GAME OF UPMANSHIP. Its  doctrines and dogma are man made as a way to control and subjugate people. Just like country, state and city laws.  Yes, some of these laws or doctrines or dogmas in my opinion are no more than means to rein in and/or subjugate people. Thus a reason to kill.In total frankness, I am a practising Catholic.  Born, raised and educated in all levels its schoolings; -from grammar school through college. I consider myself spiritual rather the religious.  I do not follow a priest or a preacher or churches or a religion as others do; -no disrespect intended here. Rather I prefer being a Catholic because of its universality.  Meaning to say, where ever in the world I go, all the sacraments and sacramental celebrations are the same. This is not to include such things as the inquisitions and church abuses. I know this invites criticism.  I am not open to debate.  Again simply put; I am spiritual and I do believe in the love, forgiveness and holiness of my supreme being God my creator. Only to Him I humble myself.", "overall": 5.0, "summary": "Ay. yay, yay! ...A history lesson in religion; ...of all types", "unixReviewTime": 1270252800, "reviewTime": "04 3, 2010"}
{"reviewerID": "A3E3ELTAMZ32K3", "asin": "B000GIPKWY", "reviewerName": "Wings_of_Wind", "helpful": [0, 1], "reviewText": "It was not the series I thought I was ordering, but it is still good.  Very educational.  I would recommend this set to a church bible study group or teen group.", "overall": 4.0, "summary": "Very informative", "unixReviewTime": 1383782400, "reviewTime": "11 7, 2013"}
{"reviewerID": "A21YD7FBMV01HP", "asin": "B000GJUQ7M", "reviewerName": "C. Brown \"jbrown\"", "helpful": [5, 11], "reviewText": "This was my first download of this type and also my last.  I did get it to play with my desktop where I downloaded it but moving it to any other machine has been a nightmare.  There are too many software restrictions and even a legal attempt to buy a new licence is fruitless.  The machines keep freezing up.  The idea is nice but the technology isn't there yet.", "overall": 1.0, "summary": "Poor support", "unixReviewTime": 1164931200, "reviewTime": "12 1, 2006"}
{"reviewerID": "A1LMX2N66EYKB4", "asin": "B000GJUQ7M", "reviewerName": "Mark K. Riordan \"ptownmarc\"", "helpful": [5, 5], "reviewText": "Nice little video for my Zen during my long wait at the doctor's office.  Confucius overcame many difficulties.", "overall": 5.0, "summary": "Informative.", "unixReviewTime": 1170374400, "reviewTime": "02 2, 2007"}
{"reviewerID": "AGPOJFLTYSMFW", "asin": "B000GJUQ7M", "reviewerName": "RMP", "helpful": [1, 2], "reviewText": "This was my first download and it was \"free\".  The download performed well.  \"The Mystery of Edgar Allan Poe\" was informative.  It ran up to 50 minutes. This was a Unbox Video Download. It started with the typical intro and ended with the credits. Some individuals did not get a complete download so i included my experience with the Unbox download.  i hope the review was helpful. ty.", "overall": 5.0, "summary": "Informative", "unixReviewTime": 1169251200, "reviewTime": "01 20, 2007"}
{"reviewerID": "A35O4YSNIEHCR", "asin": "B000GK0NBK", "reviewerName": "C. Swenson", "helpful": [2, 9], "reviewText": "A great \"Highlight Reel\" of the Apollo 11 mission.  Enough background information is presented to provide context, and the interviews and actual footage are very effective in recreating the feel of watching the mission unfold.  If you're looking for a memory refresher or an introdution to the mission to the moon for younger viewers, this show fills the bill.", "overall": 5.0, "summary": "Great Job for 45 Minutes", "unixReviewTime": 1157932800, "reviewTime": "09 11, 2006"}
{"reviewerID": "A1ALC8JP5D7C3C", "asin": "B000GK0NBK", "reviewerName": "Joseph L. Campbell \"mrjoecampbell\"", "helpful": [4, 7], "reviewText": "This show is NOT 47 minutes long. It's just a segment from a longer show, maybe 11 minutes or so.", "overall": 2.0, "summary": "Where's the rest of it?", "unixReviewTime": 1173139200, "reviewTime": "03 6, 2007"}
{"reviewerID": "A1UU0WHNOXGGXB", "asin": "B000GK51HG", "reviewerName": "IDigAK", "helpful": [0, 0], "reviewText": "Very educational. It starts out with the wright brothers and gives an in depth very detailed history of the Air Force up to current date. The best movie of its kind that I have ever seen.", "overall": 5.0, "summary": "Great educational movie", "unixReviewTime": 1200528000, "reviewTime": "01 17, 2008"}
{"reviewerID": "AVZ30RTKJHKKT", "asin": "B000GK6NFK", "reviewerName": "Amazon Customer \"catch5\"", "helpful": [3, 7], "reviewText": "I love south of nowhere...however my dvd sets season 1 and 2 will not play on my tv.  i can get them to the menu where i can play all or select an episode but it will not go past the main screen.  i can't even get a single episode to play!", "overall": 1.0, "summary": "CONSUMER WARNING---PRODUCT NOT WORKING", "unixReviewTime": 1229817600, "reviewTime": "12 21, 2008"}
{"reviewerID": "AP7JOAYYKOGVW", "asin": "B000GK6NFK", "reviewerName": "Amazon Customer", "helpful": [53, 57], "reviewText": "This series is simply the story of two best friends that fall in love with each other.Spencer Carlin, a genuinely sweet 16 year old girl, moves from Ohio to LA with her family and finds herself trying to deal with her instant interest in Ashley Davies (A rebellious, rich daughter of a rock star)The two embark on a realistic journey together that rivals any other love story on film or television. You will find yourself rooting for the pair in every episode leading up to the finale.Innocent touches, shy glances, head tilts, and flirting, make Season 1 the best of the series.Oh yeah. There's the token bitchy cheerleader, Madison, to stir up some drama for the should-be/might-be/could-be couple. The adopted black brother to teach us about racial identity. An overbearing mother. A shirtless boy to keep the straight audience happy. And a father any teenage girl would be envious to have.But when all is said and done, this show is entirely about Spencer and Ashley.It is too good to be cancelled before it's time. Watch Season 3B on October 10th at 9pm and Save Spashley!", "overall": 5.0, "summary": "A love story", "unixReviewTime": 1221868800, "reviewTime": "09 20, 2008"}
{"reviewerID": "A21G21TFGZNBUR", "asin": "B000GK6NFK", "reviewerName": "Angelica Rodriguez Moreno", "helpful": [0, 0], "reviewText": "It's really good, I totally recommend it for everybody who likes drama and teenage conflicts. I absolutely love it! :)", "overall": 5.0, "summary": "Great  TV Show!", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"}
{"reviewerID": "ARNNW9J2DG005", "asin": "B000GK6NFK", "reviewerName": "Bobbi Jo Kranz \"bobbi\"", "helpful": [0, 0], "reviewText": "I had missed so much of this series. Glad I bought it. its nice to catch up on.", "overall": 5.0, "summary": "cool", "unixReviewTime": 1244851200, "reviewTime": "06 13, 2009"}
{"reviewerID": "A22U1ZY8IMNS7C", "asin": "B000GK6NFK", "reviewerName": "Caroline G. Foster", "helpful": [3, 3], "reviewText": "Great show, I've always loved it since it came out. The only thing I pay attention to though is the relationship between Spencer and Ashley.", "overall": 5.0, "summary": "South of Nowhere", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "A21Q8TYJO50OCU", "asin": "B000GK6NFK", "reviewerName": "Charmaine B. Donato", "helpful": [0, 1], "reviewText": "Great series... loved watching the trials of these youngsters trying to come to terms with who they are in the world.", "overall": 5.0, "summary": "South of Nowhere season 1", "unixReviewTime": 1365465600, "reviewTime": "04 9, 2013"}
{"reviewerID": "A1BWNF5GHHI9SI", "asin": "B000GK6NFK", "reviewerName": "chipper", "helpful": [1, 5], "reviewText": "I have always been very happy with purchases from Amazon, but this is an exception.  Amazon has burned this episodes onto dvd and did not include in the product information that there would be actual edits from the original show(which I know because I taped the show when it was on the N network).  There are changes in dialogue and content.  This is very upsetting given the price, but most important is amazon's not being completely forth coming in it's product description.  Otherwise, amazon has always been a great place to shop", "overall": 1.0, "summary": "Falsifying product description", "unixReviewTime": 1311984000, "reviewTime": "07 30, 2011"}
{"reviewerID": "AHPQ16I8JWH6L", "asin": "B000GK6NFK", "reviewerName": "Curiosity Cat", "helpful": [2, 3], "reviewText": "I first saw this show online, and was completely hooked on it. I think it's a fantastic show and wish there had been shows like this when I was younger.However, the reason for my 3 star rating is not because of the show itself, but because of the quality of the video. It really looks like it was just downloaded from one of the sites that it streams from. The picture is fuzzy and the audio is kind of flat. People who have reviewed the DVD version have had similar complaints.I wanted to get this show so that I could show it to someone else, but I'm not sure I'd buy any other seasons of it, instead I'll just watch it online. Logo still has it online.", "overall": 3.0, "summary": "Love the show, not the picture quality", "unixReviewTime": 1344816000, "reviewTime": "08 13, 2012"}
{"reviewerID": "AXYESYR1GNGM0", "asin": "B000GK6NFK", "reviewerName": "DavisJes", "helpful": [2, 3], "reviewText": "It is good for people who are coming out and also for people who know who they are. Watching this reminded me of what it was like discovering who I was.", "overall": 5.0, "summary": "Completely hooked.", "unixReviewTime": 1251244800, "reviewTime": "08 26, 2009"}
{"reviewerID": "AWRQ9YBI64ZJB", "asin": "B000GK6NFK", "reviewerName": "Deborah", "helpful": [1, 1], "reviewText": "I absolutely love this show and was quite suprised with how good the quality of the dvd was because I had only ever watched the show on the internet. The dvd was shipped and received very quickly and plays perfectly. I would most definately from this user again and I cannot wait to purchase the second season of South of Nowhere because this is a truly excellent show with an amazing message to it's viewers, I highly recommend it.", "overall": 5.0, "summary": "S.O.N. Season 1 EXCELLENT", "unixReviewTime": 1343952000, "reviewTime": "08 3, 2012"}
{"reviewerID": "A2JP8K38NLHBQJ", "asin": "B000GK6NFK", "reviewerName": "dream.laugh.live", "helpful": [2, 3], "reviewText": "I wanted to do this review because when I bought it on amazon, it freeked me out that someone did a review and said that they were not able to watch any of the episodes. I want to secure everybody that wants to buy it by saying that on dvd, blu-ray and on a computer, everything is working perfectly, I tried it. Moreover, some wanted to know if there were any extras in the dvds such has interviews, deleted scenes or bloopers and there is none (sorry), only the episodes. However, now, for the appreciation part of the serie, I would definetly recommend South of Nowhere to teenagers who like romantic/drama series. Even though your not gay, you can fully appreciate this tv show for its originality, its funny parts and its themes such has love, teenage \"problems\" (first time, moving in a new city, fitting in, the need to belong somewere, ennemies, etc.). And for the girls that are gay, well, you will appreciate this story because of all the reasons above and because it shows, trough Spencer's story, all the steps that someone goes trough when they gradually find out their true sexuality and how they live their first real love. Furthermore, I have to say this, Ashley (Mandy Musgrave)and Spencer (Gabrielle Christian)are really gorgeous and they form a beautiful couple. S.O.N. is amazing!", "overall": 5.0, "summary": "Everything you want to know", "unixReviewTime": 1296691200, "reviewTime": "02 3, 2011"}
{"reviewerID": "A16UW55IAXI9LW", "asin": "B000GK6NFK", "reviewerName": "Frank Sabler", "helpful": [0, 1], "reviewText": "Bought it for daughter she loves it so that's all that matters to me . I personally never watched it", "overall": 5.0, "summary": "bought for dauhgter", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A55KA3FEBNDL", "asin": "B000GK6NFK", "reviewerName": "Gabriela \"Gaby\"", "helpful": [0, 1], "reviewText": "ive already seen the show, its really good, so i decided to buy it and i got my moneys worth. now ill have it whenever i feel like watching.", "overall": 5.0, "summary": "south of nowhere season 1", "unixReviewTime": 1245456000, "reviewTime": "06 20, 2009"}
{"reviewerID": "A3QW44Q3C856NR", "asin": "B000GK6NFK", "reviewerName": "heartofalion26", "helpful": [3, 3], "reviewText": "I was very pleased with my recent purchase of season one of south of nowhere on DVD. I had read some bad things about this set but I bought it anyway, I was a big fan of the show back then and I just wanted to be able to watch it again. I wanted to buy all 3 seasons but that would have been pretty expensive. lol I do plan to buy the other two later. But as some have already stated, the theme music is different. I didn't like it at first but after you watch it all the way through you don't mind the theme music, it's just strange to me that they changed it...? this is a great gift for anyone you may know struggling with their sexuality. it got me through some tough times with my own when it was on television and now I can sit back and watch Spencer's plight knowing what she's gone through already firsthand. The set is only 3 DVDs long it's a very short season, that's why it's so cheap compared to season 2 & 3 but I recommend it to anyone. I really wish everyone would watch the whole season I think it would change some views of a lot of closed-minded people. All three seasons of the show depict a young girl struggling to balance between making her mother, a religious woman with strong opinions, happy and letting herself be who she is finding out she is. Her father, a guidance counselor of sorts, just wants her to be happy but he's got his own problems. The story also centers on her two brothers, one adopted and looking for his birth mother, and one blood brother who is trying to be a basketball star and runs into complications along the way. Ashley and Spencer are adorable together and this is, above all, a love story for the next generation. The set itself is no fuss no muss, comes with just the box and 3 DVDs, conservatively decorated, but it's what is inside that counts, which is hours of enjoyment that will make you go \"awww!\" and have you smiling to yourself. I would give this whole series as a gift to anyone and everyone if it weren't so expensive I think everyone should watch it it's both entertaining and helpful in understanding the plight of lesbian and bisexual people. Ashley never says she's a lesbian (that I remember. at least not in this season) and sometimes she plays around with aiden but in the end we know she's not into men. Spencer is \"not into labels\" and I love her for that so we never know whether to classify either of them as \"bi\" or \"gay\" as spencer called it, but I can pretty safely say  this is a show about girls, for girls, of any orientation. It's compelling and full of sweet moments anyone could enjoy.", "overall": 5.0, "summary": "South Of Nowhere Season 1", "unixReviewTime": 1290470400, "reviewTime": "11 23, 2010"}
{"reviewerID": "A7SH32KDX7BS2", "asin": "B000GK6NFK", "reviewerName": "Isela", "helpful": [0, 0], "reviewText": "This show really got me through my younger years of teen angst, homo-becoming, and all around finding my own path to follow.All 3 discs play perfectly. No previews, skips straight to menu. Only thing I noticed is no subtitles '0.o' Only a problem if you're into 'em. All around full five stars!", "overall": 5.0, "summary": "Just as I remembered", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "A2VRO53CM5EP28", "asin": "B000GK6NFK", "reviewerName": "ItsMe", "helpful": [1, 1], "reviewText": "This is an amazing show that used to come on The N network. It's a show about a girl who meets another girl who she thinks she's falling in love with. She becomes confused about her sexuality, her family is having lots of problems, and everything is just crazy in her life. There are quite a few dark moments but they are balanced by light, happy, and funny moments. It is a great teen drama.", "overall": 5.0, "summary": "A really great show!", "unixReviewTime": 1358553600, "reviewTime": "01 19, 2013"}
{"reviewerID": "A1CU3ANLIPE538", "asin": "B000GK6NFK", "reviewerName": "Janel", "helpful": [0, 1], "reviewText": "Butttt, When i got it, it was scrached and it wont play the correct way.I will be getting a replacement and i will be happy.These discs for season one are different from the other ones. I got a replacement for the disc and that one was still scratched.... I dont know what they are doing to the cds but they were scratched for a second time!", "overall": 5.0, "summary": "Love this show", "unixReviewTime": 1367884800, "reviewTime": "05 7, 2013"}
{"reviewerID": "A3VI7N9O6K3MAF", "asin": "B000GK6NFK", "reviewerName": "Jazz", "helpful": [0, 1], "reviewText": "To buy the season 2, 1 is juicy and leaves you craving more, there love is strong regard all the struggles they go through. Eventually I will end up buying them all.", "overall": 5.0, "summary": "Can't wait!", "unixReviewTime": 1381536000, "reviewTime": "10 12, 2013"}
{"reviewerID": "A3P63XV3B7IA36", "asin": "B000GK6NFK", "reviewerName": "Jen Godbehere", "helpful": [0, 1], "reviewText": "I watched the entire series.  It was Awesome!  I am bummed that it was only 3 seasons.  I love Mandy Musgrave...", "overall": 5.0, "summary": "Loved It!", "unixReviewTime": 1381104000, "reviewTime": "10 7, 2013"}
{"reviewerID": "A28SXDX87WNBDZ", "asin": "B000GK6NFK", "reviewerName": "Jennifer L. Childers", "helpful": [0, 0], "reviewText": "I just found this series, and I am hooked!  Watched all of season 1 in 1 day, and I can't wait for Season 2!!!", "overall": 5.0, "summary": "SON", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"}
{"reviewerID": "A1XLZA0EKRUDJR", "asin": "B000GK6NFK", "reviewerName": "Jess", "helpful": [0, 1], "reviewText": "Love this show! So happy to find it online for a great price! A nice addition to my DVD collection! :)", "overall": 5.0, "summary": "wonderful series", "unixReviewTime": 1384819200, "reviewTime": "11 19, 2013"}
{"reviewerID": "A3VOYWGL8SZ6T8", "asin": "B000GK6NFK", "reviewerName": "J.J.", "helpful": [0, 1], "reviewText": "If I'd ever longed for a dramatic show to highlight the dramatic and difficult path that we all take through adolescence to find our true selves, I've found it. I love this show!", "overall": 5.0, "summary": "Fantastic!", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "A12DJ1784JEUOL", "asin": "B000GK6NFK", "reviewerName": "John D. Hartsough", "helpful": [1, 2], "reviewText": "I was so happy to see the pop-up on The~N for seasons 1-2. I only got season 1 and am very happy with the CD-R quality. Can't get enough of the Maddison/Ashley feud and the love that starts to blossom between Ashley and Spencer is priceless :-)", "overall": 4.0, "summary": "It's About Time!!", "unixReviewTime": 1227484800, "reviewTime": "11 24, 2008"}
{"reviewerID": "AV6AFHG3U0U9A", "asin": "B000GK6NFK", "reviewerName": "J. Smith \"Maven\"", "helpful": [0, 3], "reviewText": "So, I got My South Of Nowhere DVD in the mail today, i havent watched the episodes yet but i wanted to look at the main menu on the dvd and it doesnt have any type of beggining credits or anything the dvd menu just plops right up and its very plain and boring.(my brother was even in the room and said \"degrassi's menu looks way better why does this look so bad\") and im thinking mabey cause it wasnt presented under a major label, thats why it is so cheap looking,cause i think amazon.com is the ones selling this dvd..as for the quality in the episodes i dont kno yet because i havent watched any but I've heard that the Picture is really,really good! the show itse;f is very realisitic and even though degrassi is too, degrassi can be very dramatic someitmes...but this show keeps it very cut-dry and even the language used in today is portrade the same.All in all its worth buying (so isnt buying season 2 & 3 )which are being mailed to me as we speak...ahaha Just thought i would share my opinion...so go out and buy it!", "overall": 4.0, "summary": "South Of Nowhere Is Historic!", "unixReviewTime": 1242777600, "reviewTime": "05 20, 2009"}
{"reviewerID": "ABUZCXVWZLHC9", "asin": "B000GK6NFK", "reviewerName": "J. T. Sheldon", "helpful": [5, 7], "reviewText": "at first i was afraid to buy this dvd set because of some of the reviews, including the one talking about how they changed the theme song. but overall, i'm glad i bought seasons 1 and 2 of south of nowhere. while the origonal theme song by the donna's WAS better suited, and despite how much i hate to say this... i love the new theme. *waits for people to groan* the first time i heard it i was like \"ew\" but then as time went on i fell in love with it, singing along and making my mom give me weird looks :Pthere are no special feautures on either season 1 and 2, but i didn't think SoN was going to ever be released on dvd, so the fact that is IS and that all the episodes are here, well, that's good enough for me. they just better release season 3, too, or i'm gonna be pissed.P.S. - (season 2's theme is the same, \"wasted\" by L.P.)", "overall": 3.0, "summary": "this is the time to fly (DVD review)", "unixReviewTime": 1223683200, "reviewTime": "10 11, 2008"}
{"reviewerID": "A1DT8VXDWGY02B", "asin": "B000GK6NFK", "reviewerName": "Juan Sanchez", "helpful": [0, 0], "reviewText": "I loved that show since the first time I saw it. The only thing I didn't like is that they changed the opening song. Wonderful show.", "overall": 4.0, "summary": "South of Nowhere", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"}
{"reviewerID": "A3KTYXYEWMJHUH", "asin": "B000GK6NFK", "reviewerName": "Karen", "helpful": [1, 1], "reviewText": "I have been looking for this show in it's entirety. It is a very good quality,does not skip or freeze.", "overall": 5.0, "summary": "Good Quality", "unixReviewTime": 1378944000, "reviewTime": "09 12, 2013"}
{"reviewerID": "A2FVDZ9F0YPIFP", "asin": "B000GK6NFK", "reviewerName": "Katie Pittman", "helpful": [0, 1], "reviewText": "I loved it the first time I saw this season. The cast was amazing and the season was very well put together.", "overall": 5.0, "summary": "South of Nowhere Rocks", "unixReviewTime": 1384732800, "reviewTime": "11 18, 2013"}
{"reviewerID": "A1SYZI8XAFW9HD", "asin": "B000GK6NFK", "reviewerName": "Kizzy M. Davis", "helpful": [0, 2], "reviewText": "for a new series its pretty good, hell who am i kidding i loved it.", "overall": 4.0, "summary": "pretty good", "unixReviewTime": 1227571200, "reviewTime": "11 25, 2008"}
{"reviewerID": "A1H5G60239IB8D", "asin": "B000GK6NFK", "reviewerName": "klazmom", "helpful": [1, 2], "reviewText": "Not quite what I was expecting, the acting is not that great, hopefully that will improve over the next seasons. Seems to me to be a \"90210\" copycat.", "overall": 2.0, "summary": "Not what I was expecting", "unixReviewTime": 1367366400, "reviewTime": "05 1, 2013"}
{"reviewerID": "A2P6REPFF51MTE", "asin": "B000GK6NFK", "reviewerName": "Laina", "helpful": [0, 1], "reviewText": "Package arrived on time and in perfect condition. DVD's played perfectly and I would definitely buy from this seller again.", "overall": 5.0, "summary": "Laina's Review for SON S1", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "A24YV7DUO05ATU", "asin": "B000GK6NFK", "reviewerName": "laynea", "helpful": [0, 1], "reviewText": "This show is a little corny at first, but gets better and better as it goes on. It really just sucks you in.", "overall": 5.0, "summary": "Intriguing", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A24WXVWTRPC6J3", "asin": "B000GK6NFK", "reviewerName": "L. Kaufman", "helpful": [0, 0], "reviewText": "Season 1 is about moving to a new place and lots of self discovery. Great show, I highly recommend it. Very realistic unlike The L world which is mostly fantasy.", "overall": 5.0, "summary": "Loved season 1. Discovery is a wonderful thing!", "unixReviewTime": 1233273600, "reviewTime": "01 30, 2009"}
{"reviewerID": "A3OGUQOD70EMMK", "asin": "B000GK6NFK", "reviewerName": "Louise \"Lulu Tripp\"", "helpful": [1, 4], "reviewText": "Why on earth did Season Two come out/arrive before Season One? It seriously makes no sense whatsoever. I have Season Two, but I want to watch them (again) in order darnit.Heh, anyway. I love this show...", "overall": 4.0, "summary": "Can somebody please tell me...", "unixReviewTime": 1223856000, "reviewTime": "10 13, 2008"}
