{"reviewerID": "A3PMSRCL80KSA1", "asin": "0000031852", "reviewerName": "Dee", "helpful": [0, 0], "reviewText": "Tutus are cute but a little thin. Can't complain for the price though. Still a good buy. My daughter will enjoy these in dance class.", "overall": 4.0, "summary": "Not bad", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "A1SNLWGLFXD70K", "asin": "0000031852", "reviewerName": "DEVA", "helpful": [0, 0], "reviewText": "I origonally didn't get the item I ordered.  When contacting the company they got back with me quickly.  It turned out the item was out of stock.  They sent it once it came in stock.  This wasn't a problem for me since I ordered the item way in advance for my daughters birthday.  I would recommend this selling but ordered ahead of time just incase.", "overall": 4.0, "summary": "Happy with purchase even though it came a lot later than expected.", "unixReviewTime": 1392940800, "reviewTime": "02 21, 2014"}
{"reviewerID": "A1KJ4CVG87QW09", "asin": "0000031852", "reviewerName": "Donna Carter-Scott", "helpful": [0, 0], "reviewText": "Arrived very timely, cute grandbaby loves it. Only thing there was a scent on it when it came but for the price it was great!", "overall": 4.0, "summary": "Cute Tutu", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "AA9ITO6ZLZW6", "asin": "0000031852", "reviewerName": "Jazzy77", "helpful": [0, 0], "reviewText": "My little girl just loves to wear this tutu because of the stripes! She has even convinced me to let her wear it over leggings when we go out instead of exclusively for ballet. Since the tutu isn't too full it work as a skirt for everyday wear as well", "overall": 5.0, "summary": "Versatile", "unixReviewTime": 1399507200, "reviewTime": "05 8, 2014"}
{"reviewerID": "APJ5ULJ1RMZ4", "asin": "0000031852", "reviewerName": "kesha wallace", "helpful": [0, 0], "reviewText": "I bought this for my 3 yr old daughter when I took it out the pack it had a bad oder, cute but very cheap material easy to ripe.  When I tried it on her it was to big, but of course she liked it so I kept it. I dressed her up in it and she looked cute.---- NikkiFrom Baltimore", "overall": 1.0, "summary": "Would not recommend", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "A2PAVURT4NOHE1", "asin": "0000031852", "reviewerName": "Leah", "helpful": [0, 0], "reviewText": "Bought it for a ballet tutu but it is being worn around the house with leggings. Really cute, full skirt.", "overall": 5.0, "summary": "Super cute", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "A3URQ0LXLV46E9", "asin": "0000031852", "reviewerName": "shortyvee", "helpful": [0, 0], "reviewText": "My daughter and her friends love the colors and the way it fit. Last long after each wash. Will order more colors.", "overall": 4.0, "summary": "zebralisous", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"}
{"reviewerID": "A2681T699HV6H1", "asin": "0000031895", "reviewerName": "Courtney Riha", "helpful": [0, 0], "reviewText": "very cute and went great with my Halloween costume! for the price, couldn't have asked for better. Warning: if you are not a child this tutu is a very tight fit, i wear a size 0 and it was a little hard to get it over my hips", "overall": 4.0, "summary": "loved it!", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A2EPSZKEG06QZE", "asin": "0000031895", "reviewerName": "Katie R.", "helpful": [1, 1], "reviewText": "This tutu is completely see-through. I bought it for my 6 year old to wear in a parade she is walking in and she absolutely will not be able to wear it without pants on underneath, which I was not expecting.", "overall": 2.0, "summary": "Completely See-Through", "unixReviewTime": 1396224000, "reviewTime": "03 31, 2014"}
{"reviewerID": "A23K73OVXJ04EG", "asin": "0000031895", "reviewerName": "Susie Mo \"author\"", "helpful": [0, 0], "reviewText": "It was as described and fit my 6 year old grand daughter perfectly. She loves to play dress-up and this is a good addition to her wardrobe. I received the item quickly and the packaging was great.", "overall": 5.0, "summary": "Neon Blue Tutu", "unixReviewTime": 1391212800, "reviewTime": "02 1, 2014"}
{"reviewerID": "A2182SHKEJLY7N", "asin": "0000031909", "reviewerName": "Delta Pruim", "helpful": [0, 0], "reviewText": "It's a really nice tutu, but there was one problem that i need to address, the cloth it's made out of. For one, it is really easy too rip, and when you wash it, it shrinks! They could have told me that! I got ticked off, and i don't want you getting it, washing it, and not being able to wear it. Besides that, it's a really good one!", "overall": 4.0, "summary": "Nice, but one problem", "unixReviewTime": 1384041600, "reviewTime": "11 10, 2013"}
{"reviewerID": "A3506HSOL4JYKR", "asin": "0000031909", "reviewerName": "Emily Clavette", "helpful": [0, 0], "reviewText": "it tore within 24 hours:( My daughter was sad. Also, the bottom was not finished - it is just the cut fabric at the ends", "overall": 2.0, "summary": "cheaply made", "unixReviewTime": 1377388800, "reviewTime": "08 25, 2013"}
{"reviewerID": "A9A1P7C3G1V9H", "asin": "0000031909", "reviewerName": "michelle smith", "helpful": [0, 0], "reviewText": "Cheap fabric, it ripped the same day my daughter wore it", "overall": 2.0, "summary": "Two Stars", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
{"reviewerID": "A3TBJ4L4RGPIGE", "asin": "0000032034", "reviewerName": "D. Simpson", "helpful": [0, 0], "reviewText": "As described...this will work perfect for the event we are going to.  Bright color..soft tool...will purchase more items from this seller.", "overall": 5.0, "summary": "Wonderful", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
{"reviewerID": "A1NTYIH44YZ8OD", "asin": "0000032034", "reviewerName": "Jayme Agren", "helpful": [6, 7], "reviewText": "This tutu is not really yellow... more of an off gold color. I bought this for the color me rad 5K and ended up having to find another. It is very long for a tutu aswell", "overall": 1.0, "summary": "NOT FOR ME", "unixReviewTime": 1376870400, "reviewTime": "08 19, 2013"}
{"reviewerID": "A2MPIVS0KSY8O0", "asin": "0000032034", "reviewerName": "Sonja", "helpful": [11, 12], "reviewText": "Purchased and wore these tutus for the Portland to Coast relay race.  The were a one size fits all although we cut off about 12 or more inches as they were too long for our needs.  Soft and not at all scratchy.", "overall": 5.0, "summary": "Tutus", "unixReviewTime": 1378771200, "reviewTime": "09 10, 2013"}
{"reviewerID": "A107J9TV0VW5I7", "asin": "0000032050", "helpful": [0, 0], "reviewText": "I bought this for an 80's themed party.The size was accurate but it was more transparent than it appears, however nothing that ruffled boy shorts couldn't fix.Good buy !", "overall": 5.0, "summary": "Good buy!", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
{"reviewerID": "A29NXYXESRFZEI", "asin": "0000032050", "reviewerName": "Carol I Fasbender", "helpful": [1, 1], "reviewText": "I wanted something different to set us aside all the Runners/Walkers in our Cancer Pub Fundrasier.  It was the perfect choice.  We had women of all different shapes and sizes and this one worked out perfect!  It was fun because there while walking around you would look up and say hey there's some of our peeps!!  I ordered 21 but should have ordered a lot of extra because so many wanted them!!!  We shall use the ones we got for next year and order more for others!!  Thanks for being so quick to deliver and being a perfect fit!!Enjoy the Journey!Carol", "overall": 5.0, "summary": "Was a perfect fit for our Pub/Walk", "unixReviewTime": 1398124800, "reviewTime": "04 22, 2014"}
{"reviewerID": "A1L437EBT5RX9M", "asin": "0000032050", "reviewerName": "Elle", "helpful": [0, 0], "reviewText": "Well made, arrived quickly.  Was for an art installation and fit an adult beautifully.  would recommend and have no complaints.", "overall": 5.0, "summary": "very cute", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"}
{"reviewerID": "A2KR7WBO1PKHN6", "asin": "0000032050", "reviewerName": "happy in CT!", "helpful": [1, 1], "reviewText": "I work at a children's museum and got this for my own &#34;friendly witch&#34; costume. It was cute, but the shiny fabric around the waist totally unravelled after three wearings.", "overall": 3.0, "summary": "Barely survived three wearings", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "A1489AS2M43ZWR", "asin": "0000032050", "reviewerName": "kritter", "helpful": [0, 0], "reviewText": "We were looking for costumes for a specific event. These tutus were perfect. Good quality! Great color! Just as described!", "overall": 5.0, "summary": "Love these!", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "AF6P9QP6O03QE", "asin": "0000032050", "reviewerName": "mellody n stroy", "helpful": [1, 1], "reviewText": "It worked out perfectly for what I needed it for. It fit me just fine and wasn't too small for me!", "overall": 5.0, "summary": "Perfect fit", "unixReviewTime": 1383782400, "reviewTime": "11 7, 2013"}
{"reviewerID": "A37CTVN84V4XIG", "asin": "0000032050", "reviewerName": "mike dog \"mike dog\"", "helpful": [1, 1], "reviewText": "No problems at all.  Made well, shipping fast.  Cute and fairly well made for being inexpensive.  We used it as a costume", "overall": 5.0, "summary": "as expected", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"}
{"reviewerID": "A16LOQBQ22UPHL", "asin": "0000032050", "reviewerName": "MysticFire", "helpful": [0, 0], "reviewText": "This worked great for my Ninja Turtle costume this past Halloween.  I was worried it wouldn't fit (I'm a 6/8) but the elastic is perfect and it looked wonderful!  Because of the type of light and flowy tulle it doesn't wrinkle, which is an added bonus!", "overall": 5.0, "summary": "Perfect!", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A3V95EULVNA5H4", "asin": "0000032069", "reviewerName": "kristin", "helpful": [0, 0], "reviewText": "Poor quality, I guess you get what you paid for. I bought this for a 10k race I did recently. All my friends bought tutus mine was just not as high quality and it was very noticable, and broke at the end of the race. Oh well IT served its purpose for the pictures and what not. I just wont buy again. I was hoping to reuse it for a different race.", "overall": 2.0, "summary": "POOR QUALITY", "unixReviewTime": 1385942400, "reviewTime": "12 2, 2013"}
{"reviewerID": "A26A7Q6R1GMCFP", "asin": "0000032069", "reviewerName": "K. W. \"Eragon Fan\"", "helpful": [0, 0], "reviewText": "My daughter wanted to change her wardrobe and one big item she really begged for was a tutu. The look had to be just exactly what she wanted. You can imagine the search. Finding the right look, online, with just a picture and some customer reviews to go on was daunting but I took a chance on this one. It is perfection. It looks just like the picture if not even better. The length was just what she wanted (covers the bum but not too long.) The various colors make it go with so many outfits. It fluffs out very nicely but is not too poofy. It is just a very nice product.", "overall": 5.0, "summary": "Just gorgeous", "unixReviewTime": 1395187200, "reviewTime": "03 19, 2014"}
{"reviewerID": "A1ZC6T6VPBKWXD", "asin": "0000032069", "reviewerName": "Michelle M", "helpful": [0, 0], "reviewText": "Need a costume? Always wanted to wear a tutu? This is the one to buy. If you are tall, I'm 5'11&#34; this is perfect. It is longer than a traditional tutu so it covers the important bits. And who doesn't love an animal print. Too much fun!", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1402704000, "reviewTime": "06 14, 2014"}
{"reviewerID": "A2QWHC6G91IDJA", "asin": "0188477284", "reviewerName": "L. Mehyar \"Loulou\"", "helpful": [0, 0], "reviewText": "I bought 2 of these bottles for my nephews to take to school, however, i didnt like their performance. There is an air circulation thin hole on the top of the cap that causes leakage of the liquid inside the bottle when it is laying flat. The cubicles where the kids keep their lunch boxes are flat, this means the liquid will keep leaking endlessly. by the end of the day, the lunch box is wet and sticky, and the kids didnt have their juice/water. The metal body of the bottle is a little thin, it can be bumped easily if not handled very carefully. Unfortunately, These are not proper bottles for kids ages 3-5.", "overall": 2.0, "summary": "Things i didnt like", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "AIJE40D4V05C4", "asin": "0531904822", "reviewerName": "Kevin J. Riley \"plano rocket\"", "helpful": [0, 0], "reviewText": "Well worth the $$$ & quick delivery.", "overall": 5.0, "summary": "Cool. Solid", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
{"reviewerID": "A3SFMFQQHFD5IC", "asin": "059445039X", "reviewerName": "SoCal Mom.... \"Winter Transplant\"", "helpful": [0, 0], "reviewText": "This was a gift for my granddaughter.  The bag is beautiful quality, but its been a challenge to rid it of a very strong odor of tobacco and not-sure-what-else.  Tried everything, Febreeze, newspapers, etc. but it still is not odor-free.  However, I appreciate the fact that I did find her the bag, which she loves.  Sellers really need to pay attention to whether the product offered is odor-free of; if not, mention it in the ad.", "overall": 3.0, "summary": "MIXED EMOTIONS", "unixReviewTime": 1379635200, "reviewTime": "09 20, 2013"}
{"reviewerID": "A2TC4ACBCZ52J9", "asin": "060791548X", "reviewerName": "Midwestern Boy", "helpful": [3, 3], "reviewText": "Warning:  This map does not include the Laramie Peak District, i.e. that whole chunk of the Medicine Bow National Forest that is south of Douglas and north of Garrett.", "overall": 4.0, "summary": "Not the Whole Forest", "unixReviewTime": 1328054400, "reviewTime": "02 1, 2012"}
{"reviewerID": "A2Y3IA7WJ1EGK3", "asin": "060791548X", "reviewerName": "Segamlat", "helpful": [0, 0], "reviewText": "The map has no compass rose, North or declination indication--are the longitudinal lines Grid, True or Magnetic North? I know that a UTM map uses Grid North but I'm just guessing without the rose. I can't trust this map in the field. No one should trust this map. You are much better off with a free map from a gas station.", "overall": 1.0, "summary": "Guess which way is North", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "ANX56FYNHRJDX", "asin": "060791548X", "reviewerName": "Stef", "helpful": [2, 2], "reviewText": "A great map made to be used.  I love that the map is compact and waterproof.  It makes it easy to take with you and you don't have to worry about keeping it dry.  It shows the forest service roads and 4wd roads.  It also has major trailheads.", "overall": 4.0, "summary": "great map for 4WD paths and forest service roads", "unixReviewTime": 1310688000, "reviewTime": "07 15, 2011"}
{"reviewerID": "A189C6EM6YKMCM", "asin": "0607968699", "reviewerName": "Dee Ann Ratliff Smith", "helpful": [0, 0], "reviewText": "It could be made of better material.  I think it will do for what we need it for.  I would probably look harder for a map next time.", "overall": 3.0, "summary": "Workable", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "A3CG09G5XPITSH", "asin": "0615302939", "reviewerName": "Barbara A. Baltera", "helpful": [0, 0], "reviewText": "I am the parent of a 13 yr old junior golfer & \"Journey to Excellence\" is a must read for all golf parents !  If your child's goal is to play golf at a Div.1 school or to become the next Tiger or Annika, this book is a reality check on what it takes to get there.Growing up, I never even held a golf club so you can imagine how difficult it was trying to figure out what clubs to buy or how to find a teaching pro willing to teach a very young golfer.  So much information came from other parents & frankly many are misinformed.  I am so happy to have finally found this honest, step-by-step guide to help aspiring juniors reach their fullest potential.  All I can say is.. read Henry's book ! !", "overall": 5.0, "summary": "A must read for all golf parents!", "unixReviewTime": 1253232000, "reviewTime": "09 18, 2009"}
{"reviewerID": "A1M5IGRPFIBC9T", "asin": "0615302939", "reviewerName": "David J. Wurzer", "helpful": [0, 0], "reviewText": "Journey to Excellence by Henry Brunton with Michael Grange is a roadmap for an elite junior golfer. The book highlights the challenges of becoming a PGA Touring Professional. It includes a realistic overview of the junior golfer's journey. The basic core topics of fitness, swing/putt, playing, mental and life skills helps the junior golfer understand the skills necessary to become a PGA Touring Professional.Henry is a Canadian PGA Master Professional and Royal Canadian Golf Association's National Coach. He is \"walking the walk\" as he takes juniors from the Sampling Years through the PGA Touring Professional ranks. Henry is a true professional. I recommend this book to all focused and goal oriented junior golfers and their parents/guardians.David Wurzer, Ph.D.PGA Master ProfessionalTPI Certified Golf Instructor GP 3 & Junior Coach 2", "overall": 5.0, "summary": "Real World of Junior Golf", "unixReviewTime": 1253404800, "reviewTime": "09 20, 2009"}
{"reviewerID": "AECHWI5DE95QG", "asin": "0615302939", "reviewerName": "Kyle Paquette", "helpful": [3, 3], "reviewText": "Journey to Excellence is brilliant guide for all of those involved in the development of junior golfers. From coaches to parents, to the athletes themselves, JTE is a must read for anyone who is serious about embracing their potential, whether it be in golf or life. Henry Brunton's wealth of knowledge and experience are wonderully layed out in a clear and enjoyable read. JTE is a truly encompassing guide that touches on all factors required for optimal development (e.g., proper coaching/equipment, physical/mental training, nutrition). As Brunton points out, \"there are many routes to excellence...golf can be your path to excellence or a conduit that leads you places you never thought possible\" (p. 15). As a golf coach and performance consultant, I could not agree more! This book has immediately become an integral part of my work with all junior development players. In summary, this book does a great job highlighting the notion that \"there are no failures in life, only lessons\" (p. 128)... a statement we should all live by. Thanks Henry for this wonderful gift!", "overall": 5.0, "summary": "A must read for anyone who is serious about embracing their potential!", "unixReviewTime": 1260144000, "reviewTime": "12 7, 2009"}
{"reviewerID": "A1ZE5F28ONW8OP", "asin": "0615302939", "reviewerName": "Lorin Anderson", "helpful": [0, 0], "reviewText": "Twenty-five years ago when I was competing in junior golf tournaments all over the Midwest and struggling to improve I would have given anything for this book. I've worked in the golf publishing business for nearly 20 years and have never seen a step-by-step guide that explains how the best junior golfers continue to improve and reach their full potential until Journey to Excellence. It took someone of Henry Brunton's credentials to finally pull all the key information into one resource. Brunton is the Head Coach for the Canadian National Men's Team, he is the only Canadian ever named one of GOLF Magazine's Top 100 Teachers, he is the creator of the teaching curriculum used by the Canadian PGA and near Toronto he runs one of the finest regional junior programs in the world for competitive juniors. A program that has been emulated by instructors all over North America.Journey to Excellence details the intricacies of every major issue that a young competitive golfer will face while trying to become the best they can be. From equipment issues, to finding the right coach, to managing emotions to understanding how to earn a college scholarship, it's all right here in a breezy read filled with anecdotes from the game's best players who have already reached their full potential in the game.Brunton saw the need for providing honest, accurate information to the next generation of competitive golfers and spent two years working on this manuscript. It was a labor of love and it shows in the final work. I've been fortunate to know Henry for nearly 15 years and he is a major force who will lead junior golf in a positive direction for years to come. If you (or your child) enjoy competitive golf, this will be the best small investment you'll ever make on your golfing career.", "overall": 5.0, "summary": "A Well-researched Road Map for Competitive Junior Golfers", "unixReviewTime": 1252195200, "reviewTime": "09 6, 2009"}
{"reviewerID": "A2SHNU3TZB7DFI", "asin": "0615302939", "reviewerName": "Nancy Kapitanoff", "helpful": [0, 0], "reviewText": "While doing research on junior golf programs, I came across Henry Brunton's book, \"Journey to Excellence: The Young Golfer's Complete Guide to Achievement and Personal Growth.\" Brunton, a member of the Canadian PGA since 1984, is a CPGA Master Professional, Canada's National Coach since 1999, a U.S. Kids Golf Top 50 Kids Teacher and a member of the Titleist Performance Institute's Junior Advisory Board. He knows a lot about golf in general and in particular what life is like for young people with aspirations to become collegiate golfers and touring pros.For those young golfers who have fallen in love with game, who dream of being the next Tiger or Annika (and for the parents and coaches who will help them achieve their goals), \"Journey to Excellence\" is a delightfully supportive but also down-to-earth, realistic guide to becoming the best golfers they can be. Sorry kids, you don't get to skip your homework because you need to practice.\"In reality, if you let your homework pile up, not only will your school work suffer, but your golf will too, as the stress of poor grades will likely leak into your golf game. Instead, it's much wiser to take the steps necessary to balance the demands of golf and the other realities of your life so that both spheres benefit,\" Brunton writes.But Brunton is clear that the journey begins with the fun of playing golf. \"For some reason, some people--a lot of people-- have fun trying to move that white ball. There are a lot of things about it that make it fun: the company is almost always good--no one is introduced to golf by people they don't like...\" Brunton writes on Page 1. By Page 3, fun and a passion for the game meet up with the hard work and diligence that is needed if a young golfer is to have any chance of becoming one of the 5,500 golfers playing at the NCAA Division 1 level, not to mention join the less than 500 men and women currently playing on the PGA and LPGA tours combined.There are no instructional sections here, no swing tip sequences nor references to any mechanical devices that can straighten a hook or slice. There is a chapter on how to get clubs that fit properly. How to find a coach, maximizing practice sessions to fit a young golfer's age, needs and personality; principles for self management including mental and physical training and nutrition needs; and developing a plan to win are all topics covered in this handbook. The final chapter delves into the pertinent facts about college golf.As I read the book, I paused many times to consider how Brunton's advice applies to my own desires to take my golf game to a higher level. Though specifically designed to meet the needs of young golfers, \"Journey to Excellence's\" comprehensive and wise perspective could benefit golfers of any age.", "overall": 5.0, "summary": "Just What Aspiring Tigers and Annikas Need To Know", "unixReviewTime": 1253404800, "reviewTime": "09 20, 2009"}
{"reviewerID": "A2TW9DGUMYHH7", "asin": "0615302939", "reviewerName": "Paul G. Schempp", "helpful": [1, 1], "reviewText": "A masterpiece.  When I finally put down Journey to Excellence, that was my thought and my feeling--a masterpiece.  Serving as a consultant to both Golf Digest and GOLF Magazine, and numerous national golf federations around the world, I've read my share of golf books--and then some.  But I've never read a golf book like Journey to Excellence.  It is, without question, a unique, fresh and powerful contribution to the golf literature.  The accomplished author, Coach Henry Brunton, uses an engaging, interactive writing style to place in these pages the wisdom of his experience, the collective wisdom of successful players and coaches, and extensive research.  The result is a highly useable guide from start to finish on how to be a successful golfer.  While the target audience is junior golfers, this volume is serviceable reading for golfers at any level, and should be required reading for parents of aspiring golfers.  Moving beyond the traditional topics of swing technique and mental game tips, Brunton offers sound research on one's chance at reaching the top rung on golf's food chain (chap. 2), excellent suggestions on `perfect practice' (chp. 5), and preparation strategies to maximize competitive performance (chp. 8).  Journey to Excellence needs to be in the library of every serious golfer, and is must reading for every parent and player in junior golf.  Thank you Henry Brunton!", "overall": 5.0, "summary": "A Masterpiece!", "unixReviewTime": 1253232000, "reviewTime": "09 18, 2009"}
{"reviewerID": "A3UIMROYU7844N", "asin": "0615302939", "reviewerName": "press", "helpful": [0, 0], "reviewText": "Claude Dupuis (North Carolina)Journey to Excellence is a real masterpiece created by Henry Brunton with the assistance of Michael Grange.I found the book to be a must read not only for any aspiring golfer who wants to make it to the top level but also for anyone who plays the game.The book is really informative with the chances of making the grade from college level up to the top PGA Tour.The stories that from past to present about golf legends  keeps the reader entertained.The interviews with different highly qualified experts shows the dedication Henry put into making it a \"tell it like it is\" facts about making it to the top.Topics such as time management,proper diet,equipment,financial as well as many others are all covered in great detail to give the aspiring young golfer the perfect receipe for success.The message is very clear: Success is where planning and opportunity meets.I have known Henry since his first Golf assignment as \"backshop kid\" at the \"View\" in Ottawa. I have witnessed Henry's Journey to Excellence and his accomplishmentsso far, are nothing short of amazing.Henry's \"Tiger like mentality\" is what can I do to improve and the best has yet to come.Congratulation Henry! Keep up the great work.", "overall": 5.0, "summary": "Journey to Excellence is excellent !", "unixReviewTime": 1257033600, "reviewTime": "11 1, 2009"}
{"reviewerID": "A2ZSIEFL388S6D", "asin": "0615302939", "reviewerName": "Threeputt", "helpful": [0, 0], "reviewText": "After browsing thru it and reading some chapters I'd say good book! Almost a must read for those who want to improve", "overall": 5.0, "summary": "Very good book", "unixReviewTime": 1389744000, "reviewTime": "01 15, 2014"}
{"reviewerID": "AM6ZMLRK8QAO6", "asin": "0615302939", "reviewerName": "TJ Yeaton", "helpful": [0, 0], "reviewText": "Henry is the world leading expert on developing junior golfers. Journey to Excellence is a must read for any coach, parent or junior involved in competitive golf. A great source of information for everything involved in college and competitive golf. One of my favorite books!", "overall": 5.0, "summary": "A must read for ANY junior looking to play college golf", "unixReviewTime": 1280534400, "reviewTime": "07 31, 2010"}
{"reviewerID": "AAZRSTBOMMCQ1", "asin": "0615329020", "reviewerName": "Beverly Janik", "helpful": [0, 0], "reviewText": "I had this book once before, lost it on the golf course. No one claimed to find it, so I had to buy another one.  I love this book.  The club to ball distance is accurate for my golf ability.  I enjoy reviewing the types of swings getting the distance and more.  Now if accomplish what this book states, I would be a fantastic golfer.  Enjoy!", "overall": 5.0, "summary": "Golf book", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "A12050CRFY6PA4", "asin": "0615329020", "reviewerName": "JasonT", "helpful": [3, 3], "reviewText": "My wife gave me the Golf Genie pocket guide earlier this year when I started getting ready for the golf season.  I'm about a 15 handicap and though I'm pretty good, I always want to get better.  My problem is that I forget how to set up for certain shots and never have the time to go see a pro or review golf books.  This product has really helped my game. It is very well done.  What I like about it is that it has great visuals and advice for all the key shots and a great review section that helps me remember all the critical stuff I need to do to prepare for the golf season.  But its best use is out on the course. There were several times over the summer when I needed a quick tip like hitting out of a fairway bunker and upslope lies, etc. and I quickly referenced the guide and knew exactly what to do.  It definitely helped shave some strokes off my game and gave me a sense of confidence.I since gave away my Golf Genie to a friend of mine who needed some serious help and just bought another one on Amazon for next year's golf season. I'll probably get a few more for stocking stuffers.Bottom line, this is the coolest little idea and is good for all levels of golfers...highly recommended.", "overall": 5.0, "summary": "Perfect golf tips for on the course", "unixReviewTime": 1292198400, "reviewTime": "12 13, 2010"}
{"reviewerID": "A21CB2ZFJDIC91", "asin": "0615329020", "reviewerName": "John White", "helpful": [0, 0], "reviewText": "This is the fourth purchase for me of this booklet.  It is an excellent training aid covering basic to advanced golf shots.  I have played for nearly 30 years and I use this booklet before each round to refresh my thinking with my swing as well as course management.  I recommend this booklet to anyone who would like to improve their golf game.", "overall": 5.0, "summary": "EXCELLENT TRAINING AID!!", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"}
{"reviewerID": "A1GEXYHDWI2BFM", "asin": "0615329020", "reviewerName": "M. KENNEDY", "helpful": [0, 0], "reviewText": "Have used this over the years, but it was time for a new one.Received in a very timely fashion. Very pleased.", "overall": 5.0, "summary": "great item, sent one to our niece and her husband, too.", "unixReviewTime": 1355184000, "reviewTime": "12 11, 2012"}
{"reviewerID": "A1ZDUTFMDLWRCS", "asin": "0615329020", "reviewerName": "Robert Phillips", "helpful": [0, 0], "reviewText": "Guide has easy to follow instructions; it combines visual with the instruction. This is helpful in making a lasting connection on how to hit the golf shots. The guide covers a wide variety of &#34;How To&#34;  shot/swing instructions that will benefit most golfers or serve as a refresher guide.", "overall": 4.0, "summary": "Good Visual displays to support instruction test.", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "AN0YV83ZD1OY", "asin": "0615329020", "reviewerName": "Rooster", "helpful": [0, 0], "reviewText": "The only thing better would be a personal coach. I went from shooting in the 100's to the 80's. Thanks.", "overall": 4.0, "summary": "Must have, especially for the beginner!", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A3HVF3XN8W0OE5", "asin": "0615375790", "reviewerName": "Fred DuBose", "helpful": [0, 0], "reviewText": "This is the best scorebook I've ever used. It's compact yet comprehensive. It's also much easier to write on because it's thicker, and the page design seems a lot more logical.", "overall": 5.0, "summary": "Just right", "unixReviewTime": 1296691200, "reviewTime": "02 3, 2011"}
{"reviewerID": "ABO697QP4NC9P", "asin": "0615375790", "reviewerName": "leigh", "helpful": [0, 0], "reviewText": "I am thrilled with my discovery of The Serious Observer's Baseball Scorebook! Finally an intituitive record keeping book that I can instruct the youngest of children with ease the joy of baseball stats. This comprehensive guide, I hope, will also teach them about, and enhance, their own game.", "overall": 5.0, "summary": "it's about time for this book!", "unixReviewTime": 1297036800, "reviewTime": "02 7, 2011"}
{"reviewerID": "A1WVA7V02PQOY6", "asin": "0615532209", "reviewerName": "Dad of Divas", "helpful": [0, 0], "reviewText": "This is a great guide for any parent looking to work on getting their child outside. It is filled with great ideas and resources at engaging children in outdoor activities. What was great was that the book is set up for usability. You can easily take notes or jot down your experiences with the different things within the book itself. I also found that the book is set to be able to give you ideas that can work at almost any time of year. Thus, whether it is summer or winter there are a ton of activities that can easily engage you and your child in fun outdoor activities!This is the type of book that will provide hours and hours of fun for you and your child, and I for one am having a blast trying all of the things out with my own daughters and believe that you will too!*I received a copy for review - all opinions are my own*", "overall": 5.0, "summary": "A Great Book!", "unixReviewTime": 1382745600, "reviewTime": "10 26, 2013"}
{"reviewerID": "A32WP8MGRNKX0V", "asin": "0641649975", "reviewerName": "Dreamer", "helpful": [0, 0], "reviewText": "I never touched a gambling poker chip in a casino, so can't compare it to anything.  But they were good quality chips when i was learning chip tricks.", "overall": 5.0, "summary": "got these to learn chip tricks", "unixReviewTime": 1287705600, "reviewTime": "10 22, 2010"}
{"reviewerID": "AL2NZ93SK4SMS", "asin": "0641869169", "reviewerName": "Dan Johnstone \"Outdoor Geek\"", "helpful": [0, 0], "reviewText": "These cups are the greatest no leaks keeps coffee hot great", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
{"reviewerID": "A2GX6NQHA5KC51", "asin": "0641869169", "reviewerName": "Iris Anna", "helpful": [0, 0], "reviewText": "It'll keep your drink from spilling but it only keeps beverages hot for about 30-45 minutes and the clear plastic design makes this mug look extremely cheap.", "overall": 2.0, "summary": "I love it as a gift but I would never buy this again", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "A3ENR2LLNM0R1I", "asin": "0736060332", "reviewerName": "john fleming", "helpful": [0, 0], "reviewText": "A great dvd on bodybuilding showing you how to gain more mass and make your muscles grow by changing your workouts and shocking the muscles.", "overall": 5.0, "summary": "Muscle building", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"}
{"reviewerID": "ALVO51HPY14QX", "asin": "0743273575", "reviewerName": "8921", "helpful": [0, 0], "reviewText": "A good short read that has some great information on the simple basics. If you're a newbie golfer, it had some good info on setup, grip, and posture. I'm sure there are better books, but its written by one of the best.", "overall": 5.0, "summary": "Good Short Read.... Helpful Indeed", "unixReviewTime": 1353542400, "reviewTime": "11 22, 2012"}
{"reviewerID": "A207ZTX3YRSGSM", "asin": "0743273575", "reviewerName": "Another Amazon Buyer", "helpful": [0, 0], "reviewText": "They say this is the book every golfer should have and I agree. I pul lit out every spring now", "overall": 5.0, "summary": "Great golf book.", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "A2CXVERYM2BTT8", "asin": "0743273575", "reviewerName": "anson olds", "helpful": [0, 1], "reviewText": "I bought this book as a recommendation from my brother in-law who has been golfing for years. The book is very detailed and in depth, and for someone who likes to know the very innermost and essential workings of the golf swing, like I do, this book is a must have. Even if you're breaking 90, I still recommend this book.", "overall": 5.0, "summary": "Extremely Helpful!", "unixReviewTime": 1368576000, "reviewTime": "05 15, 2013"}
{"reviewerID": "A2Q1HFUVROME3W", "asin": "0743273575", "reviewerName": "A. Russell \"Drew\"", "helpful": [0, 0], "reviewText": "Hogan's book emphasizes how important the basics of golf are. A great foundation and practice makes all the difference between a high handicap vs a low handicap. My father read Hogan's books to learn how to play golf and was a 3 handicap up until he turned 50.I would advise anyone starting out to read this book and learn the basics if they want to be a good golfer.", "overall": 5.0, "summary": "Great book to learn basics of golf.", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"}
{"reviewerID": "A2G4M0W5MMBKCJ", "asin": "0743273575", "reviewerName": "Chris Cooper", "helpful": [1, 1], "reviewText": "Finally a golf book that is simple and works. Not only is Ben Hogan consider the greatest ball striker ever he also had a great knowledge of the swing and could communicate his knowledge in an understandable manor. This book is an instructional classic that is as relative today as when it was written.", "overall": 5.0, "summary": "A golf book that makes sense", "unixReviewTime": 1287014400, "reviewTime": "10 14, 2010"}
{"reviewerID": "A95CYMC1KMZLG", "asin": "0743273575", "reviewerName": "D. Roth", "helpful": [0, 0], "reviewText": "No matter who writes a golf instruction book and no matter what era that golfer represents the lessons are still about the grip, the stance, the follow through and concentration. However, Ben Hogan has made these tips more understandable for the average golfer (90-100 score). If you wish to improve your game I suggest you read Ben's book and if it doesn't help then read it again!", "overall": 5.0, "summary": "Golf Tips From The Best", "unixReviewTime": 1390003200, "reviewTime": "01 18, 2014"}
{"reviewerID": "A29ON5W12OSHL0", "asin": "0743273575", "reviewerName": "Edith V. Fox", "helpful": [0, 0], "reviewText": "We bought this book for our son-in-law for his birthday on Dec 27.  As you know, this is an old book but the foundation of a good golf swing shown  never grow old.  My husband also bought one just to have as a review as he bought it for the first time years ago.", "overall": 5.0, "summary": "Young or old", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "A2RRYW0NF9YUN5", "asin": "0743273575", "reviewerName": "Fish", "helpful": [0, 0], "reviewText": "Great reading and to the point. I hope my golf game will get better after getting some pointers from this book.", "overall": 5.0, "summary": "Ben Hogan's Five lessons", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"}
{"reviewerID": "A3T8NHZ7FW2I7J", "asin": "0743273575", "reviewerName": "Fuller Ridgebreck", "helpful": [0, 0], "reviewText": "Hogan was one of the greats and while I had heard these tips before, I enjoyed reading them right from the source.", "overall": 5.0, "summary": "classic swing instructions", "unixReviewTime": 1369699200, "reviewTime": "05 28, 2013"}
{"reviewerID": "A6KYDNP84GGGJ", "asin": "0743273575", "reviewerName": "GolferMark", "helpful": [0, 0], "reviewText": "This book is what I used to learn how to swing a club. I shoot in the low 80's. Its so good I've given them as gifts to others.", "overall": 5.0, "summary": "The golf swing Bible", "unixReviewTime": 1367625600, "reviewTime": "05 4, 2013"}
{"reviewerID": "A1TDCFAHII5IRI", "asin": "0743273575", "reviewerName": "iamphilzone", "helpful": [0, 0], "reviewText": "This book is an easy read but it is  loaded with great information. It is a must for any golfer from beginner to veteran.", "overall": 5.0, "summary": "A Must Have!", "unixReviewTime": 1374019200, "reviewTime": "07 17, 2013"}
{"reviewerID": "AEV43HQ2E3BXI", "asin": "0743273575", "reviewerName": "Jack", "helpful": [0, 0], "reviewText": "It's simple.If you read the entire book and honestly apply all of what Mr. Hogan describes you will gain a repeatable and reliable golf swing.If you only take part of what he teaches and try to apply it to your current swing then you probably won't improve a great deal.If you are new to the game please do yourself a favor and study this book. The advice is solid and each piece builds on the previous to produce a repeatable and very solid swing.If you have been playing for years yet still struggle, study this book.", "overall": 5.0, "summary": "THE golf swing instruction book", "unixReviewTime": 1317168000, "reviewTime": "09 28, 2011"}
{"reviewerID": "A49NE7FIMHLEY", "asin": "0743273575", "reviewerName": "James W. Killman", "helpful": [0, 0], "reviewText": "If Hogan's \"Power Golf\" is the Bible of the game, then this is the best New Testament version around. This is kind of a condensation of the larger book, and it covers as much as the duffer will need for a really good start at improving his game. This book alone should be good for taking several strokes off your game in a couple of weeks--with work! I recommend it for anyone who really wants to play better golf, and who doesn't want to do that?", "overall": 4.0, "summary": "Great start for improvement", "unixReviewTime": 1316131200, "reviewTime": "09 16, 2011"}
{"reviewerID": "A1EWCDPM3PWXIE", "asin": "0743273575", "reviewerName": "Jesse405", "helpful": [0, 0], "reviewText": "This is THE  golf book! Great! If you are a student of the game, you have to have a copy of this in your Golf library!", "overall": 5.0, "summary": "Hogan", "unixReviewTime": 1369267200, "reviewTime": "05 23, 2013"}
{"reviewerID": "A26E33CZG2F8Y4", "asin": "0743273575", "reviewerName": "kelly parker", "helpful": [0, 0], "reviewText": "I was listening to everyone tell me do this do that.... finally said stop, heard about the book and got it. I realized that I had forgotten the pure basics, Ben brought me back the simple step by step basics, and then applied the mechanics and I started hitting the ball straight, consistently and lowered my score by 15...Thanks Ben....", "overall": 4.0, "summary": "Got me back in my game", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "ARRYTSEWOVKDO", "asin": "0743273575", "reviewerName": "MICHAEL", "helpful": [0, 0], "reviewText": "FRIEND TOLD ME HE HAS THIS BOOK IN MULTIPLE LOCATIONS AND RERREADS IT OVER AND OVER. THE ILLUSTRATIONS ARE GREAT!", "overall": 5.0, "summary": "BEST GOLF BOOK EVER", "unixReviewTime": 1377302400, "reviewTime": "08 24, 2013"}
{"reviewerID": "AB7Q6P0NFC6YL", "asin": "0743273575", "reviewerName": "Michael Nicotera", "helpful": [1, 2], "reviewText": "I never write reviews but had to on this.  I'm a 14 handicap.  Went from 19 to 14 in the last year or so.  I had taken some lessons and decided to order this book.  It just makes sense.  For me, the grip and stance chapters hit home.  I was just taking that stuff for granted.  I have gone to the range a few times since incorporating the new grip (I used to use the overlap) and stance, and although it felt a little awkward at first, my ball striking is much, MUCH improved and the flight of the ball is better.  I would highly recommend this to anyone trying to improve their game.  It is basic, fundamental stuff, and the diagrams make it simple.  And its Ben Hogan.  Really nothing more you can say than that.", "overall": 5.0, "summary": "Well Worth It", "unixReviewTime": 1369612800, "reviewTime": "05 27, 2013"}
{"reviewerID": "ANH2QGLIJ3TBG", "asin": "0743273575", "reviewerName": "Mir", "helpful": [1, 1], "reviewText": "This book is really helpful I would highly recommend. Key points and clearly understandable. It's a great refresher book too to reference.", "overall": 5.0, "summary": "Helpful", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "A1P4NQFQ5DWUM9", "asin": "0743273575", "reviewerName": "NDBear", "helpful": [0, 0], "reviewText": "Great book a must read for any golfer of any ability.  Great basics for the beginner and a good tool for a low handicapper", "overall": 5.0, "summary": "Best golf instruction", "unixReviewTime": 1373155200, "reviewTime": "07 7, 2013"}
{"reviewerID": "A2VQUXAGEGNUX1", "asin": "0743273575", "reviewerName": "Oscar Rubenstein \"Oscar\"", "helpful": [4, 4], "reviewText": "So here is the backdrop.  I've been golfing off and on for 20 years (I am 45 now).  I LOVE the game.  Up until this year, though, I was horribly inconsistent at it.  So much so that I was often embarrassed to go out and play in club outings, tournaments, etc.  I would come home so down on myself.  I said I was going to quit so many times.This year things changed.  I was sitting at a party and this guy started boring me about this book he read and how it changed his game.  Yeah, yeah, I thought.  But then I went on to Amazon and looked it up.  $10 bucks.  I figured its got to be worth a try.Unbelievable!This book is so simple.  I have spent $100's or even $1,000's of dollars on golf lessons over the years and NONE of them came even 1/2 way to what this book has done for me (golf pros should be ashamed at themselves!  They make you do these goofy things and they don't focus on the fundamentals).  I read it three times in about a day and a half.  The third time I read it with my club by my side (to try grips, etc.).  The biggest breakthroughs for me were the grip (I had been doing it totally wrong for years) and the pattern of the on-plane arms, shoulders hips backswing to the hips, shoulders arms forward swing.  Again, unbelievable!  I hit it straighter, farther, etc. etc.  It is so much fun!  I feel like I actually know how to play the game!  And when I start to go off kilter a little bit, I go back to Hogan's fundamentals and it all comes back.  It's weird, I have been swinging wrong for so long...that doing it his way feels weird...but I'm coming to just trust it and not think about it...and I have more confidence to swing hard and just let it deliver.", "overall": 5.0, "summary": "The best $10 you've ever spent.", "unixReviewTime": 1323043200, "reviewTime": "12 5, 2011"}
{"reviewerID": "A2NLKAKJY2P1DJ", "asin": "0743273575", "reviewerName": "Philip Olmes", "helpful": [0, 0], "reviewText": "If you want a bookd on golf to correct your slice, read the first chapter on how to put your ands on the club and then practice it on your living room sofa, so you realize initially how awkward the swing feels --- but it corrects your mistakes and your hit it longer !", "overall": 5.0, "summary": "Best Book on Golf there is.  Seller sent the books as requested-- on time as ordered.", "unixReviewTime": 1379289600, "reviewTime": "09 16, 2013"}
{"reviewerID": "A318UVGFL0E9U9", "asin": "0743273575", "reviewerName": "Richard", "helpful": [0, 0], "reviewText": "Very good, makes the golf swing and game seem simple. My handicap has gone down thanks to this book and information.", "overall": 5.0, "summary": "Ben Hogan's five lessons", "unixReviewTime": 1367712000, "reviewTime": "05 5, 2013"}
{"reviewerID": "A26TBAZ6OOMWQK", "asin": "0743273575", "reviewerName": "Robert Rawie", "helpful": [0, 0], "reviewText": "Most helpful lessons I have ever read. Very enjoyable book. Driving the ball like I know what I am doing.", "overall": 5.0, "summary": "Great read.", "unixReviewTime": 1378771200, "reviewTime": "09 10, 2013"}
{"reviewerID": "AUFREYQB75XF3", "asin": "0743273575", "reviewerName": "rong", "helpful": [0, 0], "reviewText": "This book provides the reader with classic golf swing instruction.  Hogan not only describes every fundamental of his classic swing, he provides the reader with the &#34;why&#34; behind each component.", "overall": 5.0, "summary": "Classic Golf Instruction", "unixReviewTime": 1384819200, "reviewTime": "11 19, 2013"}
{"reviewerID": "A14J0NL3LU67H7", "asin": "0743273575", "reviewerName": "Ryan", "helpful": [0, 0], "reviewText": "Book changed my game - no doubt about it. Hogan details fundamentals for grip, posture and swing that I can't believe I wasn't taught earlier after 12 years of playing golf regularly and multiple lessons; would have saved me a lot of trouble to learn the proper way from day one. Definitely recommend for anyone looking to take golf seriously.", "overall": 5.0, "summary": "Don't get serious about golf without this book", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A1AU89S0PQ1TC4", "asin": "0743273575", "reviewerName": "Thomas DiGati", "helpful": [0, 0], "reviewText": "Still the best golf book I have read.  &#34;Golf is Not a Game of Perfect&#34; is a nice caveat to the mental aspects of the game.", "overall": 5.0, "summary": "Classic", "unixReviewTime": 1379030400, "reviewTime": "09 13, 2013"}
{"reviewerID": "A1G5S2FPVSF9LF", "asin": "0743273575", "reviewerName": "tim maxwell", "helpful": [0, 0], "reviewText": "I used this book in my mid-twenties and reduced my scoring by ten strokes. Now that I am getting back into the game there is nowhere else I would go!", "overall": 5.0, "summary": "Loved it", "unixReviewTime": 1374019200, "reviewTime": "07 17, 2013"}
{"reviewerID": "A1YZ5LQ0OSWLKU", "asin": "0743273575", "reviewerName": "Wendell Moore", "helpful": [0, 0], "reviewText": "When the grip and the stance are right the rest follows much easier. It only took me a week to master these two changes and make them a normal part of my game.", "overall": 4.0, "summary": "Very basic, very helpful.", "unixReviewTime": 1361059200, "reviewTime": "02 17, 2013"}
{"reviewerID": "A1UYPC2JMP1KK1", "asin": "0743273575", "reviewerName": "William Morales", "helpful": [0, 0], "reviewText": "Everything I expected. People been telling me about this book for years. Should have read it years ago. Look forward to buying more books.", "overall": 5.0, "summary": "Great book!", "unixReviewTime": 1376006400, "reviewTime": "08 9, 2013"}
{"reviewerID": "A1UUR225GXZEFC", "asin": "0743608658", "reviewerName": "firvo", "helpful": [0, 0], "reviewText": "Needed to make a trip up the river and wanted a handy sized weatherproof chart to refer to.  This map was the perfect choice and on amazon it is fairly priced compared to other local options.  Recommended chart.", "overall": 5.0, "summary": "Excellent reference for the river at a competitive price", "unixReviewTime": 1352764800, "reviewTime": "11 13, 2012"}
{"reviewerID": "A2U1IZ6SOWOQH5", "asin": "0743608984", "reviewerName": "Bruce", "helpful": [0, 0], "reviewText": "The maps were excellent and arrived on time for our cruise south. The vendor was EXCELLENT! I cannot speak more highly of them. The original shipment went missing and they overnighted another (newer version) to us since we were scheduled to leave the next day. Highly recommend the maps and vendor.", "overall": 5.0, "summary": "Very Good", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"}
{"reviewerID": "AQYJY8MM75ZOP", "asin": "0743608984", "reviewerName": "W. Carlberg", "helpful": [0, 0], "reviewText": "For those of us who are confirmed paper and pencil navigators  and can't afford expensive chart plotters that actually have the &#34;navigate to&#34; capability instead of direct line navigation across shoals and land etc.- Maptech charts are the way to go.  Made several 1,000 + mile trips safely with their use.", "overall": 5.0, "summary": "Great resource", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
{"reviewerID": "A1X4K0SX3633GL", "asin": "074360900X", "reviewerName": "Edward J. Winne", "helpful": [0, 0], "reviewText": "I've used the roll-up charts from NOAA, but they're too big and bulky to use on a small boat bouncing in the waves. This chart is much easier, covers the area well, and stands up to the wind and water. Well worth it.", "overall": 5.0, "summary": "Chart is easy to use, and waterproof!", "unixReviewTime": 1309219200, "reviewTime": "06 28, 2011"}
{"reviewerID": "A254AKLJ1L7KNS", "asin": "074360962X", "reviewerName": "ardian muca", "helpful": [0, 0], "reviewText": "smth that every boater must have. easy to navigate and keep notes for future references. right size and details for boating", "overall": 5.0, "summary": "good and affordable", "unixReviewTime": 1375488000, "reviewTime": "08 3, 2013"}
{"reviewerID": "A3UQSOJW51UU9T", "asin": "074360962X", "reviewerName": "BrianD", "helpful": [0, 0], "reviewText": "This was suggested to me by my sailing instructor as an alternative to many fold out maps.  For the price you do get quite a bit. That being said it is big and bulky, I struggle finding a place to store it.  In the end I still ended up buying a few key Maptech fold outs that I use often.  They take up less space, making them easier to store and they are easy to read.  I can reference them quickly in the cockpit and then easily throw them into my cockpit table.  I may end up taking the Chartkit back to my home and use it just for trip planning purposes, which it would be ideally suited for.  If you don't venture to far I would stick with a couple of folding maps and skip the Chartkit.", "overall": 4.0, "summary": "You get a lot for your money, but it is bulky.", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}
{"reviewerID": "A20VEGJPH0VE6V", "asin": "074360962X", "reviewerName": "Sailorsue", "helpful": [0, 0], "reviewText": "We swear by these Map-tech charts. Used this new one in the Chesapeake last year and it was spot on.", "overall": 5.0, "summary": "Chart kits", "unixReviewTime": 1366243200, "reviewTime": "04 18, 2013"}
{"reviewerID": "A254AKLJ1L7KNS", "asin": "0743609972", "reviewerName": "ardian muca", "helpful": [2, 2], "reviewText": "smth that every boater must have. easy to navigate and keep notes for future references. right size and details for boating.", "overall": 5.0, "summary": "good and affordable", "unixReviewTime": 1375488000, "reviewTime": "08 3, 2013"}
{"reviewerID": "A6HKN0SQ8WIKP", "asin": "074361058X", "reviewerName": "James X Mullen", "helpful": [1, 1], "reviewText": "The LI Embassy Guide isn't a bad piece of work but it sure isn't the definitive reference book that it purports to be. Generally speaking, the guide can find something charming and optimistic to say about every harbor and you can count on the fact that advertisers are portrayed in terms that glow. This makes things like restaurant recommendations highly suspect, and some disappointing meals confirm that suspicion. The guide is most useful for its collection of charts that give the data on harbor facilities, largely accurate and definitely helpful. Conclusion: buy it for its factual information, not its opinions.", "overall": 3.0, "summary": "Cruising With Rose-Colored Glasses", "unixReviewTime": 1377302400, "reviewTime": "08 24, 2013"}
{"reviewerID": "A1D7Z7FY8OUSQY", "asin": "074361058X", "reviewerName": "Jean Lopriore", "helpful": [0, 0], "reviewText": "I will reccomend this to anyone, very satisfied, the people were great to work with.  The product is a great guide and a must to any boater.", "overall": 5.0, "summary": "Very Satisfied", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "AHYHF3VG7S18C", "asin": "074361058X", "reviewerName": "Phyllis Silva", "helpful": [1, 1], "reviewText": "Great book to have for cruising. Easy to read and very informative.Wouldn't cruise without it. Make's arriving in port a lot easier.", "overall": 5.0, "summary": "Long Island Sound to Cape May, NJ", "unixReviewTime": 1284336000, "reviewTime": "09 13, 2010"}
{"reviewerID": "A3523KVAL9SHLK", "asin": "0766233987", "reviewerName": "Liz Lorch", "helpful": [0, 0], "reviewText": "I was sent a completely different item.  They were out of stock.  At least I got to keep the one I was sent, even though it wasn't what I ordered.", "overall": 1.0, "summary": "I was sent the  wrong item", "unixReviewTime": 1372118400, "reviewTime": "06 25, 2013"}
{"reviewerID": "A205TQG19S0GS8", "asin": "078341384X", "reviewerName": "Gail Coleman", "helpful": [0, 0], "reviewText": "I got this map for my husband, who has hiked the area many times in the past and he enjoyed studying the map and it brought back good memories for him.  He was impressed by how well it was put together.", "overall": 5.0, "summary": "Response to map", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
{"reviewerID": "A2NX29NO9KAGAU", "asin": "078341384X", "reviewerName": "Globe Trotter", "helpful": [0, 0], "reviewText": "I purchased several of these and laminated them locally. Very detailed. Use it for S&R primarily when I need to reference a large area (more &#34;manageable&#34; maps available for more specific areas if you need that).", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A3F7RDVB69RFIA", "asin": "078341384X", "reviewerName": "RocklinDave \"rocklindave\"", "helpful": [2, 2], "reviewText": "In short, these folks were very helpful and attentive to a problem that was not theirs.I ordered this map to do a week long backpacking trip with my brothers.  The map came swiftly, but I opened it up to find that one side had been printed poorly.  After a few emails back and forth, it turned out that all of the maps looked like that.  Too bad, because otherwise it's a great product.Again, the organization is very responsive, but this specific map has some printing flaws.", "overall": 5.0, "summary": "Wonderful Service", "unixReviewTime": 1316908800, "reviewTime": "09 25, 2011"}
