{"overall": 5.0, "verified": true, "reviewTime": "12 14, 2014", "reviewerID": "A1NKJW0TNRVS7O", "asin": "B0000DIWNZ", "reviewerName": "Tamara M.", "reviewText": "Good clinging", "summary": "Clings  well", "unixReviewTime": 1418515200}
{"overall": 4.0, "verified": true, "reviewTime": "11 20, 2014", "reviewerID": "A2L6X37E8TFTCC", "asin": "B0000DIWNZ", "reviewerName": "Amazon Customer", "reviewText": "Fantastic buy and a good plastic wrap.  Even though labeled \"Cling Plus,\" I feel that another plastic wrap holds and clings tighter for me.\nStill, for the price and roll size, I'll order this product as needed with my Amazon Prime food orders.", "summary": "Saran could use more Plus to Cling better.", "unixReviewTime": 1416441600}
{"overall": 4.0, "verified": true, "reviewTime": "10 11, 2014", "reviewerID": "A2WPR4W6V48121", "asin": "B0000DIWNZ", "reviewerName": "noname", "reviewText": "ok", "summary": "Four Stars", "unixReviewTime": 1412985600}
{"overall": 3.0, "vote": "4", "verified": false, "reviewTime": "09 1, 2014", "reviewerID": "A27EE7X7L29UMU", "asin": "B0000DIWNZ", "reviewerName": "ZapNZs", "reviewText": "Saran Cling Plus is kind of like most of the Cling Wrap from Glad. It is a very good quality plastic wrap, but the delivery system is poorly executed, and this makes usage more frustrating and less time-efficient. As convenience is one of the core selling points of this sort of product, how easy it is to use is just as important as how good the wrap itself is.\n\nAs another user here noted, getting this stuff out of the box and tearing off the portion you need to use is very difficult. Substantial force is required to do this due to a cutting system that is lacking, and this can result in the box being damaged as it is not a very robust box. It can also cause the piece you are attempting to tear off fold up from the pressure upon being torn, leaving you with a tangled mess to untangle. As the blade itself does not do a great job cutting, sometimes the wrap will tear, leaving you with a piece that is a different size than you wanted. The physical location of where the wrap comes out relative to where it is cut at also results in one having to hold at an awkward angle to see what they are doing, making all of this more difficult.\n\nI use clear wrap multiple times a day...the difference between a delivery system that is easy versus difficult means a lot of time savings, and a lot of frustration that does not have to occur. This is a good quality wrap, but like Glad's wrap, it's delivery system is lacking compared to other products (such as the Kirkland clear wraps) and so the convenience factor is reduced. So I think that you will find that an alternative clear wrap product with a better system for dispensing & cutting is more enjoyable to use, and much more convenient.", "summary": "The wrap is fantastic, but the dispensing, cutting, & packaging is lackluster, making the Saran less convenient & time-saving", "unixReviewTime": 1409529600}
{"overall": 4.0, "verified": true, "reviewTime": "08 10, 2014", "reviewerID": "A1OWT4YZGB5GV9", "asin": "B0000DIWNZ", "reviewerName": "Amy Rogers", "reviewText": "This is my go to plastic wrap so there isn't much bad I can say. Plastic wrap is kind of a pain when you are trying to get it off the roll and it sticks to itself. I don't seem to have that problem with cling plus. It comes out nice and rips off well. It usually sticks well to what i need it to. I will say i use it more to wrap things, then to go over containers. I just don't feel any plastic wrap sticks really well to plastic and glass bowls. So i use it sparingly for these purposes. If i need to wrap up something for my children's lunch this is the plastic wrap i would choose.", "summary": "has been doing it's job for years", "unixReviewTime": 1407628800}
{"overall": 5.0, "verified": true, "reviewTime": "07 14, 2014", "reviewerID": "A1GN2ADKF1IE7K", "asin": "B0000DIWNZ", "reviewerName": "Happygoddess", "reviewText": "Works very well. Clings to my glass baking dish very well", "summary": "I like it", "unixReviewTime": 1405296000}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "04 30, 2014", "reviewerID": "A3SJKIHSPA2MDZ", "asin": "B0000DIWNZ", "reviewerName": "Cato", "reviewText": "I find the 200 foot roll of Saran Cling Plus nearly impossible to extract from the box.  Pulling on the roll requires a force that breaks the box.  If you tape the box (with scotch packing tape), it just tears somewhere else.  Since the wrap clings well, fiddling with the box means that the wrap can fold over on itself, making it nearly impossible to untangle.  Since I buy this stuff to save time, this poor packaging erases most of the advantage.  Wax paper with a rubber band (my mom's solution) would be as fast and a lot cheaper.\n\nGlad doesn't stick as well as this wrap, but it is much easier to manipulate in larger pieces, allowing you to cover food  fast.\n\nOne reviewer notes that Saran wrap sticks well in the microwave.  I'd be nervous about soft plastic adhering to my food in a microwave. There's a lot of buzz about chemicals in plastic leaching into food. To be safe, glass/china/paper are the containers of choice in the microwave. to prevent spattering, just put an upside down plate (china or paper) over the food being heated.", "summary": "Box wastes time", "unixReviewTime": 1398816000}
{"overall": 5.0, "verified": true, "reviewTime": "06 19, 2013", "reviewerID": "A2YXHRKCDBEJKX", "asin": "B0000DIWNZ", "reviewerName": "Tania", "reviewText": "I like Saran wrap better than Glad, for some reason my husband and I believe it works better, it clings better and it doesn't melt as fast in the microwave as the others do. The price was right and it was delivered very quick.", "summary": "Very good staple", "unixReviewTime": 1371600000}
{"overall": 5.0, "verified": true, "reviewTime": "05 11, 2013", "reviewerID": "A4NK3T8BCMJQ8", "asin": "B0000DIWNZ", "reviewerName": "Amazon Customer", "reviewText": "An excellent product with great \"sticking power\"!  Other more expensive product that claim \"easy handling\" are simply LESS STICKY and that's not what you want in cling-film! The price here buying in bulk + Amazon prime is hard to beat.", "summary": "Love this cling-film", "unixReviewTime": 1368230400}
{"overall": 1.0, "vote": "10", "verified": true, "reviewTime": "05 27, 2012", "reviewerID": "A3L82S0SJ6L279", "asin": "B0000DIWNZ", "reviewerName": "Sarah Sarah", "reviewText": "The product description impled a pack of 12. That would have been a terrific value so I didn't mnd paying a $5 shipping charge. It is not. At least not from the seller I purchased it from (Soap). It's one pack of 200 sq ft. size. Not a good value at all. Plus it came in a gigantic boz that could indeed contain 12 individual products. But the box only contained one. Shame on you Soap. Not a good Amazon seller.", "summary": "Not a pack of 12", "unixReviewTime": 1338076800}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "04 24, 2011", "reviewerID": "A2WLCSZB1EAFAM", "asin": "B0000DIWNI", "reviewerName": "iloveamazon", "reviewText": "got so many of them since amazon only sells in bulk, now have enough for the next five years. don't buy it unless u plan to stock forever...", "summary": "good product, but too much", "unixReviewTime": 1303603200}
{"overall": 5.0, "verified": false, "reviewTime": "03 24, 2011", "reviewerID": "A25LB4CZOIYIL3", "asin": "B0000DIWNI", "reviewerName": "Giiiiibby", "reviewText": "Saran Plastic Wrap SAVED MY LIFE!!!! You see, I work for a fine dining restaurant and our chef, I kid you not, must be the spawn of Hell's kitchen. We had a dish which until put in the bread bowl and mixed, remained rather soupy. It would constantly spill in the fridge and get all over the other items we were in the process of cooking. Who should go down for this incident? None other than me. So, I had tried plastic wear-it leaked, foil-also leaked, plus allows for fridge smells to seep in from the other food. So, with this dilema before me, and an extremely angry chef behind my right shoulder, I thought. Most plastic wraps never seemed to work. It was out of the question for me. We did not keep them in the kitchen due to the sticking to hot food items and melting near the ovens. Keeping all other air out and the food in until mixing time was my top priority and the Chef punished me every time there was a spill. This is my job, I should be able to look forward to it not dread the very moment I open the fridge. Didn't anyone ever tell the chef not to cry over spilled milk? Anyway, I finally was at the point of giving up. I came across a box of Saran Plastic Wrap on the counter and thought it couldn't hurt to through it on. At once it clung perfectly to the bow. I was able to seal and push out all the air and move it in the fridge with ease. There were no messes, no more spills, and the chef did not try and drown me in the soup for these messy mistakes so, you see, Saran Wrap saved my life!!!!<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Saran-Premium-Plastic-Wrap-Heavy-Duty-100-sq-ft/dp/B0000DIWNI/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Saran Premium Plastic Wrap, Heavy Duty 100 sq ft</a>", "summary": "SARAN WRAP SAVED MY LIFE!!", "unixReviewTime": 1300924800}
{"overall": 1.0, "vote": "20", "verified": false, "reviewTime": "03 10, 2010", "reviewerID": "A1AOSZ3YNFSVQE", "asin": "B0000DIWNI", "reviewerName": "dc", "reviewText": "If you are looking for a good clingy plastic food wrap, steer away from this product. This wrap does not function contrary to what is advertised on the box. It does not stick to glass, nor does it stick to itself even if you pat it down.\n\nI highly recommend the following products instead. These brands' food wrap provide strong, instant cling for a tight seal:\n- Reynolds plastic wrap\n- Kirkland (Costco brand) plastic food wrap\n- First Street (Smart & Final brand) plastic food wrap", "summary": "Does not cling!", "unixReviewTime": 1268179200}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "10 2, 2009", "reviewerID": "A10AZVYK32ZJSE", "asin": "B0000DIWNI", "reviewerName": "Colour", "reviewText": "Saran brand plastic wrap is normally pretty decent, but the slide n cut bar that they have on the latest packages is an atrocity probably illegal under the Geneva Convention.  It is pretty much impossible to get the slide bar to cut any plastic wrap and utterly infuriating. The normal blade that's usually on these boxes is replaced with the bar, which makes cutting plastic wrap more difficult than giving a cat a bath. Avoid the slide n cut bar at all costs, I ended up using scissors.", "summary": "Slide N Cut bar is awful", "unixReviewTime": 1254441600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 29, 2007", "reviewerID": "A3PDNV30IFOUBT", "asin": "B0000DIWNI", "reviewerName": "Bhakti-rider", "reviewText": "I use plastic wrap every day, at least once.  I've tried lots of different ones over the decades.  I like all the characteristics of the classic (original) except that it tears way too easily; if it was strong and otherwise the same, it would be my favorite, but as it is, the Premium is the best I've found so far.", "summary": "The best I've tried", "unixReviewTime": 1188345600}
{"overall": 4.0, "verified": false, "reviewTime": "01 16, 2016", "reviewerID": "A2KRHYFYBTLEIK", "asin": "B0000DIWNI", "reviewerName": "Angela", "reviewText": "I like this productr because it's not too clingy.  It will cling to the container or food you're trying to protect if you want it to, but it's not so \"clingy\" that if folds up on itself and becomes a crinkly mess!", "summary": "I like this productr because it's not too clingy", "unixReviewTime": 1452902400}
{"overall": 4.0, "verified": true, "reviewTime": "10 4, 2015", "reviewerID": "A4GFA67FAZ5V1", "asin": "B0000DIWNI", "reviewerName": "E. Jones", "reviewText": "Still infuriating to work with, and could use a better container/cutter, but like the headline says...", "summary": "Better than anything else I've found", "unixReviewTime": 1443916800}
{"overall": 4.0, "verified": true, "reviewTime": "09 24, 2015", "reviewerID": "A31Y9ELLA1JUB0", "asin": "B0000DIWNI", "reviewerName": "Her Royal Peepness Princess HoneyBunny Blayze", "reviewText": "I purchased this Saran premium plastic wrap after trying Reynolds press and seal wrap which I would never use again.. There is less static cling to this wrap than I remember. To me this is a good thing because it doesn't stick to its self .\n\nThis is my typical complaint with all plastic wraps. When trying to cut them they ball all up and are useless. However they have improved this. Now Saran clings to the bowl or plate you wish to cover.\n\nNow if only they could improve the cutters on the boxes so  that the cutters actually cut and scissors weren't required would be better..", "summary": "Pretty Good For plastic Wrap", "unixReviewTime": 1443052800}
{"overall": 5.0, "verified": true, "reviewTime": "09 8, 2015", "reviewerID": "A3S842ENKKNM69", "asin": "B0000DIWNI", "reviewerName": "Tony B", "reviewText": "Love love love it", "summary": "Woo hoo", "unixReviewTime": 1441670400}
{"overall": 5.0, "verified": false, "reviewTime": "07 7, 2015", "reviewerID": "A2EDR4BSO8F0E1", "asin": "B0000DIWNI", "reviewerName": "happyday", "reviewText": "I go through a lot of plastic ware and for me Saran Premium is the best.", "summary": "... plastic ware and for me Saran Premium is the best.", "unixReviewTime": 1436227200}
{"overall": 5.0, "verified": true, "reviewTime": "06 23, 2015", "reviewerID": "A2FYW9VZ0AMXKY", "asin": "B0000DIWNI", "reviewerName": "Mary", "reviewText": "I am an avid cook and baker.  Saran Premium Plastic Wrap is a staple in my pantry and the only plastic wrap I purchase.  I have tried other brands including Glad and have consistently found Saran Wrap to be far superior.\n\nSaran Wrap is easy to use.  It's cutting bar cuts the wrap smoothly and the end of the wrap is easy to remove from the roll, doesn't get all sticky and impossible to remove like on some other brands.  Some of the comments mention that Saran Wrap does not cling, but I have never had this problem when using this wrap at room temperature, in the refrigerator, or in the microwave.\n\nKeeps food stuffs fresh and wonderful to use to separate layers of freshly baked cookies and brownies stored in containers in the freezer.  I also use this to tightly wrap partially used fruits and vegetable like apples and avocadoes.  Saran Wrap excels at keeping these partially used fruits and vegetables fresh with no browning.  Another great Amazon Prime Pantry value.", "summary": "The Best Plastic Wrap for your Cooking, Baking, and Food Storage Needs", "unixReviewTime": 1435017600}
{"overall": 5.0, "verified": true, "reviewTime": "06 13, 2015", "reviewerID": "A1NE43T0OM6NNX", "asin": "B0000DIWNI", "reviewerName": "Tulay C", "reviewText": "Good wrap, keeping it in the fridge makes it easier to tear. Learned this trick from my sister.", "summary": "Good and strong.", "unixReviewTime": 1434153600}
{"overall": 4.0, "verified": true, "reviewTime": "06 3, 2015", "reviewerID": "AHTCPGK2CNPKU", "asin": "B0000DIWNI", "reviewerName": "OmaShops", "reviewText": "I prefer Saran wrap over other brands. It doesn't cling as well to dishes, but it tangles less when pulling it out of the box.", "summary": "Doesn't cling as well to dishes as other brands, but it tangles less", "unixReviewTime": 1433289600}
{"overall": 4.0, "verified": true, "reviewTime": "05 12, 2015", "reviewerID": "A1PHJXO4D1D7LW", "asin": "B0000DIWNI", "reviewerName": "DD Purchaser", "reviewText": "perfect", "summary": "Four Stars", "unixReviewTime": 1431388800}
{"overall": 5.0, "verified": true, "reviewTime": "04 20, 2015", "reviewerID": "A25SIBTMVXLB59", "asin": "B0000DIWNI", "reviewerName": "Nitemanslim", "reviewText": "Thanks", "summary": "Five Stars", "unixReviewTime": 1429488000}
{"overall": 5.0, "verified": true, "reviewTime": "04 10, 2015", "reviewerID": "A24EEIAPSY8Q39", "asin": "B0000DIWNI", "reviewerName": "Chao Song", "reviewText": "Ty!", "summary": "Five Stars", "unixReviewTime": 1428624000}
{"overall": 5.0, "verified": true, "reviewTime": "04 9, 2015", "reviewerID": "AR5DSI7UNMX9S", "asin": "B0000DIWNI", "reviewerName": "NIKKOLE", "reviewText": "really good", "summary": "Five Stars", "unixReviewTime": 1428537600}
{"overall": 4.0, "verified": true, "reviewTime": "03 26, 2015", "reviewerID": "A1U7EU7Z6BHHH2", "asin": "B0000DIWNI", "reviewerName": "Tina Hall", "reviewText": "Nice product, not a lot on the roll.", "summary": "nice product", "unixReviewTime": 1427328000}
{"overall": 5.0, "verified": true, "reviewTime": "03 22, 2015", "reviewerID": "A2UB63U73M9NIP", "asin": "B0000DIWNI", "reviewerName": "viperhitman1508", "reviewText": "Great product.", "summary": "Five Stars", "unixReviewTime": 1426982400}
{"overall": 5.0, "verified": true, "reviewTime": "03 18, 2015", "reviewerID": "A2CGWAJXK9T0FI", "asin": "B0000DIWNI", "reviewerName": "null", "reviewText": "Wraps things up and it clings well to ppots, plates, tubberware, my hands, the counter, food and anything else i can not think of right now.  We all know what this stuff does and how it works and it does it well.  Go Saran!", "summary": "Chop & then Wrap", "unixReviewTime": 1426636800}
{"overall": 5.0, "verified": true, "reviewTime": "03 8, 2015", "reviewerID": "A2XKLQ0ZXJYDG1", "asin": "B0000DIWNI", "reviewerName": "Jameson C.", "reviewText": "I use press n seal for most things in the kitchen. However, plastic wrap is needed when bread is rising. This brand is by far the best.", "summary": "This brand is by far the best.", "unixReviewTime": 1425772800}
{"overall": 4.0, "verified": true, "reviewTime": "03 8, 2015", "reviewerID": "A3VWQL1UIC9JAE", "asin": "B0000DIWNI", "reviewerName": "Kristann Harrigan", "reviewText": "When one can\"t find the right lid, use this wrap.  It stays in place and keeps food fresh.  I use it to wrap sandwiches as well.  I will purchase it again.  Thanks for keeping it in stock/", "summary": "stays in place, many uses", "unixReviewTime": 1425772800}
{"overall": 3.0, "verified": true, "reviewTime": "02 21, 2015", "reviewerID": "A1TNGMNW5V713C", "asin": "B0000DIWNI", "reviewerName": "Maria Villanueva", "reviewText": "good", "summary": "Three Stars", "unixReviewTime": 1424476800}
{"overall": 5.0, "verified": true, "reviewTime": "02 4, 2015", "reviewerID": "A2IZLMCA9GOIZ0", "asin": "B0000DIWNI", "reviewerName": "JB", "reviewText": "Use it all the time...good as usual.", "summary": "good as usual", "unixReviewTime": 1423008000}
{"overall": 5.0, "verified": true, "reviewTime": "01 14, 2015", "reviewerID": "ALB03N25CJDRO", "asin": "B0000DIWNI", "reviewerName": "redmug", "reviewText": "good", "summary": "Five Stars", "unixReviewTime": 1421193600}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2014", "reviewerID": "AM8CV0IH407MK", "asin": "B0000DIWNI", "reviewerName": "Octogen", "reviewText": "Have been using saran wrap for many years. I prefer the 100 sq. ft. size since it is so easy to grab and hold when I need it.", "summary": "size since it is so easy to grab and hold when I need it", "unixReviewTime": 1419897600}
{"overall": 5.0, "verified": false, "reviewTime": "12 30, 2014", "reviewerID": "A3Q3UMNMYV6YZ3", "asin": "B0000DIWNI", "reviewerName": "BFrank", "reviewText": "And that's exactly what you want in a plastic wrap.", "summary": "S*** clings like a needy bitch.", "unixReviewTime": 1419897600}
{"overall": 5.0, "verified": true, "reviewTime": "12 23, 2014", "reviewerID": "A2EREM0JFISC5O", "asin": "B0000DIWNI", "reviewerName": "Dark Jester", "reviewText": "Clings well and works like it should. The cutting edge isn't the best, but they never are on this style of box.", "summary": "It's Saran Wrap. ;)", "unixReviewTime": 1419292800}
{"overall": 5.0, "verified": true, "reviewTime": "12 11, 2014", "reviewerID": "A2AOFXI2TZYD0G", "asin": "B0000DIWNI", "reviewerName": "Gina C.", "reviewText": "LOVE THIS SARAN WRAP", "summary": "REALLY CLINGS TO THE DISHES TIGHTLY!!", "unixReviewTime": 1418256000}
{"overall": 5.0, "verified": true, "reviewTime": "11 11, 2014", "reviewerID": "APXYU2VIM9T8B", "asin": "B0000DIWNI", "reviewerName": "Maxine Price", "reviewText": "good", "summary": "Five Stars", "unixReviewTime": 1415664000}
{"overall": 5.0, "verified": true, "reviewTime": "09 8, 2014", "reviewerID": "A1ETFQJ7J4YSVN", "asin": "B0000DIWNI", "reviewerName": "Cathy Z.", "reviewText": "so far everything ordered has been as described and what I expected. Nothing has arrived undamaged or late. I will just repeat this message for each item. All has been great.", "summary": "All has been great.", "unixReviewTime": 1410134400}
{"overall": 5.0, "verified": true, "reviewTime": "08 29, 2014", "reviewerID": "A3BITQXFU7WGMG", "asin": "B0000DIWNI", "reviewerName": "Vicki Miller", "reviewText": "Sticks to bowls!  Love it!!!", "summary": "great plastic wrap", "unixReviewTime": 1409270400}
{"overall": 5.0, "verified": true, "reviewTime": "08 27, 2014", "reviewerID": "A36X6J3030HT8", "asin": "B0000DIWNI", "reviewerName": "fernew", "reviewText": "perfect wrap", "summary": "Five Stars", "unixReviewTime": 1409097600}
{"overall": 5.0, "verified": true, "reviewTime": "07 2, 2014", "reviewerID": "AL5L8PJC6636T", "asin": "B0000DIWNI", "reviewerName": "bluedinosaur", "reviewText": "Good purchase.", "summary": "Five Stars", "unixReviewTime": 1404259200}
{"overall": 5.0, "verified": false, "reviewTime": "06 29, 2014", "reviewerID": "A2GQXD9EG9BWU0", "asin": "B0000DIWNI", "reviewerName": "Jon K. Newkirk", "reviewText": "This product is thick enough so that it does not wrap itself around all sorts of things that you don't want it to wrap itself around.  It clings to itself and other things without having the annoying tendency to fly away and tangle itself up that plagues many clear wraps.  It doesn't wrap itself so tightly that you can't get the end loose and the sticky tab on the dispensing box actually works most of the time.\nI think the extra thickness is what makes this a superior performing product.\nI am a fairly cranky old guy and I was still pleased with how easily this product fulfilled the mission.", "summary": "very effective product", "unixReviewTime": 1404000000}
{"overall": 5.0, "verified": true, "reviewTime": "06 21, 2014", "reviewerID": "A3GTIKZKY70VLT", "asin": "B0000DIWNI", "reviewerName": "Z the Beeman", "reviewText": "The Mrs loves this stuff.  It isn't available anymore in our area -- so bought a whole case.  She says it is heads and shoulders about brand x -- clings better -- easier to work with -- tougher.\nI wholeheartedly trust her judgement.  (just for the record I cook a lot too -- I agree with her observations).", "summary": "The best", "unixReviewTime": 1403308800}
{"overall": 1.0, "vote": "7", "verified": false, "reviewTime": "04 11, 2014", "reviewerID": "A3VGKTT7LIDYQR", "asin": "B0000DIWNI", "reviewerName": "TrainChaser", "reviewText": "I wonder why so many companies are so dedicated to the concept of \"new and different\" that they turn their backs on even basic common sense?  This company is one of them.  They need to find someone in their company that has a few brains.  Maybe they can find one in their shipping or janitorial dept.\n\nJust in case they ever look here, I'm going to spoon-feed it to them.\n\nHey, Dweebs:  PUT THE CUTTING STRIP ON THE BOTTOM, not the top!  Everyone else puts it on the bottom.  We rip aluminum foil downward.  We rip the waxed paper downward.  It works better because the bottom has more support and stability.  The lid is floppy.  It rips unevenly if it rips at all.\n\nThere.  I hope the words weren't too big, or the sentences too long.\n\nExcept for the advertising, all the cling wraps are pretty much the same.  Handi-Wrap was the best, but it's long gone.", "summary": "Decent product, 5th-rate dispenser", "unixReviewTime": 1397174400}
{"overall": 5.0, "verified": true, "reviewTime": "03 7, 2014", "reviewerID": "A3DA33P06W6EF7", "asin": "B0000DIWNI", "reviewerName": "Ingrid Hebert", "reviewText": "This is the best stuff. It is a staple in my house. I remember this product in my Moms kitchen.", "summary": "Old School", "unixReviewTime": 1394150400}
{"overall": 3.0, "verified": true, "reviewTime": "02 20, 2014", "reviewerID": "AA0YPCLUF78B4", "asin": "B0000DIWNI", "reviewerName": "Elizabeth", "reviewText": "I don't understand why all the reviewers love this Saran Wrap.  It stretches so much when I pull it out that I can hardly get it to tear.  It is better than a lot of the cheap plastic wrap out there, but I have much better memories of Saran Wrap from my childhood.  What happened to this?", "summary": "Not so great", "unixReviewTime": 1392854400}
{"overall": 5.0, "verified": true, "reviewTime": "01 31, 2014", "reviewerID": "A3BV3BQGCQ3E3P", "asin": "B0000DIWNI", "reviewerName": "Kitty Blind", "reviewText": "This was a Xmas gift for my daughter because it is very hard to find Saran Wrap in the San Jose area.  She was thrilled and I was pleased to be able to get it for her.", "summary": "Available only at Amazon", "unixReviewTime": 1391126400}
{"overall": 5.0, "verified": true, "reviewTime": "11 6, 2013", "reviewerID": "AET27TOVBY0FV", "asin": "B0000DIWNI", "reviewerName": "Anne Norton", "reviewText": "Just as expected! No clue why it's so hard to find in the stores! This is the best plastic wrap on the market and I have plenty now!", "summary": "Perfect!", "unixReviewTime": 1383696000}
{"overall": 5.0, "verified": true, "reviewTime": "10 24, 2013", "reviewerID": "A216GLB00NJ7OI", "asin": "B0000DIWNI", "reviewerName": "Renee Kalish", "reviewText": "Sara wrap clings better than other wraps, thicker and doesn't tangle as easily than others.  Couldn't find it in my area, so bought a case.", "summary": "Best wrap", "unixReviewTime": 1382572800}
{"overall": 4.0, "verified": true, "reviewTime": "09 26, 2013", "reviewerID": "AQFYGWUOGWBXY", "asin": "B0000DIWNI", "reviewerName": "Cassie", "reviewText": "I bought a few kitchen supplies to start off my new apartment and bought this. Works great and it was a good price.", "summary": "great price", "unixReviewTime": 1380153600}
{"overall": 5.0, "verified": true, "reviewTime": "09 19, 2013", "reviewerID": "A3963R7EPE3A7E", "asin": "B0000DIWNI", "reviewerName": "John Schar", "reviewText": "We go through wrap like most people go through toilet paper or paper towels.  We have no regret either because it performs as advertised.  It was customary for us to buy the cheapest available wrap until one day not too long ago we detected a foul odor coming from the package.  We thought it was just a fluke in the single package and just threw it away and opened another one only to find that it had the identical odor.  Instead of throwing this one away, I contacted the seller and placed a complaint.  A coupon to buy another brand arrived and we bought our first Saran Premium Wrap.  It was so good that we bought an entire pack of 12 100 square foot rolls and could not be happier.  It clings well and above all it protects what we want protected and keeps out unwanted molecules such as those unwanted air ones and bug ones and even odors.  It even cuts clean and does not require muscles of Mr. Clean to pull a piece off the roll.  We saved a few pennies over the years and they were not pennies saved for the betterment of our mindset.  To say that I recommend this product would be redundant so please forgive my redundancy, I highly recommend Saran Premium Wrap and will buy more when the time comes.", "summary": "Hold ON and it did", "unixReviewTime": 1379548800}
{"overall": 5.0, "verified": false, "reviewTime": "08 24, 2013", "reviewerID": "AV2XNWBIC2QIE", "asin": "B0000DIWNI", "reviewerName": "rocketface", "reviewText": "norwex is selling a ten dollar sandwich bag. it is effective. HOWEVER, i found that a better solution to this sandwich housing problem is Saran Premium Wrap - 100 feet. Seriously. I wrapped, single handedly, like 200 sandwiches. THEN i washed the Saran wrap and wrapped 200 MORE sandwiches. PB featuring J, beeyoch. I paid 0.02795 cents per TWO sammiches. Norwex, for shame. FOR SHAAAAME. im hungry.", "summary": "Better than norwex", "unixReviewTime": 1377302400}
{"overall": 1.0, "vote": "3", "verified": false, "reviewTime": "07 2, 2013", "reviewerID": "A3HF1TS6KVYTFM", "asin": "B0000DIWNI", "reviewerName": "Hal Magnusson", "reviewText": "This product is on a downhill slide.  The brand used to be synonymous with quality.  Now, it promotes \"Great Value!\" as if that was more important than quality.  But, here's where Saran Wrap (an SC Johnson Family Company)deserves the \"Shi**y (tt omitted) Product Award - for its packaging! On the lower quality SKU, Saran \"Cling Plus\" box, they have the audacity to show an ad for their less lower quality SKU, Saran \"Premium Wrap.\"  This is confusing to consumers, and I believe it is intentional.  I would suggest purchasing another brand, to help teach SC Johnson & Son a lesson in consumer behavior.", "summary": "Consumer Beware!", "unixReviewTime": 1372723200}
{"overall": 5.0, "verified": true, "reviewTime": "03 18, 2013", "reviewerID": "A39MOJV5VNEJ06", "asin": "B0000DIWNI", "reviewerName": "Terri PhD", "reviewText": "I tried to buy less expensive competitors' brands but nothing works as well as Saran Wrap!  When I cover a glass bowl with this stuff -- it sticks and stays.  This is one of those items that is essential, that's why I broke down and bought a case.", "summary": "Don't buy imitations -- Saran Wrap is the real thing!", "unixReviewTime": 1363564800}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "03 8, 2013", "reviewerID": "A3QLSUFR10WCFY", "asin": "B0000DIWNI", "reviewerName": "Phyl", "reviewText": "Saran wrap has changed since Dow manufactured it. The Premium Plastic is supposed to cling well to glass but I found that it never clings. The latest box is totally un-clingable. don't waste your money!", "summary": "Doesn't stick", "unixReviewTime": 1362700800}
{"overall": 2.0, "verified": false, "reviewTime": "09 11, 2012", "reviewerID": "AKZ7A68Z7SROV", "asin": "B0000DIWNI", "reviewerName": "Bop", "reviewText": "I purchased this from Amazon Warehouse Deals so I knew it might not be 100% and could live with one problem But the ends of the box fell apart and the double sided tape to hold the wrap in place was on the top of the box not under the metal cutter bar So the wrap would roll back into the box Plus the wrap is very wrinkled like it has been stored in a hot warehouse I would have kept it if it had one problem but not three", "summary": "Defective box", "unixReviewTime": 1347321600}
{"overall": 1.0, "vote": "3", "verified": false, "reviewTime": "03 12, 2012", "reviewerID": "A3VASX9GMGBLQX", "asin": "B0000DIWNI", "reviewerName": "Wolfwasp", "reviewText": "SC Johnson makes the worst plastic wrap on the market today.\nThe roll is wrapped so tight you can't pull it out of the box without the box falling apart.\nThe tabs on the end of the box are supposed to be pushed in to hold the roll in place while you try to pull some out.\nThe tabs were designed by an idiot. When you push them in the whole box falls apart because the folds in the box are in the way of the tabs.\nIf you scotch tape the ends after destroying the box they still don't work.\nThe wrap itself does not stick to anything. I have tried it on pyrex glass bowls, ceramic bowls, plastic bowls.\nThey spent a fortune designing the box to get your attention but that is all you get.\nThis product deserves a class action suit. Absolute garbage. Bordering on commercial fraud.", "summary": "DON'T WASTE YOUR $$", "unixReviewTime": 1331510400}
{"overall": 5.0, "verified": true, "reviewTime": "02 19, 2012", "reviewerID": "A9H6DQN2806MF", "asin": "B0000DIWNI", "reviewerName": "SJME", "reviewText": "I probably now have a lifetime supply of Saran wrap BUT it is hard to find in all the grocery stores I frequent.  There is nothing quite like Saran wrap.", "summary": "Hard to find good plastic wrap", "unixReviewTime": 1329609600}
{"overall": 4.0, "verified": false, "reviewTime": "02 19, 2012", "reviewerID": "AQQLWCMRNDFGI", "asin": "B0000DIWNI", "reviewerName": "Steven Peterson", "reviewText": "When I was a kid (a long time ago!), my mother would use Saran Wrap to wrap up left overs and cover plates and so on. Live and learn.\n\nNow? I use it as well. It is wonderful for storing leftovers. It is useful for covering ingredients for my meals (mise en place?) to keep them fresh. It seemed to work well for my mother; it surely works well for me.\n\nAfter all of these years. . . .  A satisfied customer!", "summary": "A family tradition", "unixReviewTime": 1329609600}
{"overall": 5.0, "verified": false, "reviewTime": "11 17, 2011", "reviewerID": "A30AJN9BVMM49T", "asin": "B0000DIWNI", "reviewerName": "lightning", "reviewText": "Having looked at all the usual grocery and hardware stores to no avail for my Saran Wrap Premium Wrap, in desperation thought, try Amazon. I was pleasantly suprised and please with the last dozne rolls of Saran Wrap I ordered. I'm stocked for 6 months but atleast I have access to such a superior product. All other plastic wraps I was forced to used as a substitute were horrible.  THank you Amazon for carrying my favorite Saran Wrap brand. No problem with a dozen, at least I have it, don't have to spend endless hours on wishing I could find it, I know where to go.\nVery satisfied,\nLightning", "summary": "thank you for carrying this item-", "unixReviewTime": 1321488000}
{"overall": 5.0, "verified": true, "reviewTime": "10 3, 2011", "reviewerID": "A3RU7QI4PLON76", "asin": "B0000DIWNI", "reviewerName": "fancydancey", "reviewText": "Yes, saran wrap is the best so when they stopped carrying it at my store (Meijers), I tried all of the other brands with dissappointment at every turn.  I thought, why not try online.  So glad to have found it on amazon, and I don't mind buying a dozen at a time as this is probably less than a  year supply for me.  How can  you go wrong?!", "summary": "What can one say about saran wrap?", "unixReviewTime": 1317600000}
{"overall": 1.0, "vote": "9", "verified": false, "reviewTime": "01 19, 2009", "reviewerID": "AI0NMYA3LKXW1", "asin": "B0000GH6UG", "reviewerName": "Bartok Kinski", "reviewText": "When I was incarcerated in a Mexican prison, this was the only drink in the joint.  We had to fix it with goat's milk and heat it over an open flame in the yard.  The taste is awful.  It's not pleasing like the thick, hot Chocolate found in Madrid.", "summary": "taste is awful", "unixReviewTime": 1232323200}
{"overall": 5.0, "vote": "9", "verified": false, "reviewTime": "12 8, 2008", "reviewerID": "AXIJRVN9CQQ0G", "asin": "B0000GH6UG", "reviewerName": "Elle N.", "reviewText": "I just wanted to correct what some of the other reviews are saying:\n\nA. It's not an \"acquired\" taste, that kids will probably not like:\nI grew up with Ibarra, it was a once in a blue moon treat. I loved it as a kid and preferred it to Swiss Miss or Nestle or any other hot chocolate.\n\nB. Although I'm sure you can make Ibarra hot chocolate with a blender I have never once seen someone make it like that. It's really simple:\nTake two wedges and melt them in a cup or so of milk (any kind) or water and just whisk it or use a wooden spoon.\n\nIbarra is may favorite hot chocolate. I've introduced others to it and they've never had a bad thing to say!", "summary": "A few corrections", "unixReviewTime": 1228694400}
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "04 20, 2007", "reviewerID": "A2XUW6VTPD0ILX", "asin": "B0000GH6UG", "reviewerName": "GP", "reviewText": "Love the package and the individually wrapped \"cakes\". Very visually appealing-would make a great gift.\n\nPlease don't get turned off by hearing that you must chop or blend the cakes of chocolate before mixing in the milk then mix it all in a blender. Sure, you can do that and I'm sure the froth is wonderful however, give my method a try. It's super simple, I promise.\n\nFirst get a LARGE mug and fill with milk OR water. Nuke in the microwave for a minute or two. Place the entire chocolate \"cake\" slowly into the cup so it drops to the bottom. Let sit for a minute then with your spoon gently stir it around. The chocolate melts very quickly and easily. Now enjoy! The package does not say to use the whole cake but with a large cappucino mug, it was the perfect amount.\n\nAs for the reviewer who thought kids may not like it, I have to share that my 5 and 8 yr olds loved it!\n\nOne last thing, I bought mine (same size) at the regular grocery store for less than $4.", "summary": "This is not your typical hot cocoa mix. It's much better!", "unixReviewTime": 1177027200}
{"overall": 4.0, "vote": "38", "verified": false, "reviewTime": "01 11, 2006", "reviewerID": "A3OJX18B60PJR9", "asin": "B0000GH6UG", "reviewerName": "DAVERAT", "reviewText": "First off - this is not an \"instant' product the way most americans expect Hot Cocoa products to be.  It comes in cakes and must be ground either with a mortar & pestle or in a very sturdy grinder/blender.  It is a basic recipe which suits the majority.  Therefore, if you want it to be super spicy, you need to dress it up a bit.  Follow the package instructions for best results but use a whisk.  It needs to be made in a saucepan on top of the stove or in a Mr. Coffee Cocomotion machine.\n\nGrind the cakes in advance for maximum convenience and use 1 and a half times the recommended amount for best results. Use whole milk for best results or 2%.  Skim milk just doesn't work as well. For a spicier mug of cocoa, add ground chili powder to taste.  You can also add a piece of vanilla bean while cooking if you like that.  If you want even more cinnamon taste, you can cook with a cinnamon stick. You can add espresso powder as well for a nice change of pace.  Instant coffee will do in a pinch plus that's a good way to get rid of intsant coffee!\n\nIt's best to try a few mugs of Ibarra before you decide to spice it up.  The flavor will grow on you. If you don't feel like paying the shipping fees, ask your grocer if they carry this item.  Most chain grocery stores with a Hispanic section do carry Ibarra.", "summary": "Consistant basic Mexican hot Chocolate you can dress up", "unixReviewTime": 1136937600}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "01 4, 2006", "reviewerID": "A35IS73UXM9PEO", "asin": "B0000GH6UG", "reviewerName": "Julie R. Anderson", "reviewText": "After reading the reviews, I was syked to receive my order of Ibarra chocolate.  I love hot chocolate, and look forward to trying new flavors and brands.  I've never had \"Mexican Chocolate\", so maybe this is what it is supposed to be like, but I didn't like it at all.  It was hard as a rock, tasteless, and messy.  I followed the instructions of boiling some milk, chopping the chocolate in my blender, and mixing it together.  It came out foamy, like one reviewer described, but I was surprised to find it tasteless and flat!!  I ended up adding 4 T. of my standard coco mix just so I could finish the drink.  This was not at all what I expected, so if any of those three reviewers are looking for an open package, you can purchase mine!  In one word: YUCK!!!", "summary": "Sadly disappointed in this product", "unixReviewTime": 1136332800}
{"overall": 5.0, "vote": "20", "verified": false, "reviewTime": "10 10, 2005", "reviewerID": "A1QNYL4OUPCN7V", "asin": "B0000GH6UG", "reviewerName": "Hoopty", "reviewText": "There is nothing better than Ibarra hot chocolate! But all you really have to do is put two wedges of the chocolate, roughly chopped, into the blender with a cup of hot milk and frappe it. No simmering needed! (I nuke the milk.) Mmm, foamy and delicious!", "summary": "Amazing, and easier to prepare than the above instructions...", "unixReviewTime": 1128902400}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 12, 2005", "reviewerID": "ACA1GW3LZO481", "asin": "B0000GH6UG", "reviewerName": "queenie1", "reviewText": "If you've never had Mexican hot chocolate, you are in for a real treat. This is also addictive to eat alone, although the sugar makes it grainy.\n\nTo go along with your cup of Mexican hot chocolate, get the movie `Chocolat' with Johnny Depp and Juliette Binoche. Watch for something special that Vianne adds to her hot chocolate that she learned from her Mexican mother and watch her customers' reactions!", "summary": "Great to the last drop!", "unixReviewTime": 1105488000}
{"overall": 5.0, "verified": false, "reviewTime": "11 28, 2004", "reviewerID": "A2SJJ0LJYXE2KB", "asin": "B0000GH6UG", "reviewerName": "nancy erickson", "reviewText": "the best way to enjoy this is as hot chocolate. mix 2 wedges of chocolate with 6-8 ounces of milk and heat until dissolved. pour mixture into a blender and beat for 30 seconds on high. delicious!", "summary": "i love this chocolate", "unixReviewTime": 1101600000}
{"overall": 4.0, "vote": "8", "verified": false, "reviewTime": "01 10, 2004", "reviewerID": "A1J2NULS2YDNAQ", "asin": "B0000GH6UG", "reviewerName": "Matt Cromwell", "reviewText": "I was first turned onto this chocolate when I visited a private Mexican themed coffee shop. I love a good mocha and that's usually how I judge a coffee shop first. This mocha was one-of-a-kind! I had to know what was in it. It was IBARRA!\nBasically, Mexican chocolate is pure cocoa with cinnamon. IBARRA also adds some sugar and an emulsifier (which is why I only give it 4 stars). I have made mochas and hot chocolates at home and my guests think I'm a god (maybe an Aztec god!). It just really brings an orginal taste unlike any of those other cheap sugary brands (Nestle, Hershey's, ect.).\nI highly recommend it. But two suggestions: IBARRA comes in \"bricks\" that you must chop or grind. We use a coffee bean grinder, but make sure it's a good quality grinder or cut the pieces into smaller pieces. Otherwise you might have a broken coffee bean grinder. For a real authentic feel you can use a stone and pistol just fine. And a recipe suggestion: Grind a portion of a Hazelnut for an added spice. ENJOY!", "summary": "Chocolate Like You've Never Had It!", "unixReviewTime": 1073692800}
{"overall": 1.0, "vote": "3", "verified": false, "reviewTime": "02 2, 2015", "reviewerID": "A2OPSAK2UVOW22", "asin": "B0000GH6UG", "reviewerName": "Bradley J. Hanson", "reviewText": "I bought this to make mexican mole.  I took a bite of it first and I wanted to spit it out.  It has an awful taste that is nothing like chocolate.  It is full of coarse gritty sugar crystals and heavy fat (lard) and chocolate liquor.  I still used it in the recipe thinking it was baking chocolate and would taste good in the recipe.  After eating it I had severe stomach cramps bloating and foul odor of sulfur gas farts.  I looked up the ingredients and found out it is on the FDA CDC and poison control center warning lists.  It is made in Mexico and may contain lead.  Mexico uses lead in their food processing for dyes and equipment and packaging.  There is no safe amount of exposure to lead.  Pregnant woman, breastfeeding woman and children should not consume this product.  To be on the safe and considering it tastes awful and causes bloating and bad gas I will avoid it too.", "summary": "MAY CONTAIN LEAD!!! DO NOT CONSUME", "unixReviewTime": 1422835200}
{"overall": 5.0, "verified": true, "reviewTime": "02 1, 2015", "reviewerID": "AJHQA36B3C3W3", "asin": "B0000GH6UG", "reviewerName": "Carla Laris", "reviewText": "I Love this hot Chocolate! Very traditional taste.", "summary": "Its Perfect", "unixReviewTime": 1422748800}
{"overall": 3.0, "verified": true, "reviewTime": "01 27, 2015", "reviewerID": "A10JS70MFT8HUB", "asin": "B0000GH6UG", "reviewerName": "S. Geronimus", "reviewText": "I bought this thinking it was powder for Mexican hot chocolate or cocoa because of the picture on the box and because I thought I was being suggested something I have bought in the past.  It turns out to be wheels of thick chocolate with this granulated sugary stuff inside. There are indentations around the wheel suggesting slices like pieces of pie, but this stuff is very hard to cut. I have tried and the chocolate goes flying everywhere. You certainly cannot break off a piece and it is too much to just bite into. Too sweet for my sweet tooth. Hard to portion control. Now reading other reviews, I see it is supposed to be used for hot chocolate, but there are no directions on the package, and the wedges are very hard to break off (I have yet to succeed.)", "summary": "This is hard chocolate, not hot chocolate powder or mix!", "unixReviewTime": 1422316800}
{"overall": 5.0, "verified": true, "reviewTime": "01 25, 2015", "reviewerID": "AFJ4DTILURYVH", "asin": "B0000GH6UG", "reviewerName": "J. Espinoza", "reviewText": "Can't beat it", "summary": "Five Stars", "unixReviewTime": 1422144000}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "11 15, 2014", "reviewerID": "A7KGGMKQ1LEVH", "asin": "B0000GH6UG", "reviewerName": "Roxanna", "reviewText": "This was gross.  I gave it to my son.  Buy Taza, it's 100x better.", "summary": "Yuck", "unixReviewTime": 1416009600}
{"overall": 5.0, "verified": true, "reviewTime": "11 8, 2014", "reviewerID": "A2QTC5B81K29JD", "asin": "B0000GH6UG", "reviewerName": "BPC", "reviewText": "I've been drinking mine with (vanilla) soy milk and it's good. I heat the soy milk stove top, drop in one wedge for every 8-12 ounces of milk, two wedges for my 16 oz mug, for a light brown color; any more and the chocolate takes a little longer to dissolve AND it gets too sweet. I stir constantly as the milk gets hotter and the chocolate dissolves; blender not needed. Very few bits remain undissolved at the bottom even after stirring a long time, which I just leave in the pan as I pour it into the mug. A thin film of something develops over the drink as it cools, which is easily removed with a spoon and might be unique to soy milk.\n\nEach tablet/cake has 8 wedges, and each package has 5 tablets. 40 servings total. The wedges are easy to break off by hand, harder if you try to cut it with a knife, though it doesn't hurt to make the indent a little deeper with a knife.", "summary": "Good with soy milk, too", "unixReviewTime": 1415404800}
{"overall": 5.0, "verified": false, "reviewTime": "10 20, 2014", "reviewerID": "A21D037PSROQTT", "asin": "B0000GH6UG", "reviewerName": "Everett Vasquez", "reviewText": "ty", "summary": "Five Stars", "unixReviewTime": 1413763200}
{"overall": 5.0, "verified": false, "reviewTime": "09 13, 2014", "reviewerID": "A1O8O9CX2KW8CL", "asin": "B0000GH6UG", "reviewerName": "KellyK", "reviewText": "You'd think in Dallas I'd be able to find this pretty easily, but no. Everyone seems to carry the inferior Abuelita. Even Fiesta grocery store! Glad to know I can get it on line. This makes THE best hot chocolate drink ever. An older review stated it had gone bad because it had white on it. The white is called the \"bloom\". This chocolate has a high percentage of sugar and the sugar \"bloom\" is just a result of fluctuating temperatures. It does NOT mean the chocolate is bad. This is drinking chocolate in bar form but it is not a bar of chocolate you would just eat. Heat up some milk (vanilla almond milk for me) toss in 2 or 3 wedges (or as many you like) and let it dissolve while whisking briskly Or just throw it in the Vitamix to make it extra smooth. Just sorry I couldn't find any today. Having a cold snap and some Ibarra would've been perfect tonight.", "summary": "... think in Dallas I'd be able to find this pretty easily, but no", "unixReviewTime": 1410566400}
{"overall": 5.0, "verified": true, "reviewTime": "08 26, 2014", "reviewerID": "AGE56D7QK9BMX", "asin": "B0000GH6UG", "reviewerName": "Hilary Nickless", "reviewText": "One of my favorite hot chocolates in the entire world! It has a nice cinnamon-y, almost cappuccino-like flavor to it, and is so creamy and delicious.", "summary": "Delicioso!", "unixReviewTime": 1409011200}
{"overall": 4.0, "verified": true, "reviewTime": "03 18, 2014", "reviewerID": "ABMN685EAGEQM", "asin": "B0000GH6UG", "reviewerName": "JBlairNJ", "reviewText": "My wife and I tried making mole sauce which called for Ibarra, and we used a substitute which was OK. However, for authenticity nothing beats Ibarra. The consistency and taste were so much better when we used the proper ingredients. Accept no substitute!", "summary": "Mole", "unixReviewTime": 1395100800}
{"overall": 5.0, "verified": true, "reviewTime": "03 16, 2014", "reviewerID": "A3CT2P2XULW1X5", "asin": "B0000GH6UG", "reviewerName": "Dale Malisiak", "reviewText": "This is the 3rd Mexican Hot Chocolate I've tried since I discovered Mexican Hot Chocolate about a month ago.  It is the best of the three by far.", "summary": "Ibarra Mexican Chocolate, 19 oz", "unixReviewTime": 1394928000}
{"overall": 5.0, "verified": true, "reviewTime": "01 28, 2014", "reviewerID": "A1Z1MF3BGMWB3K", "asin": "B0000GH6UG", "reviewerName": "L. J. Rankins Goodwin", "reviewText": "This is hard to find in Albertsons and Safeway.  Abuelita seems to be the easier one to find, but my family prefers the Ibarra brand, that is why I ordered some onlilne.  It costs more than the other brand but it's what they like.", "summary": "Hard to find in mainstream grocery stores", "unixReviewTime": 1390867200}
{"overall": 5.0, "verified": true, "reviewTime": "01 27, 2014", "reviewerID": "A3PZZK8KMM8HTC", "asin": "B0000GH6UG", "reviewerName": "Linda Wiland", "reviewText": "What can be said?  Yummy, Mexican style chocolate for making hot chocolate with that little hint of cinnamon.  I break off 2 sections of a disc and add to milk in my Aluminum chocolatera and swirl with my molinillo.  Voila!  Yummy hot chocolate to enjoy.", "summary": "Yummy!", "unixReviewTime": 1390780800}
{"overall": 5.0, "verified": true, "reviewTime": "01 26, 2014", "reviewerID": "A1RRGJJEPDVOQ7", "asin": "B0000GH6UG", "reviewerName": "Picabo Bob", "reviewText": "Used it in cookies.  It added a level of richness and an unusual flavoring to otherwise standard recipes.  Give it a try.", "summary": "Mexican Chocolate", "unixReviewTime": 1390694400}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "01 17, 2014", "reviewerID": "A1Y8SG8FA46NWK", "asin": "B0000GH6UG", "reviewerName": "a nice person in MI", "reviewText": "I love chocolate, especially organic, european, high-cocoa & cocoa butter content.  The cocoa butter is not in this product, but a soya lecithin; and the cinnamon is artificial flavoring and apparently not the real spice because it tastes kind of fake.  I've tried Dagoba Xocolatl and liked it but wanted a bit less spicy - this just lost in comparison.  Course sugar is fine but it's just too sweet.  Wanted to like it but don't and am trying to figure out who I can give the rest of the box to.", "summary": "not real cinnamon and too sweet", "unixReviewTime": 1389916800}
{"overall": 1.0, "vote": "3", "verified": false, "reviewTime": "12 30, 2013", "reviewerID": "A3L61G6N7AT8N2", "asin": "B0000GH6UG", "reviewerName": "Bartok Kinski", "reviewText": "When I was incarcerated in a Mexican prison, this was the only drink in the joint. We had to fix it with goat's milk and heat it over an open flame in the yard. The taste is awful. It's not pleasing like the thick, hot Chocolate found in Madrid.", "summary": "taste is awful", "unixReviewTime": 1388361600}
{"overall": 5.0, "verified": false, "reviewTime": "10 9, 2013", "reviewerID": "ASHMCANTHV5JI", "asin": "B0000GH6UG", "reviewerName": "Ann E. Picard", "reviewText": "Ibarra is the real deal. If you want to make authentic Champurrado, or a mexican chocolate drink of your own creation  by adding your own creative flavors. You can't go wrong. The \"gourmet\"  brands that are twice the price are just that, twice the price.", "summary": "Why Pay More When This is IT", "unixReviewTime": 1381276800}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2013", "reviewerID": "A22IYMLYWY9K22", "asin": "B0000GH6UG", "reviewerName": "Steve B", "reviewText": "I really like this Ibarra chocolate. Its the best hot chocolate I've been able to find. I cant get it in stores locally so I have to order it. I think its better than the Abuelita brand. People who don't like the taste or the look of it have to remember that this is Mexican hot chocolate not American hot chocolate. It has a different taste. Its normal for it to have slightly dried white look when its cut open. After all its not a chocolate bar. It has to be stirred for a while to dissolve the sugar. This is normal for mexican hot chocolate.", "summary": "Excellent taste", "unixReviewTime": 1361404800}
{"overall": 4.0, "verified": false, "reviewTime": "12 31, 2012", "reviewerID": "A218ELZRJ67IJM", "asin": "B0000GH6UG", "reviewerName": "Peter Galle", "reviewText": "Supreme hot chokolate\nIbarra Mexican chokalate is the Perfect choice for hot chokolate - easy to make, easy to handle and with a superb taste", "summary": "Ibarra Mexican chokalate", "unixReviewTime": 1356912000}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "10 1, 2012", "reviewerID": "A2V4P3X39U7CNY", "asin": "B0000GH6UG", "reviewerName": "Cory", "reviewText": "I received this product faster than anticipated which was the only plus to the product.  The chocolate was old, crumbly and already turning white. A business partner of mine had recommended this chocolate, but I will have to wait to try it now.", "summary": "Bad chocolate", "unixReviewTime": 1349049600}
{"overall": 5.0, "verified": true, "reviewTime": "02 28, 2012", "reviewerID": "A3AKT4Y5XDXW1I", "asin": "B0000GH6UG", "reviewerName": "Jim", "reviewText": "If you like chocolate (like I do), then you will like this stuff; its the real thing. The hot chocolate drink tastes like what I imagine the Aztecs would have made, with great taste and a 'warm all over' feeling when it goes down. What a treat!", "summary": "Yum Yum", "unixReviewTime": 1330387200}
{"overall": 1.0, "vote": "23", "verified": true, "reviewTime": "01 10, 2012", "reviewerID": "A1BW9CHX86X9FU", "asin": "B0000GH6UG", "reviewerName": "Wren Caulfield", "reviewText": "Extremely disappointed in this product. It barely tastes of cinnamon at all and is downright gross. My main complaint, however, is that it's not chocolate at all. It's a cake of sugar held together with dyed brown vegetable fat with a bit of cocoa liquor thrown in as an afterthought. Unbelievable that they market it as chocolate. And the list of ingredients on this product page conveniently leaves out the fact that it contains vegetable fat, which is clearly states on the package. It also does NOT contain cacao nibs, but rather cheap cacao liqueur. THIS PRODUCT CONTAINS TRANS FATS in the form of manteca/vegetable fat, also known as hydrogenated oil or Crisco. Don't let the legal loophole of \"0 grams\" fool you.", "summary": "NOT chocolate: FALSE LIST OF INGREDIENTS", "unixReviewTime": 1326153600}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "01 1, 2012", "reviewerID": "A37VSMI2V1Z1P5", "asin": "B0000GH6UG", "reviewerName": "J. spencer", "reviewText": "Somewhere I must have missed the wording BAR. The item as a bar did not work for my uses. The taste was restrictive in use. Other than that great product.", "summary": "Not what I expected.", "unixReviewTime": 1325376000}
{"overall": 5.0, "verified": false, "reviewTime": "11 17, 2011", "reviewerID": "A26M6LYYH6KQVS", "asin": "B0000GH6UG", "reviewerName": "overseas shopper", "reviewText": "I love this stuff.  I nuke a mug a milk until it's very hot, drop in 2 of the triangles, stir until the chocolate melts, then froth it with my Aerolatte.  Simple and tasty.", "summary": "Yummy and frothy with an Aerolatte", "unixReviewTime": 1321488000}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "11 11, 2011", "reviewerID": "A1Z7UKTVE57Q9S", "asin": "B0000GH6UG", "reviewerName": "Judy M. Leibowitz", "reviewText": "This chocolate was too hard and bitter for me. Tried it in my coffee and threw both out. Love mexican blend coffee, but not this product.", "summary": "Love good chocolate", "unixReviewTime": 1320969600}
{"overall": 5.0, "verified": true, "reviewTime": "03 25, 2011", "reviewerID": "A2LB86SVX3NDV1", "asin": "B0000GH6UG", "reviewerName": "Person", "reviewText": "Couldn't wait to try this product. Loved the fact I tried it. Easy to make, creamy texture, rich chocolate taste.", "summary": "Rich and creamy", "unixReviewTime": 1301011200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "01 9, 2011", "reviewerID": "ARN4R4NNS2OVA", "asin": "B0000GH6UG", "reviewerName": "Reen", "reviewText": "A friend described the hot chocolate her Mexican mother made for her when she was a kid.  It was nowhere to be fund in Rochester, New York (not even at Wegman's and they have everything).  We had to hunt online because she couldn't remember the name, just what the package looked like.  Of course the shipping was more than the product but next time I'll purchase a volume because it is really good.  It was just as she remembered.", "summary": "hot chocolate mmmmmmmmmm", "unixReviewTime": 1294531200}
{"overall": 5.0, "vote": "15", "verified": false, "reviewTime": "09 6, 2010", "reviewerID": "A15A2DG9MKLFIY", "asin": "B0000GH6UG", "reviewerName": "WestCoastBlue", "reviewText": "Ibarra is made with ground cacao nibs (\"cacao paste\"), not processed chocolate powder, so there is much more theobromine in it than in other chocolate products. If you are looking for a chocolate high, this is the product for you! You don't need a blender either. Just take a good chef's knife, cut off a piece of Ibarra, and slice the knife along one edge, progressively shaving down the block to a powder. Watch your fingers if you do this--we don't need any more Aztec blood sacrifice! Mix well with warm milk and enjoy the drink of the gods!", "summary": "More theobromine, no blender required!", "unixReviewTime": 1283731200}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "04 30, 2010", "reviewerID": "A2DQKKMWQB7PJM", "asin": "B0000GH6UG", "reviewerName": "J. Lody", "reviewText": "This stuff is the BOMB! Dark, Gritty, Sweet, with a bite of cinnamon! We doan need no stinking Hershey's!!! Makes great hot chocolate, great mole, or just savor it by itself as actual \"Chocolate Para Mesa.\"\nMy mole recipe: 1/2 cup flour or corn starch, 1/2 cup cooking oil, 1 Ibarra disc, 1/4 cup minced garlic, 2 Tbsp onion powder, 1 Tbsp cumin powder, 2 Tbsp Chili powder, 1 Tbsp salt, 1/4 cup tequila, 1/2 cup Amontillado (or 1/3 cup merlot and 2 Tbsp brandy). Make rue out of flour and oil, add garlic and spices, stir until blended smoothly. Separately melt/dissolve disc in tequila and wine over moderate heat (do not burn!).  Combine chocolate/alcohol mix with spiced rue and allow to slowly cook down to desired consistency and thickness. Serve over meat and rice.", "summary": "Impresionante!!!!", "unixReviewTime": 1272585600}
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "11 11, 2009", "reviewerID": "AJBFZ07U43KUQ", "asin": "B0000GH6UG", "reviewerName": "T. Martin", "reviewText": "if you've walked into a coffee shop and ordered a mexican mocha and they handed back something with chocolate syrup and cinnamon sprinkled on the top of your drink, then you have not had a mexican mocha.\n\nthree things (maybe four) for a perfect mexican mocha.  espresso(or any good coffee), milk and grated ibarra mexican chocolate(abuelita will do if ibarra is unavailable).  that's it!  the fourth item, should you so choose, is to add a bit of vanilla extract.  try the short menu first and see if just doesn't make you hum with pleasure.  add whipped cream and sprinkle more of the grated chocolate on top.  whatever you feel like doing.  just do it!  you will never be disappointed.\n\ni make at least two of these in a soup-bowl sized mug(you know, the size you get at that cool, funky coffee shop down the street) and a hot shower every morning in order to greet work with a smile.  it is a pleasure so fierce you'll think it's sinful.  they are thick, rich and oh, so very good.  try one at home or ask your favorite (non-starbucks) barrista to make you a latte and add your own ibarra if they don't have it and then ask them if they want a sip.  i wouldn't be at all surprised if mexican mocha showed up on the menu five minutes later.", "summary": "you may be seriously deprived,....", "unixReviewTime": 1257897600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "06 18, 2014", "reviewerID": "A39BRW3XU55852", "asin": "B0001E1IN8", "reviewerName": "Aditya K. Prasad", "reviewText": "I've tried many hot sauces over the years, but I can't remember coming across one that I find as delectable as this. Sure, I still ask for Cholula or Tapatio when eating out, but that's primarily out of habit and the unlikelihood of finding something better. No doubt those are wonderful sauces, but the tangy kick of this li'l guy puts them to shame.", "summary": "I could almost eat (drink) this by itself it's so good", "unixReviewTime": 1403049600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "03 16, 2014", "reviewerID": "A3LKQTD5B9KB46", "asin": "B0001E1IN8", "reviewerName": "Kev N", "reviewText": "I used to have to buy this in large quantities in Mexico so I wouldn't run out but thankfully I can now find it in San Diego.  This is by far my favorite hot sauce.  It doesn't have a strong vinegar taste, just habanero.  I love it.", "summary": "My favorite hot sauce", "unixReviewTime": 1394928000}
{"overall": 5.0, "verified": true, "reviewTime": "03 10, 2014", "reviewerID": "A14JN5JD0KK8K4", "asin": "B0001E1IN8", "reviewerName": "Starr", "reviewText": "This is a product for a country club that I work for. And they keep me ordering it for them as they love the hot flavor.", "summary": "The Country Club", "unixReviewTime": 1394409600}
{"overall": 5.0, "verified": true, "reviewTime": "01 7, 2014", "reviewerID": "A3V7CWJ9O3B30V", "asin": "B0001E1IN8", "reviewerName": "J. Killingbeck", "reviewText": "By far the best taste of any spicy hot sauce that I have tried personally.  I have distant friends that travel to Mexico and bring this stuff back by the case for themselves to give to their friends.  It's that good.  I ran out recently.  Thankfully I found it here on Amazon.  I use it on all sorts of things- pizza, salads with ranch, and of course Mexican fare.  As spicy goes, this is fairly spicy.  Not Ghost pepper spicy, but makes Franks Red Hot or Tabasco seem like water.", "summary": "It's not all about spicy, it's about taste.", "unixReviewTime": 1389052800}
{"overall": 4.0, "verified": true, "reviewTime": "08 29, 2013", "reviewerID": "A2Q1PMQXIS31E8", "asin": "B0001E1IN8", "reviewerName": "Wilemina", "reviewText": "Was good but not exactly what I remembered from living in Texas and getting it. Still a good buy though.", "summary": "Good but not as remembered", "unixReviewTime": 1377734400}
{"overall": 4.0, "verified": false, "reviewTime": "07 4, 2013", "reviewerID": "A2EMQ4ICW8M1U3", "asin": "B0001E1IN8", "reviewerName": "RWJ", "reviewText": "This hot sauce has excellent flavor.  The reviewer who said it isn't that hot so gave it three stars is missing the point.  Sauces like these should have some kick, but hot for hot sake isn't what's important.  For me, it's the combination of spice and flavor that counts, and this is a really nice combination.", "summary": "Excellent flavor", "unixReviewTime": 1372896000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 13, 2013", "reviewerID": "A11RPESISC4G4J", "asin": "B0001E1IN8", "reviewerName": "Joseph", "reviewText": "This hot sauce is pretty good. I've got a thing for spiciness and the bottle speaks hotness. I've had Marie Sharp's hot sauce from Belize and this stuff is on par with it (although I had the Marie Sharp years ago and this is the only thing that reminds me of it). I take some Tapatio and mix this stuff in with it and it's perfect.", "summary": "Extremely good", "unixReviewTime": 1358035200}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "08 30, 2012", "reviewerID": "ALIVNL8DUZ0B", "asin": "B0001E1IN8", "reviewerName": "C. Zeman", "reviewText": "Habaneros are very tasty.  Most people don't know that because habaneros are usually pretty darn hot.  Hot enough to scare people away.\n This sauce has all the wonderful flavor of habaneros without all of the heat.  There's still plenty of heat - enough that a few too many drops out of a fresh bottle will have you running around hooting like an owl.  But it's a clean heat without the unfortunate next-day side effects that come with, say, hot pepper flakes.  I've been eating this stuff for over 15 years, I get it at my local mercado.  There is no better sauce in my humble opinion!  Cheap and very high quality.  Refrigerate after opening to keep the flavor and heat fresh.", "summary": "The good stuff!", "unixReviewTime": 1346284800}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "05 22, 2011", "reviewerID": "A1CNMP3S345BPI", "asin": "B0001E1IN8", "reviewerName": "Josh", "reviewText": "This is my favorite because it doesn't have that horrible vinegar taste that most hot sauces have. It's got a decent kick. I'd say its significantly hotter than Tabasco.", "summary": "Excellent!", "unixReviewTime": 1306022400}
{"overall": 5.0, "verified": true, "reviewTime": "08 18, 2011", "reviewerID": "A1D2ZYEXKQQ8FU", "asin": "B00032E8XK", "reviewerName": "luvstoshop", "reviewText": "This tuna is the only brand that i will buy. i am really picky when it comes to my fish.", "summary": "Best tuna on the market", "unixReviewTime": 1313625600}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "08 10, 2011", "reviewerID": "A2B0ZJ5CYX49TN", "asin": "B00032E8XK", "reviewerName": "Manu", "reviewText": "...but it is edible.  I like the super saver free shipping mainly, otherwise I would purchase another brand.  This is emergency lunch that conveniently gets shipped directly to my office, where I keep it for when I do not have time to step out, but need to have protein.  Most cans are fine, but every now and then, you get a funky can of tuna, which doesn't look right.", "summary": "Not the best", "unixReviewTime": 1312934400}
{"overall": 5.0, "verified": true, "reviewTime": "07 8, 2011", "reviewerID": "A1J52MX2YDWSU0", "asin": "B00032E8XK", "reviewerName": "these pretzels r making me thirsty", "reviewText": "I was among those who were trying to drain the tuna out with the previous lids and most of the tuna/mush would escape out of the side when trying to drain the liquid (I like to give it to my cats as a treat and in addition to their water).  Well this batch I just got I had no problem draining the liquid!  It was a nice tough lid like in the old days of canned tuna.  Made draining so easy!  The tuna was nice and chunky inside.  Very solid, not mushy at all and I really couldn't tell that it was low sodium by the taste.  Tastes great!  I hope they will continue to use these lids!  Thanks Chicken of the Sea!", "summary": "They've improved the lids on the batch I just received!", "unixReviewTime": 1310083200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "05 21, 2011", "reviewerID": "A3A0R815M3WINQ", "asin": "B00032E8XK", "reviewerName": "Richard J. Brockman", "reviewText": "Drain out the water and you have a great product.  I like a little cheese in a soft taco shell with this tuna, just roll it up for a fast lunch.", "summary": "Great Product", "unixReviewTime": 1305936000}
{"overall": 4.0, "vote": "6", "verified": true, "reviewTime": "03 28, 2011", "reviewerID": "A18SUMK4D1VNJ2", "asin": "B00032E8XK", "reviewerName": "Bob Schultz", "reviewText": "What can I say-same as you get anywhere else except a little cheaper, fast delivery and a long expiration date. Will buy again", "summary": "Good old chicken of the sea canned tuna fish in water", "unixReviewTime": 1301270400}
{"overall": 5.0, "vote": "28", "verified": true, "reviewTime": "02 23, 2011", "reviewerID": "A217JGISPCD7X", "asin": "B00032E8XK", "reviewerName": "Grant Bennett", "reviewText": "A lot of tuna at a great price. Exactly what I was looking for. Haven't noticed any taste difference over regular cans Vs Lower Sodium. If you like canned tuna and know how to make it, this is for you. If you are only used to tuna in bags, then you need to know how to drain the cans.\nIt's really easy. Use your can opener, cut the entire top but don't remove it. Take the can over to your sink. Use the freshly cut top to squeeze out the water down your drain. Squeeze slowly until no more water comes out. Now you are ready.\n\nI am describing this only because other reviews of cans on Amazon have labeled them as \"tuna soup\". reviews written by people who haven't used tuna in cans before, and haven't known that you need to drain them.", "summary": "Deliscious and delivered to my door", "unixReviewTime": 1298419200}
{"overall": 1.0, "vote": "12", "verified": false, "reviewTime": "04 23, 2010", "reviewerID": "AH8924TCKHW48", "asin": "B00032E8XK", "reviewerName": "cookwarejunkie", "reviewText": "Salty and rank with an inedible flavor and a mushy, slimy texture. I couldn't even finish the first can and I had 23 more to do. My cat took a few sniffs of it and then walked away. If he won't eat it knowing how my cat loves tuna, I won't either. It's not even pure tuna in water. It contains vegetable broth with soy on top of the salt that's in there. This little can has 350 mg. of sodium. Truly disgusting.\n\nThere's another good review of the same tuna which is the one I saw. Had I seen these I wouldn't have bought this. I'm going to post this on the other page too.", "summary": "Inedible & gross...", "unixReviewTime": 1271980800}
{"overall": 2.0, "vote": "11", "verified": false, "reviewTime": "09 14, 2009", "reviewerID": "A1AZVADRU6Y65T", "asin": "B00032E8XK", "reviewerName": "Syldaril", "reviewText": "I bought a bunch of these from Walgreens just to find that none of the cans had chunks of tuna in them. They should probably re-label this product to \"tuna soup\" since this is really what this is. The pieces are so tiny that they literally ooze out of the can as you drain the water out of it. Plus who in their right mind would name a brand of canned tuna 'Chicken of the Sea'?", "summary": "Tuna soup", "unixReviewTime": 1252886400}
{"overall": 2.0, "vote": "19", "verified": true, "reviewTime": "08 13, 2009", "reviewerID": "A2YI093RCI57PI", "asin": "B00032E8XK", "reviewerName": "rosekelly", "reviewText": "Pros:\n  No fishy smell.\n  More fish particles than liquid.\n  My cat love it.\n\nCons:\n  Grated Tuna NOT Chunk.\n  Very mushy. Cannot be use for topping salad or any recipe that call for Chunk Tuna.\n  Sam's club carry the same thing for A LOT LESS!", "summary": "Cat Food anyone?", "unixReviewTime": 1250121600}
{"overall": 5.0, "verified": true, "reviewTime": "11 10, 2017", "reviewerID": "A3167IQ2CYIMHI", "asin": "B00032E8XK", "reviewerName": "Rose Mary Cisco", "reviewText": "perfect", "summary": "Five Stars", "unixReviewTime": 1510272000}
{"overall": 4.0, "verified": true, "reviewTime": "11 10, 2017", "reviewerID": "ACMSQCH1H7JZD", "asin": "B00032E8XK", "reviewerName": "KED", "reviewText": "It's not solid chunks. It's broken up like it would be before you mix it with mayo for tuna salad. But the taste is great.", "summary": "Jessica Simpson likes it too...", "unixReviewTime": 1510272000}
{"overall": 5.0, "verified": true, "reviewTime": "11 8, 2017", "reviewerID": "A2LUY8LI3VB1D1", "asin": "B00032E8XK", "reviewerName": "R.A.", "reviewText": "Reorder all the time. Tiny bit salty, but for the price, I can live with that.", "summary": "Pantry item!!!", "unixReviewTime": 1510099200}
{"overall": 5.0, "verified": true, "reviewTime": "10 23, 2017", "reviewerID": "A28D5W1R3SD3AX", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "Great product, would definitely recommend to others.", "summary": "Five Stars", "unixReviewTime": 1508716800}
{"overall": 5.0, "verified": true, "reviewTime": "10 4, 2017", "reviewerID": "ARDJ5DMKH00JH", "asin": "B00032E8XK", "reviewerName": "Jolinda Ferrell", "reviewText": "Love the white tuna", "summary": "Five Stars", "unixReviewTime": 1507075200}
{"overall": 5.0, "verified": true, "reviewTime": "10 4, 2017", "reviewerID": "A4NO879SNMFC8", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "Tastes Great!  No hassle.  Froze some for later.", "summary": "YUM!", "unixReviewTime": 1507075200}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "09 27, 2017", "reviewerID": "A2I6KBFBFIORH7", "asin": "B00032E8XK", "reviewerName": "edcaroleg", "reviewText": "When I was younger and still working, I used to eat a can of this \"Chicken of the Sea Tuna Chunk Light in Water\" every day for lunch. It was excellent, the best of several brands I tried. Now that I'm retired,  I decided to try it again. Tuna is such a good source of protein. What used to be pure tuna in water now is tuna mixed with \"vegetable broth containing soy\" What happened? Did the regulations change? Is it no longer profitable to sell \"pure\" tuna in a can of tuna? This stuff is edible but is certainly not very good!", "summary": "Label Should Say \"Tuna In Vegetable Broth\"", "unixReviewTime": 1506470400}
{"overall": 5.0, "verified": true, "reviewTime": "09 27, 2017", "reviewerID": "A1W5BURTOPO8P7", "asin": "B00032E8XK", "reviewerName": "Kindle Customer", "reviewText": "Good", "summary": "Its tuna", "unixReviewTime": 1506470400}
{"overall": 2.0, "verified": true, "reviewTime": "09 15, 2017", "reviewerID": "A1O3WXVFVIU0I1", "asin": "B00032E8XK", "reviewerName": "Rapscallion", "reviewText": "We love tuna in our house and normally the big can will provide less mush.  This is a little better than the small cans, but not by much.  We were very disappointed in this tuna.  The taste is rather bland as well.  Some people might like that, but I like to taste tuna when I eat tuna.  The price is the best anywhere, but unfortunately, I will not be buying again.", "summary": "Great Price, But Not Good Tuna", "unixReviewTime": 1505433600}
{"overall": 5.0, "verified": true, "reviewTime": "08 30, 2017", "reviewerID": "A17KG88LT5FPTY", "asin": "B00032E8XK", "reviewerName": "Skydog", "reviewText": "Very good", "summary": "Five Stars", "unixReviewTime": 1504051200}
{"overall": 5.0, "verified": true, "reviewTime": "08 5, 2017", "reviewerID": "AATICPVQEYSMF", "asin": "B00032E8XK", "reviewerName": "Robert B.", "reviewText": "Chicken?  Hmmm... Tasted like Tuna  :-)", "summary": "Tasted like Tuna: -)", "unixReviewTime": 1501891200}
{"overall": 4.0, "verified": true, "reviewTime": "07 27, 2017", "reviewerID": "A1R56WGS6ZU0V1", "asin": "B00032E8XK", "reviewerName": "Kindle Customer", "reviewText": "Good tuna. mercury and all.", "summary": "Yum.", "unixReviewTime": 1501113600}
{"overall": 5.0, "verified": true, "reviewTime": "07 23, 2017", "reviewerID": "AFZPH5EPKTLT", "asin": "B00032E8XK", "reviewerName": "Happy Camper", "reviewText": "They are good. I have been ordering this for two years now and have no complain.", "summary": "Five Stars", "unixReviewTime": 1500768000}
{"overall": 5.0, "verified": true, "reviewTime": "07 20, 2017", "reviewerID": "A8HQ3JERW1UY5", "asin": "B00032E8XK", "reviewerName": "Bonnie Wilber", "reviewText": "Very good pantry item for daughter who take lunch to work and often makes chicken salad.", "summary": "Five Stars", "unixReviewTime": 1500508800}
{"overall": 3.0, "verified": true, "reviewTime": "07 18, 2017", "reviewerID": "AG5CL3UGUZPWS", "asin": "B00032E8XK", "reviewerName": "Thomas Johnston", "reviewText": "tuna is good for you in small batches", "summary": "Three Stars", "unixReviewTime": 1500336000}
{"overall": 5.0, "verified": true, "reviewTime": "06 12, 2017", "reviewerID": "AAOUQBLRM46YT", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "love tuna!", "summary": "solid white albacore is fantastic!", "unixReviewTime": 1497225600}
{"overall": 2.0, "verified": true, "reviewTime": "06 7, 2017", "reviewerID": "A37QTVGHANWH2N", "asin": "B00032E8XK", "reviewerName": "Shirlok", "reviewText": "Same tuna I've bought for years. Tasted weird and was very \"liquid\". Threw half of it away.", "summary": "Weird", "unixReviewTime": 1496793600}
{"overall": 5.0, "verified": true, "reviewTime": "06 6, 2017", "reviewerID": "AFNO8CUQFZHJW", "asin": "B00032E8XK", "reviewerName": "HS", "reviewText": "I like the size for a quick lunch.", "summary": "Five Stars", "unixReviewTime": 1496707200}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/71VSRQDjrbL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/I/71VkmKxO98L._SY88.jpg"], "overall": 2.0, "verified": false, "reviewTime": "06 5, 2017", "reviewerID": "A1YQ0ACENZPHA1", "asin": "B00032E8XK", "reviewerName": "cc", "reviewText": "Not as good as a store branded one. There were a lot of small shreds, and I thought it was more fishy. Check out the comparison pictures", "summary": "Not as good as a store branded one", "unixReviewTime": 1496620800}
{"overall": 3.0, "verified": true, "reviewTime": "05 28, 2017", "reviewerID": "ABKY9A2303EWD", "asin": "B00032E8XK", "reviewerName": "Kazim", "reviewText": "Did not really care for it.", "summary": "It is ok but not to my taste.", "unixReviewTime": 1495929600}
{"overall": 5.0, "verified": true, "reviewTime": "05 13, 2017", "reviewerID": "A1T0W1X6D6NHFH", "asin": "B00032E8XK", "reviewerName": "CuriousAndCozy", "reviewText": "If you are looking to add fish to your diet, but sometimes find tuna to be a little too \"fishy\" then here is your solution.\n\nYes, it's still fish, but it's sort of like how white meat chicken is compared to dark meat chicken - a little drier and a little less deeper flavor. It makes it great if your family aren't a bunch of fish fans.", "summary": "Tasty", "unixReviewTime": 1494633600}
{"overall": 5.0, "verified": true, "reviewTime": "05 6, 2017", "reviewerID": "A39ODHY313W1FP", "asin": "B00032E8XK", "reviewerName": "G", "reviewText": "Used to have a source for this but when we moved I needed to find another. Price is okay almost :)", "summary": "Great tuna", "unixReviewTime": 1494028800}
{"overall": 5.0, "verified": false, "reviewTime": "04 30, 2017", "reviewerID": "A1F2XDEFUCGO8U", "asin": "B00032E8XK", "reviewerName": "Scott Chapman", "reviewText": "Great Tuna\n3lbs after draining\nGreat for the Atkins Diet", "summary": "Great Tuna 3lbs after draining Great for the Atkins", "unixReviewTime": 1493510400}
{"overall": 3.0, "vote": "5", "verified": true, "reviewTime": "04 25, 2017", "reviewerID": "A1YKD6GWRDD5P7", "asin": "B00032E8XK", "reviewerName": "Mark Spritzler", "reviewText": "I gave it three stars because Chicken of the Sea and the Solid White Albacore Tuna in Water is my favorite tuna. However, this product on Amazon as a single can purchase on the other hand should be AVOIDED AT ALL COSTS.\n\nI ordered almost 100 of these cans, (I said I loved their tune). However, I had to throw away a good 15-20 of them because of either\n\n1) dented cans. The box it was delivered in had the cans just all over the place, such that I am sure the dents occurred in delivery. And I only threw away the extremely dented ones.\n\nMore importantly.\n\n2) Some of the tuna was really really old. Meaning I would open the can and the stench that came out of it, and looking at the tuna is was so dark. You can tell good fresh tuna as it is white/pinkish in color. When it is brown, flush it down!!!!!!.\n\nMy recommendation, which I had done before is buy the version that have wrapping around them in like a 6 pack. As they won't get tossed around, and you might only have to deal with a few bad cans of old tuna.", "summary": "Don't buy the single cans, they dent in delivery and some are old, brown and stinky.", "unixReviewTime": 1493078400}
{"overall": 1.0, "verified": true, "reviewTime": "04 8, 2017", "reviewerID": "AN59BLXBH81TE", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "OLD OLD OLD", "summary": "One Star", "unixReviewTime": 1491609600}
{"overall": 1.0, "verified": true, "reviewTime": "04 3, 2017", "reviewerID": "A3TKVC0HK5R9PX", "asin": "B00032E8XK", "reviewerName": "ANDREA C.", "reviewText": "We did not use the product. It arrived dented.", "summary": "One Star", "unixReviewTime": 1491177600}
{"overall": 5.0, "verified": true, "reviewTime": "03 28, 2017", "reviewerID": "A1YVFROBCFI6IA", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "Boneless Tuna,", "summary": "5.5 ounce can Tuna", "unixReviewTime": 1490659200}
{"overall": 1.0, "verified": false, "reviewTime": "03 24, 2017", "reviewerID": "A3QKN4SZY681RS", "asin": "B00032E8XK", "reviewerName": "d c sullivan-marks", "reviewText": "I opened the can and it appeared as tiny tuna fuzz in a sea of pasty looking vegetable broth mush! Extraneous gobbldy gook to stretch how much tuna they actually have to put in a can and still be able to claim a certain drain weight of actual tuna. Demand more from your food suppliers! Bad job Chicken of the sea!", "summary": "Bad job Chicken of the sea", "unixReviewTime": 1490313600}
{"overall": 3.0, "verified": false, "reviewTime": "03 12, 2017", "reviewerID": "A34DKYE6HHCOOX", "asin": "B00032E8XK", "reviewerName": "Philip", "reviewText": "Too fishy", "summary": "Fishy", "unixReviewTime": 1489276800}
{"overall": 1.0, "verified": false, "reviewTime": "03 11, 2017", "reviewerID": "A1Q250M0Y43A04", "asin": "B00032E8XK", "reviewerName": "Scooper", "reviewText": "I had four cans in my cupboard that I purchased from a local grocer a few months ago. All four cans had an expiration date of 05/07/18. All cans were in perfect condition - no dents or punctures or anything like that. Stored in a my kitchen pantry cupboard so no exposure to extreme temperatures. I went to make a tuna sandwich and found all four cans were completely rancid! They had varying degrees of a black mold like substance growing inside along the edges. They smelled absolutely wretched! There were all varying degrees of slimy sludge no longer resembling food. It made me want to gag so much, and has left me with a strong aversion to canned tuna. I will definitely NOT buy this brand EVER again, even if I do decide I can try tuna again (which I love). I reported all this to the company but doubt it will make a difference. Buyer beware.", "summary": "Spoiled over 1 year before \"best by\" date! Buyer Beware!", "unixReviewTime": 1489190400}
{"overall": 5.0, "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A3GGUF2WSNXCTI", "asin": "B00032E8XK", "reviewerName": "SJ", "reviewText": "I mean... it's tuna.  It's better than other brands, I guess.", "summary": "It's better than other brands", "unixReviewTime": 1488844800}
{"overall": 3.0, "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "AIRIEUZI2TZSJ", "asin": "B00032E8XK", "reviewerName": "Marigrace Lonergan Gleason", "reviewText": "tuna is ok, but small self-opening cans are pretty expensive", "summary": "quality good, but expensive for size", "unixReviewTime": 1488412800}
{"overall": 5.0, "verified": true, "reviewTime": "02 20, 2017", "reviewerID": "AY8XVN09NGFLK", "asin": "B00032E8XK", "reviewerName": "Elizabeth Brailey", "reviewText": "love it", "summary": "Five Stars", "unixReviewTime": 1487548800}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "A1SN94G79WJGPU", "asin": "B00032E8XK", "reviewerName": "greg sorrow", "reviewText": "taken to a food bank...just what they needed", "summary": "Five Stars", "unixReviewTime": 1483401600}
{"overall": 5.0, "verified": true, "reviewTime": "12 31, 2016", "reviewerID": "A12DHQMPGUP3WN", "asin": "B00032E8XK", "reviewerName": "khadina modeste", "summary": "Five Stars", "unixReviewTime": 1483142400}
{"overall": 3.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A37WQJ74HHOGW0", "asin": "B00032E8XK", "reviewerName": "Sandwich", "reviewText": "I feel like different brands of tuna are indistinguishable in terms of taste/quality, but I didn't die after eating this so A+.", "summary": "I feel like different brands of tuna are indistinguishable in terms of ...", "unixReviewTime": 1482969600}
{"overall": 4.0, "verified": true, "reviewTime": "12 13, 2016", "reviewerID": "A2IB5U11QTNH5Y", "asin": "B00032E8XK", "reviewerName": "Frank S.", "reviewText": "AAA+", "summary": "Four Stars", "unixReviewTime": 1481587200}
{"overall": 5.0, "verified": true, "reviewTime": "12 10, 2016", "reviewerID": "A3JNUX86OANAOX", "asin": "B00032E8XK", "reviewerName": "sanford h steinman", "reviewText": "great tuna", "summary": "Five Stars", "unixReviewTime": 1481328000}
{"overall": 5.0, "verified": true, "reviewTime": "12 5, 2016", "reviewerID": "A3TTUL7A81IJGZ", "asin": "B00032E8XK", "reviewerName": "T. La", "reviewText": "One can't go wrong with Chicken of the Sea", "summary": "Decent taste", "unixReviewTime": 1480896000}
{"overall": 1.0, "verified": true, "reviewTime": "12 3, 2016", "reviewerID": "A2MZ9XJG5FQEUB", "asin": "B00032E8XK", "reviewerName": "jean", "reviewText": "Smelled and looked bad. Threw it out.", "summary": "One Star", "unixReviewTime": 1480723200}
{"overall": 1.0, "verified": true, "reviewTime": "11 22, 2016", "reviewerID": "A1GIAKLBQTQ9Q", "asin": "B00032E8XK", "reviewerName": "K Hall", "reviewText": "Poor quality", "summary": "One Star", "unixReviewTime": 1479772800}
{"overall": 5.0, "verified": true, "reviewTime": "11 20, 2016", "reviewerID": "A1K82R24ROO2I7", "asin": "B00032E8XK", "reviewerName": "A. Cheffy", "reviewText": "Great deal for tons O' tuna. Tuna casserole is one of my 'go to' dinners when I'm in a rush. Also, this tuna makes excellent 'tuna cakes'. Great value and no dented cans.", "summary": "Must have for stocking my pantry", "unixReviewTime": 1479600000}
{"overall": 5.0, "verified": true, "reviewTime": "11 11, 2016", "reviewerID": "A2L10BML0VRL29", "asin": "B00032E8XK", "reviewerName": "SanScram", "reviewText": "This is a great product if you have to watch your sodium intake.", "summary": "Great", "unixReviewTime": 1478822400}
{"overall": 5.0, "verified": true, "reviewTime": "11 8, 2016", "reviewerID": "AQ935DJ1JS9AJ", "asin": "B00032E8XK", "reviewerName": "RL Miller", "reviewText": "Good value in terms of cost/oz.  Makes preparing tuna salad much easier than using the 5 oz. cans.  Better quality tuna also.", "summary": "Good value in terms of cost/oz", "unixReviewTime": 1478563200}
{"overall": 5.0, "verified": true, "reviewTime": "11 3, 2016", "reviewerID": "A17YJ8V8CO7EWN", "asin": "B00032E8XK", "reviewerName": "Stephen Maccaferri", "reviewText": "Like tuna?  Can't fish?  These dudes sell tuna fish in a can and it is ready to eat.  Can't go wrong.", "summary": "Like tuna? Can't fish", "unixReviewTime": 1478131200}
{"overall": 4.0, "verified": true, "reviewTime": "11 2, 2016", "reviewerID": "A10TS3755XX7CX", "asin": "B00032E8XK", "reviewerName": "LO", "reviewText": "Just like the store. No complaints.\n\nCans were dented though.", "summary": "Four Stars", "unixReviewTime": 1478044800}
{"overall": 3.0, "verified": true, "reviewTime": "11 1, 2016", "reviewerID": "A1JBN0LOFUMZ14", "asin": "B00032E8XK", "reviewerName": "Night Dove", "reviewText": "Dark colored not white like others I have had. Bit off putting because it is supposed to be solid white.", "summary": "It's tuna fish", "unixReviewTime": 1477958400}
{"overall": 5.0, "verified": true, "reviewTime": "10 23, 2016", "reviewerID": "A93NFLPGNR78M", "asin": "B00032E8XK", "reviewerName": "Marilyn", "reviewText": "love tuna fish", "summary": "tuna", "unixReviewTime": 1477180800}
{"overall": 5.0, "verified": true, "reviewTime": "10 22, 2016", "reviewerID": "A2KM6D229D4HSN", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "Good", "summary": "Five Stars", "unixReviewTime": 1477094400}
{"overall": 1.0, "verified": false, "reviewTime": "10 17, 2016", "reviewerID": "A41W03DWODECT", "asin": "B00032E8XK", "reviewerName": "kandy89", "reviewText": "This is not the tuna I grew up wth. What happened? It is dreadful. Smells awful and is not chunk tuna. It is shredded, mushy, and watery. It is cat food. Any other brand is better.", "summary": "Any other brand is better.", "unixReviewTime": 1476662400}
{"overall": 4.0, "verified": false, "reviewTime": "10 14, 2016", "reviewerID": "A2M2BLB72IHMRR", "asin": "B00032E8XK", "reviewerName": "B", "reviewText": "good", "summary": "Four Stars", "unixReviewTime": 1476403200}
{"overall": 3.0, "verified": true, "reviewTime": "10 10, 2016", "reviewerID": "A1AZAQU63WRAS5", "asin": "B00032E8XK", "reviewerName": "Sharon Keniston", "reviewText": "to much mushy... too little whole pcs.", "summary": "loose - only good for stuffing.", "unixReviewTime": 1476057600}
{"overall": 5.0, "verified": true, "reviewTime": "09 24, 2016", "reviewerID": "A3DDD82MP6I4IC", "asin": "B00032E8XK", "reviewerName": "S.K. Bowen", "reviewText": "Love Tuna.  Mostly either in a sandwich or in a casserole.  Finished off a case, and will have to get a new one soon.", "summary": "Tuna Sandwich Anyone?", "unixReviewTime": 1474675200}
{"overall": 5.0, "verified": true, "reviewTime": "09 22, 2016", "reviewerID": "A1ZR3UA83CPCEX", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "good product, lower mercury content (than solid white tuna) and great price, delivered to my door.", "summary": "good tuna", "unixReviewTime": 1474502400}
{"overall": 5.0, "verified": true, "reviewTime": "09 14, 2016", "reviewerID": "A1GJJIG9G49Z8Z", "asin": "B00032E8XK", "reviewerName": "Debra in Reno", "reviewText": "Very tasty. Not fishy at all. Love it as a sandwich with mayo", "unixReviewTime": 1473811200}
{"overall": 5.0, "verified": true, "reviewTime": "09 10, 2016", "reviewerID": "A2LIG22GIS24NR", "asin": "B00032E8XK", "reviewerName": "Derick Taylor", "reviewText": "It's tuna. In a can", "summary": "Five Stars", "unixReviewTime": 1473465600}
{"overall": 5.0, "verified": true, "reviewTime": "09 7, 2016", "reviewerID": "AAB3ULI1FOJ5E", "asin": "B00032E8XK", "reviewerName": "linda crandall", "reviewText": "I always order my tuna from Amazon site. love this brand of tuna and good value on this product.", "summary": "Love this tuna!", "unixReviewTime": 1473206400}
{"overall": 5.0, "verified": true, "reviewTime": "08 27, 2016", "reviewerID": "A2BQQEY8BHQBX3", "asin": "B00032E8XK", "reviewerName": "David Rickel", "reviewText": "Great Stuff, cheaper than buying in store", "summary": "Five Stars", "unixReviewTime": 1472256000}
{"overall": 5.0, "verified": true, "reviewTime": "08 25, 2016", "reviewerID": "A3O50VUD2SZOWA", "asin": "B00032E8XK", "reviewerName": "Dorie51", "reviewText": "Good purchase.", "summary": "Five Stars", "unixReviewTime": 1472083200}
{"overall": 5.0, "verified": true, "reviewTime": "08 17, 2016", "reviewerID": "AWBBFXTYT2ZNA", "asin": "B00032E8XK", "reviewerName": "Annie", "reviewText": "I stock up on this product, have used for decades. Will continue to buy.", "summary": "Five Stars", "unixReviewTime": 1471392000}
{"overall": 5.0, "verified": false, "reviewTime": "08 12, 2016", "reviewerID": "A1NM7I630PG68B", "asin": "B00032E8XK", "reviewerName": "Kindle Customer", "reviewText": "It was tasty tuna. Lots of meat in the can. Worth the price.", "summary": "Good Tuna", "unixReviewTime": 1470960000}
{"overall": 5.0, "verified": true, "reviewTime": "08 8, 2016", "reviewerID": "A2CF7X6BUGRVW1", "asin": "B00032E8XK", "reviewerName": "CHERYL A CAPRIOTTI", "reviewText": "GREAT DEAL!", "summary": "Five Stars", "unixReviewTime": 1470614400}
{"overall": 3.0, "verified": false, "reviewTime": "08 7, 2016", "reviewerID": "A14UWKY7L15UUB", "asin": "B00032E8XK", "reviewerName": "Steven Rapp", "reviewText": "too expensive. Pop top is super convenient feeding cat when I wake in the morning which earned it third star. Of course it is a lot of water--he prefers it to dryer Albacore. I have never tasted it.", "summary": "Odysseus the cat loves it BUT...", "unixReviewTime": 1470528000}
{"overall": 3.0, "verified": true, "reviewTime": "07 31, 2016", "reviewerID": "A2ESMTXYCBTPIT", "asin": "B00032E8XK", "reviewerName": "E. A. Russell", "reviewText": "this batch had way too much water in each can, that is cheating and cheap people.  do better.", "summary": "too much water per can", "unixReviewTime": 1469923200}
{"overall": 5.0, "verified": true, "reviewTime": "07 28, 2016", "reviewerID": "A2HPKSU4YW1YYK", "asin": "B00032E8XK", "reviewerName": "David Evans", "reviewText": "What can you say", "summary": "Five Stars", "unixReviewTime": 1469664000}
{"overall": 3.0, "verified": true, "reviewTime": "07 14, 2016", "reviewerID": "A2NBPWCCOKS8ZZ", "asin": "B00032E8XK", "reviewerName": "M. C. Moy", "reviewText": "Wish they have it in olive oil.", "summary": "Three Stars", "unixReviewTime": 1468454400}
{"overall": 5.0, "verified": true, "reviewTime": "06 20, 2016", "reviewerID": "A3L7HNIDF4WQIM", "asin": "B00032E8XK", "reviewerName": "1st Cav Medic", "reviewText": "Gave it to my dog with her dinner every night.", "summary": "Five Stars", "unixReviewTime": 1466380800}
{"overall": 1.0, "vote": "4", "verified": true, "reviewTime": "06 4, 2016", "reviewerID": "A134JYVC226CVG", "asin": "B00032E8XK", "reviewerName": "Ireckon", "reviewText": "I thought this would be a good choice but I was mistaken.  While the date on the cans still had time on them and stamped product of Thailand... the tuna was not appealing to eat.  Maybe I am spoiled by normally eating \"Starkist Chunk Light Tuna in water\" but after two cans of the 24 I had to go local and buy my normal and throw the rest away.", "summary": "Did not sit well with me...", "unixReviewTime": 1464998400}
{"overall": 5.0, "verified": true, "reviewTime": "05 26, 2016", "reviewerID": "A2H9DS91C64L88", "asin": "B00032E8XK", "reviewerName": "T. Krill", "reviewText": "good stuff.", "summary": "Five Stars", "unixReviewTime": 1464220800}
{"overall": 4.0, "verified": true, "reviewTime": "05 15, 2016", "reviewerID": "A2MC3GD3FO97FF", "asin": "B00032E8XK", "reviewerName": "C. Lyons", "reviewText": "This came in a typical case unit box for cans.\nIt arrived in good condition with no damaged cans.", "summary": "It arrived in good condition with no damaged cans", "unixReviewTime": 1463270400}
{"overall": 4.0, "verified": false, "reviewTime": "05 3, 2016", "reviewerID": "A22GU2QQJZHEHU", "asin": "B00032E8XK", "reviewerName": "J a m i e", "reviewText": "It's full of water... But I keep on buying because the taste is good. I love having it with crackers.", "summary": "4", "unixReviewTime": 1462233600}
{"overall": 5.0, "verified": true, "reviewTime": "04 11, 2016", "reviewerID": "A2MCLQN9W0GE7L", "asin": "B00032E8XK", "reviewerName": "busy_mama", "reviewText": "Pros\n+ This is the brand I buy at the local grocery store so to get it delivered for a good price just helps me out.\n+ You are getting a whole case/tray so it is wrapped up in plastic on a cardboard tray. I leave it in the package and make a hole on one side and use it like a dispenser :)\n\nCons\nnone so far", "summary": "... grocery store so to get it delivered for a good price just helps me out", "unixReviewTime": 1460332800}
{"overall": 3.0, "verified": true, "reviewTime": "04 6, 2016", "reviewerID": "ADA91975K0DL2", "asin": "B00032E8XK", "reviewerName": "Paige Turner", "reviewText": "Next time I'll think about getting the more expensive white albacore, since this stuff is really tiny shreds rather than chunks and is a pain to drain the water off without wasting. Otherwise it's perfectly OK.\nOh, and the lids aren't pull top, so you'll need a can opener for each of at least 6 cans to make tuna salad worthwhile.", "summary": "Think again", "unixReviewTime": 1459900800}
{"overall": 5.0, "verified": true, "reviewTime": "04 5, 2016", "reviewerID": "A3SBZQPX00Y5LY", "asin": "B00032E8XK", "reviewerName": "MARK B. BURNS", "reviewText": "a+", "summary": "Five Stars", "unixReviewTime": 1459814400}
{"overall": 5.0, "verified": true, "reviewTime": "03 30, 2016", "reviewerID": "A2FR9RZ9KN76FH", "asin": "B00032E8XK", "reviewerName": "Gary Zwick", "reviewText": "excellent tuna and prices and delivery", "summary": "Five Stars", "unixReviewTime": 1459296000}
{"overall": 2.0, "verified": true, "reviewTime": "03 30, 2016", "reviewerID": "AFQRD8UY20DJ7", "asin": "B00032E8XK", "reviewerName": "amdg", "reviewText": "Tuna quality is OK. Lowered sodium is a plus. Packed with an inordinate amount of water and therefore is wildly overpriced. Would not purchase again.", "summary": "Watery", "unixReviewTime": 1459296000}
{"overall": 5.0, "verified": true, "reviewTime": "03 18, 2016", "reviewerID": "A3FWTV1T0E2L6X", "asin": "B00032E8XK", "reviewerName": "Rivka A. Strom", "reviewText": "Just the right size for a small portion of tuna salad to be made into a salad or sandwich.", "summary": "Right size", "unixReviewTime": 1458259200}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "03 17, 2016", "reviewerID": "A2GKIVHC4JDJHY", "asin": "B00032E8XK", "reviewerName": "Larry Stevenson", "reviewText": "This is a product from China and is the poorest excuse for something that is supposed to be consumed by humans I've ever seen!  WE will -never- by this brand of Tuna again.", "summary": "From China!!!!!", "unixReviewTime": 1458172800}
{"overall": 5.0, "verified": true, "reviewTime": "03 15, 2016", "reviewerID": "A1WXTUXANILNR9", "asin": "B00032E8XK", "reviewerName": "Amazon Customer", "reviewText": "Very good", "summary": "Five Stars", "unixReviewTime": 1458000000}
