{"reviewerID": "A1YS9MDZP93857", "asin": "0006428320", "reviewerName": "John Taylor", "helpful": [0, 0], "reviewText": "The portfolio is fine except for the fact that the last movement of sonata #6 is missing. What should one expect?", "overall": 3.0, "summary": "Parts missing", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"}
{"reviewerID": "A3TS466QBAWB9D", "asin": "0014072149", "reviewerName": "Silver Pencil", "helpful": [0, 0], "reviewText": "If you are a serious violin student on a budget, this edition has it all: Piano accompaniment, low price, urtext solo parts, and annotations by Maestro David Oistrakh where Bach's penmanship is hard to decipher.  Additions (in dashes) are easily distinguishable from the original bowings.  This is a delightful concerto that all intermediate level violinists should perform with a violin buddy.  Get your copy, today, along with \"The Green Violin; Theory, Ear Training, and Musicianship for Violinists\" book to prepare for this concerto and for more advanced playing!", "overall": 5.0, "summary": "Perform it with a friend, today!", "unixReviewTime": 1370476800, "reviewTime": "06 6, 2013"}
{"reviewerID": "A3BUDYITWUSIS7", "asin": "0041291905", "reviewerName": "joyce gabriel cornett", "helpful": [0, 0], "reviewText": "This is and excellent edition and perfectly true to the orchestral version!  It makes playing Vivaldi a joy!  I uses this for a wedding and was totally satisfied with the accuracy!", "overall": 5.0, "summary": "Vivalldi's Four Seasons", "unixReviewTime": 1381708800, "reviewTime": "10 14, 2013"}
{"reviewerID": "A19K10Z0D2NTZK", "asin": "0041913574", "reviewerName": "TexasCowboy", "helpful": [0, 0], "reviewText": "Perfect for someone who is an opera fan or a working musician.Aida:  Aida (sometimes spelled Ada, pronounced ah-EE-dah, is an Arabic female name meaning \"visitor\" or \"returning\") is an opera in four acts by Giuseppe Verdi to an Italian libretto by Antonio Ghislanzoni, based on a scenario written by French Egyptologist Auguste Mariette. Aida was first performed at the Khedivial Opera House in Cairo on 24 December 1871, conducted by Giovanni Bottesini.Overview: Aida, an Ethiopian princess, is captured and brought into slavery in Egypt. A military commander, Radames, struggles to choose between his love for her and his loyalty to the Pharaoh. To complicate the story further, Radames is loved by the Pharaoh's daughter Amneris, although he does not return her feelings.", "overall": 5.0, "summary": "Full score: voice and orchestra", "unixReviewTime": 1285200000, "reviewTime": "09 23, 2010"}
{"reviewerID": "A14X336IB4JD89", "asin": "0201891859", "reviewerName": "dfjm53", "helpful": [0, 1], "reviewText": "How many Nocturnes does it contain? All of them? Some?Unable to determnine contents therefore, hard to decide if this is what I need/want.", "overall": 1.0, "summary": "Unable to determine contents", "unixReviewTime": 1350432000, "reviewTime": "10 17, 2012"}
{"reviewerID": "A2HR0IL3TC4CKL", "asin": "0577088726", "reviewerName": "scarecrow \"scarecrow\"", "helpful": [0, 0], "reviewText": "this was written for Carin Levine in 2008, but not premiered until 2011 at the Musica Viva Fest in Munich. .the work's premise maybe about the arduousness, nefarious of existence, how we all \"Work\" at life, at complexity, at densities of differing lifeworlds. Ferneyhough's music might suggest that these multiple dimensions of an ontology exist in diagonals across differing spectrums of human cognition, how we come to think about an object,aisthetic shaped ones, and expressionistic ones as his music.The work has a nice classical shape,and holds the \"romantic\" at bay; a mere 7 plus minutes for Alto Flute, a neglected wind cadre member.The work has gorgeous arresting moments with a great bounty of extended timbres-pointillistic bursts\" Klangfarben Sehr Kraeftig\" that you do grow weary of; it is almost predictable now hearing these works; you know they will inhabit a dense timbral space of mega-speed lines tossed in all registers;still one listens; that gap Freud speaks about, that we know we need this at some level. . .the music slowed at times for structural rigour.. .  we have a dramatic causality at play in the subject,(the work's title) the arduousness of pushing, aspiring, working toward something; pleasurable illuminating or not, How about emancipation from itself;I guess we need forget the production of surplus value herein,even with the rebellions in current urban areas today; It has no place. . .  these constructions  are leftovers from modernity, the \"gods\" still hover. . .\"gods\" that Ferneyhough has no power to dispel. . . . All are now commonplace for the new music literature of music.This music still sound quite stunning, marvelous and evocative today,it is simple at some level, direct, unencumbered and violent with spit-tongues,gratuitous lines, fluttertongue,percussive slap-keys,tremoli wistful glissandi harmonics, fast filigreed lines, and simply threadbare melos, an austere fragment of what was a melody. . .Claudio Arrau said someplace that the performer the musician must emanate a \"work\" while playing music, a \"struggle\", aesthetic or otherwise, Sviatoslav Richter thought this grotesque, to look at a musician playing the great music. It was ugly for him. . .You can hear Ms.Levine on youtube playing her work, she is quite convincing, you always need to impart an authority,succored in an emotive focus that the music itself has not succumbed to your own possession. You play the music, it doesn't \"play\" you. . . I'd hope though that music with this arduous construction and structural vigour that it would in fact come to possess the performer. . .it is one of the last libidinal pleasures remaining. . .", "overall": 5.0, "summary": "arduous indeed!", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A2DHYD72O52WS5", "asin": "0634029231", "reviewerName": "Amazon Customer \"RCC\"", "helpful": [0, 0], "reviewText": "Greg Koch is a knowledgable and charismatic host. He is seriously fun to watch. The main problem with the video is the format. The lack of on-screen tab is a serious flaw. You have to watch very carefully, have a good understanding of the minor pentatonic, and  basic foundation of blues licks to even have a chance at gleening anything from this video.If you're just starting out, pick up the IN THE STYLE OF series. While this series has its limitations (incomplete songs due to copyright, no doubt), it has on screen tab and each lick is played at a reasonably slow speed. In addition, their web site has downloadable tab.However, if you can hold your own in the minor pentatonic, give this a try. It is quite a workout and you'll find yourself a better player having taken on the challenge.", "overall": 3.0, "summary": "GREAT! BUT NOT FOR  BEGINNERS.", "unixReviewTime": 1119571200, "reviewTime": "06 24, 2005"}
{"reviewerID": "A1MUVHT8BONL5K", "asin": "0634029347", "reviewerName": "Amazon Customer \"clapton music fan\"", "helpful": [2, 12], "reviewText": "I bought this DVD and I'm returning it.  The description and editorial review are misleading.  This is NOT a Clapton video.  Certainly some clips from Clapton, but generally this is a \"how to\" video.  Same applies to Clapton  The Early Years!", "overall": 2.0, "summary": "NOT CLAPTION MUSIC VIDEO!  A Learn How To Play Guitar LIKE Clapton", "unixReviewTime": 1129334400, "reviewTime": "10 15, 2005"}
{"reviewerID": "A15GZQZWKG6KZM", "asin": "0634029347", "reviewerName": "Robert Wright", "helpful": [0, 1], "reviewText": "I was looking for a concert, not instructions to play his songs. A total waste of money. It should have said that it was for instruction.", "overall": 1.0, "summary": "I was disapointed", "unixReviewTime": 1387584000, "reviewTime": "12 21, 2013"}
{"reviewerID": "A16WE7UU0QD33D", "asin": "0634029347", "reviewerName": "S. R. Mcdonald", "helpful": [1, 8], "reviewText": "If you are an unabashed EC fan (as I am), you must own thispiece of history!! It takes you from the obscure artist he wasin the early years,to the Mega-star he is today!! Your EricClapton library won't be complete without it!!", "overall": 5.0, "summary": "Solo Years Revisited", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"}
{"reviewerID": "AXMWZYP2IROMP", "asin": "0634029355", "reviewerName": "Alex", "helpful": [2, 2], "reviewText": "I was carefull to choose this DVD because it had early work on it , but i was dissapointed by the level of instruction. Even though i feel it is aimed at beg. to intermed. players the guy who is 'instructing' could really do a beter job of spelling out the riffs and runs. for example he might say'ok this song starts with some hammer-ons and pull-offs (plays riffs) and then goes into A7 to Gmaj' just as an example. This is frustrating because i end up rewinding many times to make sure im playing the correct notes- what would be so much better is if he took the time and effort to say ' this run startes 2nd fret on the G  pull off to open G then...' and so on spelling out the notes. this assures accuracy and ultimately saves time and frustration ( I feel strongly about this because i have purchases other DVD's that are dome that way and the difference is noght to day)Also not all songs are not complete- for example white room is missing solo- layla is missing outro solo so its just studies of the songs reallyAfter watching, i kinda feel my money would have been beter spent on a book of TAB, but at the end of the day i feel i will get a handle on the songs that attracted me to this DVD , but buyer be informed!", "overall": 2.0, "summary": "not great instruction", "unixReviewTime": 1352419200, "reviewTime": "11 9, 2012"}
{"reviewerID": "A1MUVHT8BONL5K", "asin": "0634029355", "reviewerName": "Amazon Customer \"clapton music fan\"", "helpful": [3, 17], "reviewText": "I bought this DVD and I'm returning it.  The description and editorial review are misleading.  This is NOT a Clapton video.  Certainly some clips from Clapton, but generally this is a \"how to\" video.  Also applies to Clapton The Solo Years.", "overall": 2.0, "summary": "NOT CLAPTION MUSIC VIDEO!  A Learn How To Play Guitar LIKE Clapton", "unixReviewTime": 1129334400, "reviewTime": "10 15, 2005"}
{"reviewerID": "A6DCKXX4659CR", "asin": "0634029355", "reviewerName": "Hotshot \"Hotshot\"", "helpful": [2, 2], "reviewText": "Unless you are someone who dosen't have a clue and you mistake this DVD of Guitar Instruction for live Clapton Concert Footage: You will thoroughly enjoy this item.  This DVD is very well done: I would rate it excellent in the line of \"Signiture Licks\" instructional video. I would rate it up there with the Hendrix \"Learn to Play Songs from Are You Experienced\" video/DVD by Hal Leonard. This Clapton stroll down nostalgic lane is not as comprehensive as that but it is of the same superior quality.  I could have wished for more songs to be included but the ones that are included are must know songs for any Clapton student.  If you want live concert try the most recent \"Live at Albert Hall Reunion Concert\" : Even though the band seems uninspired and tired and the audiance seems way too subdued for a Cream concert, the music is still vibrant. I've been playing for almost 30 years and Clapton is one of my favorite teachers.  I still found the DVD very helpfull.  Beginner or seasoned vet will find much practical information and tips herein.  The instruction is clear and conscise. The Songs are Great! The tips and tricks are informative.  I couldn't let one misguided simpleton ruin this treasure for the rest of us. I highly recommend this DVD.", "overall": 5.0, "summary": "CLAPTON GUITAR INSTRUCTIONAL : ROCKS !", "unixReviewTime": 1189728000, "reviewTime": "09 14, 2007"}
{"reviewerID": "A28YJZCV43ZWQW", "asin": "0634029355", "reviewerName": "James V. Signorile", "helpful": [3, 3], "reviewText": "I've played guitar for over 40 years, but it's been mostly folk music and classical and I only got bitten by the Blues Bug about 2-3 years ago - and EC was the prime reason for that (and also for my initially starting guitar back in '67 when he was in Cream, but I was looking at it more from a Rock than Blues perspective back then, not understanding when I was 15 how Rock evolved and is based on the Blues).I first used this DVD to learn White Room and Sunshine of Your Love - Doug Bodouch is fantastic at playing and explaining how and why Clapton played it the way he did.  I was able to join a Blues Band playing lead guitar only a few months after buying this because of the proficiency I picked up by learning and playing along with Doug on these DVDs (I also got the Solo Years and Acoustic Classics).These are HIGHLY recommended by me, and no where does it state these are lessons *BY* Eric Clapton (good luck finding that!).Jim", "overall": 5.0, "summary": "First rate lessons on Clapton classics", "unixReviewTime": 1206489600, "reviewTime": "03 26, 2008"}
{"reviewerID": "A2I4CV4PGZCNAF", "asin": "0634029355", "reviewerName": "Josh Hayden", "helpful": [2, 3], "reviewText": "This isn't worth your money. Doug runs through each song in about three or four minutes, he doesn't give you time to learn it.Unless you've already mastered transcribing (and then why buy this dvd?), you're going to be left to rewinding a million times to get the right notes.This is no better than a youtube video of someone playing a bunch of clapton songs.Doug doesn't even show you the rhythm or other guitar parts! You're left only knowing the lead!What sense does that make?", "overall": 2.0, "summary": "Don't waste your money.", "unixReviewTime": 1271721600, "reviewTime": "04 20, 2010"}
{"reviewerID": "A1M7OWNI93N1Y3", "asin": "0634029363", "reviewerName": "geronimo", "helpful": [1, 1], "reviewText": "As much as I like doug boduch as a guitar player and teacher, All songs on this particular dvd,were not explained as they should have been. He plays at tempo, then starts playing slow, but without saying what fret, string etc, sould be played (no tab either)....On one part he even states: \"you play this chord,over here, and then you play this chord\" wow, that was clear..go figure..Also, NONE of the picking form, or right hand patterns were explained, when the picking part was intricate..Maybe it was a producer's order to \"teach \" this way, but really I was very dissapointed, I expected more. Since I own the tablature book, I didn't have any problem with following the dvd, but if you don't, well, you are in trouble. The dvd is a very good complement for the tab book, or else, SKIP it.", "overall": 2.0, "summary": "not very didactic", "unixReviewTime": 1365897600, "reviewTime": "04 14, 2013"}
{"reviewerID": "A2FEDDUHQAEN97", "asin": "0634029363", "reviewerName": "J. Drinks \"chesapeake chick\"", "helpful": [12, 31], "reviewText": "THIS IS NOT A CLAPTON CONCERT!!! IT'S AN INSTRUCTION MANUAL BY SOMEONE NAMED DOUG BODUCH TO TEACH YOU HOW TO PLAY IN THE CLAPTON STYLE. I WAS VERY DISAPPOINTED AND RETURNED IT UNOPENED", "overall": 1.0, "summary": "clapton acoustic", "unixReviewTime": 1117497600, "reviewTime": "05 31, 2005"}
{"reviewerID": "A338HVUM4AWJY7", "asin": "0634029363", "reviewerName": "Joaquim Do M. Nt \"kinkas\"", "helpful": [8, 8], "reviewText": "For those who may not know the Hal Leonard publications and the Signature Licks Series: this is not a DVD of an Eric Clapton show! This is an instructional DVD for those who wants to play acoustic guitar.The instructor is Dough Boduch, a freelance guitarist, teacher, editor and recording artist. He teachs how to play (in the acoustic guitar) 8 of the Eric Clapton tunes presented in Eric's CD/DVD \"Unplugged\". Songs are: Change the World, Circus, Layla, Malted Milk, Nobody Knows You When You'Re Down and Out, Signe, Tears in Heaven and Walkin' Blues.I think the quality of the image is very good and clean. The sound is also great - when Dough Boduch plays the acoustic guitar, he sounds almost as Eric Clapton in the CD/DVD.After presenting part of the music at the regular speed, the instructor breaks it in several parts, then explain and shows part by part of each song at a very low speed (sometimes more then once) in order to make you get to the point.There is also a chapter used to tune the guitar. The instructor is very good and explains very well. The DVD could be a little bit better if we could have the TABs of the songs, but they're available neither on the DVD nor on a web-site. It seems however that if you get the Hal Leonard \"Eric Clapton - Unplugged\" play along book you will get there - I haven't check it yet.One interesting section of 15 minutes is dedicated to the techniques used by Eric Clapton and how he uses them: bending, vibrato, pull-off, hammer on, fingerpicking, blues scales and C Minor scale.One more cool section is the jam along section where the video shows the instructor playing but you can't hear him. Instead, you can be Eric Clapton for a day and play the acoustic parts of the song in a Acoustic Guitar Karaoke.To summarize, I found this to be an excellent instructional video, specially for those who are Eric Clapton fans and who already have a knowledge in playng the acoustic guitar. Beginners (such as myself) will probably have to work a little harder before getting the most out of this DVD.", "overall": 5.0, "summary": "This is an instructional DVD! A Great One!!", "unixReviewTime": 1182038400, "reviewTime": "06 17, 2007"}
{"reviewerID": "A16WE7UU0QD33D", "asin": "0634029363", "reviewerName": "S. R. Mcdonald", "helpful": [0, 4], "reviewText": "No EC collection would be considered complete without theacoustic side of EC, because the man himself is MUCH morethan just the electric guitar!!", "overall": 5.0, "summary": "Acoustic EC", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"}
{"reviewerID": "AKKQM6B0KI6F4", "asin": "0634029363", "reviewerName": "Thomas J. Chuchola", "helpful": [2, 2], "reviewText": "Very disappointing. This was advertised to be a \"note-for-note\" lesson on selected Clapton tunes, and it was not even close. There was no tab to support the little (and sometime inaccurate) portions of the songs that were listed. I sent a complaint directly to Hal Leonard, but never received the courtesy of a reply.", "overall": 1.0, "summary": "Clapton Classics", "unixReviewTime": 1272672000, "reviewTime": "05 1, 2010"}
{"reviewerID": "A1BX81N79C9BVT", "asin": "0634050028", "reviewerName": "Rick Valentine", "helpful": [0, 0], "reviewText": "I'm too busy using it to take time out to review it. I suggest that you get it, I did.", "overall": 5.0, "summary": "I'm lovin' it", "unixReviewTime": 1369872000, "reviewTime": "05 30, 2013"}
{"reviewerID": "A11ER3801T7KRP", "asin": "0634055429", "reviewerName": "robert r.", "helpful": [0, 0], "reviewText": "This is a basic instructional DVD . If you are looking to learn buy the Tomas Cruz volume 1,2and 3 . Look no further .", "overall": 2.0, "summary": "Basic", "unixReviewTime": 1372636800, "reviewTime": "07 1, 2013"}
{"reviewerID": "A175UOHOVXRYMW", "asin": "0634055534", "reviewerName": "Diane E. Amov \"The Bluegrass Gospel Blog\"", "helpful": [10, 10], "reviewText": "So, you have a pile of guitar instruction books, maybe some videos, too. Yet, somehow, you just can't make progress in your studies. You look at the profusion of guitar instructional materials out there, and wonder which one of them will finally turn you into a guitarist. Well, wonder no more. Happy Traum's DVDs are the only ones you'll ever need. Traum is an experienced and engaging instructor who has the unique ability to zero in on potential problems and tell the student exactly how to overcome them. His lessons go quickly, but he leaves nothing out. Follow his pace, and his advice about when to shut off the DVD and go practice on your own, and you'll be handling those chord changes on time in no time. It's time to move beyond G/C/D and become a real guitarist, and these are the DVDs that'll help you do it. This set is the jumping-off point for Traum's many other instructional DVDs. Whether your interest is bluegrass, country, blues, fingerstyle, or whatever, start here. You'll get an excellent, easy-to-understand grounding in guitar technique and theory. After that, you can move onto one of Traum's other DVDs to explore your favorite genre. Oh, great! I've just re-read what I've written, and I sound like some slick salesperson. I guess it's because I'm so relieved. After two years of false starts, I'm finally learning how to play. Thank you, Happy Traum!", "overall": 5.0, "summary": "Frustrated No More!", "unixReviewTime": 1214092800, "reviewTime": "06 22, 2008"}
{"reviewerID": "A2P1Z9NUJ9H1RT", "asin": "0634055534", "reviewerName": "music fan", "helpful": [0, 0], "reviewText": "Bought this for my grand son that just started playing guitar and I know from past experience with Homespun Tapes that this will really turn the light on for him...Thank you Happy Traum for introducing this brilliant teaching concept !", "overall": 5.0, "summary": "This is the ticket", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A1D1S69ZMKYCCV", "asin": "0634061801", "reviewerName": "daniel", "helpful": [0, 0], "reviewText": "great book... you should be aware of blues scales and have a little practice before using it but it will help you a lot. After a few exercises you'll notice some improvement on your style..and 50 licks is more than what you need...cheers from Costa Rica...surf town :)", "overall": 5.0, "summary": "product review", "unixReviewTime": 1289001600, "reviewTime": "11 6, 2010"}
{"reviewerID": "A7R79JLQ5Q28M", "asin": "0634061801", "reviewerName": "Eddie", "helpful": [0, 0], "reviewText": "While I did not enjoy Mat's \"Blues Rock guitar soloing\" DVD, I did enjoy this one.It is very straightforward, with Matt playing  and explaining 50 blues licks. The licks start with turnaround licks, and are easy to learn and incorporate into my own playing.One minor complaint is that there is no context for the licks other than what Mat mentions. I think it would be more beneficial to the player to actually listen to the licks in a musical context (i.e., played with a band or a backing track).This is a useful addition to the blues player's (and student) arsenal.", "overall": 4.0, "summary": "Good collection of blues licks", "unixReviewTime": 1124928000, "reviewTime": "08 25, 2005"}
{"reviewerID": "A3T7SXCKJUYXT3", "asin": "0634061801", "reviewerName": "K. D. Shultz", "helpful": [4, 4], "reviewText": "This was a very pleasant suprize i really enjoyed this dvd.It challenges you to learn and play these very usable and desireable blues licks.In this dvd are the great turnaround lick's that have been used for years on some of the best blues solo's , I instantly began using what i had learned from this dvd in my solo's.The one drawback is the DVD menu i found myself back at the start menu many times.This is the type of dvd that helps you take your soloing to the next level.But if you are new to guitar this would be a frustrating ride,I would estimate that the people who would benifit from this should be at least intermediate to advanced level....but everyone is different.This dvd is one of the best blues insrtuction i own.", "overall": 5.0, "summary": "Buy It ...and get out of a rut", "unixReviewTime": 1190851200, "reviewTime": "09 27, 2007"}
{"reviewerID": "A1JZM0YIYHL6JW", "asin": "0634061801", "reviewerName": "Leon C. Rodriguez \"bluehillcinema\"", "helpful": [3, 3], "reviewText": "I've been playing the blues for a long time so I wasn't particularly inspired by any of the licks. I didn't find the 'gem' that I didn't recognize to add to my vocabulary, the one illusive moment i was looking for... nevertheless, every one of these licks is the 'meat and potatoes' vocabulary that can be used to talk the talk.  Mat does an outstanding job of guiding you through these 50 licks with real clarity.  I like that he uses the actual names of the notes instead of naming the string and fret for reference.  I can see that Mat's a real musician and has a masterful handle on his axe. I went through it in about a week and had a good time doing it. I like that the DVD format defaults to the menu after the lesson to give you time it 'fool around' with the lick and squeeze as much as you can out of it. I really enjoyed it.  Good stuff.", "overall": 4.0, "summary": "Well executed and professionally done", "unixReviewTime": 1270684800, "reviewTime": "04 8, 2010"}
{"reviewerID": "A372SXZ39TUWTZ", "asin": "0634061801", "reviewerName": "Magellan \"Scarpetti\"", "helpful": [14, 15], "reviewText": "Mat and would not hit it off.  Instant personality clash for sure.  Then again I didn't buy this DVD to make friends.  I bought it to learn blues.  50 good usable licks presented in a way that you can actually learn them.  Good camera angles, the sound is fair.  Tab could be onscreen but I guess the booklet works just fine.  Just the thing for the early intermediate player.This DVD spends a lot of time in my player!", "overall": 5.0, "summary": "Finally, a Blues Guitar DVD with some MEAT!", "unixReviewTime": 1122681600, "reviewTime": "07 30, 2005"}
{"reviewerID": "A331DOWXV50UMT", "asin": "0634061801", "reviewerName": "RDD", "helpful": [0, 0], "reviewText": "Some really cool riffs that can be incorporated into your playing - Instructor could have spent a little more time explaining and breaking them down, but I guess they had to stay within a certain allotted recording time", "overall": 4.0, "summary": "Nice Riffs", "unixReviewTime": 1288656000, "reviewTime": "11 2, 2010"}
{"reviewerID": "A16ZE9MJ0703UB", "asin": "0634061801", "reviewerName": "Rea", "helpful": [0, 0], "reviewText": "This wasn't for me..but for my husband who enjoys anything guitar. He learned some new ideas and enjoys going back to this and seems to learn something new each time. He is not a beginner and not a pro either.", "overall": 4.0, "summary": "Fun to learn some new ideas", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"}
{"reviewerID": "A3DM7ADJV144TZ", "asin": "0634061801", "reviewerName": "s. mack", "helpful": [0, 0], "reviewText": "this is a cool video and has some killer licks in it, but as stated above, this is not for novices. it is very fast paced and unforgiving. great for the upper level intermediate who has maybe hit a bit of a wall and just needs some fresh ideas.", "overall": 4.0, "summary": "beware!", "unixReviewTime": 1365811200, "reviewTime": "04 13, 2013"}
{"reviewerID": "A2FIMQIKNOHFPK", "asin": "0634061801", "reviewerName": "S. White", "helpful": [10, 10], "reviewText": "I am a professional musician with over 17 years experience on guitar alone and this is the second DVD in this series I have bought now as I was so impressed with the first which was the Country licks. At the outset it should be said that these DVD's are not for beginners, sorry but that's just the facts. This isn't to say that a beginner cannot glean inspiration and work up to certain licks slowly but I would suggest this really suiting the intermediate player to advanced on some techniques.With my many years of playing I was already familiar with the techniques being employed on this DVD and found myself ripping some awesome licks in just a couple of hours after sitting down and viewing it. Even for an old dog like me I was learning how to lay down certain phrases I was always curious about but never got around to ... such as some of the faster flourishes.The sound and presentation are simple and yet excellent with both right and left hand views on screen at the same time. Mat Gurman does a fine job of breaking down the phrases and is technically excellent in his own right. I have had no issues with the Tab that comes with this DVD NOT matching up with what is being played ... every note was where it ought to be.A final note ... don't be put off by the return to menu feature, I have found this to be a smart addition to this series since it allows you to stay with that lick until you got it locked in before moving on without having the DVD race away from you while you are working things out. This also makes each lick easy to find and return to rather than having to scroll through to locate it!For this kind of value I plan on getting the Jazz and Rock DVD's in this series - my vocabulary has really expanded in the time I have spent with this product and I am already an advanced player. If like me you are an experienced guitarist you may find you only need 10 or more of these licks but I'd be learning them all because they can often transform into other licks you create yourself.Killer series!", "overall": 5.0, "summary": "Get rhythm!", "unixReviewTime": 1190592000, "reviewTime": "09 24, 2007"}
{"reviewerID": "A1QVR0ZIG59ZAG", "asin": "0634061801", "reviewerName": "Thomas G. Sopchak \"themainmusicman\"", "helpful": [17, 17], "reviewText": "My Background:In order to level set you as to my comments here is a little about me. I have been playing pretty consistently for about 1.5 years. I still consider myself a novice guitar player. I know 1/2 dozen cords, a few songs, some typical beginner licks and have been practicing the A major and A minor pentatonic scales both in the first position. I am pretty good with those two scales. I have no problem reading most guitar tablature.What You Need To KnowThis is just my opinion. It is key that you can read guitar tablature. Also, it would be VERY helpful if you knew many (more than I do) of the pentatonic scales and several of the positions for each (there are 5 positions for each scale). Mat (the instructor) only shows you one scale and in a single position (A Major \"Blues\" scale). He does this very quickly at the start of the DVD. It would also be very helpful if you are proficient at bends, hammer ons, pull offs and slides. You will also do better if you have some skill in a few different strumming techniques, including muted tones. Clearly all of these are key elements of blues guitar (actually any guitar work) and he uses them in abundance.The Instruction and Licks:As I mentioned he does show one of the scales he calls the \"A\" blues scale. However he is all over the place on the fret board (uses far more than just this one scale) and if you don't have some degree of proficiency in playing scales you will not get much from this DVD. He also shows you quickly how to tune a guitar. However I'm guessing that anyone who would remotely be able to use this DVD would already know how to do that.The licks he shows are very cool and if you can learn some of them they can be strung together to really jam. They range widely in level of complexity. There are a few that could be played by a beginner who has little experience (although they are the exception). Any beginner trying to learn these licks would have to be highly motivated and determined. Mat does include the tablature for each of the licks which is very good. In most places on the DVD he shows both of his hands so you can see the fret work as well and the picking. He does slow his playing down and for the most part you can figure out what he is doing. However he is so versed in what he is doing that he does sometimes make assumptions that you understand what he just did or what he is telling you. This is where it will be difficult for beginners.Bottom Line:Pretty cool DVD. With my current skill level I will be able to make some use out of it but by in large it is a little beyond me still. That said I am still very happy I bought it because I am sick of just practicing scales up and down, up and down, without doing anything cool. You can not even get 30 minutes of live guitar lessons for $10. The DVD is done well enough such that if you have some ability to play and want to check out some cool licks it is well worth the money.", "overall": 5.0, "summary": "Not For The Beginner Guitarist, But Some COOL Licks!", "unixReviewTime": 1187654400, "reviewTime": "08 21, 2007"}
{"reviewerID": "A2788UYAD532T", "asin": "0634061801", "reviewerName": "WannabeClapton \"E.C.\"", "helpful": [8, 13], "reviewText": "Having recently revived my desire to improve on the guitar, I purchased this video. I had just purchsed another DVD with which I was very happy and decided that any decent guitarist needed some blues licks in their repertoire. I had a more difficult time following along with this one than I did on the previous purchase. This one comes with a hard copy of the Tabulature but I'm convinced that in many places, the Tabs don't match what he says to play or actually does play. That's a little frustrating for me. I do give it 3 stars because I do think as I improve, there will be some learning opportunities, but at my current skill level, it's a bit over my head so that makes it not very valuable for now. Perhaps there should be a grading/age/skill level system like they do for kids' toys that allows for consumers to judge how advanced you need to be to get value from a product or if it's even suitable.", "overall": 3.0, "summary": "Not as good as I had hoped.", "unixReviewTime": 1178409600, "reviewTime": "05 6, 2007"}
{"reviewerID": "A1746NHDF3PF3H", "asin": "0634065459", "reviewerName": "T. Feldmann", "helpful": [3, 3], "reviewText": "After performing bottleneck gospel/blues professionaly for the past 12yrs I've noticed a trend amongst my generation (30somethings) of players which concerns me greatly...wild, fast, sloppy playing sounds more authentic.  I have had numerous conversations with fellow players attempting to convince them that fast and sloppy playing isn't more authentic, it's just fast and sloppy playing.Brozman makes it a point to address just that in DVD 1.  He states that the originators were trying thier best to play as clean as possible but due to bad strings, bad guitars and pretty lowsy recording equipment it created a challenge to do so, although many did achieve very clean playing (Tampa Red, Blind Willie Johnson, Robert Johnson, etc.,).DVD 1 is critical in learning the fundamentals of control, both with slide and picking.  I highly recommend DVD 1 for any players.DVD 2 covers classic detla blues material Brozman style.  Plenty of \"tricks\" to be learned even if your not looking to sound like a Brozman copy.DVD 3 expands into more open tunings.  Again, plenty of \"tricks\" to be learned.Whether these are too advanced for the beginner I cannot say because I'm not a beginner.  I can say that minutes into DVD 1 I wished I had these DVD's when I was learning because it's taken me 12yrs to acquire the skills I could've learned in months of working with these lessons.ALl in all these DVD's will help get the wheels of creativity flowing in your own playing...and playing clean.", "overall": 5.0, "summary": "Outstanding!!!", "unixReviewTime": 1295913600, "reviewTime": "01 25, 2011"}
{"reviewerID": "A26LIKTL5KW29E", "asin": "0739003755", "reviewerName": "3_Angels", "helpful": [7, 7], "reviewText": "This is a two CD set each CD is 30 minutes long.  The second CD is for the \"music discovery book\", I love this CD, it is just perfect for group music classes and it is a fun CD for kids to just listen to.  There are 25 songs: a hello song (mentions mozart mouse and beethoven bear), a goodbye song (could be used for any program), 8 rhythm instrument songs, 5 movement/music appreciation songs, and 8 listening/ear training songs.The first CD is essentially a \"book on CD\" of the \"music lesson\" book and I don't see why you would ever use it because a teacher could read the story herself much more entertainingly.", "overall": 5.0, "summary": "Great music for preschool music classes", "unixReviewTime": 1212624000, "reviewTime": "06 5, 2008"}
{"reviewerID": "A4TE45TH7L2MW", "asin": "0739003755", "reviewerName": "~AMH", "helpful": [4, 4], "reviewText": "The Discovery CD has songs for singing and movement. There are some original songs as well as familiar tunes. The Listen and Sing examples are short, easy songs to help students learn solfeggio syllables la-ti-so-re-mi. The Lesson Book CD tells the story of Mozart Mouse and Beethoven Bear exploring the magical music book as they learn to play piano. Children play with their plush toys and play piano/keyboard along with the lessons. The lessons are well organized and fun for very young children. Some of the songs on the Discovery CD include:Hello SongIf You're Happy and You Know ItRacing CarClownin' AroundFinger Play SongHickory Dickory DockMexican Hat DanceBeethoven's Rage Over the Lost PennyMozart's Variations on Twinkle, TwinkleOld MacDonald Had a FarmMister Elephant's Funky DanceSousa's Stars and Stripes ForeverGiant's LullabyDo Re Mi Tapping SongMinuet in FBeethoven's Symphony No. 5Twinkle, Twinkle Little StarPut the Beat in Your FeetGoodbye Song", "overall": 5.0, "summary": "Magical Music Book Story", "unixReviewTime": 1311984000, "reviewTime": "07 30, 2011"}
{"reviewerID": "A732DZLEGXSEQ", "asin": "0739003755", "reviewerName": "Jenny Lee", "helpful": [0, 0], "reviewText": "This CD is absolutely awesome. My daughter loves listening to the stories of Clara Schuman Cat, Beethoven Bear and Mozart Mouse. There are stories to listen to as well as wonderful renditions of the songs in the book. They have two differently played songs which helped my daughter a lot. It would be nice to have one of the renditions have the songs sung. Having to learn 10 songs for her recital with every song using the same 5 notes made it difficult for her to remember them all as they sounded so similar.", "overall": 5.0, "summary": "We LOVED this CD!!!", "unixReviewTime": 1337299200, "reviewTime": "05 18, 2012"}
{"reviewerID": "A142DE4DV7NKTQ", "asin": "0739003755", "reviewerName": "Lois Seeger \"music mom\"", "helpful": [0, 0], "reviewText": "As a lifetime piano teacher, I love this child-friendly piano method for young children. Content is rich with a variety of musical experiences. And I have fun too with Mozart Mouse and Beethoven Bear.Its great to see the level of interest and readiness of a student.", "overall": 5.0, "summary": "the best for young chldren", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "AAUUICXM1YE8L", "asin": "0739003755", "reviewerName": "Mary Chopin", "helpful": [0, 0], "reviewText": "Just like the previous reviewer says, the two CD's are great in contents. For some reasons, however, my set came with labels switched around.  The one that said \"Music Lesson Book 1\" was actually for \"Music Discovery Book 1\" and vice versa. There must have been a mistake at the manufacturer.", "overall": 4.0, "summary": "The two CD's came mislabeled.", "unixReviewTime": 1297900800, "reviewTime": "02 17, 2011"}
{"reviewerID": "A153V2QD4BJT1Z", "asin": "0739003755", "reviewerName": "Musicmom", "helpful": [0, 0], "reviewText": "We are very happy with this series.  My son has special needs and benefits from music therapy weekly.  This series teaches about musical concepts with a story book format.  We also bought the companion CD and stuffed animals.", "overall": 5.0, "summary": "Great series", "unixReviewTime": 1364083200, "reviewTime": "03 24, 2013"}
{"reviewerID": "A2TKRYCS1POPOA", "asin": "0739003755", "reviewerName": "NewMommy", "helpful": [0, 0], "reviewText": "We absolutely love this line of books. My 4 year old is now on the third set and playing away! It's made her lessons fun and easy. And I love that she can play with the cd's accompaniment.", "overall": 5.0, "summary": "LOVE", "unixReviewTime": 1359417600, "reviewTime": "01 29, 2013"}
{"reviewerID": "A1IRFW13NXF08Z", "asin": "0739003755", "reviewerName": "R. Davis", "helpful": [0, 0], "reviewText": "Since Music for Little Mozarts is based on the age group of 4-6, I am surprised that the music on the CD doesn't have tempo options for beginning lessons.  Also, I think there could be more &#34;notice&#34; given on when the songs will start; just seems to quick or hurried.", "overall": 3.0, "summary": "Rating Based on Experience of a 4 Year Old", "unixReviewTime": 1394323200, "reviewTime": "03 9, 2014"}
{"reviewerID": "A25UM6A6A4SEDT", "asin": "0739037986", "reviewerName": "BrotherMike57 \"BrotherMike57\"", "helpful": [0, 0], "reviewText": "I would recommend this DVD to anyone interested in the construction and the materials in which pick ups are made from.  The history of the Semour Duncan Company is fascinating.  Anyone wanting a basic understanding of how pick ups works do yourself a favior and buy this DVD.", "overall": 5.0, "summary": "Great Information", "unixReviewTime": 1229904000, "reviewTime": "12 22, 2008"}
{"reviewerID": "ADM67P7K66F41", "asin": "0739037986", "reviewerName": "Jeffrey Smith \"Smith Guitars\"", "helpful": [0, 0], "reviewText": "This is a great video with lots to learn and see. It is basically a tour of the SD factory, with interviews with the Duncans. This may have started out like a fluff piece documenting the company, but I really liked it. SD shows how he changes out pick-ups, very cool. And it has a great educational section on the development, sound, and design of their products. Good. Great info available elsewhere in print and on the web, but if you like moving pictures and like a good guitar story then $20 for this video is worth it.", "overall": 3.0, "summary": "A behind the scenes look at one of the innovators of guitar pick-up technology.", "unixReviewTime": 1231718400, "reviewTime": "01 12, 2009"}
{"reviewerID": "A18C8JYM2161KE", "asin": "0739037986", "reviewerName": "M. Balzano", "helpful": [2, 2], "reviewText": "This was terrible. It gets right to the part you need to know to solder the pickups and then cuts and shows pickup already installed. I really dont see how anybody approved this for sale. If you are looking to learn how to install pickups and save yourself money at the guitar store - this DVD is worthless. Again, the video footage cuts ahead at the critical point that would show you which wires to solder where. so disgusted.", "overall": 1.0, "summary": "Terrible - skips essential info to install pickups", "unixReviewTime": 1219795200, "reviewTime": "08 27, 2008"}
{"reviewerID": "AK3MEBCSQ18LO", "asin": "0739037986", "reviewerName": "R. Burns \"guitar nut\"", "helpful": [2, 4], "reviewText": "I didn't think it was worth the money !I have used his pickups and they are fabulous .......Buy his pickups but skip the DVD !", "overall": 2.0, "summary": "seymour duncan guide to pickups", "unixReviewTime": 1202515200, "reviewTime": "02 9, 2008"}
{"reviewerID": "A307SOXS9WP4GI", "asin": "0739040251", "reviewerName": "Bill Card", "helpful": [0, 0], "reviewText": "If you want to know how drummers that have made it actually drum, you'll want this video. If not, you won't.", "overall": 5.0, "summary": "This was a good video", "unixReviewTime": 1359936000, "reviewTime": "02 4, 2013"}
{"reviewerID": "ASP16LVGFITDE", "asin": "0739040251", "reviewerName": "Bill Moll", "helpful": [0, 0], "reviewText": "As a drummer of 40+ years - (recovered, but relapsing constantly) - Simon Phillips becomes my new hero with this video. His polyrythmic ambidexterity seems effortless and natural, and his behind the scenes comentary and instruction are concise, thorough, and easily absorbable. A must-have DVD for any drummer desiring to improve his skill set. Five Stars!", "overall": 5.0, "summary": "A must-have", "unixReviewTime": 1288310400, "reviewTime": "10 29, 2010"}
{"reviewerID": "A2HYLAESK4RRTI", "asin": "0739040251", "reviewerName": "Clovis G. Yarnall Jr. \"Daddy Gene\"", "helpful": [0, 0], "reviewText": "I like Simon Phillips, I think he is one of the best drummers in the world.  This video however, was obviously made a long time ago because he looks very young in it.  I admit I saw the cover and could see he appeared to be much younger, but because the video had been remastered and redone I hoped some of his more recent performances might be included, they were not.  I still enjoyed it but wish he would bring out something containing more recent material.", "overall": 4.0, "summary": "Made a long time ago", "unixReviewTime": 1392854400, "reviewTime": "02 20, 2014"}
{"reviewerID": "ASEVEFG1SSYJK", "asin": "0739040251", "reviewerName": "David Gaither \"Gatesstudios\"", "helpful": [0, 0], "reviewText": "He shows the grooves and beats in a slow enough speed to understand. He even breaks up longer patterns into sections to see what he's doing.  He's a ambidextrous player for sure and much like Billy Cobham has some serious stamina to not only play 100 miles an hour, but keep the pace for a whole show. I had a chance to see him locally recently and he's pretty much the way he comes across on his video. As his playing is double bass, I would recommend it for those with 2 bass drums. He was much younger in this video and still plays the same style and speed. No real time spent on simple grooves and patterns, thus I'd say it was an intermediate level instructional video.", "overall": 5.0, "summary": "old but still current", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "AARB5F3HPXV0V", "asin": "0739040251", "reviewerName": "D. Forester", "helpful": [2, 2], "reviewText": "If you have not seen Simmon Phillips play, this is the DVD to see!This is closest your going to get to Simmon Phillips Mastery!What an incredible player he is, my hat is off!!If your a drummer or a music lover for that mater, this is a must see!!!", "overall": 5.0, "summary": "Simmon Phillips at his best!!!", "unixReviewTime": 1192060800, "reviewTime": "10 11, 2007"}
{"reviewerID": "AQFYZ8N5SQ1Y7", "asin": "0739040251", "reviewerName": "Ian Braun", "helpful": [4, 4], "reviewText": "This DVD is the complete set of what had previously been 2 separate vhs tapes. Simon's playing is, of course, incredible. For any drummer interested in Simon's playing this is a must. There are some advanced concepts here, but Simon is extremely good at explaing what is going on in simple language. For those who are more musically literate there were two instruction books based on the videos. The video can be seen as a progression from simpler (well simple for Simon) material to more advanced. Something like 'Cosmos' can be approached at a much easier level than say 'Force Majeure.' The section on Odd Time is great, and if you buy the instructional books, there are play-alongs to all of the material. Also, in terms of sheer performance Simon is always so exciting to watch that even if you don't play drums near that level, you will love the 'Concert' footage.", "overall": 5.0, "summary": "Fantastic Simon Primer!", "unixReviewTime": 1196294400, "reviewTime": "11 29, 2007"}
{"reviewerID": "A1Z5471UG451G9", "asin": "0739040251", "reviewerName": "Mikael Bohlin \"MB\"", "helpful": [1, 1], "reviewText": "Simon is really taking it to the extreme and the performaces in these videos are very inspiring. I suppose even less experienced drummers can benefit from looking at this as it contains good basic training techniques. It also covers tuning and even mixing, so this is really something to smile about for all us drummers.", "overall": 4.0, "summary": "Almost scary", "unixReviewTime": 1268870400, "reviewTime": "03 18, 2010"}
{"reviewerID": "A2PI3IIBPG2VI2", "asin": "0739040251", "reviewerName": "Phil Sac", "helpful": [1, 1], "reviewText": "I imagine Simon Phillips needs no introduction indeed, so we can skip that part.The amazing thing about this long awaited DVD is the fact that all these great and complicated stuff Phillips executes are whithin the context of great music, written by him and performed with two other great musicians otherwise, what would be the point of such amazing technique and skill?Through very clear chapters Simon explains how to tune, why he position himself like that behind the kit, etc., in a humble way only great a talented people can show.The double bass technique is explained and shown in a very useful and understandable way so you can play or practice along. He is miles away from showing himself off with what he's doing which seems to be the usual these days. And the sound of that kit? In my humble opinion that's the way a drumkit should sound, wide open,lots of projection and sweet tom-toms sound since he plays off the heads instead of whacking the kit, which is the current tendency. Listening to this DVD, even though I still haven't done it 5.1 is an enjoyable experience not only for drummers but for anyboby who appreciates great music.The track performed are in that interesting area among jazz,rock and fusion so there is something for everyone here. The interview with Simon talking about the 5.1 mix, which he did entirely is very interesting even for us not so involved in recording matters. Least but not last, even though this DVD has no subtitles, is perfectly understandable because of Simon's slow and plain british accent, so it won't be a problem for any audiences worldwide.Five stars/thumbs for Simon....again!", "overall": 5.0, "summary": "Exciting, amusing and very useful.", "unixReviewTime": 1225843200, "reviewTime": "11 5, 2008"}
{"reviewerID": "A370T379VAAP4B", "asin": "0739040251", "reviewerName": "R. A. Broussard II \"broumeistre\"", "helpful": [0, 0], "reviewText": "overall in informative and entertaining video.some experience drummers may fastforward the tuning and practice segments.too bad the updated commentary of making the video doesn't include recent footage of performance.", "overall": 4.0, "summary": "Simon's review", "unixReviewTime": 1226448000, "reviewTime": "11 12, 2008"}
{"reviewerID": "A2BXUV043WWTKW", "asin": "0739040251", "reviewerName": "redzart", "helpful": [0, 0], "reviewText": "I was looking for more of a teaching feel to this video,but the video is a good video because as a drummer you can pick up on some real cool licks.I would recommend this video to any skill level drummer.", "overall": 3.0, "summary": "the redzart review", "unixReviewTime": 1350172800, "reviewTime": "10 14, 2012"}
{"reviewerID": "A1PXB4OVLPLT4H", "asin": "0739040308", "reviewerName": "Bassworks", "helpful": [0, 1], "reviewText": "John Patitucci is not only an amazing player, but also an incredible teacher and offers insights into a myriad of essential & beyond aspects of musicianship on this DVD. Highly recommended for intermediate to advanced bass players looking to expand their playing in a big way!", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1204588800, "reviewTime": "03 4, 2008"}
{"reviewerID": "A2RI4VW44924NH", "asin": "0739040308", "reviewerName": "Jorge Alberto Arellano Mayerstein", "helpful": [0, 0], "reviewText": "One of the greatest bassist alive!! I really enjoyed this DVD, it helps you with technique, groove and to understand multiple rythms and how to approach each one", "overall": 5.0, "summary": "Great", "unixReviewTime": 1360281600, "reviewTime": "02 8, 2013"}
{"reviewerID": "A3O2TMYU7E1V81", "asin": "0739040308", "reviewerName": "Park Sang Soon", "helpful": [0, 2], "reviewText": "i thought it involve small hand bookbut it's only DVDbut, the information is so good", "overall": 3.0, "summary": "not bad", "unixReviewTime": 1253750400, "reviewTime": "09 24, 2009"}
{"reviewerID": "AVBWSI19JRCPQ", "asin": "0739040308", "reviewerName": "pounding on the keyboard \"wantaknow\"", "helpful": [4, 4], "reviewText": "Patitucci is an excellent teacher, but not entirely comfortable in front of camera.  He covers most of the basics: posture, left and right hand action, strength/flexibility/independence exercises: spiderwalking, pulloffs with other fingers locked. The harmony/theory sections assume you have a decent command of the basics.The bonus footage of him and Steve Bailey, and of Jaco (clips from other Alfred DVDs, i think) are fun to watch.Some drawbacks of DVD version:- a lot (50%) of footage uses 6-string, which is still relatively uncommon, and forces you to figure your own fingerings/transposes if you don't have one.- much of the footage after the initial clinic chapters, JP playing with recorded backup or with Drummer D Weckl live, is not close up, so not that helpful.  YOu can listen, you can't watch JP's hand action carefully.- sound is printed through on original analog master tapes, i.e. you can hear a faded \"preview\" of Patittucci talking before he starts talking.  Not a big deal.", "overall": 4.0, "summary": "valuable for intermediate+ players", "unixReviewTime": 1229731200, "reviewTime": "12 20, 2008"}
{"reviewerID": "A2WNDXINN9PXEL", "asin": "0739040308", "reviewerName": "Richard Davis III", "helpful": [0, 0], "reviewText": "This is a great basic instructional DVD, John goes into some great fingering exercises to build dexterity and strenght that all good bass players. Recommend this as one of the basics of a good instructional library.", "overall": 5.0, "summary": "Instructional DVDs", "unixReviewTime": 1270598400, "reviewTime": "04 7, 2010"}
{"reviewerID": "AZY4GP1W5N5KO", "asin": "0739040308", "reviewerName": "Sevag Kouyoumjian", "helpful": [0, 0], "reviewText": "Just the perfect video to get everything about bass, rhythms, techniques, soloing, theories, harmony, styles, etc.John Patitucci is master", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1398038400, "reviewTime": "04 21, 2014"}
{"reviewerID": "A1JHCSJLJA3M21", "asin": "0739040308", "reviewerName": "Z. L. Grove \"copsnrobbers\"", "helpful": [8, 10], "reviewText": "This is not what you're thinking.  This DVD is merely two hours of the \"flamboyant\" John Patitucci playing songs.  He does not show any of his riffs to you, he plays them at full speed so it takes forever to find the pattern.  This is $30.00 I'll never have back!", "overall": 1.0, "summary": "Don't waste your money.", "unixReviewTime": 1193529600, "reviewTime": "10 28, 2007"}
{"reviewerID": "A3FYONMMFY4VK6", "asin": "0739040375", "reviewerName": "Adam Miller \"arpeggio meister\"", "helpful": [17, 18], "reviewText": "I own every Paul Gilbert video that I am aware of.  These two volumes have dramatically improved my technique, speed, phrasing, picking, etc.  Paul is an amazing teacher.  He explains everything in depth so that even the novice guitarist will understand most everything covered.  I own many other videos including Yngwie, Vinnie Moore, Richie Kotzen etc.  None of the other videos can compete with the Paul Gilbert videos. I often watch Intense rock 1 and 2 as refresher courses or just for plain entertainment.  If shred is your game, then look no further.  Learn from the best!", "overall": 5.0, "summary": "Essential!!!!", "unixReviewTime": 1173398400, "reviewTime": "03 9, 2007"}
{"reviewerID": "A31NJVE7JDIPR2", "asin": "0739040375", "reviewerName": "Ajith Narayan \"Ajit Narayan\"", "helpful": [3, 4], "reviewText": "I'd already seen a few of the lessons online and there was no doubt on what I was in for.A detailed shred of shredding. And Paul Gilbert is a fantastic teacher. And a great artist. He really rips apart his own technique and shows you the light... the rest is up to you. Whether you have the motivation to DO and practice consistently and accurately.If playing fast is the real thing on your mind. Just pick up this DVD and hear your self transform in a matter of months.I used to have this fear of speed. Thanks Paul for dispelling completely. And making it accessible for mere mortals. While I still am not sure I can ever get to the clarity levels that he has on his fast ones... I am definitely not scared anymore to attempt to play fast...Thank you very much Paul Gilbert.", "overall": 5.0, "summary": "Shreding for dummies", "unixReviewTime": 1213315200, "reviewTime": "06 13, 2008"}
{"reviewerID": "A1HXA6YKQJ7FNT", "asin": "0739040375", "reviewerName": "Amazon Customer \"Rock chick\"", "helpful": [2, 8], "reviewText": "I read good reviews about this guy and this video. I even saw some clips of him on youtube and that convinced me to buy this. However when I got it and watched it, I noticed he went too fast in his instruction for me to keep up. My biggest gripe is that he does not teach you the rudimentary techniques such as how to hold the pick so that you can pick as fast as he is. I found myself pausing the video a lot just to get the lick. The DVD comes with a printable PDF booklet (13 pgs). This is def not for beginners. It would have been better if he started out showing you how to use a metronome in shredding and subdividing notes. The included sample vid with John Petrucci (he shows you shredding with a metronome) was what this video should have been.", "overall": 3.0, "summary": "This is NOT for beginners!", "unixReviewTime": 1216512000, "reviewTime": "07 20, 2008"}
{"reviewerID": "AFA6HGI3MW3SA", "asin": "0739040375", "reviewerName": "Anonymous", "helpful": [21, 22], "reviewText": "I just got this dvd a few weeks back and I can already feel a noticable improvement in my technique.  In the first section, he goes over picking, 3-note per string scales, chromatic and harmonic minor licks, hammer - ons and pull - offs and different arpeggio techniques, including sweep picking and string skipping.  In the second section, he gives more practical applications of the techniques and offers insight on how to improve phrasing and how to practice soloing.  Paul is a great teacher and he will keep you interested both with his playing and his sense of humor.", "overall": 5.0, "summary": "One of the best instructional dvds out there", "unixReviewTime": 1173744000, "reviewTime": "03 13, 2007"}
{"reviewerID": "A1FPATLQSFTLC9", "asin": "0739040375", "reviewerName": "chip bronson", "helpful": [0, 0], "reviewText": "... at a price that cannot be beat.  the product contains both of paul's first 2 dvd's and offers a huge selection of over-the-top shred guitar.  i had the 1st vhs way back in the day (the 80s!!!) and just about wore it out so i had to purchase this item just to have.  if you want to take your guitar playing to the next level and save some coin in the process, get this.", "overall": 5.0, "summary": "superior guitar instruction...", "unixReviewTime": 1335916800, "reviewTime": "05 2, 2012"}
{"reviewerID": "A30TM3EBHF2C7R", "asin": "0739040375", "reviewerName": "Chris E.", "helpful": [2, 3], "reviewText": "There'd be a lot more amazing guitarists in the world.  Intense Rock I is mainly directed at improving technique providing a lot of different 3-note-per-string, string skipping and sweep arpeggios sequences.  Paul does a great job at breaking these things down while giving us a taste of his goofy sense of humor, but for my money Intense Rock II is king.  Among other things Paul covers dynamics and control, and the last segment on practicing alone is worth the money.  Do yourself a favor and pick this up, your guitar will thank you.", "overall": 5.0, "summary": "If Every Guitar Teacher Was as Good as Gilbert...", "unixReviewTime": 1208736000, "reviewTime": "04 21, 2008"}
{"reviewerID": "A2WIO7VLFWV4YV", "asin": "0739040375", "reviewerName": "C. Katouli", "helpful": [2, 2], "reviewText": "Within a month I have already notice some serious improvements in my playing.  Particularly my picking is much cleaner.  Also, it's nice to add some more licks to my library...I was getting pretty bored with my playing for a while, but this video has revived my playing once again!", "overall": 5.0, "summary": "Super Charge Your Chops", "unixReviewTime": 1267488000, "reviewTime": "03 2, 2010"}
{"reviewerID": "A2GAXE9X97WYTW", "asin": "0739040375", "reviewerName": "CVD \"NsideOut\"", "helpful": [4, 5], "reviewText": "Paul's ability to teach is amazing.  VERY relevant and ALWAYS fun!  For 20 years now he has been and continues to keep things easily understood that are essential in taking your technique to a new level.  As a player whom has been playing for 30 years now myself, Paul's breakdown of left and right-hand technique finally got me over the \"hump\" I had not been able to overcome most of my guitar playing days as I finally overcame a plateau and quickly saw noticable improvment in speed and accuracy as I finally got the metronome setting to click higher than ever and still growing.", "overall": 5.0, "summary": "Essential for any guitarist in improving technique", "unixReviewTime": 1196899200, "reviewTime": "12 6, 2007"}
{"reviewerID": "A3QJ54LWTFXBIB", "asin": "0739040375", "reviewerName": "D. Cullington", "helpful": [2, 2], "reviewText": "Every budding shredder needs this. I'd give it a 5 star but it lacks a bit of technical detail. Gilbert is such a impeccable player though so just buy it anyway.David[...]", "overall": 4.0, "summary": "A must have!", "unixReviewTime": 1234051200, "reviewTime": "02 8, 2009"}
{"reviewerID": "A1AO3SP66Q9ZWJ", "asin": "0739040375", "reviewerName": "Francisco Astaburuaga", "helpful": [0, 0], "reviewText": "Muy bueno y explicativo para todo tipo de guitarristas, ayuda a incrementar la t&eacute;cnica y rapidez.Excelente DVD para tenerlo en consideraci&oacute;n en nuestra colecci&oacute;n.", "overall": 5.0, "summary": "Ayuda de verdad", "unixReviewTime": 1380153600, "reviewTime": "09 26, 2013"}
{"reviewerID": "AL1HYP266NWOJ", "asin": "0739040375", "reviewerName": "Gustavo Mendez Wiesner", "helpful": [0, 0], "reviewText": "Nice lessons from the shredder King, is better start with this DVD, recommended for increase your guitar skills and fun", "overall": 5.0, "summary": "The Best of Paul Gilbert lessons", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}
{"reviewerID": "A1R8OFZY6CYX7G", "asin": "0739040375", "reviewerName": "Howard L Lambert", "helpful": [3, 4], "reviewText": "Part 1 of this DVD is crammed with standard shred licks...but not much in the way of how, when and where to use them. In that respect, it's one of the more disorganized guitar instructional videos I've seen. Despite Paul's youth and enthusiasm,, the material gets relatively advanced rather quickly (and he can play the licks so fast and perfect, it's just as discouraging as inspirational).In Part 2, he sporadically mentions things that would be aimed at relative beginners...which definitely doesn't belong on these videos.  On the other hand, Example #7 is so much more intricate/difficult than anything else on this disk, it seems out of place.  The best thing on the whole disk are the 2-note per string/string skipping arpeggios (wish I woulda started practicing those 10 years ago). There are a couple of other cool licks, but the video ends up a mess of a lot of talking...my mind wandered.Before attempting to play along, you should already know all the major scale modes and the melodic minor scale.  Your alternate picking should already be very controlled/synchronized and you should be experienced with string skipping.  It also contains some extreme finger stretches/intervals that a lot of people might never be able to do (a shorter scale neck or extraordinary long fingers will come in handy here).If you don't already have the skills mentioned above, I highly recommend Don Latarski's \"Guitar Theory Basics\" and Frank Gambale's \"Chopbuilder\" be bought first.  Sequentially, they'll introduce you to all the basic mode fingerings and get your alternate picking, control and speed somewhat closer to Paul's level.", "overall": 2.0, "summary": "entertaining, but disorganized", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "AQ46HO28ZVEL3", "asin": "0739040375", "reviewerName": "Jason L . Inocencio", "helpful": [0, 0], "reviewText": "intense guitar lessons.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"}
{"reviewerID": "A1GUCW7L3QYQ33", "asin": "0739040375", "reviewerName": "J. Castaneda", "helpful": [0, 0], "reviewText": "Paul goes into great detail on scales arpeggios and everything you need to sound like a pro!!  I would highly recommend!!", "overall": 5.0, "summary": "Great Learning Tools", "unixReviewTime": 1374969600, "reviewTime": "07 28, 2013"}
{"reviewerID": "A3TITKW06F1W0", "asin": "0739040375", "reviewerName": "JD", "helpful": [4, 5], "reviewText": "I have been playing forms of rock/metal for a few years, but never really tried my hand at leads so I figured I would give this vid a shot.  I watched the video through a few times and obviously Paul is very good at what he teaches, but I got left in the dust right off the bat.  I eventually decided to focus on some of the easier patterns, memorize them and run though them everytime i pick up my guitar.  I am a lot faster now than before I started, but still nothing close to paul---even on the simple ones.  I would say this video is more for someone that can already play fairly fast and is either looking for more licks or wants to play faster.  Don't get me wrong it is a good vid, i just wish I were more up to speed when i bought it.", "overall": 3.0, "summary": "not for beginners", "unixReviewTime": 1223856000, "reviewTime": "10 13, 2008"}
{"reviewerID": "A35DFRN89NRVU1", "asin": "0739040375", "reviewerName": "Joel", "helpful": [6, 7], "reviewText": "Anyone interested in improving their picking and articulation would be well advised to check out this DVD. There's enough here to keep a player occupied for quite a while. Volume two of this title really drives home the point of making those tasty shred licks musical. This DVD is a fantastic deal.", "overall": 5.0, "summary": "Enter the Woodshed", "unixReviewTime": 1201219200, "reviewTime": "01 25, 2008"}
{"reviewerID": "A1MFT8DXOQJA9L", "asin": "0739040375", "reviewerName": "J. Pilbeam", "helpful": [3, 4], "reviewText": "This was produced going on 20 years ago, (the 1st half anyway) but is still relevant today.  After the post-grunge backlash of the early to mid 90's it is good to see this style of playing coming back.  Paul is an unassuming character whose delivery & instruction of his style & technique is very helpful & down to earth.  The 1st half of the DVD was done in his early Racer X days & really reflects the licks from that era, as the 2nd half naturally exposes the Mr. Big pop oriented offerings.  This DVD will either inspire you to attempt to reach his level of technique, or really discourage you.  But again, I believe his good nature will inspire most.  I was able to meet Mr. Gilbert at a clinic shortly after \"To be with you\" was a hit for Mr. Big years ago & he was still really down to Earth.  A whole new generation have the opportunity to learn from him & really should make this DVD part of their library.  Just do your best to ignore the 80's-90's \"production\" :)  Also the addition of the .PDF files for Vol. 2 is a nice touch!", "overall": 5.0, "summary": "Shread is back from the dead!", "unixReviewTime": 1182816000, "reviewTime": "06 26, 2007"}
{"reviewerID": "A29MLKCAZXX7AB", "asin": "0739040375", "reviewerName": "J. Tunison", "helpful": [1, 1], "reviewText": "I've been playing guitar for years and years. Have many books, CD's, etc. This is my first on \"shred\" techniques... holy cow! It's like I'm back to square one.. but that's good.. basic techniques are well presented in logical format. I was able to move through some of this fairly quickly, in theory, but still working on speed speed speed! Wish there was TAB for Vol.1, but I found that online. Vol.2 tab is included in PDF on disk. Would be nice if there was something to paly along with, it's presented and you're off on your own to practice. All that said, it's a good bang for the buck... plenty of good techniques and lessons to work on for a long long time.", "overall": 4.0, "summary": "Practicing now!", "unixReviewTime": 1267660800, "reviewTime": "03 4, 2010"}
{"reviewerID": "A1ZMV5QSAR8V2L", "asin": "0739040375", "reviewerName": "Mark D. Davis", "helpful": [0, 0], "reviewText": "Paul gilbert showing some of his favorite chops, a true innovator of the 80'sguitar era with racer x/mr.big and his solo work!!!!", "overall": 5.0, "summary": "paul gilbert", "unixReviewTime": 1380758400, "reviewTime": "10 3, 2013"}
{"reviewerID": "A2G7DYW6ILDGKL", "asin": "0739040375", "reviewerName": "Matthew M. Smith \"Esquire\"", "helpful": [5, 9], "reviewText": "Paul Gilbert got my attention in a tiny article from Guitar World, maybe Guitar Player, back in I'd say 87? maybe even earlier. he had just won a guitar gun slinger contest in the LA area and was heaed to GIT.  ayway, I kept an eye out for him along the way, and sho nuff, he is a technical monster. he may not send quite the emotional chills of say, I don't know, Eddie Van Halen (78-84 that is)? but the cat definitely sings some soul with his axe too, don't get me wrong.  I'd say, get his chops down, maybe some DiMeola master's level stuff too if you are into fast, clean, alternate picking as I try to be, then fuse your own soul with it--put some Clapton, SRV, Jimi, and Eddie in there--don't forget to bend it and shake it! you may come out with some really fresh, really good stylistic new frontiers--At least, that's what I'm after. just don't forget to make it YOUR OWN! balance in all things.  this video is all you need to get started on the Gilbert part of this equation.  its full, complete, and well done. His work with Mr Big is seriously good too, if a litte poppy, particularly their first two (I never got to hear too much of the later work.  enjoy, work the technque down to perfection, cleanly and slowly, then rip it up full speed when you're ready.  keep this vital part of intense rock alive and then, lift your goblets of rock!", "overall": 5.0, "summary": "shred on", "unixReviewTime": 1174608000, "reviewTime": "03 23, 2007"}
{"reviewerID": "AVU79AEIZQL8", "asin": "0739040375", "reviewerName": "Nicholas D. Mccloskey", "helpful": [1, 2], "reviewText": "Paul gilbert does a good job at explaining all the sequences. the only reason i don't give it a perfect rating is that part one gets kind of boring to watch, and you need to get through a lot of it in order to understand part 2.", "overall": 4.0, "summary": "Very good instructional DVD", "unixReviewTime": 1191715200, "reviewTime": "10 7, 2007"}
{"reviewerID": "A2FFKX759L9RFT", "asin": "0739040375", "reviewerName": "Nick Distasi", "helpful": [0, 0], "reviewText": "Best guitar instructional video that have seen in my 20 years of playing. Comes with video tabs which is great too!", "overall": 5.0, "summary": "Amazing", "unixReviewTime": 1382313600, "reviewTime": "10 21, 2013"}
{"reviewerID": "A31DJ1X8OARWYG", "asin": "0739040375", "reviewerName": "PumpItUp", "helpful": [1, 2], "reviewText": "I am speaking for someone else here, but I am very very happy with my purchase nonetheless. I got the dvds for my boyfriend who is a professional guitarist and he was ecstatic! thank you amazon for having everything I can ever think of to get for someone.", "overall": 5.0, "summary": "He loves it", "unixReviewTime": 1298851200, "reviewTime": "02 28, 2011"}
{"reviewerID": "ALLHLOG4NLA0A", "asin": "0739040375", "reviewerName": "Ray St John \"Ray St John\"", "helpful": [0, 0], "reviewText": "This is the best purchase anyone can make if you want to shred being that finding a good teacher that can teach this skill is not easy. Paul besides being an incredible player covers all bases of Alternate Picking and String Skipping like he was in front of you. This is worth every singe penny. Now you have both instructionals on one DVD for the price of one!!!!I own a vast array of instructionals, and if you only had 17 dollars to spend on a dvd, this is the best money you'll ever spent. Paul teaches shred like he was in front of you and believe me, no one posseses that skill. I also recommend his other instructionals after you are ready to move forward from this one Terryfying Guitar Trip, Get Out Of My Yard and his latest, Silence Followed By a Deafening Roar.RATING 10", "overall": 5.0, "summary": "The Best Instructional For Guitar Shreddin' - PERIOD!", "unixReviewTime": 1169510400, "reviewTime": "01 23, 2007"}
{"reviewerID": "A3PNCYFSZW7JQ9", "asin": "0739040375", "reviewerName": "Shelby E. Williford \"shredderdude\"", "helpful": [27, 28], "reviewText": "I actually bought this video (vol 1) when I was 11 or 12 when it first came out with my allowance that I saved up. As a guitar teacher and someone with 20 plus years playing experience, I can say that this is the best video on shred guitar technique. Volume 1 alone is well worth the price. My only issue(a VERY minor one) is that he doesn't talk about the metronome and its usage. But any good teacher can explane that in about 2 minutes.Volume 2 while not quite as shred heavy is still a great dvd to have(and just as important content). It concetrates more on phrasing, dynamics, rythmic ways of building phrases, etc. Don't worry, there is still plenty of shredding as well.These volumes are the best investments I ever made as a guitar player,teacher and student. Anyone who wants to learn how to shred, get this dvd package, and a book on music theory(or instruction by a teacher) and a good chord book and you'll have everything you ever need.Keep in mind, no matter what, you still have to practice(alot!!!!). No book, Dvd, or anything is going to MAKE you play well. If you are a beginner(or even advanced), you still have to work hard. However, this is a big help.", "overall": 5.0, "summary": "THE best dvd for learning how to shred", "unixReviewTime": 1187827200, "reviewTime": "08 23, 2007"}
{"reviewerID": "A1HOMEHH9SE7X3", "asin": "0739040375", "reviewerName": "Siddius", "helpful": [0, 0], "reviewText": "I give this product three stars because it was good.  It is pretty basic.  There are good lessons here for fundamentals.  There are a couple of interesting arpeggio ideas, but really nothing to write home about.Consists of picking exercises and simplistic scalar patterns.  Great for a player in their first few years.", "overall": 3.0, "summary": "Pretty Basic", "unixReviewTime": 1369180800, "reviewTime": "05 22, 2013"}
{"reviewerID": "A3DMR234MWQYSE", "asin": "0739040375", "reviewerName": "S. M. Barden", "helpful": [3, 4], "reviewText": "Gilbert is a master player and instructor - and I think we all know that those two things don't necessarily go together.  His technique on this DVD is jaw dropping.  I really don't think it would be possible to alternate pick faster with the clarity Mr. Gilbert brings to the instrument.  Paul seems to have both sides of his brain fully developed - the artistic left side that rocks out with gut searing intensity and emotion, and the geeky analytical right side that can perfectly explain and break down why it all works.  I own literally thousands of guitar instructional materials that I've purchased over the last thirty years, and can honestly say that this DVD ranks in the top three.  If you are at all interested in shred guitar, you simply have to buy this.  Many of us paid $40 or more per VHS tape for the original videos (parts I and II), so this DVD is an amazing bargain at this price.  Thanks, Paul!", "overall": 5.0, "summary": "Amazing, inspiring DVD", "unixReviewTime": 1204848000, "reviewTime": "03 7, 2008"}
{"reviewerID": "AX5ZI7JZMA2SY", "asin": "0739040375", "reviewerName": "stu pierce \"Hard Rock Fan 01\"", "helpful": [3, 4], "reviewText": "I have been playing guitar for more almost 20 years and I wish I had this DVD back when I was trying to develop my shred guitar technique. Couple this DVD with a book like Speed Mechanics by Stetina and you have all you need to start shredding. Paul is such a virtuoso shred player, he will blow you away with licks played at the speed of light!! He however slows  all these licks down and even shows every small detail in achieving these licks from alternate picking, sweeping, sequences, sweep-tap, legato and more!!You will also need a metronome and LOTS of practice time to learn these techniques. When you master them you won't regret it since you will playing with terrifying technique.If you want to play like Paul Gilbert and other master shredders out there, this is the DVD to start with. And for this price you can't go wrong.", "overall": 5.0, "summary": "Ultimate Shred Manual", "unixReviewTime": 1195776000, "reviewTime": "11 23, 2007"}
{"reviewerID": "A1K1ZKOHP4RQTW", "asin": "0739040375", "reviewerName": "Thegolfingfisherman", "helpful": [0, 0], "reviewText": "If your leads only consist of Box 1 of the minor pentatonic scale, this DVD will leave you in the dust quickly. This is only for guitar hero-shredder types that have real chops. You need to be fluent in music theory, you must have absolute command of the entire fretboard, and you need to be fast in all the scale modes to keep up with the material. The video is very entertaining and packed with info that will help any guitarist no matter your skill set; the problem is, you won't be able to play the examples up to speed. Watching a virtuoso like Mr Gilbert run up and down the fretboard at the speed of light is worth the price of the DVD. An amazing guitarist!", "overall": 5.0, "summary": "Only for accomplished players; but jaw-dropping content", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "A1FWCIDD38DYMU", "asin": "0739040375", "reviewerName": "Thinker \"Ryne\"", "helpful": [4, 5], "reviewText": "Paul Gilbert is one of the best guitarists in the world. Lucky for us, he's also a really down to earth guy and is a great teacher. While all of Paul's DVDs are great, Intense Rock helps you lay the groundwork to play shred metal.From the first simple exercise to the last terror lick, Intense Rock is an exercise in the development of shred technique. Paul is a great teacher who actually slows down the licks and explains how he plays them. He certainly isn't too haughty to forget what it was once like to be a student. Pair this up with Troy Stetina's shred masterpiece, \"Speed Mechanics for the Lead Guitar,\" spend most of your free time practicing, and you'll be able to shred. (There's no great secret to technique! It takes time, drive, patience, and belief in one self.)John Petrucci's Rock Discipline is highly recommended as well, since Petrucci, while less wacky and attention-grabbing than Gilbert, is a great teacher as well. Although, I would say it's better for those who've already bettered there technique, and have, thus, seen some concrete rewards for their playing. The Intense Rock ( and Speed Mechanics, for that matter) exercises are very musical, and are therefore easier for the beginning shredder to practice for an extended period of time, than Rock Discipline which has a lot of (valuable) atonal exercises.", "overall": 5.0, "summary": "Are you serious about shredding? If so, then get this instructional!", "unixReviewTime": 1206230400, "reviewTime": "03 23, 2008"}
{"reviewerID": "AWU110TP1HTPF", "asin": "0739040375", "reviewerName": "Thomas A. Gaston \"TG\"", "helpful": [2, 2], "reviewText": "Paul is the master of fast guitar licks. I mean Wow!!he teaching very valuable technique that is helping me improve my speed. I've got all the DVDs and bought them for my kids too! Thanks Paul!!!Tommy G", "overall": 5.0, "summary": "Intense Review", "unixReviewTime": 1201132800, "reviewTime": "01 24, 2008"}
{"reviewerID": "A1JQDMDHOZTYCV", "asin": "0739040375", "reviewerName": "Tim Jennings", "helpful": [0, 0], "reviewText": "Thank you for my Paul Gilbert DVD. It is double plus premium and A-Okay! I now own Paul Gilbert guitarist on video. He is trapped forever!", "overall": 5.0, "summary": "DVD ROCKS", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}
{"reviewerID": "A3P3QBFRD6LR3L", "asin": "0739040375", "reviewerName": "Tri Tran", "helpful": [1, 2], "reviewText": "This video guitar lesson is for those who want to get a bit more technical into their repertoire. Intense Rock 1 has old school Paul (good old Racer X days) teaching us the basics of soloing, scaling and just good guitar playing overall. I like how he also incorporates funny skits in between sessions which is great cos learning guitar is meant to be a fun experience too (in his case anyways). Intense Rock 2 kinda builds on the first, introducing a few more patterns and sequences. Paul continues his humorous presentation keeping the audience awake and laughing. I play with a whammy bar so it's a bit of a shame PG doesn't like it too much but that's his playing style I guess.Overall PG is a cool and fun down-too-Earth guitar teacher you won't be disappointed. Oh and did I mention he's the world's 4th fastest guitar player?", "overall": 5.0, "summary": "Paul Gilbert. Nuff Said", "unixReviewTime": 1258502400, "reviewTime": "11 18, 2009"}
{"reviewerID": "APR59BMJNHKHX", "asin": "0739040375", "reviewerName": "T. R. Mills", "helpful": [3, 4], "reviewText": "Paul Gilbert instructs viewers in his style of incredibly fast guitar playing while entertaining you with \"guitar tricks\" and Cheerleader segways.  A must buy for anyone who wants to learn speed picking techniques with a sense of humor.", "overall": 4.0, "summary": "Entertaining and informative", "unixReviewTime": 1178582400, "reviewTime": "05 8, 2007"}
{"reviewerID": "ALKPRBP7WIUE2", "asin": "0739040375", "reviewerName": "W.G.B \"Brownsound\"", "helpful": [5, 6], "reviewText": "I've worn out this video over the years cause I got it on VHS,now its on DVD! My few comments on Paul Gilbert is that through his playing,he show's alot of discipline and passion on the way he play's. but most of all, he's passionate about music thats why he got to the level of where he's at. I've meet him couple of times at a NAMM show and it was like talking to the next door neighbor. no rocks star attitude just plain Paul Gilbert DOWN TO EARTH...If your like me who's alway's practicing to get better all the time and to learn more, GET THIS DVD and apply the skills you learn from Paul in a band situation when its called for. I happen to be fortunate that growin up in the 80's doing this stuff called shred playing was the NORM back then, so I caught up to this GIT style real quick and for the most part,this was the ticket to be in a band back then.if you've never done this kinda stuff then be prepared for some seriouse learning curve adjustments. Dont give up keep up on practicing and discipline,some things dont come easy but when you get there, its personaly an awesome accomplishment,convidence builder. but most of all one's you can master 2 or 3 of Paul's licks it comes easier cause it builds on top of each other. happy picking and have some good laughter on Paul's humor...", "overall": 5.0, "summary": "a must have!!!!!!!", "unixReviewTime": 1183161600, "reviewTime": "06 30, 2007"}
