{"overall": 4.0, "verified": true, "reviewTime": "03 11, 2014", "reviewerID": "A240ORQ2LF9LUI", "asin": "0077613252", "style": {"Format:": " Loose Leaf"}, "reviewerName": "Michelle W", "reviewText": "The materials arrived early and were in excellent condition.  However for the money spent they really should've come with a binder and not just loose leaf.", "summary": "Material Great", "unixReviewTime": 1394496000}
{"overall": 4.0, "verified": true, "reviewTime": "02 23, 2014", "reviewerID": "A1YCCU0YRLS0FE", "asin": "0077613252", "style": {"Format:": " Loose Leaf"}, "reviewerName": "Rosalind White Ames", "reviewText": "I am really enjoying this book with the worksheets that make you review your goals, what to do when you do not make it, it reminds me  of my human sexuality classwork.", "summary": "Health", "unixReviewTime": 1393113600}
{"overall": 1.0, "vote": "7", "verified": true, "reviewTime": "02 17, 2014", "reviewerID": "A1BJHRQDYVAY2J", "asin": "0077613252", "style": {"Format:": " Loose Leaf"}, "reviewerName": "Allan R. Baker", "reviewText": "IF YOU ARE TAKING THIS CLASS DON\"T WASTE YOUR MONEY ON THIS SO CALLED BOOK! $140.00 FOR A \"BOOK\" THAT ISIN'T EVEN BOUND LOOSE LEAFS, THAT I HAD TO PROVIDE MY OWN BINDER FOR. TURNS OUT YOU CAN BUY ACCESS TO THE BOOK AT MCGRAW HILL CONNECT CORE FOR $70.00\n\nTHIS BOOK IS A COMPLETE WASTE OF MONEY!", "summary": "ARE YOU KIDING ME?", "unixReviewTime": 1392595200}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "02 17, 2014", "reviewerID": "APRDVZ6QBIQXT", "asin": "0077613252", "style": {"Format:": " Loose Leaf"}, "reviewerName": "Lucy", "reviewText": "This book was missing pages!!! Important pages. I couldn't answer some test questions because of it!! I have never had this happen before.", "summary": "missing pages!!", "unixReviewTime": 1392595200}
{"overall": 5.0, "verified": false, "reviewTime": "10 14, 2013", "reviewerID": "A2JZTTBSLS1QXV", "asin": "0077775473", "reviewerName": "Albert V.", "reviewText": "I have used LearnSmart and can officially say that this is an amazing study tool that quickly and simply adapts to your style of learning. You can access it at anytime and it is on the go! Once you start using LearnSmart you will quickly realize that this is the best way to learn and study.\n\nI am a business student and I did not use LearnSmart for my Accounting I class, however, I did use it for my Accounting II class. The grade difference from Accounting I to Accounting II was a whole letter grade... thanks to LearnSmart!\n\nEvery college student should definitely check it out!", "summary": "Best study product out there!", "unixReviewTime": 1381708800}
{"overall": 4.0, "verified": true, "reviewTime": "08 15, 2011", "reviewerID": "AGN3T5ERYJN5A", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Skipper management", "reviewText": "Strong backgroung, good read, quite up to date. It takes a holistic approach to the subject. Lack of references is a bit surprising.\nJorge", "summary": "E-marketing 6th ed", "unixReviewTime": 1313366400}
{"overall": 3.0, "verified": false, "reviewTime": "10 9, 2010", "reviewerID": "AHPK2GD0SQC59", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "dstmars", "reviewText": "If you live on Mars and never heard of the internet, this is a good book to have.", "summary": "Mars calling Earth....what is internet?", "unixReviewTime": 1286582400}
{"overall": 5.0, "verified": false, "reviewTime": "10 3, 2010", "reviewerID": "A35UC8LHA6TILH", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Knw1989", "reviewText": "i got this book on amazon and it ended up saving me a lot of money.  It was in great condition and has been extremely useful to me.", "summary": "good book, saved me a lot of money", "unixReviewTime": 1286064000}
{"overall": 5.0, "verified": true, "reviewTime": "10 3, 2010", "reviewerID": "A2IH0AJPR7IWG3", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Tam", "reviewText": "I was very happy with this purchase because the shipment was super fast.  Thanks", "summary": "Super fast", "unixReviewTime": 1286064000}
{"overall": 5.0, "verified": true, "reviewTime": "05 23, 2010", "reviewerID": "AL87GELNJGOH3", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "R. Rowley", "reviewText": "Recieved in a timely manner- book in great condition. Some markings- but ledgible. Will be ordering again from this site for my school books- saved over $200.", "summary": "E-Marketing", "unixReviewTime": 1274572800}
{"overall": 2.0, "vote": "3", "verified": true, "reviewTime": "05 3, 2009", "reviewerID": "A1CUJ6ZT82H7LS", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Brian", "reviewText": "Maybe it's just me (I have no marketing background but desperately want to learn for my start-up) but I cannot get hardly anything out of this text. I have tried very hard to tread through the writing and learn something useful but chapter after chapter seems to be the exact same thing... overly wordy, rambling & unnecessarily academic writing with no comprehensible message behind it, no strategies I can apply to my own business and no organization that I can make sense of. Feels almost like I'm reading a paper a college student BSed their way through with a whole bunch of long words and cryptic sentences in order to sound impressive. What a rip-off. I paid $70 for this and it has been the most useless book I've paid for in my research process (and I've read 16 other books thus far to help me with my venture).\n\nThe only reason I'm giving this two stars and not one star is that out of the first six chapters I've read, two of them actually made sense. One was on International Marketing and did a very good job explaining the technology limitations of other countries and the ways foreign citizens adapt to this and use technology. This is actually very helpful information and I'm going to use it. The second was on the legal and ethical aspects of using the internet. It gave an extremely concise explanation with lots of info and it was easily understandable. Unfortunately, I've read a chapter like this over and over and over again in pretty much every e-business book I've picked up so far so it's getting old.", "summary": "This book is intolerable", "unixReviewTime": 1241308800}
{"overall": 5.0, "verified": true, "reviewTime": "07 12, 2013", "reviewerID": "A3HB3SSFVVZNH0", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Sherry Knight", "reviewText": "This was the textbook that I used for my E-Commerce course. I was able to understand it and to stay focused while I read it.", "summary": "fast flowing", "unixReviewTime": 1373587200}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "06 23, 2013", "reviewerID": "A1OU9LR6C03LNB", "asin": "0132147556", "style": {"Format:": " Kindle Edition"}, "reviewerName": "John", "reviewText": "Not worth the price. Most of the concepts are pretty superficial. The authors are also a little behind on the times.", "summary": "Very simplistic", "unixReviewTime": 1371945600}
{"overall": 3.0, "verified": false, "reviewTime": "06 17, 2013", "reviewerID": "A1M4P30L5OACAI", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Steve Pickering", "reviewText": "This book served as the textbook for the first of a 3-course series on internet marketing for my MBA course.  While it was acceptable as a textbook - a broad survey of E-commerce for academic use - it would not be worth the considerable cost for someone who did not need it for a course.\n\nFor an academic course, the book serves as a base by providing definitions and explanations for a broad range of topics.  In my course, the book was used to introduce a number of topics that were discussed in further detail during class discussions, and it was supplemented by case studies, videos, and articles with more depth.  A non-academic reader would not have those enrichment elements available, thus would likely find the book less useful.\n\nThe book does not explain how to do anything (set up an online store, write a blog article, configure analytics, etc.).  It is a decent text for someone looking for a broad view of e-commerce with emphasis on defining terms and covering the big picture.\n\nI do not recommend this book for anything other than a required course text.", "summary": "OK as a Textbook - Not Written for General Reading", "unixReviewTime": 1371427200}
{"overall": 4.0, "verified": true, "reviewTime": "05 11, 2013", "reviewerID": "A23DD7WBLNKFTP", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Ivan Mercado", "reviewText": "I love how this book is structurated and the fact that it contains details graphics so the newbie cannot be lost at any minute.\n\nAlso, it has a pretty amazing list of sites and webmaster tools, which makes this book \"a must\" on everybodys Internet marketers shelf :)", "summary": "Writing in plain english and a good aproximation to the Internet Markting world", "unixReviewTime": 1368230400}
{"overall": 5.0, "verified": true, "reviewTime": "04 14, 2013", "reviewerID": "AOQWD3PX50G5X", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Joy Ching", "reviewText": "Great on the delivery...doing my assignments as I write.  The shipping charge was a little pricy, but the book was in great condition (and did not smell like smoke...as other books I had purchased).  Thank you.", "summary": "E-Marketing 6th ed.", "unixReviewTime": 1365897600}
{"overall": 5.0, "verified": true, "reviewTime": "03 2, 2013", "reviewerID": "AY92PG46ZKQBR", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Mark D New Jersey", "reviewText": "The book was delivered faster then I had been told and was in great condition. This book is a required text for my college class and is well written.", "summary": "Good condition", "unixReviewTime": 1362182400}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "01 21, 2013", "reviewerID": "A35GEWDC14WGPG", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "StlAmazon", "reviewText": "Required to buy this book for Marketing 3721 class and we rarely used it. Even when we did, I felt the text was out dated and not very informational.", "summary": "Bought for school", "unixReviewTime": 1358726400}
{"overall": 1.0, "verified": true, "reviewTime": "05 26, 2012", "reviewerID": "A3VJPFC93LY4OS", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "WinterWonderLand", "reviewText": "Didn't help me much in my course.  I didn't learn much from it.  Had to look information on web to pass my course.", "summary": "Useless", "unixReviewTime": 1337990400}
{"overall": 1.0, "verified": true, "reviewTime": "05 2, 2012", "reviewerID": "A1N8M648G5E2BM", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Stephanie Tracey", "reviewText": "Disappointing textbook. To start, the lack of color is dismal, but of less importance. However, from a MARKETING book, I expected it to be a little more eye-grabbing.\nMore importantly this book regularly cites wikipedia as a source, and I caught at least two examples of incorrect information when discussing how companies fit certain profiles. In one example it states that Kit Kat is a Nestle brand when it is produced by Hershey's. It also uses companies as examples that have long since been bought out by other companies. While neither of these two items errodes the core idea of marketing, they were just easily spotted. It makes it difficult to trust the core information when something so simple as a little research could correct these errors. Along with the wikipedia citing, I don't know that I would trust this source as 'authoritive'", "summary": "terrible textbook", "unixReviewTime": 1335916800}
{"overall": 4.0, "verified": true, "reviewTime": "08 29, 2011", "reviewerID": "A2CUJPF5AWEKIY", "asin": "0132147556", "style": {"Format:": " Paperback"}, "reviewerName": "Hoa Nguyen", "reviewText": "This book provides me many useful knowledge about E-marketing, from the most basic steps. So I really enjoy to read!", "summary": "E-marketing", "unixReviewTime": 1314576000}
{"overall": 4.0, "verified": false, "reviewTime": "10 20, 2010", "reviewerID": "A38NELQT98S4H8", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "WB Halper", "reviewText": "I've been using Dreamweaver (and it's predecessor Macromedia's UltraDev) for many years.  For someone who is an experienced web designer, this course is a high-level review of the CS5 version of Dreamweaver, but it doesn't go into a great enough level of detail to find it very useful.\n\nOn the other hand, this is a great tool for someone who is a relative novice at web design.  It starts off with a basic overview of HTML and continues through the concepts necessary to build a modern web site.  Someone who goes through this course should exit with enough knowledge to create something that does what you want it do do...within reason.  Don't expect to go off and build an entire e-commerce system with only this class under your belt.\n\nIt's important to note that there's a long gap from site design to actual implementation.  This course teaches you how to implement a design.  The user interface and overall user experience is a different subject that isn't covered here...it's possible to do a great implementation of an absolutely abysmal design.  I speak from experience.  :)\n\nAs I said above, if you're a novice, a relative newcomer or just an experienced web designer who wants a refresher course, this is a good way to do it.", "summary": "A solid overview of Dreamweaver CS5", "unixReviewTime": 1287532800}
{"overall": 4.0, "verified": false, "reviewTime": "10 18, 2010", "reviewerID": "A3QJU4FEN8PQSZ", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Grimmy", "reviewText": "The demo is done with the PC version, with references to the Mac version when needed. The video is closed-captioned. You can set bookmarks. There are self-tests for each chapter as well.\n\nStarts off with \"what is HTML\" and some other basic stuff. Includes topics such as: Planning your Website; Defining a site in DW; Creating a new web page; Adding Text; Formatting with CSS; Images and rich media; Links; Page layout w/ CSS; Tables; Forms; Reusable Content; Testing; etc. Each section has sub-sections with their own video, and some have sub-sub-sections to flesh out the material, such as the one regarding project management, or CSS, which includes discussion of CSS for print. It is not, however, a tutorial on \"the best way to lay out a site using CSS\" or anything like that. For that, you'll need a book or two on that subject.\n\nShe has a site that has some helpful resources, e.g. checklists for project management and site development, and helpful URLs. All in all, it's a decent introduction to creating web sites.\n\nShe sounds weird, though, like a robot (or Stephen Hawking's voicebox) with her halting, clipped delivery. She tends to be slightly chatty and repeat material, but it's not that bad; could be helpful for retention for people new to the subject.\n\nUI - at the top of the interface, there's a \"Previous Video\" button and \"Next Video\" button. The \"Next Video\" button is disabled for the last video of each chapter, so to get to the next one you'll have to use other navigation. This is because the last item is the test. Kinda dumb UI choice, initially confusing. They could have changed it to read \"Take Test\" instead of putting up a virtual dead end. There is a sidebar which is normally hidden (you are cued that you can display it when the mouse strays into the video area), which has information on the current video and lists/links to the other videos in the chapter. The title bar (under the top-left tabs) is a dropdown to navigate the content.\n\nThere's a \"Watch and Work\" mode which shrinks the video display to let you work with your copy of DreamWeaver (not included). You can move the video window around BUT you CANNOT resize it - and it may be kind of tiny to watch in that mode. So if you have a dual monitor setup, you'll want to drag the Standard Mode video player to the other screen; Standard Mode cannot be resized to be smaller, either.\n\nAll in all, a good value if you want to learn DreamWeaver.", "summary": "A good value", "unixReviewTime": 1287360000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "10 16, 2010", "reviewerID": "ACJT8MUC0LRF0", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "D. Fowler", "reviewText": "If you've been wanting to learn how to create your own website, but have either lacked the confidence or knowledge, this affordable combination book and video course will enable you to learn at your own leisure.  There are more than twelve hours of video training included in this package, most of it split up in the small, absorbable sections.  This courseware is \"Certified Associate,\" approved courseware.  Dreamweaver is the premier product for website creation.  It offers several new advantages/features for the user.  It has improved dynamic applications, new CSS features that offer more control over your design, you can turn individual CSS properties on and off (you can see how they affect your designs), and you can fuse box model elements to troubleshoot directly within Dreamweaver.  If you are confident this DVD/book bundle is for you, you can simply bypass this review or read some shorter versions (this is a very long review).  If not, keep on reading.\n\nWith this software you'll learn a lot of basics, however, if you are already a web designer or have a lot of experience, you may find a lot of the material to be redundant.  On the other hand, if you are anxious to learn web design, this is the perfect place to start.  Taking a course can cost you a lot of $, but this course is quite affordable ... if you decide it is not for you, then you can hand it along to someone else.  You'll be getting more than twelve hours of video training from \"Adobe Certified Instructors\", a reference book, lesson files, and you can copy certain files to your iPhone, iPod, or iPad.\n\nFor the hearing impaired the script to the dialogue runs along the bottom as the narrator speaks. You can stop the video at any time to get a closer look at what is being done and/or absorb the material.  At the end of each section is a \"test\" to enable you to know just how you are progressing on each section.\n\nIf you are in a bookstore you can easily pick up a copy and glance at the book, but you cannot see what is on the DVD.  I'll try to describe what is on the DVD to the buyer can get a good understanding of what is on there and can decide if Adobe Dreamweaver CS5 is what they need. I've simply listed the few words under the contents and have tried to briefly explain what you'll be learning on the videos.\n\nCONTENTS:\n\n1) HTML Refresher - This is an excellent section for someone who already knows HTML, but could use a refresher in the form of a \"crash course.\"  You'll find a URL overview, an HTML intro (tags, how some browsers read tags differently, and what Dreamweaver \"does behind the scenes).\n\n2) Dreamweaver Introduction - You'll finally be able to learn what WYSIWYG is, you'll be introduced to Dreamweaver Design, Code, and split screens, and the welcome screen.  You'll learn about the Dreamweaver interface, the Workplace Switcher (the software's workplaces, arranging and saving your workspace), how to customize your workspace, setting up our preferences, an dhow to customize the insert bar.\n\n3) Getting a Quick Start - You'll learn about several starter layouts you can customize with CSS, how to build a starter layout page, how to create and set up the header area on a homepage, how to add a navigation bar (shows how to customize with CSS), how to use CSS to format your main content, you'll learn how to add links using CSS formatting, how to modify HTML tags and background color using CSS, and how to add a page border.\n\n4) Planning Your Website - You'll learn about project management (five videos), site development (two videos), and how to test your site (two videos).  You can opt to play all the videos in each section consecutively.\n\n5) Defining a Site in Dreamweaver - You'll learn about defining a site, what the benefits there are to defining, the course setup (copying & storing the files you'll need for your website), defining a site in Dreamweaver, and how to use the files panel.\n\n6) Creating a New Web Page - You'll learn how to create a web page by using the Welcome Screen, how to save a web page (considerations needed when naming a page), how to assign a proper title to a web page, and you'll learn what meta tags do and why they are important.\n\n7) Adding the Tex Content - You'll learn three ways to add text to your webpage (typing, copying/pasting or importing), how to set up headings, how to create lists for web pages (unordered, ordered, and definition), several ways of highlighting text, and how to insert special characters.\n\n8) Formatting Text with CSS - You'll receive an overview of text formatting options with CSS, you'll learn where you can manage and store the styles for you site, how to \"create a .CSS file and link your web pages to it,\" create styles for HTML tags, create class styles, edit styles, you'll learn how to add font styles (custom font stack), you'll learn about styles created by page properties, CSS styles for printing, and how to use the code navigator.\n\n9) Images and Rich Media - You'll learn how to pick the right web image, how to choose the file format for your project, the importance of inserting alternate text, inserting images, understanding and creating file paths, you'll learn how to use the assets panel, how to modify images, you'll learn how to work with Photoshop Smart Objects, use Flash Files to enrich your site, use Flash Video (FLV), and will learn how to optimize the use of your favorites panel.\n\n10) Creating Links - You'll learn where you can insert hyperlinks, the different kinds of links you can create, how you can link to an Internet resource, how you can create a \"local lin\" for a document within a single site, how to link to a Word or Microsoft Excel file, how to create an anchor link, how to create an email lin (with the recipients address pre-filled), you'll learn about images and image mapping (clickable hotspots), how to create rollover images, and how to insert a navigation bar (Fireworks).\n\n11) Page Layout with CSS - You'll learn background information about CSS, how to master the mechanics of CSS page layout, how to understand the box model, how to insert a div tag, how to add different styles to your div tags so CSS can control you page content, you'll learn how to edit CSS style for a div tag, how to insert a div tag (increase your efficiency), options for using div tags, fine tuning your page with different styles, customize your links (make your site attractive and consistent), center your page content, use AP elements, use inspection tools to edit and troubleshoot, you'll learn about the four types of positioning with CSS, and you'll learn how to use CSS selector types and tools.\n\n12) Tables - You'll learn how easy it is to create a table, options you can use to modify a table, use CSS for formatting tables (match text to the rest of your website), importing tabular data, merging and splitting table cells, working on rows and columns, and table alignment (border background colors, centering).\n\n13) Forms - You'll learn how create a basic for, how to use text fields (common HTML elements), ensure \"user input gets back to you,\" form validation (checkboxes, submit buttons), how to validate forms, and use Spry for from validation (implement Ajax).\n\n14) Reusable Content - You'll learn about templates and library items, how to use the library, modify a library item (keeping your pages contemporary), converting HTML to a template, creating additional pages based on your template, controlling and working with \"editable\" regions, template application, and you'll learn how to detach a page from a template.\n\n15) Testing - You'll learn how to use the spell-checker, search for a fix broken links, how you can preview your work, how to check browser compatibility, dealing with browser issues, how to allow users to test your site and offer valuable feedback, learn about page loading time an dfile size, and Dreamweaver extensions.\n\n16) Publishing and Maintenance - You'll learn how to manage you files, set up your web server to upload and download files directly to the site from Dreamweaver, learn how to expand files, incontext editing (allows non-technical users to edit the web page), Subversion control and integration features.\n\nYou'll also be treated to four bonus videos.  This was a long review, but hopefully anyone looking for core training in web communication will now know exactly what they will receive when they purchase this program.", "summary": "This is excellent software for those who want to use it as a \"crash\" refresher course or for the wannabe web designer ...", "unixReviewTime": 1287187200}
{"overall": 5.0, "verified": false, "reviewTime": "10 14, 2010", "reviewerID": "A2RQ0AT4XZUIXL", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Dr. Cathy Goodwin", "reviewText": "I've been working with Dreamweaver for a few years now - learning as I go. When I got a chance to request these videos, I thought I'd get a chance to learn Dreamweaver, finally, to maximize its capabilities. And I was totally blown away.\n\nThe videos are superb. The female voiceover is pleasant and very straightforward; there's no attempt at humor and no attempt to replicate a classroom course. The program uses live action sequences to walk us through specific examples, step by step. I was amazed at how many Dreamweaver features I haven't used, just because I didn't even notice they were there.\n\nI am not a web designer but I do know HTML and some CSS. If you don't, I'm not sure the opening video will be enough. It's not like Wordpress where you just dive in.\n\nThe only negative comment I can offer is that the DVD was really hard to dig out of the box! Grab some scissors before getting started.", "summary": "Wonderful introduction to Dreamweaver", "unixReviewTime": 1287014400}
{"overall": 5.0, "verified": false, "reviewTime": "10 12, 2010", "reviewerID": "AYUF7YETYOLNX", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Bryan Newman", "reviewText": "I've been creating websites with Dreamweaver for years now, and all that experience has taught me one thing - I'm a hack web designer.  Recently I have been trying to learn industry CSS standards and had heard that Dreamweaver has made great advances in CSS management in CS4 and CS5. I'm embarrassed to say what version I am using.\n\nWhen I got a chance to get a reviewer copy of this training set I jumped for two reasons, first I was mulling over spending the money to upgrade to DW CS5 and I second I have always that I was missing out on a lot of DW's capabilities.  It's now obvious that I should upgrade for the CSS management upgrades alone.\n\nAs for the value of the training - I couldn't be happier.  This is not an advanced tips and tricks resource, nor is it an exhaustive boot camp in web page authoring, but it is a fairly thorough training taking you from site planning and design to creation and publishing.  I watched the videos from beginning to end and they start pretty basic with an HTML refresher then move to the meatier DW specific training.  I can see myself returning to several sections later to brush up.\n\nPersonally, the CSS, Media, and Forms training videos were enough to justify the price tag.  The training lessons were short and easily digestible.  I liked that it broke training into 3-10 minutes so I had some time to do a little more in-depth googling on subjects like text wrapping on absolute positioned CSS objects (which it won't.) or checking my version of DW.\n\n  What this is\n  - An Adobe Certification Training Aid - so it starts from a very low level introduction and  goes through the entire DW web creation process\n  - A wonderfully designed interface\n  - A great overview of using DW\n\nWhat it isn't\n  - A substitute for spending the time working with DW (but it will jump start a novice)\n  - An expert tips and tricks reference\n\nAll in all, I highly recommend this to anyone trying to learn DW or even web design in general. The CSS placement section has been the most enlightening coverage of the topic I have been able to find.  The author's delivery on the videos is great and the interface is the best, most intuitive I have seen. The only bad thing I can say is that the closed captioning is defaulted on, so at times it covered the bottom of the properties table at the bottom of the screen. So sometimes I had to close it to see things the author was pointing out.  But all in all, this is an absolutely wonderful product.", "summary": "A Fantastic Overview of Dream Weaver and Web Design in General", "unixReviewTime": 1286841600}
{"overall": 5.0, "verified": false, "reviewTime": "10 7, 2010", "reviewerID": "A31ICLWQ9CSHRS", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Al Swanson", "reviewText": "I decided (after trying a number of other products) to switch to the gold standard of web site management, Dreamweaver. I bought a few books, did some Lynda courses and still found myself wanting more. This was the perfect product for that \"more\".\n\nI think some reviewers are confused about both Dreamweaver and this product - these aren't for \"design\". If you don't already know what you want to do, picking up Dreamweaver is not going to help! The product being reviewed here is how to use Dreamweaver - not how to design for the web. Both expect you already have the design part.\n\nI used a pure HTML editor, which for beginners is the best way to go. You'll learn HTML and CSS along with exactly how your code changes your page. DW is more for time savings and automation. That said, it's also massively complex with a steep learning curve. And that's where Learn Adobe Dreamweaver comes in. It very clearly takes you through learning DW so that you can get on with designing web pages.\n\nExcellent addition to my library and excellent companion to Dreamweaver itself. The only other thing you might need is one of the large reference books on DW to refer back to if you have questions.", "summary": "Excellent Tutorials!", "unixReviewTime": 1286409600}
{"overall": 5.0, "verified": false, "reviewTime": "09 26, 2010", "reviewerID": "A2BVNVJOFXGZUB", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "J. Howard", "reviewText": "The video is well-paced and delivered in an understandable manner.  It allows you to work with the software while watching and following the directions of instructor Candyce Mairs.  To me, the book is more of a reference guide, something I would access with a specific need or question, because overall I learn better by seeing and doing than by reading.  The video starts with the basics and builds logically.  This is everything you want in a teaching video/book!", "summary": "Excellent.", "unixReviewTime": 1285459200}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "09 24, 2010", "reviewerID": "A30X750M8V1XXW", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Scott", "reviewText": "I've taken classes, read books and did the dummies books but can't seem to learn Dreamweaver well enough to design a web site the way I want. I had really hoped that this dvd video that is \"Adobe Approved\" would have helped, but it fell short. First off I do want to give kudos for the way the software interface is designed. They made it very easy to navigate and find specific contents and general ease. Candyce Mairs, the teacher, gives excellent explanations and speaks clearly and at a good pace. The pace isn't too fast or too slow and I never had to rewind to listen to instructions over and over.\n\nThe course begins with the absolute basics so this is where it really breaks everything down about Dreamweaver. Being I knew most of the basics, after an hour, skipped some of it because I already knew it. The first problem I have with this training video is that you are taught to design websites from 1990. The look of them is so out dated and old its a waste of time learning it this way because anyone wanting to design a web site would not want one that looks so out dated and blah. When the videos finally get around to showing the \"CSS\" style designing, they show an example of a web site that is current in design and style. Exactly what I was wanting to learn but they don't use it for the training...WHAT? are they joking? They go back to the 1990 styled site that they show you in the beginning of these videos and TRY to update and revamp it into CSS. I wanted to focus on the CSS portion because for my needs, this is the missing info that has held me back on finally learning and make a modern web site using Dreamweaver.\n\nThe sample that they should have used to teach the CSS had many bells and whistles like when you scroll thru the site the background didn't move. The background was a great illustration photo! Then there were great drop down sub nav links that all had different colors, maps, columns, video etc. Again, all the modern bells and whistles. Yes, they do teach many of these features but in the OLD 1990 style, not in the CSS which is a complete different way of putting things into the program. I really wish they used the sample which they showed about how great CSS is. TOTAL BUMMER!!!!\n\nI have plenty of experience with web design, i'm no expert but have worked with many programs over the years as well as designed many custom sites that look modern. But unfortunately, I still am on the search to find the info I need to use Dreamweaver the way I want.", "summary": "Doesn't teach modern website design!", "unixReviewTime": 1285286400}
{"overall": 5.0, "verified": false, "reviewTime": "08 22, 2010", "reviewerID": "A1YA485UEJ5JZA", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Dennis Woodhall", "reviewText": "Candyce Mairs' offering is not only excellent, it is \"distintive.\"  Her presentational style is perfectly paced, and always directly to the point at hand.  I learned so much about Adobe's new version of Dreamweaver (CS5), that I cannot begin to explain.  Of particular note are the \"assets\" (Dreamweaver and related files) which are included on the DVD, making personal practice of the skills learned a snap.  For those new to web design, Candyce covers many foundational skills (such as HTML and CSS), along with Dreamweaver-specific functionality.  I would give this title six (6) stars, if I could.  In addition to thanking Candyce Mairs, I also applaud the folks at Video2Brain.  Great pedagogical tools!  Thank you to all who facilitated my learning of the CS5 in a \"ramped up\" fashion.\nDennis Woodhall, M.I.S., Woodhall Web Design and Hosting.", "summary": "Hurry and purchase this title NOW!", "unixReviewTime": 1282435200}
{"overall": 5.0, "verified": false, "reviewTime": "04 7, 2011", "reviewerID": "A2JMJVNTBL7K7E", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Yesuaini99", "reviewText": "I spent several hours on the lesson and I love it.\nIt is very detailed and very clear.\nThe instructions with the graph and the audio and the video playback is very nice.\nYou can cut or repeat any lesson you need and come back and review at your convenience.\nThe lesson starts with very fundamental knowledge of what an URL is and allow the students to know what is the source code, the layout and how to use the tools and maneuver in the Dreamweaver app.\nIt is an excellent tool to have.\nMost of us uses some of the tools but not all of the tools.  Some I don't even know the function was there.\nIt is nice to have a teacher like this I can go to easily without calling expensive tech support.\nHighly recommend this teaching series.", "summary": "excellent video training material", "unixReviewTime": 1302134400}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "01 25, 2011", "reviewerID": "AN4Y087DP2VZV", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Bernie V. Chiaravalle", "reviewText": "I'm about 3/4 through this course.  I have been using Dreamweaver for about 10 years but find it's good to take a course now and then to learn more about the program.  I mostly learned by myself so it's good to learn things I wasn't aware of.\n\nI find the instructors voice pleasant and thorough although I thought it took way too long to get down to business.  I didn't really feel like I was learning or doing anything until well into the lessons.  She also seemed to wander off course to much for my liking.\n\nI also found that she didn't prep me well enough for each lesson by telling me what files I needed and setting up Dreamweaver for each lesson.  I was frequently going to the DVD's Assets folder to get files that were missing from the lessons.  Luckily I have been using Dreamweaver long enough to know how to troubleshoot and find the missing parts.  But I wonder if a beginner would get confused and not know what to do without careful lesson setup.\n\nAnd I could swear there were a few mistakes on the lesson's end in the quiz answers at the end of each lesson.  Some questions were confusing.\n\nAll in all this is great way to learn visually.  Much better than a book in my opinion.  But I would ask for a good deal more attention in not leaving the student in the dark at times.", "summary": "Pretty good but some shortcomings", "unixReviewTime": 1295913600}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "01 25, 2011", "reviewerID": "A3EZEP0FX5BC1P", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "A Conrad", "reviewText": "This is my honest review of the Adobe Dreamweaver Learn by Video.  The DVD comes in a standard plastic disc holder in a cardboard box, which is part of the whole box package.  It DOES NOT come with Dreamweaver CS5.\n\nI thought it was a standard video DVD.  It is in fact a program that has to be executed (without installing anything on your computer.)  I am running it on a PC workstation.  My antivirus/spyware programs have not gone off yet, so there does not seem to be any malware associated with it.\n\nThe video contains over 12 hours of video instruction, and is accompanied by a printed guide book to teach the fundamentals of Adobe Dreamweaver CS5.  It also goes through some basic principles and fundamentals of web design.  The presenter (Candyce Mairs) is a clear and eloquent speaker, and is an Adobe Certified Instructor.  The video runs in the middle of the window, and you can select to have the sidebar available or hidden.\n\nFirst few chapters are very basic.  It is intended for those who have little or no background/experience with the terminology, such as \"URL\" and \"domain name.\"  Yeah, it's goes to the fundamentals.  I like the subtitle at the bottom of the video.  The first few chapters are so basic that I actually started writing this review while I the video is running on the other monitor (I have a dual-monitor setup).  The first chapter is dedicated to HTML fundamentals and also acts as a refresher for those who have the experience.  The second chapter is an introduction to what Dreamweaver is and what it can do.  Chapter 3 is a \"Quick Start\" chapter that gets the user setup with putting together a homepage (basic starter layouts, building the homepage, creating header area, etc.).  There are some tests at the end of each chapter to help reinforce what you've learned.\n\nWhat I liked:\n-This is a book designed for beginners.  As such, the first few chapters will be mostly overview and fundamentals.\n-The DVD comes with a guide book.  It helps with the video, and it can be brought around so you can read it without the video.\n-The course layout is logical, and therefore it makes sense.  I've seen so many poorly designed guides that jump all over the place, and this video guide is not one of these.\n-Having the a \"video\" of what the speaker is talking about really helps.  You can follow what the screen should look like.\n-The caption at the bottom of the video.  This was such a major positive.  A+++\n\nWhat I did not like:\n-The startup was not as straightforward as I expected.  Again, no big deal, but I can see how this could be a problem for those who do not know how to enable autostart, or those whose antivirus prevents the startup of an .exe file.\n-The DVD could have came with the trial version of Dreamweaver.  No big deal if you have a fast internet connection, but I know a few people who are stuck with a slow DSL speed.\n\nIn the end, you'll be familiar with the program's interface, and hopfully you will learn how to use the essential commands and tools to create and design websites.  It also identifies some areas that are typically and easily overlooked.\n\nThe book (printed guide) is glued onto the packaging with those sticky gel dots.  Though it can be separated from the box, it was not immediately obvious and I ended up carrying the entire package with me.  I wish the book was kept separated or maybe in a pocket.  No big deal.\n\nOverall, it is a nice beginner's guide to becoming familiar with and using Adobe Dreamweaver CS5.  Highly recommended.", "summary": "A very good video course to learn the basics of Dreamweaver", "unixReviewTime": 1295913600}
{"overall": 5.0, "verified": false, "reviewTime": "01 8, 2011", "reviewerID": "A14JBDSWKPKTZA", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Bob Feeser", "reviewText": "I have had Dreamweaver MX2004 since it came out back then. Spent years with it. Feel like I know it real well, but I am still familiar with tables as opposed to CSS. So I thought this would be a great introduction, and it is. The problem is that while I am looking at the video, and that simplifies things a lot, I am not getting the intuitive explanation as to why things work the way they do. I understand just knowing how to work them is sufficient. I'm tempted to delve into the rich full attributes of Dreamweaver CS5 as explained by this video, albeit difficult to understand the more advanced features, but I won't because this is about the video.\n\nThe opening salvo is chock full of... for example, this is the URL; this is where you type in the address bar etc. Only when you start to get into areas such as CSS do you get an introduction that for me is beneficial, and that is only because I am somewhat of a newbie to it. So there you have it, do you get an advanced lesson that flies through things and most find it hard to understand, or do you get this one and appreciate the fact that she walks you through everything step by step, even at the risk of boring the more in the know people, but finally arriving at the section you need to learn, and then appreciate that she is not moving at lightning speed.\n\nI'm holding off buying Dreamweaver CS5, although I got the upgrade to Photoshop CS5 and love it, because my MX2004 is not an eligible upgrade version. If I could qualify for the upgrade I would grab it, but the learning curve of CSS, and the steep price for the full version when I have MX2004 already is giving me some hesitation. If I was to upgrade, or should I say take the leap to the full version, this tutorial is the one I would use, and I also recommend the&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Adobe-Dreamweaver-CS5-on-Demand/dp/0789744449/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Adobe Dreamweaver CS5 on Demand</a>&nbsp;which makes a very good reference guide.\nAt some point I will get the new version of CS5 Dreamweaver, and at that point I will do the entire video series, and have a much more in depth analysis of it. But from what I can see after viewing a bunch of the video tutorials, it is the easiest way to indoctrinate you to the newest version. So I recommend it.", "summary": "Great Video for a Difficult at Times Program", "unixReviewTime": 1294444800}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/51chrYNW47L._SY88.jpg"], "overall": 1.0, "vote": "3", "verified": false, "reviewTime": "12 12, 2010", "reviewerID": "AH4NKNB6TYXRE", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Kevin Barrack", "reviewText": "Summary: EXTREMELY slow pace, awful stilted narration, redundant lessons and completely unprofessional page designs (imagine a mySpace page designed by a 13-year-old). HOWEVER, if you are a complete novice then this disc will teach you a lot. Just be prepared for a very very slow pace. If you've never designed a web page then this may get you started but it will probably leave you lost after a while, because although she spends a lot of time explaining things almost as elementary as how to use a mouse, she does not cover much of the most basic web design fundamentals you would get in a beginning course at a school. And you will only be shown extremely childish examples of actual visual design and layout of web pages. If you have designed a web page before, then there is probably 30 minutes of material at the end of the course that will be useful, and if you don't mind clawing your eyes out in frustration then you could take the time to watch some of the earlier lessons to learn about the Dreamweaver interface. However, as another reviewer noted, there is not detailed index, so you will spend a lot of time skipping through lessons to find the salient parts. There are many \"lessons\" where all she does is talk about what she is going to teach you in the next lesson, i.e. teaching you nothing.\n\nI used to code basic HTML by hand, but never learned CSS, so I wanted to learn it with this tutorial. I expected that to be part of the lessons but obviously not the majority. I also got Dreamweaver a while ago but haven't used it in years. I was patient at first, but then after a few hours of the most basic interface issues being hounded upon over and over again, I started skipping through lessons. And the author doesn't just give detailed lessons on how to use the Dreamweaver interface; she also goes in-depth to describe how to use basic OS functionality. Add to that her awkward, stilted speech and nasal voice (I'm not trying to be mean, but it just isn't professional), and I was pulling my hair out, even when listening to the lessons that I was interested in.\n\nExamples:\n\n* The bottom 10px of so of the screen in the videos is cut off, so that sometimes the narrator is referring\n  to something she's doing, but her cursor and what she's clicking on are not visible on the screen. In addition\n  there is a LARGE \"video2brain\" watermark obscuring some of the vital controls in the bottom right corner of the\n  screen, once again making it impossible to understand exactly what she is doing in the Dreamweaver interface.\n\n* An entire lesson (3:30 min) spent explaining how to create a new folder on your hard drive and change it's name.\n\n* Several minutes spent explaining how to open and close palettes and windows in Dreamweaver. (Not rocket science.)\n\n* Way too much time spent explaining basic OS/Browser functionality: Save/Save As functions, untitled documents,\n  naming HTML files, where page titles display on a browser window, how to bookmark sites in a browser and how\n  browser tabs work. None of this begins to expain how to use Dreamweaver, let alone build a web page.\n\n* The history of meta tags, featuring the quote \"It's a meta tag because it has HTML brackets and it says 'meta'.\"\n\n* An entire lesson (6.4) explaining how to select, copy and paste text -- elementary OS functionality. Really,\n  noting to do with Dreamweaver here! I'm not exaggerating. That was the lesson.\n\n* 5 minutes spent on making bold or italic text (not an exaggeration). Not via CSS either, just regular \"strong\"\n  and \"i\" tags, and using the clickable buttons [B] [I] to set them in Dreamweaver.\n\n* Time spent explaining how those little triangles on drop-down menus indicate that they are a menu with choices\n  that can be accessed. Didn't the first Mac television commercial in 1984 already cover that subject in-depth?\n  Or was that the Minesweeper tutorial?\n\n* Time wasted explaining how to select all text. Not something tricky about how to select text and not catch code\n  characters by mistake, just valuable time spent explaining that you could hit control-A to select all.\n\n* Six minutes and thirty seconds spent explaining what the different types of HTML links are. Not HOW to create them.\n  Not anything about styling them, or using javascript with them, or anything fancy like that. More than SIX MINUTES\n  explaining that you can have a basic hyperlink or an anchor link, perhaps talking about relative vs. absolute URL paths.\n\n* An example of her slow, wordy manner of speech. She adds 20px margin to something. Rather than saying \"that will\n  now add 20px around all sides of the object,\" instead she says it \"adds 20px to the right...the bottom...the left...\n  and the top edges.\" Now imagine that statement taking 10 seconds to utter.\n\n* The booklet is glued inside the box that the DVD comes in, so it is very inconvenient to reference or read\n  (bulky and inflexible).\n\nThis video was quite obviously not scripted. The narrator makes several flubs throughout and laughs about them. She CONSTANTLY repeats herself from one lesson to another, which wouldn't be so bad if it was just a reference to what she taught us in a former lesson, but she invariably re-teaches that lesson again, so that you are begging on your hands and knees to be taught something new, anything! If you want to see an example of the author's web design capacity, take a look at my screen capture added to the product photos, taken from this DVD, where she shows a picture of her personal website which apparently has templates available for download. It absolutely boggles the mind that this woman would be officially Certified by Adobe. And according to her bio on the product page, she is also a \"Certified Internet Webmaster.\" Let's dial the Wayback Machine all the back to 1995 and learn about what kind of responsibility THAT entails.\n\nLessons pertaining to CSS start at 11.2, which is dozens of lessons in. They do have some decent info.\n\nOverall, I think you can get better training by either going on YouTube (free! And some good stuff up there for specific issues.), or paying for a month of videos at Lynda.com, which is around half the price and much more professional. This DVD is overpriced and low quality. It does not live up to Adobe's otherwise impeccable standards.", "summary": "Embarrassingly Unprofessional", "unixReviewTime": 1292112000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 17, 2010", "reviewerID": "A19W47CXJJP1MI", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Amazonian Consumer", "reviewText": "For the cost of about $40 and 12 hours of your time, you can pretty effectively learn Adobe's Dreamweaver CS5 at your own pace and location. It is not a DVD that you just pop into a DVD player to sit back and watch passively on TV. In fact, this DVD is only playable on the computer, because it requires you to use the mouse to select many of its options.  It's interactive and allows you to go to any and section as needed. At the end of each chapter, there is a test that you can take to see how well you have been learning.\n\nThere are 17 chapters and each chapter is divided into various sections. In the Training Content screen, which is the home screen when you play the DVD, each chapter and section has its heading clearly spelled out, so that you know where to go when you are looking for a particular video. It's the sections that you can click to play; the chapters are just \"folder names\" for organization purposes. Each section can vary from less than 3 minutes to more than 13 minutes long, depending on the complexity of the topic discussed. You can pause the video at any time, and there is captioning at the bottom of the screen to enhance your learning experience. The sub-titling is also valuable for non-English learners to help them understand what was spoken.\n\nIf you are a beginner, the best way to learn this program is to start from chapter 1, section 1 and proceed in order to the last chaper, because this video starts with the basics and progresses to more and more complex topics.\n\nCompared to classroom instruction, I prefer using this Learn by Video DVD because it is very well produced with the instructor speaking clearly and the contents well organized. You can learn at your pace, always go back to review any section, and there is no way you can take a classroom instruction course for $40.", "summary": "Both the Most Effective and the Least Expensive Way to Learn Adobe Dreamweaver CS5", "unixReviewTime": 1289952000}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "11 16, 2010", "reviewerID": "A1FMWLZ9YY91XI", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "K. Kasabian", "reviewText": "As a print designer and Adobe CS user, I was most humbled by how different Dreamweaver is from my tools of choice, InDesign, Illustrator and Photoshop. This summer, when I had to learn Dreamweaver on the fly, I relied upon web forums and a nearly useless Dreamweaver book to get by. Now that I've completed one project, I'm finally ready and motived to learn after years of resistance. Enter Learn Adobe: Dreamweaver CS5 by Video at just the right time.\n\nWith more than 12 hours of video training and a full-color 120-page guide I can finally comprehend the basic principles of web design. The course covers an HTML refresher, good preparation for what's to come. I learned how to use the workspace to my advantage, how to add text, images and incorporate rich media and finally learned the proper way to use tables and forms. The publishing how-to is the icing on the cake and I can credit the video for my comprehension. It's much like having a private teacher who will patiently wait (when you press \"pause\") until you grasp a concept before moving on. Wish I had it a few months ago, but it'll be invaluable in the future. Recommended.", "summary": "Now I Get It", "unixReviewTime": 1289865600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "10 28, 2010", "reviewerID": "A2WCFDOCS73PNB", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Gadgetman", "reviewText": "I have also taken a local community college on-line course on DreamWeaver CS5 training. This video in comparison is quite a bit better in terms of the rich contents and course layout. The video has 17 sections covering the key elements of CS5 which allow the user to learn how to create a local web site from scratch and uploading it to the server. Each section is also broken down to several 3-6 minutes sub-sections which is just right in terms of the duration. At the end of each section there is also a test available to make sure you get a good understanding of the materials.\n\nThere are also some other additional useful features such as real-time caption and bookmarks which allows us to jump to our favorite section easily.\n\nAll in all, this is a great product for the price.", "summary": "Excellent value for the price", "unixReviewTime": 1288224000}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "10 28, 2010", "reviewerID": "A14638TGYH7GD9", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Rebecca Haden", "reviewText": "Even though I use Dreamweaver a great deal and own several books on the subject, I found this set very helpful. Candyce Mairs takes you through everything, from opening the program and setting up your desktop to creating a site. The focus is on the software, not on CSS or HTML or web design, so you'll end up with a through understanding of just how the software is designed to work.\n\nThe videos are brief, with clear screenshots and step by step narration which is subtitled. When occasionally the narrator makes a small error (\"Fireworks\" for \"Firefox,\" say), the subtitles correct it. The pace is slow but focused and always on task -- no rambling or making and fixing errors on screen.\n\nSince each video looks at just one issue, it's very easy to find your way back if you feel confused. I like the \"Watch and work\" option, too, which lets you keep the video running in the corner of your screen so that you can work along with the video.\n\nNew features of CS5 are pointed out in detail, not only in the video training but in the accompanying booklet, which also has tables of keyboard shortcuts, a glossary, and lots of example code.\n\nIf you're upgrading and want to master the new features immediately or if you usually hand code and want to get to know all the timesaving features of Dreamweaver, this is exactly what you need. If you're a moderately skilled web designer and would like to increase your skills, improving your ability to use Spry, for example, this is an excellent choice. It's probably not enough for the absolute beginner -- you'll still need to learn HTML and CSS and web design theory, but this is the best I've seen for using Dreamweaver in particular.", "summary": "Buy this with your copy of Dreamweaver", "unixReviewTime": 1288224000}
{"overall": 3.0, "vote": "22", "verified": false, "reviewTime": "10 21, 2010", "reviewerID": "A2VWE5SGNDS8HW", "asin": "0321719816", "style": {"Format:": " DVD-ROM"}, "reviewerName": "tachi1", "reviewText": "I waited to complete the entire course before writing this review and, in no particular order, these are my observations.\n\nI should tell you that my web skills are limited. I used Front Page for years and have created several very elementary Dreamweaver sites for family members. I'm in the process of trying to work more professionally (cleaner, less, and better code) and more creatively (a less stilted and more unique and appealing design). This course doesn't purport to be a web design course, it assumes that you already have a basic idea for a (relatively simple) website and it's going to teach you how to implement it. Don't expect inspiration.\n\nPOSITIVE:\n* Level: absolute beginner to intermediate.\n*  It is entirely DVD-based. The booklet (106 pages including index) that comes with the DVD just provides additional random information; it is in no way connected to the content or the sequence of the course.\n* The scope of the information presented is all that is needed for basic competence in the implementation of a simple Dreamweaver CS5 website. You do become familiar with the DW interface; the workflow; best practices; web and DW terminology; and basic website structure and creation.\n* The sequence and progression is logical and sequential. There is some reiteration of basic principles as the course progresses to clarify how something previously explained applies in a new situation.\n* The interface is very well thought out. You can go backwards or forwards easily. It has constant access to a table of contents that allows you to search (by both topic and subtopics) in case you want to navigate to a completely different topic. It allows you to bookmark (with long notes-to-self) on topics of interest you may want to keep coming back to. The interface coloring and design are neutral and un-intrusive. The screen always retains focus and the surrounding options melt away.\n* The course has the secondary purpose of preparing for the Adobe Certified Expert (ACE) test. Each main section has a practice test at the end.\n* Another asset is that the video transcript is captioned under the viewing screen (optional). This is particularly helpful if you're in in a public place where you can't turn on the sound.\n* All explanations of hard-to-grasp concepts (ex: the box model) are clearly demonstrated with visual examples. As a matter of fact, this is the clearest explanation I have ever seen of the box model.\n* I did find the booklet section on Fireworks instructive, since I have never used that program in the past. In fact, the entire booklet is very instructive and useful--it's just totally unrelated to the course on DVD.\n\nNOT SO POSITIVE:\n* Coverage of other concepts, such as content placement and positioning, are a little more basic and less detailed than I would have liked. I can't recall (or locate now) any reference to floats, whereas AP divs and frames (both older concepts) are well covered.\n* The narrator has a pleasant voice and clear diction, but is somewhat monotone and unexciting.\n* There is no \"search\" function or \"index.\" This makes it impossible to look up a term or a topic that is not specifically listed in the table of contents. I would have thought that the transcript text might have been searchable, but it isn't.\n* For my learning style, I would have preferred that the booklet function as support material for the video so I could follow along with text that directly reinforces the visual demonstration (and is easier to go back to or use as reference material.)\n* The bookmarks that you create when taking the course on your laptop are saved to that computer. If you want to change to your desktop, the bookmarks, obviously, are not there. So as a \"personal index\" these bookmarks have their limits.\n\nOn the whole, I do recommend this course. I wish I had taken it earlier, because it laid down the groundwork better than an online course that I had just taken. However, I think that, for a person who is learning-as-you-go (not just learning general theory but actually trying to apply it to a real website) it is essential to have reference material on Dreamweaver CS5, some sort of guidance on design principles, and a solid HTML and CSS anthology--all in well-indexed books.\n\nVideo and online courses teach you very well how to build their sample websites, but when you are stumped on YOUR website, you need to be able to supplement the general principles they taught you with a more on-point reference.", "summary": "Competent introduction to Dreamweaver and web principles.", "unixReviewTime": 1287619200}
{"overall": 5.0, "verified": false, "reviewTime": "10 21, 2010", "reviewerID": "A3V6QSTG2T9MIO", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "John Smith", "reviewText": "A picture tells a thousand words! This is especially true if you're learning about some photo management software like Photoshop Lightroom. If you are new to Photoshop Lightroom 3 (and even if you've been using Lightroom 2), you will find that the authors thoroughly cover all the features of Lightroom 3.\n\nThis tutorial literally holds your hand as you learn to use Lightroom 3. The videos are HD-quality and crystal clear. You can maximize or watch it full-screen, or you can watch it in a smaller window so you practice what you're learning at the same time.\n\nNo wonder this is \"Adobe-approved\" training by experienced Adobe-certified instructors. Highly recommended for anyone who wants sit back, relax and let the instructors teach them Photoshop Lightroom 3 as opposed to reading a book that can get boring after a few chapters.", "summary": "A very thorough course on Photoshop Lightroom 3", "unixReviewTime": 1287619200}
{"overall": 5.0, "verified": false, "reviewTime": "10 17, 2010", "reviewerID": "A9ELHLPXF7JKD", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "A. D. Lum", "reviewText": "This video is accompanied by a small book that covers general areas of interest within the field of photography.  It also offers general coverage of the new features in Lightroom 3, has a guide to keyboard shortcuts (very useful), and a glossary.  Thumbs up on the book.\n\nThe video material, contained on a single DVD, does a good job of covering all the important aspects of Lightroom 3.  This video is in my opinion, for advanced beginners on up.  I say this because the material is covered more deeply than what a beginner in the field of digital photography might be comfortable with.  Also, it is assumed that the student has some knowledge of digital photographic concepts (white balance, exposure, RAW format, etc.).  These topics are discussed without much intro-type explanation for beginners.  For me this is a good thing, as I had a reasonably good background going in.\n\nThe only thing that I wasn't thrilled about, although it is no reason to drop a star, is the pace of the training.  I actually like a faster pace.  If something is too fast, I just play it over.  The slower pace of this video training wouldn't bother me at all if there were a fast forward button that allowed me to still comprehend what is being said.  The only way I could speed things up was to skip ahead in small increments and then go back if I went too far.\n\nHere's the bottom line.  You can have no experience with Lightroom, but if you are a beginner with digital photography, bone up before hitting this video.  You'll get much more out of it.  If you've got a good footing with the basics of digital photography and you're ready to rock and roll, this video will take you where you want to go.", "summary": "Thorough", "unixReviewTime": 1287273600}
{"overall": 5.0, "verified": false, "reviewTime": "10 13, 2010", "reviewerID": "A13700AF4X40YG", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Loves Books in MD", "reviewText": "As someone who has just upgraded from Lightroom version 2 to the new version 3, I got this to bring me up to speed on the new features. I thought I would just watch the video clips on the new items as I needed them. Boy was I wrong... this is so good that I ended up watching every one of them from start to finish.\n\nThis package consists of a DVD and a small book. The book has a chapter on being a better photographer and another introducing the new features of Lightroom 3. The DVD contains the videos and a dedicated video player.  You can either use Internet Explorer or the player to view the content. My recommendation is to use the player.  It's full featured... a nice menu system, resizing for the screen, and the normal control buttons (stop, pause, play, etc.). The nicest feature of the player is the \"Work Along\" mode. In this mode, the video plays in a small window while you're working in Lightroom. This lets you try the commands along with the video.\n\nVideo and audio quality is excellent. The 2 instructors do a great job. They don't get over technical and keep a good pace. Not only do they present the material, they also give examples of how they use a Lightroom feature or command in their own workflow. This product would be perfect for someone new to Lightroom or a seasoned user looking to learn the new version.", "summary": "Learn Adobe Photoshop Lightroom 3 by Video (Learn by Video)", "unixReviewTime": 1286928000}
{"overall": 5.0, "vote": "19", "verified": false, "reviewTime": "10 7, 2010", "reviewerID": "A23E9QQHJLNGUI", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Bill Oterson", "reviewText": "Adobe approved \"Adobe Photoshop Lightroom 3, Learn by Video\" is the absolutely best method of learning Lightroom 3 that I've found. It's one on one training presented by Tim Grey and Mikkel Aaland. The program truly has just about everything to get you up and running full hilt. You'll progress from the very beginning of setting Lightroom up to importing photos, developing them, exporting them and everything in between. It does not contain everything that anyone would want in an educational program - that would be a practical impossibility. However, this program contains 10 hours of video training: you hear how a procedure occurs and you see how it's done, along with advice and opinion. There's even a testing procedure included and reference booklet. You can also copy selected video tutorials. I've had and have been using Adobe Lightroom for a couple years and recently upgraded to Lightroom 3. I've books written about Lightroom 3 by well known authors but I found reading about it was just a little too tedious and finally decided to find out how to make it work for me. This program works, it did for me and frankly I believe it's the best program available.", "summary": "Absolutely the best.", "unixReviewTime": 1286409600}
{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "10 2, 2010", "reviewerID": "A1RPTVW5VEOSI", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Michael J. Edelman", "reviewText": "I was lucky to find this offered in the Vine program as I'd just upgraded to Lightroom 3, and had been looking for a good text or other training material. It's pretty complete in its coverage of Lightroom basics, and differences from Lightroom 2; the only real issue I have is with the pacing. And that's not a real complaint about the product; it's more of a personal preference.\n\nWhat you get in the package is a slim volume of 100 pages, about half of which discuss Lightroom and photography in general terms; the remaining 50 pages are divided between notes on setting preferences in Lightroom and tables of keystroke shortcuts. Given that the booklet is glued into the packaging, it's not exactly a handy references. The bulk of the course, though, is on a disk that contains (as noted in the description) a full 10 hours of video lessons.\n\nThe lessons are divided up functionally in a manner that reflects Lightrooom's functional division- the first section is devoted to importing photos, followed by a section on the Library function. Each section is in turn divided into lessons covering one or two detailed areas. You can play all the sections and lessons in order, or pick and choose as you like. I began by playing straight through the first two sections (over two separate sessions) and picked up a lot of new and useful information about using Lightroom 3. Each lesson involves watching an expert carry out some function while narrating exactly what he's doing. The demonstrations and accompanying narration afre very clear, and made it easy for me to perform the same actions on my own. There's also a \"watch and work\" mode, in which you can shrink the video window down and try an example on your own in Lightroom, using supplied data files. Very nice.\n\nWhat I particularly liked was the us of professional photographers, rather than trainers, to present the material. The result is a real-world approach, in which the instructor both demonstrates the full range of options for some piece (like importing) and then explains exactly how he uses this in his own workflow. What you get is not a theoretical exploration of how a piece of software could be used, but a real demonstration of how it's being used by someone working in the field. Of course, that can be a drawback, too; one particular photographer's idiosyncratic methods may not be best for you. But I think this program manages to avoid that, but presenting the full range of possible approaches before the instructor gives his personal preference.\n\nThe one problem I do have with the course is, I suppose, unavoidable in this sort of presentation, and that's that the videos are fixed in duration and what's covered. Going through everything is going to take you the full 10 hours, at a minimum. You may look ahead to one chapter for something you're specifically interested in, only to discover after watching it through that what you really need is in a different chapter. That's why I generally prefer a text and image based approach. For me, at least, reading is several times faster than listening. But as I say, that's just my personal preference. For many, if not most new users, this may be one of the best ways to learn enough yo get started managing workflow with LR3.", "summary": "Good intro for new LR3 users", "unixReviewTime": 1285977600}
{"overall": 5.0, "verified": false, "reviewTime": "09 27, 2010", "reviewerID": "A1QWCRVV9VNLOK", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Darwin&#039;s Bulldog", "reviewText": "I was extremely pleased with this training video. The video player was very full featured; far better than any I have used in other video training I have used. Look over intro page ix of the accompanying book to get an over view if it's capabilities. Although it launches full screen, it can be reduced in size like any other on-screen window. Find the small handle at the lower right. You could of course shrink it down to the task bar, but it runs and looks great at both small and large sizes. What's more, you can pause the video at anytime, run you own copy of Lightroom and actually work through the same steps you are learning about. In fact, the image used on the DVD are also included on the DVD, so you could repeat the lessons with the identical images. (The video lessons are also on the DVD in .mp4 and .3gp format, so you may be able to work through some lessons on your iPhone/iPad or 3G cell phone while commuting.)\n\nIt will pay to pause the first lesson and explore the user interface of the DVD playback software. It's not as complicated as LR itself, but quirky enough to make starting off somewhat confusing. You'll want to explore the LR interface at some point too.\n\nThe Lightroom (LR) interface is designed around a good, flexible work flow, and the lessons generally follow that workflow. Of course, in actual use you can easily jump around the interface as you want, but seeing the software in an actual work flow is terrific. LR, like Photoshop, is a deep product, and watching it being used is actually far easier to do than trying to follow step-by-step instructions from a book.\n\nThe DVD comes with a small book which you can remove from the packaging; it's got those small sticky pads holding the back of the book to the box. Just lift off carefully. The first half of the book is entitled \"The Photograper's Eye\" by Michael Jordan (but not that Michael Jordan.) This seems like basic filler, and is not related to Lightroom at all. The last half is pretty good, although a lot of those ridiculously small screen shots are included. The material covered is duplicated in  Lesson 1.4 to 1.4.9 so you can at least see a much bigger image. There is also a handy keyboard shortcuts list. The book is also handy in case you want to change some of the settings without reloading the DVD.\n\nI have a few quibbles. In general, this DVD is aimed at Lightroom beginners. But much of Lesson 1 (1.1 to 1.3.7) deals with \"What's New in LR3\" which is almost useless, and frankly confusing, for someone using LR3 the first time. (If you just upgraded from an earlier version, this might be more interesting.) Start up your own LR and jump to 1.4 to begin the process of customizing your setup. At 1.4 you get a really useful, well explained review of the many LR settings.\n\nIf you start with the 'Play All' option, as recommended, the interface takes you automatically from lesson to lesson, although there is no visual indication of which lesson and chapter number you are actually on. The titles are shown on the right hand sidebar (Chapter Videos) if you open it, but not the lesson numbers. You can use the dropdown at the top of the main dialog to see this, however. You can choose specific lessons from the opening main screen if desired. As you go, you can set bookmarks for sections you might like to revisit. All you bookmarks are available from one of the tabs at the top... a really nice feature!\n\nIf you truly are a Lightroom beginner, this DVD will get you up-and-running quickly. If you have used Photoshop, and Camera Raw (CR) in particular, you will quickly see how adjustments in LR are so similar to CR, with LR adding so much more in terms of automation, asset management etc. Quirky start-up aside, this is an easy 5 star rating!", "summary": "Excellent way to learn Lightroom", "unixReviewTime": 1285545600}
{"overall": 5.0, "verified": false, "reviewTime": "09 27, 2010", "reviewerID": "A3T7V207KRDE2O", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "SMXSteve", "reviewText": "Learn By Video Adobe Photoshop Lightroom 3\n\nI have Lightroom 2.7 so I was intrigued for two reasons: 1) what is new in Lightroom 3 that I should upgrade and 2) could I still learn something about the version that I have with this video. I am happy to say it exceeded my expectations.\n\nThe lessons are good; I actually look forward to learning more about Lightroom. The lessons are always focused on the computer screen - not wasted on watching the instructor speak. First I went through some of the lessons to get an overview of the features - some I found were explained in a way that made me realize that I should have been using them. But I will really use this as a reference when I want to work on my photos with the Watch and Work.\n\nWatch and Work is a really cool feature. If you click Watch and Work (in the lower right corner) the application shrinks down and is placed in the upper left corner sort of out of the way. I say sort of because it is always on top and on my screen I am not able to get Lightroom completely visible. I can't find a minimize button so I have to go back to standard mode and then minimize it. But it does work and is a quick way to get the video up while I am working. (It's probably time I get another monitor...) The DVD does come with samples but I have no problem following along using my own photos.\n\nWhile the lessons themselves are great I did find a few quirks.\n\nWhen you first put in the disc Windows 7 pops up suggesting to run Start.exe. Choosing that starts the video with an intro from the two authors but there is no mention how to use the program. Fortunately there is a Table of Content in the upper left corner which is how I actually go through this. It isn't terribly difficult to use the video but it would make for a smoother and less timely start if they went over the use of it. The booklet does explain a little but not completely which goes for the help screen as well.\n\nThere is no install for the DVD. DVDs are either watched once or used for installation. Since I will use this as a reference and it will be used over and over they should have included an install so that you will always have access to the video. You can copy the entire DVD to your hard drive and setup a shortcut but for a lot of users that isn't always easy to do.\n\nRight away I found an annoying orange menu that pops up even if I slightly bump the mouse. All it has are options for Full Screen or an info sidebar. These options are also available in the lower right corner. At first I wasn't sure if it was part their screen shots or the application on my computer. I have not yet found any info that explains this or how to turn it off and I have no use for this menu - strictly annoying.\n\nAnother annoyance is when you close the application it goes through the list, or credits, of who put it together. Why? My experience as a developer is that no one cares who created it; if it's good people will use it. But we get to see them every single time.\nTip: although it is an added step after you click the close button, click again and you won't have to wait through the credits.\n\nThe package comes with a booklet but it doesn't offer much. Half of it explains photography and how to take certain shots. If you are using Lightroom chances are you probably have several photography books already. Another section briefly goes through each of the new features in 3. And there is a section that shows the specific settings for certain screens and another section on the shortcuts. The booklet is not an alternative to learning the application but may be a handy reference for some.\n\nThe begin where you left off doesn't work for me in fact it suggested something I used yesterday.\n\nBut I really do look forward to learning Lightroom with this video. It is far better than the free ones I have found online. And it even helps me with 2.7. Once installed on my hard drive it works great as a quick reference. I am still debating on upgrading Lightroom at least right away. But this video made several features really clear that I otherwise might not have used. And while it does have a hefty price tag my benefits are worth the expense.", "summary": "I look forward to learning Lightroom with this", "unixReviewTime": 1285545600}
{"overall": 5.0, "vote": "41", "verified": false, "reviewTime": "09 13, 2010", "reviewerID": "A1F6PIIZ0ZHHD6", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Conrad J. Obregon", "reviewText": "Some people learn more by watching than by reading. I know that I first learned about how to use Lightroom in videos by the redoubtable Michael Reichmann and Jeff Schewe, but that was mostly because they were the first out with instructional material. Mostly those videos were images of talking heads with an occasional screen shot. \"Learn Adobe Photoshop Lightroom 3 by Video\" is an offering by two other great image processing authors, Tim Grey and Mikkel Aaland.\n\nThe approach taken is fairly standard. After an introduction the videos go chapter by chapter through each of the Lightroom modules, and an examination of most of the buttons and sliders that, because of its easy interface, has made Lightroom popular with so many photographers.  Each section shows a screen shot where the viewer can follow the moves made by the authors to apply Lightroom functions, accompanied by the voice-over of one of the two authors. The chapters cover everything from bringing images into Lightroom to outputting them to web sites or slideshows. The level of instruction is fairly simple, but if you've never used the software, the instruction will get the average person processing pictures after several hours of watching. More experienced users won't learn anything new, but they are not the audience. Not every function is covered in all aspects, like my favorite test, whether the discussion of keywords covers the importation of a keyword list from another source into Lightroom. On the other hand, although this isn't covered, it clearly a subject for a more advanced user.\n\nAt the end of each chapter there is an examination. Unfortunately, if you get an answer wrong, you won't be told the correct answer, so you'll have to watch the lesson again. Maybe that's not unfortunate.\n\nThe video comes with a booklet where Aaland first presents some ideas about composition (perhaps added because the video, like most Lightroom books, doesn't tell you when a slider or button is appropriate; for that, I'd recommend \"<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Vision-Voice-Refining-Your-Vision-in-Adobe-Photoshop-Lightroom-Voices-That-Matter/dp/0321670094/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Vision & Voice: Refining Your Vision in Adobe Photoshop Lightroom (Voices That Matter)</a>\" by David duChemin). That's followed by a chapter about what's new in Lightroom 3. The disk also contains images that can be imported into Lightroom by the viewer to follow the same procedures as the authors in the lessons. I'd like to say that this allows one to follow along with the authors, but it was here that video presentation encountered a stumbling block. With a book you could keep the book in front of the computer and, if images were provided, the reader could follow along. To duplicate the experience there is a button in the lower right hand corner of the video screen, called \"Watch-and-Work\". If you click this, the video is reduced to about one-fourth of the screen. Unfortunately, when I tried to follow along with the video, the video image was often in the way and had to be moved around to gain access to the Lightroom sliders. Eventually I figured out that it was easier to pause the video and minimize the video screen and work in Lightroom. This doesn't take a computer guru to figure out, but given that the videos are aimed at tyros, it might have been useful to provide more detailed instructions in how to use the videos. Unfortunately there is just a very brief help screen, that, to make matters worse, refers to processing the picture in Dreamweaver! It might also have been useful to suggest to users that as soon as possible, they should import the images provided on the disk into Lightroom, as well as other instructions on how to best use the videos to learn.\n\nI'm still a person who prefers books, being a geezer who didn't grow up with YouTube. I underline important ideas or read them twice, and even read them on a bus, without opening a laptop. To be fair, the video does allow for bookmarking (again undocumented), that accomplishes many of these functions and perhaps reading on the bus may not be the best way to learn about running a piece of software like Lightroom.\n\nI'm impressed by the video technology, and even though there are a few bumpy spots, as an introduction to Lightroom, this will certainly teach the new user how to use the software.", "summary": "A Little Bumpy but It Works", "unixReviewTime": 1284336000}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "10 26, 2011", "reviewerID": "A1L0EITTXYRWYS", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Lis", "reviewText": "I was looking forward to receiving his product. However, when I started to view the various items I was rather disappointed that the explanations were far to long winded and very short on actual facts and techniques. A pity, because these could be quite informative if the presenters got to the point earlier.  Needs a serious revision!", "summary": "Learn Adobe Photoshop Lightroom 3 by Video", "unixReviewTime": 1319587200}
{"overall": 4.0, "verified": false, "reviewTime": "10 25, 2011", "reviewerID": "A3H8WNELR7EZO7", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Charles W. Houseworth", "reviewText": "I thought these videos were too elementary.  I found it much easier to pick and choose from one of the many superb texts that are available.", "summary": "Too Elementary", "unixReviewTime": 1319500800}
{"overall": 3.0, "verified": true, "reviewTime": "10 22, 2011", "reviewerID": "A1DMZCOQ3RLQPQ", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Joe Radcliffe", "reviewText": "Its average prefer Laura Shoe's DVD. The instruction seemed very basic and just adequate. It could have gotten into the develop module better.", "summary": "LR3 DVD review", "unixReviewTime": 1319241600}
{"overall": 5.0, "verified": true, "reviewTime": "09 10, 2011", "reviewerID": "A3NUUU64HTJ4VD", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Traylorc", "reviewText": "This DVD is a fantastic tool for those who prefer a visual approach to learning rather than simply reading.  This DVD breaks down the basics of Lightroom, and explains it to you in a simple manner.  I like the fact that I can watch the video while having my copy of Lightroom open, so I can easily follow along.  In my opinion, my learning is enhanced by showing me how to use a function like the Adjustment Brush rather than simply reading about how to use the Adjustment Brush.\n\nIf you are a little intimidated by programs like Lightroom or Photoshop Elements, then this is a perfect video for you.  Everything is presented in basic terms, and they instructors provide plenty of examples for the subject matter that is presented.  If you are someone who is an experienced Lightroom user, this DVD may teach/remind you a few elements available in Lightroom but IMHO it's not targeted at experienced Lightroom users.", "summary": "A Great Tool For Learning Lightroom...", "unixReviewTime": 1315612800}
{"overall": 5.0, "verified": true, "reviewTime": "09 3, 2011", "reviewerID": "A20VVNGWNCXYCQ", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Photonut", "reviewText": "Want to cut Lightroom 3 learning curve by 5o to 80 percent? Get this training program. Its very well thought out and will have you up and running quickly. Well worth the money!", "summary": "Reduce Your Learning Curve", "unixReviewTime": 1315008000}
{"overall": 5.0, "verified": false, "reviewTime": "05 15, 2011", "reviewerID": "A1GQRGB8FGSLIZ", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Amazon Customer", "reviewText": "This is a greate collection of videos on the disk.  Most of the videos are between 2 and 6 minutes, The index allows you to quickly jump to a video that you want to review. The video goes from an introduction, to what is new in Lightroom 3. The videos cover working with the workflow, creating slideshows, and more.  I would recommend going to the authors website to get even more information on Lightroom\n\nAt this low of a cost it is a no brainer.  I highly recommed this to anyone who is just starting with Lightroom or those who ahve worked with it for a while", "summary": "I find myself going back to the product", "unixReviewTime": 1305417600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "04 13, 2011", "reviewerID": "A3DB4MP9DUB3FP", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "bulldoglady", "reviewText": "I can go over the material as often as I like to makes sure I understand and remember.  There are little quizzes at the end of each section that are very helpful too.  The presenters are easy to understand and overall very good.", "summary": "I find this video very informative and helpful.", "unixReviewTime": 1302652800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "03 11, 2011", "reviewerID": "A32KKLRM3OHQ5T", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Amazon Customer", "reviewText": "I have never owned a SLR camera and never used a photo editing software like LR3 before.  I'm a very visual leaner, therefore, appreciate being able to see not only the menus and what they select, but how to use the features and see the effects to the photos \"real time\".\n\nThey also discussed general topics as to how to organize files, folders, catalogs, collections, (can get overwhelming w/out some instruction and context for how to use all the features), etc.  I continually go back to the DVD as I try to use the software but can't remember exactly how to from my first overview of all the lessons.  Every time I review a feature/section, I seem to pick up more tips that I missed with the first viewing.\n\nIf you don't like to read and/or don't want to spend a lot of time trying to figure out how to interpret and apply written instructions vs. seeing a \"live\" demonstration, then this DVD/learning method is for you!  I love it.", "summary": "Great way to learn the software!!", "unixReviewTime": 1299801600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "02 27, 2011", "reviewerID": "A26WHG8F960C8N", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "D. Thompson", "reviewText": "One of the best purchases I have made in a long time.  Learned so much in a short time and can go back and rewatch the areas that I need to.", "summary": "Great Product", "unixReviewTime": 1298764800}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "02 13, 2011", "reviewerID": "A3V15SFD7918WZ", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Jesse Walker", "reviewText": "Had a chance to try this out, here are a few impressions:\n\nEasy to use, well-designed, and useful.\n\nBUT... at a fairly basic \"this is Lightroom\" level.  So, if you're new to Lightroom, and a visual learner (as opposed to wanting to read everything in a book), this is an awesome resource.  It's kind of like having an experienced photographer friend sit down with you and a copy of LR3 for 10 hours and go over every feature, in a reasonable degree of depth, one feature at a time.  But you get to pause, rewind, and rewatch it whenever you want, add bookmarks to favorite parts you want to review later, etc.\n\nYou can also learn LR3 on your own; that's what I did.  I'd been using the program for over a year before getting this, so I didn't think I had much to learn.  While I wasn't sure how useful this would be, I was pleasantly surprised.  I use primarily the Library and Develop modules (all the time), and was hoping to learn more about the other three (Print, Web, and Slideshow).  I certainly did, and am comfortable with those now.  But I also learned some pretty useful things about the ones I use constantly (I haven't really used collections before, for instance, and that's going to be a huge time-saver).\n\nThe two photographers that guide you through lightroom introduce you to all of its features, but don't necessarily give too much creative input... they teach you what you CAN do, not what TO do.  For most people, this is fine.  But they're not there to refine and hone your creativity.  Just get you familiar with the program, which they do very well.\n\nWhat I'm a little disappointed by is that I didn't get&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Learn-Adobe-Photoshop-CS5-by-Video-Core-Training-in-Visual-Communication-Learn-by-Video/dp/0321719808/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Learn Adobe Photoshop CS5 by Video: Core Training in Visual Communication (Learn by Video)</a>&nbsp;instead.  I don't know Photoshop nearly as well as I know Lightroom.  And while Lightroom isn't too hard to figure out without a guide, Photoshop is pretty much impossible.  And that particular video item, while the same price as this, has over twice as much video (21 hours instead of 10).  If you're trying to learn both programs, I'd probably recommend getting that instead, and figuring out LR3 on your own.\n\nOh, and it comes with a book.  The book is a little odd, as it doesn't really go along with the product.  Instead, it has three main sections:  The first, is basically a \"welcome to photography, here's what you need to know to capture nice images\" with basic photographic advice.  Part 2 is \"what's new in LR3\" (compared to previous versions; only newly added stuff is mentioned).  The third part is Lightroom preferences... basically, descriptions of everything that you can tweak \"under the hood\".  I read them, and they're all okay... but they're not what you're buying this product for.", "summary": "Very handy for certain people.", "unixReviewTime": 1297555200}
{"overall": 3.0, "vote": "16", "verified": false, "reviewTime": "01 9, 2011", "reviewerID": "A1E50L7PCVXLN4", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Colinda", "reviewText": "There are over 100 video lessons here. Most users have given this a high rating and I assume they are very comfortable with video learning. Personally I found it rather tedious.\n\nI'd like to learn Lightroom because I've owned it for a while. I tried to use it but did not understand it so I went back to using Adobe Bridge, which is think is generally under-appreciated. I love Photoshop but tend to spend a lot of time with it, so the supposed time-saving features of Lightroom would be helpful.\n\nI really hoped this product would make it easy for me to use Lightroom. Unfortunately I had trouble staying alert through more than 3 or 4 lessons at a time, and that much only covers a small portion of the material.  I don't think this is because of the presenters so much as it is the difficulty of covering this sort of material in a video format.\n\nThe Introduction alone consists of 26 videos. It seemed like a commercial for Lightroom rather than a tutorial. Seven of the lessons are devoted to \"What's New\" -- not too relevant for beginners. On the plus side, there were plenty of screen shots to familiarize us with the look of the software.\n\nUnit 2 has 11 video lessons on importing pictures. That gives you an idea on how much detail is here. If that's what you need, you'll find this product useful.", "summary": "For Highly Motivated and Patient People", "unixReviewTime": 1294531200}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "12 17, 2010", "reviewerID": "A87W2NKSYDMD6", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "S. Epstein", "reviewText": "No reason to restate all the positive comments. I just wanted to chime in to say that I, too, think this was a great purchase. I have been watching in \"Watch and Work\" mode, and really like being able to follow along; I learn by doing more than just by watching. Light Room has so many features that I can't imagine learning them all, but this video makes it simple. There are even chapter tests after each chapter. Very polished and professional.", "summary": "Really Great Tutorial", "unixReviewTime": 1292544000}
{"overall": 5.0, "verified": false, "reviewTime": "12 6, 2010", "reviewerID": "A10Y058K7B96C6", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "midnight122", "reviewText": "I am not an avid Lightroom user, although I have used it many times.  I have always wanted to dive into the tools and techniques of the software more and this video series has definitely put me on the right track.  The series does an excellent job of not only giving you a general tour and reference to what is available in Lightroom, but also diving into more important aspects that you do not pick up on out of the gate.\n\nWatching the entire video in one sitting is probably not feasible since it's ten hours of content.  In fact, finding the time to watch the entire ten hours at all might be difficult.  Don't be fooled though as any time you invest in going through this video will improve your usage of Lightroom.  It really depends on what you want out of Lightroom.  If you are just wanting some simple organization and editing you won't need this video or certainly won't need all of it.  If you would like to dive into the publishing aspects and really optimizing your workflow, then this would be a good investment for you.", "summary": "Great for beginners or just about any Lightroom user", "unixReviewTime": 1291593600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 23, 2010", "reviewerID": "A279FUL12R7MBD", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Brandy Fortune", "reviewText": "This was perfect and so well timed, I learn so much better via video then just reading a book! I was very happy with this particular DVD, it was the perfect training and introduction to how to use Lightroom properly! It comes with a great key shortcut reference booklet as well.", "summary": "Learning in a visual way is fantastic", "unixReviewTime": 1290470400}
{"overall": 4.0, "vote": "5", "verified": true, "reviewTime": "11 16, 2010", "reviewerID": "A3JERG6E6HW8A5", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Amazon Customer", "reviewText": "This video was well paced and hit all of the highlights of the program it taught how to use most of the buttons and features of lightroom 3. It gave reasonable examples and by showing the screen shots of what was being talked about there was a ready reinforcement. I have already gone back to some of the chapters as a reference when I needed to do certain tasks. Would highly recommend this work.", "summary": "Lightroom teacher", "unixReviewTime": 1289865600}
{"overall": 5.0, "verified": false, "reviewTime": "11 15, 2010", "reviewerID": "A3V7D0LH8L7BG0", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Spike D.", "reviewText": "I am a long time user of Photoshop Lightroom, from the first version. I used to use Photoshop to manage and edit digital images, but switched to LR totally from then. LR is relatively user-friendly, you need very little instruction to get started. I never had any training, book or instructions of anykind, but always felt efficient with the software.\n\nWell, I think it is great that I now have access to this training video. It was kind of long (10 hrs.), so finding the time to watch them was a challenge. Especially for me, as I already know how to use the software. But of course, you will pick up things that you don't know before or how to do it better. And it is true. I learned more than I expected. So no matter how experienced you are or how user-friendly the software is, you will definitely gain something from it.\n\nIf you are a new user of LR, it could be a little intimidating. If you are a casual user who only need to manage your photo and run slideshow, you don't need this video. But if you want more like publishing, converting and optimizing images, I recommend this training video.", "summary": "You need to have this..", "unixReviewTime": 1289779200}
{"overall": 5.0, "vote": "19", "verified": false, "reviewTime": "11 4, 2010", "reviewerID": "AH9AUW175XCVP", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Sam Archer", "reviewText": "I've spent lots of money on Photoshop and Lightroom. These programs are so complicated that you end up buying lots of books to learn to use them, some of which end up collecting dust because they are so hard to read.\n\nThis video instruction program is pretty long at 10hours but it really covers what you need to know to use Lightroom 3.0 properly.\n\nThe format allows you to skip to chapters that you want to see.\nI think you need to watch this on a computer because it doesn't play like a regular DVD with menus that need to be clicked by mouse.\n\nThe video shows step by step how to do actions from basic to advanced.\n\nCompared to books teaching Lightroom, this is by far the best way to learn that I have seen so far.\n\nNow I need to get a version for Photoshop CS5....", "summary": "Better than a book. Teaches you lightroom!", "unixReviewTime": 1288828800}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "10 29, 2010", "reviewerID": "A3HCRJH1AUUAFE", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Todd M. Petersen", "reviewText": "The Tim Grey Lightroom video is a great learning tool. The content and pace are well suited for the beginner and intermediate user. The use of specific examples really enhancing the learning experience.", "summary": "Great CD!", "unixReviewTime": 1288310400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "10 27, 2010", "reviewerID": "A3QKRKODKBN4Q1", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Layla11245", "reviewText": "This is a great package, full of helpful information! I am mostly self taught with Lightroom, so it's nice to have these materials to fall back on when I need some additional help. 10 hours seems like a lot, but it's broken up to where it doesn't feel like too much information. The index is very helpful, if you are looking for a certain topic you can scan the index in the book and see where to find that video.\nSome of the lessons include Importing photos, basic how-to's of how to use the Library module and organizing the Library module, Editing Essentials such as white balance, clarity, color adjustments, Retouching and Correction such as portrait touch up, and noise reduction. Also how to convert from color to black and white.\nAlso included is a lesson on how to take photographs with different subjects such as nature, landscape, family, sports, etc.\nA book is also included, but I find the videos a lot more helpful. I'm looking forward to watching more videos, and even testing my knowledge at the end of each lesson!", "summary": "Great tutorials", "unixReviewTime": 1288137600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "10 21, 2010", "reviewerID": "AT28RL25Q2OLK", "asin": "0321700945", "style": {"Format:": " DVD-ROM"}, "reviewerName": "ReconScout", "reviewText": "As a new user to Lightroom (coming from Nikon Capture NX2), I am extremely impressed.  The quality of the video is evident as is the quality of the book.  This product addresses a long standing need for video training when compared to written manuals.\n\nThe DVD is well organized and seems quicker for reference than even having a manual near the keyboard.  Interestingly, there is a special mode that uses a smaller video window that plays while your work in Lightroom so you can actually work with the instructors in a sense.\n\nA new user of Lightroom would clearly benefit from this video.  Advanced users most likely not.", "summary": "Indispensable", "unixReviewTime": 1287619200}
{"overall": 4.0, "verified": false, "reviewTime": "11 27, 2010", "reviewerID": "AGVWTYW0ULXHT", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Nate", "reviewText": "The \"Learn by Video\" program for Flash CS5 would make a nice alternative to an introductory book - especially for visual learners.  I'd worked through the&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Adobe-Flash-Professional-CS5-Classroom-in-a-Book/dp/0321701801/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Adobe Flash Professional CS5 Classroom in a Book</a>&nbsp;- and found that to be more comprehensive in its coverage, but there is a different emphasis here and I found I learned quite a bit that I didn't know or that wasn't clear before.  The little booklet that comes with the guide is an extremely useful introduction to design principles that are essential to effective working in Flash.\n\nThere are several chapters on different introductory-level topics in Flash CS5.  Each is broken up into different sections, and usually these can be completed in under ten minutes each.  That makes this easy to work through in short sections.  You can set bookmarks to remember where you left off - although it would be nicer if the program saved your progress directly and remembered for you where you left off.  The exposition is clear, but perhaps a bit dry.  There's no hint of humor here, and I always find it helps to make verbal lessons a bit more interesting and memorable.  Each section tells you what you are going to learn, gives you an explanation and a tutorial you can follow along using one of the project files included on the dvd, and then explains what you have learned.\n\nThe focus here is on learning how things work and what things mean at a fairly basic level.  You don't get very advanced, and by the end of things you'd really just have a rough idea of how things work in Flash, but it is very clear.  They assume a listener who is just getting started with Flash, and, while the lessons are sequential and they build upon each other, they remind you what you've learned and how to do things several times.  Sometimes that's a bit frustrating - in a beginner's level textbook it's easy just to skim through the repetition when it is familiar - with video it's harder to skim through what is inessential without missing the important bits.  That's one reason to prefer something like the \"Classroom in a Book\" series, rather than the Video Classroom approach.\n\nOne thing I got here more clearly than in the \"Classroom in a Book\" for Flash CS5 is an emphasis on best practices - how to manage projects so as to be completely clear, and how that helps to achieve control over the project.  There is more explanation here - more whys behind the hows.  I thought the chapter on Action Script was excellent for giving a clear concept of how it works as an \"object based\" language - even though you'd only be able to do some very rudimentary things after working through the entire chapter, you'd have a pretty decent understanding of how the language works and a good basis for further learning.  There are video files on the disk that allow you to follow along on what they show you in the tutorials.  One thing they don't make clear is that to work with them you have to copy the assets folder to your hard drive and open and work with the projects there.  (I find it most convenient to backup the entire dvd to my hard drive and play it from there - since that means it's available and ready whenever I want to work through a section, and it also helps to protect the original disk from scratching).\n\nOverall, it's a good introduction to Flash and the emphasis on \"Best Practices\" serves as a useful complement to the \"how to\" guides you can find in other introductory Flash books.  I do have a few minor gripes:  the navigation through the chapter files is not as intuitive as I'd like: there are sections and subsections, and you can go to the next section in a chapter by clicking the \"Next Video\" button.  But: when you get to the end of a subsection, the \"Next Video\" button is not enabled and you have to go back to the main index and then open up the chapter index again to get to the next section in the chapter.  Several words in the projects are misspelt (e.g. \"Hawaiin\" instead of \"Hawaiian\"), and I also noticed that at least one of the project files they encourage you to use was missing (the \"inverseKinematics_start.fla\" file from chapter 9).  Still, the guide as a whole is very helpful and clear - and the emphasis on design principles in the included booklet makes this a very helpful overview and introduction to a rich and complicated program.", "summary": "A helpful introduction to Flash CS5 - a bit dry, perhaps, but very clear and useful explanations and great on \"best practices\"", "unixReviewTime": 1290816000}
{"overall": 3.0, "verified": false, "reviewTime": "10 28, 2010", "reviewerID": "A3FQDU9WANNZZR", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Beemer903", "reviewText": "In theory, the idea of watching a video tutorial while operating the program it's teaching is a great idea, but the implementation is at times flawed and frustrating.\n\nIt appears that the tutorial is built on Adobe Air, which make Javascript look positively robust and blazing. The interface is slow and quite unresponsive on a fast Mac. It's very frustrating that it is not aware of dual monitor setups either. There is an option to watch it full screen, but if you try to place the video tutorial on a second monitor -- which would be customary if the program you are trying to learn was on your main monitor -- clicking on \"full-screen\" jumps the tutorial to your main display and makes it full-screen there, covering up the Flash program!\n\nThe content and organization is pretty well done for beginner to intermediate level Flash programmers, but the numerous typos give it an  amateur whiff. How can there be typos in a video you ask? Well, the Video Training INSISTS on turning closed captioning on by default. No matter how many times you turn it off, when you relaunch the training, it appears again.\n\nMy ultimate verdict is not-bad, but not great. I would give this 2-1/2 stars if that were an option, but as it's not I will tip the favor to three stars for ambition.", "summary": "Not without its problems!", "unixReviewTime": 1288224000}
{"overall": 4.0, "verified": false, "reviewTime": "10 21, 2010", "reviewerID": "A3QJU4FEN8PQSZ", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Grimmy", "reviewText": "The presenter here sounds much more natural than the semi-robotic delivery found in the DreamWeaver tutorial product.\n\nThe lessons are broken up into easily digested 3-5 minute chunks, covering aspects of Flash from project planning and defining customer needs to an introduction to ActionScript fundamentails. Although it does not deal with programming in detail, it does cover basic concepts of object-oriented programming, variables, conditional statements, and functions. The rest covers working with artwork and text; library and symbols; layers, timeline, animation, and tweens; working with files, sound and video. You'll learn the fundamentals; you won't learn how to create those fancy user interfaces on those fancy sites; that's for a more advanced class.\n\nAs with other products in this series, there are some usability issues. At the top of the interface, there's a \"Previous Video\" button and \"Next Video\" button. The \"Next Video\" button is disabled for the last video of each chapter, so to get to the next one you'll have to use other navigation. This is because the last item is the test. Kinda dumb UI choice, initially confusing. They could have changed it to read \"Take Test\" instead of putting up a virtual dead end. There is a sidebar which is normally hidden (you are cued that you can display it when the mouse strays into the video area), which has information on the current video and lists/links to the other videos in the chapter. The title bar (under the top-left tabs) is a dropdown to navigate the content.\n\nThere's a \"Watch and Work\" mode which shrinks the video display to let you work with your copy of DreamWeaver (not included). You can move the video window around BUT you CANNOT resize it - and it may be kind of tiny to watch in that mode. So if you have a dual monitor setup, you'll want to drag the Standard Mode video player to the other screen; Standard Mode cannot be resized to be smaller, either.\n\nAll in all it's a good way to get started in Flash programming, if you don't have the patience for going through a book. Know what to expect; you'll learn the basics, but you'll need to carry on the learning process yourself, by seeking out more advanced information or learning materials.", "summary": "A good introduction to Flash, with some UI weaknesses", "unixReviewTime": 1287619200}
{"overall": 4.0, "verified": false, "reviewTime": "10 16, 2010", "reviewerID": "AK9FTWLCW09RR", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "OnceMore", "reviewText": "If you've seen neat Flash presentations and wondered how you can create them yourself, this book will get you started in the right direction.  It contains a DVD and a hundred page book supplement.  The DVD provides well-done video tutorials that you can follow along in watch-and-work mode using the starter work files included in the DVD, and the book provides useful reference materials (e.g., colored screenshots of user interfaces and how to use the various tool components, keyboard short cuts for specific tasks, etc.)\n\nThe video lessons cover all the important basics: how to create work projects and organize your files; how to use various tools and features; what are objects, shapes, symbols, movie clips, timelines, layers, frames, stage, etc; how to work with text and graphics; how to create animations such as objects moving in a choreographed fashion (motion tweens), or shapes morphing into other shapes (shape tweens); how to include ActionScript code snippets for more dynamic (but still simple) handling of events; how to build not just good-looking designs and presentations but also simple applications that react to text inputs, button presses, and mouse clicks; and how to test and deploy your work. By the time you're done with the lessons, you'll have an appreciation of how powerful Flash CS5 is and how learning even just the few techniques introduced in this video guide already empowers you to do interesting stuff!\n\nThe user interface for the video tutorials is easy to use, and although the book supplement comes with instructions on how to use that interface and navigate through the tutorials, most people should be able to figure out how to use the interface without having read those instructions first.\n\nThe video lessons are organized into eight chapters, most of which end with test questions that give you additional opportunities to revisit what you have just learned.  For the most part, the test questions quiz your knowledge of what was covered not just in the video lessons but also related materials in the book supplement; given that the video lessons and the chapters in the book supplement do not track each other perfectly (for example, the video lessons introduce motion tweens before shape tweens, but the supplement reverses this order), if you focus on the video lessons only, you might occasionally be surprised at getting quizzed on something that appeared unfamiliar by virtue of the fact that you might have missed reading some relevant materials presented (probably out of order) in the supplement.\n\nFinally, I thought that while some of the materials in the video lessons are somewhat repetitious, the instructors have nevertheless done a good job showcasing some of the most useful features of Flash. Many students will appreciate how when covering features newly available only in the latest CS5 version of Flash, the instructors clearly demonstrate how these new features improve upon the replaced \"classic\" features by illustrating how both sets of features work.", "summary": "Covers all important basics but also demonstrates how new features improve upon \"classic\" or pre-CS5 features", "unixReviewTime": 1287187200}
{"overall": 4.0, "verified": false, "reviewTime": "10 12, 2010", "reviewerID": "A3Q61HHSFP80LA", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "zoe", "reviewText": "There is just so much to learn with all of Adobe's products, that it's good to have yet another option offered to help navigate the product.\nI tend to be a person who learns by doing, so the \"side by side\" option to learn is a great attempt.  But there is just so many layers to the\nAdobe suite of products, that I'm not sure that there is truly a way to offer this course in any other way than in a more \"traditional\" classroom,\nwhere one can interact with the instructor and ask specific questions that a search just can't interpret.\n\nThis is definitely something of worth, and is a strong introduction to the software.  But methinks that the only way one can really learn is to \"practice practice practice\" after all.\n##", "summary": "A 4-minus -- not a bad guide!", "unixReviewTime": 1286841600}
{"overall": 4.0, "verified": false, "reviewTime": "10 10, 2010", "reviewerID": "A31N0XY2UTB25C", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Stephanie Sullivan", "reviewText": "This certified associate courseware comes as a package containing a DVD-ROM plus supplemental written material. The software covered is Flash CS5.\nIt is structured in an easy to follow manner.  It is very detailed and goes over most situations that can/will occur when using Flash CS5.  It covers the very basics and this might be off-putting to people with experience using MS Windows.\nThe presentation voices are modulated and interesting. They are personable and the viewer gets an, \"in classroom,\" feel which improved the effectiveness of the lessons for me.  Some people learn better by working along with the instructor. This video course provides the necessary files to do this and complete the tutorial as it is watched.  The narrator leaves plenty of time for this.\n\nFor those who learn best by listening and watching the pace of presentation designed for working along with the presentation it will seem to move slowly.\nThe supplemental material is a good reference for after you have completed the video lesson.  The video creates a foundation of basic skills needed and the reference reinforces the lesson.  The materials are a good reference to use while one is using the program.\n\nAll in all I found this lesson to be a useful introduction to using Flash CS5. This course helped me to learn skills that I can use in web development. For people like myself who learn better, especially at the begining in with a presentation format this provides a faster route to getting foundation skills to build upon with reference texts.", "summary": "Learn Adobe Flash Professional CS5 by Video", "unixReviewTime": 1286668800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "09 24, 2010", "reviewerID": "A2K4HN6EECBNR3", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Jean Katherine Baldridge", "reviewText": "Do you want a step in the right direction to create almost anything you've ever wanted with Adobe Flash Professional CS5? With this product, it's definitely possible.\n\nWhen I first recieved the product, all I had to do was insert the CD it came with, flip open the back cover of the box, and peel off the book. That was it! I was ready to learn in only seconds.\n\nThe book and videos work in conjunction with each other, but you can read or watch either one in your own time and still understand all of what's to offer. The best part is the videos comes with subtitles, so if you're unable to listen to it, you can still understand what's going on.\n\nBoth the book and video tutorials teach the basics all the way up to the more advanced things Flash has to offer. It will teach you how to get started, use the tools, create and import artwork, create text, work with tweens, use action scripting, importing and editing video/audio, and finally how to test and publish all you've made.\n\nIn addition to both medias, there are many visualizations you will experience to really get you into what you are doing (yes, there are even picture examples with colors in the book). Almost all basics are covered and more, so you'll be really willing and able to learn all that you can for whatever you plan to create with Adobe Flash Professional CS5.\n\nIn conclusion, after using this product, you'll have an incredibly easy time getting started with Adobe Flash Professional CS5. It comes with an easy to use CD, and a book, which both explain what you need to do to get started in creating almost whatever you want.", "summary": "Learn how to use one of the most powerful programs ever made: Adobe Flash Professional CS5.", "unixReviewTime": 1285286400}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "09 17, 2010", "reviewerID": "A2CDDAJE10KCD5", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Frank Stepanski", "reviewText": "I've been teaching Flash for about 7 years now at a local university. Over the years I've gone through many books to help students learn all aspects of Flash from the basics of using the timeline, creatign and using symbols, managing tweening, and everything else. Of course I can show the students everything there is to know about Flash but I always found it hard to find a complete training tool that students can use in the classroom and at home to complement my teachings.\n\nI pretty much went through every book on the market, whether in be the 'Visual Guide' series or the ones from Adobe or anything in between. I mean literally close to probably 20 or 30 books in that timespan. I even use videos by [...] and other. Trust me, you name, I have bought to try for my class. But always I find I need to use more than 1 book/video series to have my students buy that would cover everything I wanted them to know. Usually I ended up writing up a few lessons to supplement the material as well.\n\nBut, I can honestly say, I found the most complete learning tool for Flash.\n\nThis video DVD, combines multiple video series from [...], plus material from multiple books and puts it into one learning tool. I am guessing the DVD framework was created with Adobe Air, because the interface looks fantastic (nothing I ever have seen before). There are seperate menus for videos all broken down into multiple sub categories, there are review questions and quizes and review material. I really can't say enough good things about this DVD, other than if you buy anything else you are wasting your money.\n\nThere is also a Dreamweaver and Photoshop DVD that I purchased that is equally impressive as well.\n\nA must and only buy if you want to learn or help teach Flash CS5", "summary": "The Only Way to Learn Flash CS5", "unixReviewTime": 1284681600}
{"overall": 3.0, "verified": false, "reviewTime": "07 17, 2011", "reviewerID": "AQ3JJWT0F6UD7", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "BR", "reviewText": "I'm a big fan of the other Adobe video products, but this one of f***ing irritating- specifically Kevin Ruse. He repeats the same crap again and again and again and again!! WTH!! Just get one with the bloody lesson!!", "summary": "Kevin Ruse is so bloody irritating!!!", "unixReviewTime": 1310860800}
{"overall": 3.0, "verified": true, "reviewTime": "05 12, 2011", "reviewerID": "A2TEH84I6LA0VO", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Evolving Eileen", "reviewText": "I was somewhat disappointed ... I'd read that this was a tutorial for Adobe beginners.  I am not a computer novice, and I have used Photoshop for at least a decade, but the instruction may as well have been delivered in Sanskrit.  This instruction is for people who already have a basic working knowledge of Flash.", "summary": "I must be lacking a core", "unixReviewTime": 1305158400}
{"overall": 5.0, "verified": false, "reviewTime": "04 26, 2011", "reviewerID": "A30UDDRL5GASLA", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Rob T", "reviewText": "Books on software put me to sleep.  When I see a video about software, I can't use it to easily flip back and forth to check topics. This combination is the best of both worlds. The book allows me to jump around and browse, while the video keeps me solidly on track.  Flash has a big learning curve for the unitiated.  This product is a great help.", "summary": "I really love this", "unixReviewTime": 1303776000}
{"overall": 5.0, "verified": false, "reviewTime": "03 27, 2011", "reviewerID": "A1A027UELK4JZC", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Jami", "reviewText": "I have really enjoyed this training.  It's very thorough and I am able to follow along and put what I've learned into action right away with Flash CS5.  You do need to have the Flash CS5 software.  I'm a self-starter learner and I usually read books or tutorials to learn.  This training is perfect for anyone like me who doesn't have time or the money to sit in classroom to learn how to create flash applications.\n\nI've not yet completed the course, but will update my review when I do.  so far, it's been great to learn the interface and get started with Flash.  I also like that there is a reference book that accompanies it, as I like having a book and documentation to refer to as well.\n\nI think the way this is set up, with the interactive learning environment, the instructor-led \"lectures\" is great.", "summary": "Thorough, self-paced learning", "unixReviewTime": 1301184000}
{"overall": 5.0, "verified": true, "reviewTime": "03 15, 2011", "reviewerID": "A13O106QPE706T", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Raynardo Shedrick", "reviewText": "I love this video.  I'm using it for an independent study and it has taught me a lot. I highly recommend this series.", "summary": "Awesome Video", "unixReviewTime": 1300147200}
{"overall": 4.0, "verified": false, "reviewTime": "01 29, 2011", "reviewerID": "A2BLFCOPSMBOZ9", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Dave Edmiston", "reviewText": "This was the first Learn by Video series course that I've used, and I'm very impressed with the production.  For the most part I'm impressed with the content too, although the introductory level was frustrating at times.\n\nThe course provides a good introduction to the  CS5 user interface, the Flash tools, file types, and managing the timeline.  There's also a very basic chapter that introduces ActionScript (AS3), which is the coding language used to create complex logic in a Flash application. The AS3 material is extremely basic--too basic in my opinion.\n\nAgain, I like the production of this video package. The videos can be played in Windows, Mac, or Linux. There are also MP4 versions of the video files, in case you want to view them on a portable device (iPod Touch, iPhone, iPad, etc.). This is helpful if you want to view the videos and work hands-on on your computer, although the small screen would be difficult.  The DVD also includes a collection of asset files that correspond with the lessons.\n\nIf you are a visual learner or don't prefer thick technical books, then this video course would be a good low-cost alternative. Don't expect to be a Flash expert when you complete this course, but at least you'll understand the basic concepts.", "summary": "Good Intro to Flash CS5", "unixReviewTime": 1296259200}
{"overall": 5.0, "verified": false, "reviewTime": "01 7, 2011", "reviewerID": "A2B72UCJRZUTZW", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "The Indie Review", "reviewText": "This course is well designed and well delivered. The information is presented in a very accessible way and you can tell that the presenters are qualified teachers in the tech industry. They know what their audience is looking for and cover all the relevant material to preempt questions.\n\nThe topics start with the general concepts such as \"Planning your project\" and \"Saving .fla files\" and get into some coverage of the tools, working with symbols, artwork, text, and the timeline, and then gets into animation, sound, and video. The lesson on Actionscript 3.0 is a great introduction to Object Oriented Programming.\n\nAlthough it is touted as an \"Official Training for Adobe Certified Associate Exam\", this developer cannot believe that it is all the learner will need. Having taken the exam, I can say that there are plenty of concepts in the test that are not covered in this course.\n\nWith that being said, it is an excellent way to learn Flash, or go over the basics for rustier developers.", "summary": "Great for beginners", "unixReviewTime": 1294358400}
{"overall": 4.0, "verified": false, "reviewTime": "12 22, 2010", "reviewerID": "ADDDFVHP3CSVA", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Sistertex", "reviewText": "Recently going through school to obtain an IT degree I had wanted to take Flash as well but just didn't have enough time or cash to fit it into my degree program. This seems like a pretty viable way, with a good price, to get a handle on Adobe Flash CS5.\n\nI read the intro, plugged it in and thought I was going to just take off with it. The vocal on the presentation are pleasing and easy to understand. If you miss something it is *so easy* to back up and hear it again. There is closed caption at the bottom, but if you need that, good luck...it is pretty tiny. It took me a while to set things up so that I could use the assets that come along with the classes (or even find them) in order to do a 'hands-on' follow along with the lessons. Was pretty frustrating to set up an environment to do that as you can't save back to the DVD and Flash liked to argue with me about the destination of the items I wanted to save.\n\nEnded up just copying the DVD onto my computer and then using the files from there (but starting from the DVD itself) worked fine. Another thing I noticed is that when it opens up the tutorial screen is huge and not scalable. This to me is a royal pain because I wanted to work AND watch the video. There is a *work and watch* mode you can put it into, however then the *watch* portion becomes very small and you cannot minimize it without going back into regular mode (which is not full screen mode, but takes the whole screen without being able to 'down size it' like other items I am used to.\n\nThose frustrations aside, it is a sharp presentation that includes tests and items to help you make sure you capture the essence of what is being taught. I really *do* like it and when completed, it touts, that you will have learned all the skills necessary to become a 'Rich Media Communication Adobe Certified Associate'. I haven't gotten quite that far yet, but will come back and update shortly to let you know how *that* goes in conjunction with this particular 'Learn by Video' product.", "summary": "Actually Doing The Course", "unixReviewTime": 1292976000}
{"overall": 5.0, "verified": false, "reviewTime": "12 21, 2010", "reviewerID": "ADS5APY1NKTL4", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "D. Pawl", "reviewText": "This is informative and also very utilitarian. Complete with video tutorials. It gives me a sense of focus and purpose, when I am given samples.", "summary": "a great product...", "unixReviewTime": 1292889600}
{"overall": 5.0, "verified": false, "reviewTime": "12 1, 2010", "reviewerID": "AQ77JHD6CYC2Z", "asin": "0321719824", "style": {"Format:": " DVD-ROM"}, "reviewerName": "Amazon fan", "reviewText": "I have always garnered a deep respect and fondness for animation, perhaps because of all of the now classic Disney films my parents treated me to during my childhood.  Although I am not a professional, nor do I care to be one, I do enjoy creating humorous flash animation which I circulate among family and friends.  I did find this video informative and enjoyable.  I certainly learn much more than I thought I would and would recommend this product to anyone with a love of animation and an extra 18 hours to spend.", "summary": "A classroom in a box", "unixReviewTime": 1291161600}
{"overall": 4.0, "verified": true, "reviewTime": "08 13, 2013", "reviewerID": "A279VRO0YVM43V", "asin": "0321898354", "reviewerName": "San Francisco Pete", "reviewText": "The title of this DVD is Introduction to Adobe Premiere Elements 11, and that is exactly what this is - a short introduction.  Maybe if you nare already an experienced operator of some older version of then program, It will familiarize you with the idiosynchrases of a newer version, but teach you the basics of movie-making and this program, nope!  You need something much more basic than this.  But you usually get what you pay for!", "summary": "Almost it!", "unixReviewTime": 1376352000}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "07 15, 2013", "reviewerID": "A1PVHCS99XNQIS", "asin": "0321898354", "reviewerName": "Marcel &amp; Joanna", "reviewText": "I purchased Premier Elements 11 and its difficult well impossible to use. I am proficient Adobe Photoshop user all the way back to Photoshop 7\nI am new to video, this DVD-ROM is nice, and handy I just wish it was DVD split up in chapters so I can use it in my DVD player while I am working on my computer.\nIm still using it as a reference when I need to perform some unusual task.\nThis DVD-ROM is a must with Premier Elements 11.", "summary": "is a must with Premier Elements 11", "unixReviewTime": 1373846400}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "04 4, 2013", "reviewerID": "AY5YUX0X4IH2T", "asin": "0321898354", "reviewerName": "Frequent Shopper", "reviewText": "Having no experience with Adobe Premiere Elements the \"Learn by Video\" answered a lot of my questions and got me off to a good start using the video editing program.  I would definitely recommended it.", "summary": "I would definitely recommended it.", "unixReviewTime": 1365033600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "04 4, 2013", "reviewerID": "A39WKHGS7VJ3YN", "asin": "0321898354", "reviewerName": "Thomas V. Hagerty", "reviewText": "Adobe Premiere Elements 11 is difficult for a first-time user. Reading through the manual did not give me the push I needed to start editing my own footage. But Chad Perkins, the voice on this Learn by Video CD, gave me the knowledge and the motivation I needed to start experimenting with some of my own footage on the Timeline. His examples and explanations clarified what for me were difficult problems.\n\nExperienced film editors will probably not need this video; people new to film editing and the Adobe program will greatly benefit from it though. The actual creation of short, coherent movies from multiple clips in the video is a teaching technique that registers: I picked up some difficult concepts quickly because of this.\n\nChad Perkins the host is intelligent and personable. His knowledge and subtle sense of humor made the many hours of teaching fly by fast. However, one viewing will not be enough. I'm on my third viewing now (perhaps I'm a slow learner) and I might need a few more. Chad's instruction sinks in better I think if a person is working on a real project. A real project plus Chad's insights are a good combination for mastering Premiere Elements.", "summary": "A Helpful Video for Learning Premiere Elements 11", "unixReviewTime": 1365033600}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "02 2, 2013", "reviewerID": "AY6XJYOFLOEOK", "asin": "0321898354", "reviewerName": "JB", "reviewText": "I bought Adobe Premier Elements 11 because I wanted to learn how to edit the footage that I was able to get out of my new Canon rebel T3I. I figured that because I was a whiz at Microsoft office (Excel, Word, PowerPoint, etc.) that I could just turn it on and it would be easy to pick it up. What I learned was that just because you're a whiz at 1 kind of software made by 1 company doesn't mean anything when you go to software made by another company. I could not get past just turning it on. Everything was so different. I got worried and figured that I needed help to learn this. I didn't want to spend some more money but if I didn't the software that I had already bought was going to be worthless to me.\n\nI sure am glad that I chose to get this. In the first 30 seconds of the DVD I learned an easier way to add media (video, audio, pictures) than what I had learned in studying Adobe's website for an hour. After watching it all, it seems so simple now. The narrator does move very quickly through the functions and how to work them so the pause button on my DVD player got a real workout. With the DVD paused I was able to try out some of his tips on my computer while I watched it. This was so helpful!\n\nI recommend this to anyone who is new to editing video. This really helped me understand how easy it is to work the software and also just how much the software will do. By the end of the DVD I had learned things that I didn't even know that it could do. Just remember that he goes quickly and if you want to try it out on the computer along with watching the DVD that you will have to become a pro at pausing the DVD player.\n\nNow that I know how to work Premier Elements to its full potential, Steven Spielberg and Martin Scorsese better watch out. I will soon be turning out better video than anyone in Hollywood! I know that a video review would be more logical for this, but I don't have a minute to spare. I am anxious to get started making incredible video.", "summary": "I can't wait to try out some of the stuff that I learned from this DVD", "unixReviewTime": 1359763200}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "01 6, 2013", "reviewerID": "AFZ3EF0R24N79", "asin": "0321898354", "reviewerName": "MJO", "reviewText": "gets to the mechanics of the the software very succinctly.  It is augmented well by the book 100 (actually more--another 5 star) tips on Elements .", "summary": "Great", "unixReviewTime": 1357430400}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "01 2, 2013", "reviewerID": "A21B9FUDGNDAS4", "asin": "0321898354", "reviewerName": "Business", "reviewText": "Using this to teach me how to use premiere elements 11, made me realized just how easy it is to use, I recommend this to anyone, you won't be sorry.", "summary": "Wonderful tutorial!!!", "unixReviewTime": 1357084800}
{"overall": 5.0, "vote": "12", "verified": false, "reviewTime": "07 23, 2008", "reviewerID": "A8IOST6U6WH9B", "asin": "0615179088", "reviewerName": "C. Radey", "reviewText": "Human Japanese is a truly superb introduction to what from the outside seems a daunting task---learning an Asian language.  Instruction in grammar and usage in this CD language program is congenial and clear.  Words, phrases, and sentences are in clickable format with instant, clear, and repeatable hearing of essential Japanese vocabulary.  Cultural notes add to the over-all excellence of the program.  With a reasonable price and rapid and courteous customer support, Human Japanese instructs and satisfies.", "summary": "Human Japanese", "unixReviewTime": 1216771200}
{"overall": 5.0, "vote": "11", "verified": false, "reviewTime": "06 4, 2008", "reviewerID": "A1MUV9F35OROS5", "asin": "0615179088", "reviewerName": "D. Abel", "reviewText": "I got Human Japanese as a demo from its website. Within a week I knew I had to purchase it, and it's one of the best programs I have on my entire computer.\n\nHJ eases you into the Japanese language, beginning with the hiragana alphabet. It doesn't just show you the character, it demonstrates HOW to write it, with proper stroke order. Also, you can click on any Japanese characters, and it will pronounce them for you very clearly. There is even a quick demonstration on how to pronounce words properly as opposed to the \"foreign\" way.\n\nThere are many quizzes as you progress through the hiragana and katakana to help you remember. (Although I also made my own flash cards to assist me - that was enormously helpful.) You will also learn Japanese vocabulary and grammar in an easy-to-understand way.\n\nIt is now June of 2008 and I can confidently write all of the kana, as well as write and properly pronounce many sentences. It's inspired me to try to find Japanese pen pals, and makes me want to visit Japan as soon as I can!\n\nThis is a very, very user-friendly program, and makes learning Japanese very rewarding and easy, even without a classroom.", "summary": "Best Japanese Program Available", "unixReviewTime": 1212537600}
{"overall": 4.0, "vote": "99", "verified": false, "reviewTime": "04 8, 2008", "reviewerID": "A27PAMABWVQ892", "asin": "0615179088", "reviewerName": "piepiepie75", "reviewText": "My first experience with Human Japanese was the very first version released. It was a simple program that, while not very attractive to look at, presented Japanese in a simple way that anyone could really understand. When I heard that there was a Human Japanese 2.0, I rushed to get the demo and eventually the full version.\n\nWell, first let me talk about Human Japanese in general. As the name implies, the program tries to teach you Japanese in a \"Human\" way. Without fancy terminology or complicated explanations, but rather doing it in a way that a tutor might teach you. Giving you little hints to remember writing, or making silly acronyms to remember concepts, this program tries to do things like that. It certainly is refreshing to see that kind of teaching being used in a computer program.\n\nHuman Japanese 2.0 is broken up into 40 lessons, some focused on grammar while others try to steer the reader towards learning new words and expressions along with writing. At the end of each lesson, there is usually a quiz to test your knowledge of the things learned in that chapter. These can range from small multiple choice quizzes, matching games, and an \"Endless\" type quiz which tests your vocab.\n\nStuck in between every seven or so lessons are chapters devoted entirely to culture. These small 4-7 page bits are a treat to read. They talk about things like Geography, Prices in Japan, and Bathing among other things. Many more of these for Human Japanese 3.0 would certainly be nice.\n\nThe changes from Human Japanese 1 are certainly noticeable at first glance. The interface is changed from the plain white background of 1.0 to a nice background with shades of green and silhouettes of trees. There is now a small search bar on the right side of the screen to look up any vocab term that has appeared in the program. There are also visual aids added to the lessons which, while probably not amazingly helpful, do look nice.\n\nUnfortunately, the changes from Human Japanese 1 are mainly visual. Although there are now 40 lessons, they are mostly just each of the 20 lessons from the previous version split into two lessons. This means that most of the 40 lessons are identical to content in the last version, although they tend to have a bit more meat on them (They are a bit longer, and most have a few extra vocab added).\n\nThe interface change is nice, but when making Human Japanese 3.0, I'd urge them to take the time to make up more lessons to further the readers knowledge.", "summary": "Better than the Human Japanese 1...but not much changed.", "unixReviewTime": 1207612800}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "03 26, 2008", "reviewerID": "A3HWWVK0L3JEKF", "asin": "0615179088", "reviewerName": "K. Grier", "reviewText": "This is the first language software that I have purchased and I love it!  The way in which the information is organized makes it easy to learn.  I have not even gotten far in the chapters but feel confident in what I have learned already.  I was watching an episode of Naruto with my boyfried and was pleased when I recognied the syllables for the \"key word\" or \"word clue\" just as easily as I recognize ABC.  I highly recommend this product!", "summary": "Great Product", "unixReviewTime": 1206489600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "02 20, 2008", "reviewerID": "A3NO2V2JU4Y8UY", "asin": "0615179088", "reviewerName": "H. Granat", "reviewText": "Human japanese is the best pc program for learning japanese. Easy to juse and good quises to help you remember. 10/10", "summary": "Love it!", "unixReviewTime": 1203465600}
{"overall": 5.0, "vote": "5", "verified": false, "reviewTime": "02 11, 2008", "reviewerID": "A3IMKYBNIGFPG9", "asin": "0615179088", "reviewerName": "Kenneth S. French", "reviewText": "If you want to learn or teach Japanese I would highly recommend Human Japanese. I was hooked after the first chapter and have made great progress. A nice user interface that includes excellent tools to make learning more productive and the high-quality audio is extremely helpful. Five Stars!", "summary": "Outstanding, easy-to-use", "unixReviewTime": 1202688000}
{"overall": 5.0, "vote": "246", "verified": false, "reviewTime": "01 19, 2008", "reviewerID": "A172Z0OZZD2UVF", "asin": "0615179088", "reviewerName": "Lee W. Hericks", "reviewText": "Human Japanese has an elegant, yet simple user interface that walks users through a storybook of learning Japanese.  The lessons are simple, yet effective, and contain lots of cultural and lingual information one could only discover by living in Japan.  I'm teaching English in Japan, and I even learned things I hadn't realized yet.\n\nThe style of writing is warm and has a conversational tone that keeps me reading.  That's something I think is really important when learning by book or even software.  It reads like a really knowledgable and interesting....friend.  The easy-access reference on the side let's you look up translations without jumping out of the lesson.  That's really convenient.\n\nI've tried the declan software and the rosetta stone software and it's all about vocab and phrases or trying to make you remember the words through pictures.  Just reading the introduction chapter of Human Japanese really shows how much the makers of this software care personally about teaching the fundamentals of Japanese.  The other companies just make software for learning many languages to make money.\n\nAnd I've just got to mention:  all the Japanese words in the text can be clicked on to hear the pronounciation.  It's really nice.  Also, there is a customizable review game for Japanese numbers.  It's awesome.  The Japanese number system is pretty simple, but listening to big numbers in any language is a pain.  The game will generate random numbers in the range you want and read them in Japanese and quiz you.\n\nIf you are starting Japanese or if you want a really inexpensive software that helps you build some vocabulary and hear real Japanese pronounciation, this is it.", "summary": "Learning a foreign language with a human touch", "unixReviewTime": 1200700800}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 16, 2008", "reviewerID": "A2AP8Y1YG8U0BW", "asin": "0615179088", "reviewerName": "KittyChan", "reviewText": "This product is one of those things that you just love more and more as time goes by. It starts at the beginning, introducing the writing system, both syallabaries, and pronunciation, and gradually adds in vocabulary and grammar pieces until before you know it, you're putting together full-on sentences.\n\nIt looks simple at the beginning, but as you go on the true value of this software becomes apparent. You can click every single sentence and word to hear a recording, and the text is fun to read. Two thumbs up!", "summary": "Awesome intro to Japanese", "unixReviewTime": 1200441600}
{"overall": 5.0, "verified": true, "reviewTime": "12 2, 2014", "reviewerID": "A2Q3KBSVA7F56Z", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Alvin Truthfinder", "reviewText": "Very easy product to use. It's clear. Concise. Works the brain properly.", "summary": "Five Stars", "unixReviewTime": 1417478400}
{"overall": 5.0, "verified": true, "reviewTime": "11 14, 2014", "reviewerID": "A32OSD6FHVIK4I", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Mandy Wells", "reviewText": "I love the Human Japanese software. I had a little trouble downloading it, so I wrote the author and he responded quickly. The program is easy to follow and I can click on words to hear the pronunciations. I also purchased Japanese Hiragana & Katakana for beginners and it goes really well with this program. (I test myself with the free multiple choice Kana quizzes on easyJapanese.org, but I've made flash cards too). After I learn all the Hiragana & Katakana I think I'll be able to progress faster in the program, but it's been great so far.", "summary": "I love it!", "unixReviewTime": 1415923200}
{"overall": 3.0, "verified": true, "reviewTime": "11 8, 2014", "reviewerID": "A37RK6IW147989", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Wendy Lee Riggsbee", "reviewText": "only problem, daughter lost a code and ow cannot access the info on the computer. frustrating", "summary": "Three Stars", "unixReviewTime": 1415404800}
{"overall": 4.0, "verified": true, "reviewTime": "09 22, 2014", "reviewerID": "A12ZEYNVT3PCAG", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Ean P.", "reviewText": "For an intro to learning Japanese, I found it very understandable. I have not fully completed reading yet, but I can say that I am satisfied with the overall presentation of it. I should also note that I spent weeks looking for something to get my foundation started on learning Japanese.\n\nThe only issue I had is that I am wishing there was an audio version, or someway to put it on my tablet/phone, so I don't have to sit in front of the computer.", "summary": "but I can say that I am satisfied with the overall presentation of it", "unixReviewTime": 1411344000}
{"overall": 3.0, "verified": true, "reviewTime": "09 5, 2014", "reviewerID": "A3VCAL31C8EBRM", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "KG", "reviewText": "There is a lot of great information in here but I feel like I'm just reading an interactive textbook.", "summary": "Review", "unixReviewTime": 1409875200}
{"overall": 5.0, "verified": true, "reviewTime": "09 2, 2014", "reviewerID": "A3IFU8J1OPDS88", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Marsha", "reviewText": "This really helps and is easy to use to help you understand the language more clearly!", "summary": "Five Stars", "unixReviewTime": 1409616000}
{"overall": 5.0, "verified": true, "reviewTime": "08 25, 2014", "reviewerID": "A2JN8KS19QCQ3O", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Maria McConnaughey", "reviewText": "Good program. A few little bugs, but the owner/creator helped us right away!", "summary": "Good deal! Great software!", "unixReviewTime": 1408924800}
{"overall": 4.0, "verified": true, "reviewTime": "08 8, 2014", "reviewerID": "A1ALOPLRXFG9E7", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Juan Hernandez", "reviewText": "it focuses first on the Japanese writing system the hiragana and later the katakana right now I'm still in the hiragana section I haven't went that far yet but once I get the hang of it, I will learn how to pronounce a few Japanese words overall this is a good software to teach you the basics of the Japanese language.", "summary": "I will learn how to pronounce a few Japanese words overall this is a good software to teach you the basics of the Japanese ...", "unixReviewTime": 1407456000}
{"overall": 4.0, "verified": true, "reviewTime": "08 1, 2014", "reviewerID": "A2IQ2JTNY2CJQT", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "cclee", "reviewText": "I would have graded a 5 star, but I have just started the program. It appears to be easy to understand, and the method seems simplified for a beginner, which I am. I don't have any previous Japanese program to compare it to. So far so good.", "summary": "So far so good. This seems like a simple program.", "unixReviewTime": 1406851200}
{"overall": 5.0, "verified": true, "reviewTime": "07 24, 2014", "reviewerID": "A1MHSVPNF47GUF", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "treb", "reviewText": "good item i love it", "summary": "good and fast delivery", "unixReviewTime": 1406160000}
{"overall": 5.0, "verified": true, "reviewTime": "07 14, 2014", "reviewerID": "AD6AK1FG3NLQU", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Anthony Nicosia", "reviewText": "Purchased for my eleven year old daughter.  It's easy for her to follow and understand.  Pleased with the purchase.", "summary": "It's easy for her to follow and understand", "unixReviewTime": 1405296000}
{"overall": 3.0, "vote": "9", "verified": true, "reviewTime": "06 20, 2014", "reviewerID": "AQ02W3BFJPDQ3", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Evan Shaw", "reviewText": "Pros\n- Introduces Hiragana and Katakana characters by teaching stroke order and pronunciation. The characters are introduced little by little with the help of a quiz, making them much easier to memorize as opposed to learning them all at once.\n- Helpful cultural notes are dispersed throughout the software\n- Concepts are introduced in an easy to understand, conversational way\n- Audio recordings for all Japanese words and phrases\n\nCons\n- Too much vocabulary is introduced at one time\n- The vocabulary and concept quizzes are awful. There is no way to choose how many or which words are used in the quiz, it just quizzes you on everything in the chapter at random and indefinitely, making the quiz practically useless for chapters that have a lot of vocabulary, like chapter 28, which has 39 pages.\n- There are no exercises whatsoever, only readings that do not require any user input. Because of this, in my opinion, coupled with the horrible quizzes, retention is rendered almost impossible.\n- Some concepts are introduced seemingly at random. For example, the particle \"ni\" is introduced in chapter 20, but the particle \"de\" isn't introduced until chapter 35... The problem with this is that both particles are very similar in meaning and it would make a lot more sense to explain both of them at the same time. The result for me was that, for a long time, I incorrectly used \"ni\" in places where \"de\" belonged.\n- Verb conjugation isn't explained at all. This to me is the worst part of the software. When the author introduces verbs, he introduces them in their \"-masu\" and \"-te\" forms instead of their dictionary forms. This makes it impossible to know what is actually happening to the verb. For example, when he introduces the verb \"iku\" (to go), he introduces it as \"ikimasu\" and \"itte\", providing no explanation for how \"ikimasu\" conjugates to \"itte\". In fact, the only way to know how this happens is to know that the dictionary form of \"ikimasu\" and \"itte\" is \"iku\", but he doesn't even mention it! There is also no mention of the difference between \"u\" verbs, \"ru\" verbs, and irregular verbs, leaving the user with the impression that the \"-masu\" and \"-te\" forms must simply be committed to memory.\n- There are several typos throughout the software, including a typo in one of the Japanese examples.\n\nOther thoughts:\nI bought this software as a result of not being able to take the first two intro Japanese classes at my college. I figured that if I used this software, I could opt into the third course and continue from there. My reason for choosing Human Japanese was that I thought it would be much less overwhelming compared to using a textbook. Fortunately, it was. However, if I could go back in time I would definitely choose to use the Genki textbook instead. I was able to opt into the third class, but after going through the first Genki textbook and doing all the exercises, I can say confidently that the Genki textbook isn't that difficult to navigate and far more rewarding and informative.", "summary": "Go with Genki instead", "unixReviewTime": 1403222400}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 19, 2014", "reviewerID": "A2N7IYLK882T6F", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "A. clay", "reviewText": "I was wanting to learn Japanese, not only to read and speak fluently, buy to be able to talk to myself without anyone knowing what i was saying. With this program, I am able to achieve my wish! This software is so down to earth and friendly, I am surprised I am not talking to an actual person.\n\nI have had this software for a few months now, and when I get a break from my classes, I enjoy the time I spend learning this new language. There is one or two words placed wrongly in a sentence in English, but that is throughout the entire program, while its nothing to ponder on what they just said. You can also report it to Brak, and I am sure they will fix it.\n\nHow it works: At the beginning, there is a very mild and friendly introduction, that warms you up to what is coming later. Then, it gives you a tad but of history and few moments to tell you about the writing sysytem. Once that is over, it brings you through Hirigana, the first part, all the while showing you how to write the character and giving you a hint on how to write and how to remember it. Hirigana part 1 is over, now a few pages on the Geography of Japan. Now to Hirigana part 2! Once you have learned Hirigana, they launch you into an amazingly simple and easy introduction to Greetings and what to call things around the home, and explaining how verbs are used. There are 40 chapters, and I am only on 20, which is great, because I am at my own limit, as well as you can, either if you are slow or busy, or fast or in a rush. You need time for this though.\n\nThis software is cheap, as in the price, compared to Rosetta Stone. Rosetta Stone just starts flinging out words at you, where you have to figure out how to say it, and what it means, with no training under your belt. Not Human Japanese. I was about to buy a few books on how to speak and read Japanese, but i decided to go on a whim and purchase this software. I do not regret it, and it might have been the best 30 dollars i have ever spent......but i don't keep track. I am definitely going to buy Human Japanese Intermediate once I am done with this one. I am even hoping for them to do a Russian learning software.\n\nBuy this if you are wanting a friendly, self paced software that you can have fun working through, but if you wished to be pushed through learning a language, and like to guess what your saying, go somewhere else. If this was 50 or 100 dollars, i would still buy it, and still say it is the best learning program i have ever used.\n\nRemember as well, that this has fun match games and contest you can do with yourself or the computer, and beautiful recorded sound for the voices.", "summary": "Worth Every Penny", "unixReviewTime": 1397865600}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "04 12, 2014", "reviewerID": "A3CG6VESPN5QOX", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "R. A. Pelton", "reviewText": "I should've known for the price that I wasn't going to get much. It's great if you need something to help guide you - it's very teacher-ish in it's presentation, but it wasn't as immersive and interactive as I was hoping for. I get more feedback from my DS Japanese Coach game ^_^", "summary": "Not what I expected", "unixReviewTime": 1397260800}
{"overall": 4.0, "verified": true, "reviewTime": "04 11, 2014", "reviewerID": "A1S5G0CL6NZHM8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "James M", "reviewText": "Well its good the human japanese language. Well it have its good and bad but i starting to learn something in japanese only by a little bit but yeah to me its worth it.", "summary": "Its Good", "unixReviewTime": 1397174400}
{"overall": 5.0, "verified": false, "reviewTime": "03 3, 2014", "reviewerID": "A2ZVXYAANNGK3T", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Blake Hussey", "reviewText": "Oh my god! I have never seen a language program that was so genuine as this! Whereas other language programs require you to just memorize grammar techniques, this one puts you in square one. It really shows that the developers have had years of experience with not just the language, but of the culture itself. I will be using this as I return to learning Japanese. I do recommend though to have a notebook on you when you're doing this, especially when learning about hiragana, katakana, and other words that you might see in print. This is for people who want to learn Japanese, but want to go at an easier pace.", "summary": "So amazing", "unixReviewTime": 1393804800}
{"overall": 5.0, "verified": true, "reviewTime": "02 15, 2014", "reviewerID": "A1AXFP520887DK", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "paul smith", "reviewText": "Very detailed & easy to understand. It is a calm and relaxing experience that makes it that much more enjoyable.", "summary": "GREAT!!!", "unixReviewTime": 1392422400}
{"overall": 4.0, "verified": true, "reviewTime": "02 11, 2014", "reviewerID": "A35VBQUAIJUPYP", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Summer Foovay", "reviewText": "I've had this for several months and I really like it.  I feel like I am progressing well on my understanding of Japanese.  The only complaint that I have is the emphasis on learning hiragana over vocabulary, phrases, and actually speaking Japanese - but that may be only a personal preference.  If you want a complete understanding - then this is a great program.  I also really like the little games and tests for review.", "summary": "Working well", "unixReviewTime": 1392076800}
{"overall": 5.0, "verified": true, "reviewTime": "02 10, 2014", "reviewerID": "A3G1KYVUUZ8AQP", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "jen.y", "reviewText": "really helps me understand which is great because im taking a japanese class and i don't always understand the teacher", "summary": "easy to understand", "unixReviewTime": 1391990400}
{"overall": 5.0, "verified": true, "reviewTime": "01 16, 2014", "reviewerID": "A2TVIGQ87H55S4", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Kindle Customer", "reviewText": "My daughter got it and she likes it. She is learning Japanese and this will help her even more with it.", "summary": "Good", "unixReviewTime": 1389830400}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2014", "reviewerID": "A37BSL76ZY7EEX", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "RoxShinobi", "reviewText": "I got this as a gift for my boyfriend. he's been using it for about 2 - 3 weeks now. he loves how easy it is. after his first lesson he was already reciting back what he had learned. you learn grammar, language & there are small sections about japanese culture which the boyfriend sees as a real treat. definitely a great purchase.\n\nAlso, my shipment arrived day after i ordered.", "summary": "Great, user friendly software", "unixReviewTime": 1389484800}
{"overall": 5.0, "verified": true, "reviewTime": "12 31, 2013", "reviewerID": "A3E48C2A9ZKIO7", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Trust Me", "reviewText": "Think of this program like a slightly interactive book. You're mostly reading, but when it comes time to look and learn words, you can click them to hear their pronunciation. Every Japanese sentence and word has voice dialogue for you to listen to if you choose.\nI've been studying with this program for almost a month now and it has been extremely helpful. It really breaks things down and doesn't just tell you \"This means that.\" but also explains \"(Why) This means that.\" When learning about verbs and other particles such as 'wa', 'wo', 'ni', the programs takes great strides to explain how they attach to words, and how they are used in various situations and sentences.\n\nThe only problem I have with this program so far is that there isn't much it tries to do to help you remember anything. The few games it has at the end of some chapters are not very useful. You'll have to make your own methods or get some flashcards to memorize vocabulary. For learning the program is great, for exercising and remembering what you learn, not so much.\n\nI'd still suggest this program overall for learning purposes. You can learn a lot, quickly, in detail, and then put what you learned to use in other activities.", "summary": "Great Program for a Budget", "unixReviewTime": 1388448000}
{"overall": 5.0, "verified": true, "reviewTime": "11 22, 2013", "reviewerID": "A119CM2HYG3O2A", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "TokiDoki", "reviewText": "This really is a simple and informative way of getting yourself immersed in Japanese. The lessons are easy to understand and everything is explained in a friendly, easy to understand manner. All you really need to do is put your best effort into it and practice. If you really want to get an advantage then Japanese Hiragana & Katakana for Beginners: First Steps to Mastering the Japanese Writing System, is a MUST. Also available on Amazon", "summary": "Truly for beginners", "unixReviewTime": 1385078400}
{"overall": 5.0, "verified": true, "reviewTime": "11 11, 2013", "reviewerID": "AH3DNIA4KFFOH", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Hahn T.", "reviewText": "It is very easy to use and is useful for the casual learner of the Japanese language, especially good for the price. I have been to Japan several times since I bought the software.", "summary": "Exellent value for the price", "unixReviewTime": 1384128000}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "10 5, 2013", "reviewerID": "A37YNUNFD6ZZS9", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Kimchi Cakes", "reviewText": "Beware! I bought this item new, and spoke with a representative from Human Japanese that told me that some of the cds had faulty activation codes that didn't work. I did receive in the mail a new disc and activation code that works on my computer. Customer service was excellent, and I received my new cd, and code in a week. If your activation code doesn't work, contact Human Japanese, so they can send you out a new code that works for you!", "summary": "Great learning tool.", "unixReviewTime": 1380931200}
{"overall": 5.0, "verified": false, "reviewTime": "09 15, 2013", "reviewerID": "A1K1ITTVTHDQUB", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "atomskeater", "reviewText": "Currently I'm about halfway through the program, and I've found it to be well-paced and helpful in grinding in some basic concepts of Japanese grammar. I've been trying to self-teach since May, and although I've found a good system for learning kanji I still struggle to work up the motivation to learn grammar. I find the brevity of the chapters to be refreshing and easy to work through.\n\nThe text seems to be well researched. It doesn't make the mistake of telling you that \"anata\" can be used just like we use \"you,\" for example (one thing I didn't like about my old textbook; some of the advice and info was outdated).\n\nChapters are followed with vocabulary and concept reviews, allowing you to practice what you've learned. You can even choose to display the answers/questions in Japanese or English. The chapters are interspersed with cultural notes that explain how some things work in Japan. There are numerous example sentences, and you can click on them to hear them read aloud by native speakers.\n\nTo make it more accessible for beginners, everything (so far) is written using kana. I already know some basic kanji, so I would have liked the option to switch to kanji, but that's a minor gripe. The interface is simple and easy to use. I think I'll continue to use this and refer to it from time to time. This is a useful tool for absolute beginners.", "summary": "Very personable and informative for beginners", "unixReviewTime": 1379203200}
{"overall": 5.0, "verified": true, "reviewTime": "08 5, 2013", "reviewerID": "AXYWSQYRZSV00", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Torus Bakery", "reviewText": "....That I bought it on my tablet too (digitally from the Play Store)! Know this: You will need some self-discipline to make use of this product. It doesn't hold your hand, it's just like a college class without the classmates. You will learn Hiragana and Katakana at the very least, if you write them out on paper (this is very effective for burning things into memory for long-term). I haven't gotten too far because I'm busy and forget about it but this is definitely worth the money, it's almost a steal!\nBuy this product if you want to learn!\nNo shipping or quality issues, CD installed just fine.", "summary": "I liked it so much...", "unixReviewTime": 1375660800}
{"overall": 5.0, "verified": true, "reviewTime": "06 16, 2013", "reviewerID": "A3F8K29K2X0TIB", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Daver", "reviewText": "This title has a lot of really good information for those that are starting or just have started studying Japanese.\nIt does not get into Kanji, but it does go through Hiragana and Katakana, as well as vocab and grammar.\nIt also has a lot of historical and cultural information in it as well.", "summary": "Great place to start", "unixReviewTime": 1371340800}
{"overall": 5.0, "verified": true, "reviewTime": "06 10, 2013", "reviewerID": "A1UG50S08NUN97", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Kenshin", "reviewText": "I find this as a great product for someone who is first starting out in Japanese.  I have not toyed with the intermediate version yet, but plan to do so as soon as I finish this lengthy lesson.  I say lengthy because it seems to have everything I need.  I am not new to languages, but I am relatively new to japanese.  Buy it, it's worth it.", "summary": "Great Product", "unixReviewTime": 1370822400}
{"overall": 5.0, "verified": true, "reviewTime": "06 10, 2013", "reviewerID": "A1GP6GJT0JNW8M", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Dylan", "reviewText": "I did enjoy the Rosetta Stone, I won't deny that, I had learned a lot from it.\n\nNow this little beauty though, I learned a lot more.  Plus, it really feels like you have a one-on-one tutor that truly wants you to succeed.  They want you to learn the ins and outs, the why it is how it is, not just a handful of phrases.  You'll be able to put together sentences like never before in Japanese after going at it with this program.\n\nHowever, if you can't handle a heavy dose of reading through the chapters than it wont' be for you.", "summary": "Great product great price", "unixReviewTime": 1370822400}
{"overall": 5.0, "verified": true, "reviewTime": "06 8, 2013", "reviewerID": "A8DR7YAZSNVVQ", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "K-bev", "reviewText": "My husband and I started the CD on our commute I work. The format is very easy to follow. Each course is approximately half an hour long so you don't get overwhelmed with information. We are thoroughly enjoying it and will continue through the entire disk set before you know it.", "summary": "So far so good!", "unixReviewTime": 1370649600}
{"overall": 1.0, "vote": "4", "verified": true, "reviewTime": "06 5, 2013", "reviewerID": "A1XW7E1XH2B7KU", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Paula L. Poole&#039;", "reviewText": "I hate giving these bad reviews but this software did not work whatsoever on my laptop. I had all of the requirements and even contacted the support but it didn't even start up. I'm still continuing to search out the problem but for now I have to leave it with a 1 star.", "summary": "Nope", "unixReviewTime": 1370390400}
{"overall": 5.0, "verified": true, "reviewTime": "05 4, 2013", "reviewerID": "A294X1LXSDIQ9", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Adam", "reviewText": "This product exceeded all expectations I set for it! Friendly writing and interesting information combine to form a cohesive learning experience. Love it!", "summary": "Perfect", "unixReviewTime": 1367625600}
{"overall": 5.0, "verified": true, "reviewTime": "05 3, 2013", "reviewerID": "A3HIL62ORGMUUU", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Richard Osterhout", "reviewText": "This program is amazing! For the first time, i actually understood what was being taught to me about a 2nd language. It broke the process down into a way i never thought of trying for other languages. I am being completely honest when i say, i learned more with this program in 1 month, then i did with 3 years of taking spanish. I recommend this to anyone looking into learning Japanese!", "summary": "Amazing value!", "unixReviewTime": 1367539200}
{"overall": 5.0, "verified": true, "reviewTime": "05 3, 2013", "reviewerID": "A1O66NU3Y2BLV8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Skittles", "reviewText": "I would highly recommend this product for any Japanese enthusiasts. It is appropriate for all age groups. It was bought as a gift and they loved it.", "summary": "Very Good.", "unixReviewTime": 1367539200}
{"overall": 4.0, "verified": false, "reviewTime": "05 1, 2013", "reviewerID": "A4243QRD7YXAY", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Goalposts", "reviewText": "This is an excellent product, professional in appearance, well written, but difficult to read for people with below-average eyesight. It needs to provide the capability to change the font size to the user's liking. Also, it would be nice to be able to change to a darker font as well.\n\nAlso, be advised that there is a free trial available; I don't see where it says what the free trial entails, but I found that the first eight of forty chapters are free if you download from their website. This is enough for you to get a good start and see how you like the product (and the language). Japanese is actually pretty easy - except for the writing!\n\nHajimemashite, Amazon shoppers...", "summary": "text too small", "unixReviewTime": 1367366400}
{"overall": 5.0, "verified": true, "reviewTime": "04 2, 2013", "reviewerID": "A2LVMKYTCVP1TW", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "New", "reviewText": "This product is just amazing. I never left a review on amazon, but i had to for this wonderful product!!! The interface is pleasant and greatly done, and the colors are great! I love how the author program goes over the distinct differences of english and japanese, and then slowly works you into the \"nuts and bolts\" of japanese. I thought i would never learn a language because the concept of learning another languages grammar, spelling, punctuations,etc was just crazy. This program slowly introduces to the concepts of the language and then gives you a chance to read japanese characters. The japanese characters are click-able so you can listen to them. The author also demonstrates on how foreigners make a mistake on pronouncing words and he shows you how himself (He has an awesome voice). Then after a long exercise there is a break in between the program which talks about the culture etc with some nice pictures. I wish i knew about this program sooner! I started using this today and i can read about 20 japanese characters. This program is so simply yet complex! I love it so much and i recommend it to anyone who is afraid of learning a language, interested in learning it, or is interested in it! This is 100000x better than Rosetta stone! I swear to god! I feel 100% confident that i will learn japanese with this program. I would like to thank everyone who created this masterpiece of a product!!!! You surely deserve more!!! And the price is amazing! to be frank, this thing should be at least worth 50-100 dollars. I feel like i ripped them off somehow. :) Thanks again humanjapanese!!!!", "summary": "A relaxing, soothing, amazing, interesting, well written product!!!", "unixReviewTime": 1364860800}
{"overall": 5.0, "verified": true, "reviewTime": "03 22, 2013", "reviewerID": "A10P1YIWCMGLKM", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Amazon Customer", "reviewText": "I really like this book.  I have been teaching myself, for fun, and this is a great introductory work.  It starts right off with the Hirigana and as soon as it works through that, all the exercises are in Japanese.  It has a good pace and has breaks in the format to give you a rest and acquaint you with other information.  And it has great audio, to go with the lessons, so you can hear any word or phrase as often as you need.  Very good intro to Japanese.", "summary": "Human Japanese", "unixReviewTime": 1363910400}
{"overall": 5.0, "verified": true, "reviewTime": "03 3, 2013", "reviewerID": "AD13PTGJF9I9X", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Bronson Mills", "reviewText": "Humorous and thorough. This product is a great companion to other programs/methods or as a foundation for understanding. Great Buy!", "summary": "Great Product", "unixReviewTime": 1362268800}
{"overall": 5.0, "verified": true, "reviewTime": "02 6, 2013", "reviewerID": "AST5QBQK00UTK", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Jack", "reviewText": "I just started using this software, and find it one of the best ways to learn a language. It does not just give you a bunch of phrases to memorize. It teaches you the writing of the words as well as the pronunciation. Works for me I like it and the price was real good.", "summary": "So far I really like it.", "unixReviewTime": 1360108800}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "02 3, 2013", "reviewerID": "A1MMZW6604U9QD", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Joe R", "reviewText": "It's hard for me to overstate the help I've gotten from this program in learning Japanese. I'm someone who has never done well with languages in a classroom setting. For some reason, my brain doesn't seem to jive well with the way most foreign language teachers teach. Nothing sinks in, concepts don't 'click', and  after I somehow pass the class, I forget everything.\n\nThat's what nearly happened when I took Japanese 100 in college last semester. The class would simply whizz by while I can honestly say I learned next to nothing. Finally, the week of finals, I decided I needed to do something to get up to speed so I'd pass. I used Human Japanese for a few days and learned more than I did during the whole semester. Not only that, but the program helped me to realize just how simple some of the concepts were.\n\nWhile textbooks tend to describe things in technical-speak that would confuse my understanding even of my native language, Human Japanese does what the name suggests and what the developer promises: it explains Japanese in a personal, human way that does wonders for teaching the new language to someone. I can't tell you how many times I finished learning a new concept and was surprised at just how simple it had been. This program inspires confidence in your ability to learn Japanese. It doesn't take off and leave you in the dust anywhere, ever.\n\nWe use Rosetta Stone at school, and I literally hate the program. Never mind its price, Human Japanese is a far superior program for learning the basics of Japanese. The fact that it's much, much more affordable is a huge bonus. Keep in mind, Human Japanese has just released a follow-up program called Human Japanese Intermediate for people who have finished the original and want to delve further into the language. It has been released for iPad thus far, and will come to PC/Mac/iPhone/etc soon. I can't wait!", "summary": "Simply the best software/resource I've found.", "unixReviewTime": 1359849600}
{"overall": 4.0, "verified": true, "reviewTime": "01 10, 2013", "reviewerID": "A3VZY7IQC7XUD4", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Kendra Michael", "reviewText": "I use Human Japanese to refresh myself. I have taken formal classes and even used Rosetta Stone. This is an inexpensive way to keep my Japanese language skills sharp.", "summary": "Enjoyable - Good for Beginners", "unixReviewTime": 1357776000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "12 30, 2012", "reviewerID": "A1W5EC8U1XB8WZ", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Zibbyamala", "reviewText": "Alright--this might turn out to be a lengthy review! So if you wanna skip to the grits, I'll let you know exactly where to go.\n\nFirst, I'll start you off with a little history lesson so that you know where I'm coming from in relation to language. I'm one of those people, one of those thousands of people who simply didn't get language. A second language wouldn't STICK in my brain. As soon as I began to grasp a concept, it would slip. As many Americans do, I was forced (more or less) to take a second language to pass high school. I chose spanish, as it is a money making language in the US. All throughout my spanish career, I struggled. In no offense, I didn't like the language. I didn't care about the culture, I didn't care about anything at all in relation to Spanish except for passing the class. Well, needless to say, while I passed the class, I didn't learn a damn thing. I didn't know why, and assumed it was because I was just one of those thousands of people who just didn't get language. But I do understand language now. It's taken me to my third year of college and a linguistics class to understand WHY I never really learned spanish--and the answer is so simple I could slap myself. It was because I didn't CARE about it! True, you can \"learn\" something that you don't care about--but do you excel? How long does it stick in your brain? Do you remember it or do you actually LEARN it? Ask yourself this!! I realized that I don't give a rats hat about spanish, and that subconsciously affected my learning. But I desperately wanted to become bilingual, so I took a look at a culture and language that I DO care about...\n\n**(This is what you want to read!)\nThe Human Japanese program is outstanding, amazing, enthralling, captivating, and any other positive \"-ing\" word you can think of. YES, MAC USERS, WE CAN GET IT. Just not here, search it in the Ap store, and you will find it for around 20 bucks (18.99 if my memory hasn't failed yet). Just as the other comments say, it is indeed HUMAN like. He is so warm, simple, and even kind of funny! He cracks a few jokes here and there, and relates tough or questionable subjects to things English speakers can understand. He even gives history lessons so that we can better understand the \"whys\" and the \"hows.\" There are animations, a real Japanese woman helping with pronunciation, everything! I absolutely love the program. I admit, I've just start using it--but at the same time, I'm halfway through learning Higarana. And, these things STICK. I don't know how he does it, but he puts his information in a way that really does stay with you. I remember things from pages (the program reads like a warm, friendly book) ages ago. In spanish class, I couldn't remember things we've talked about SENTENCES ago. Best 20 bucks spent.\n\nNow, if you WANT to learn another language, you LIKE Japan and are INTERESTED in the language, with no experience, Human Japanese is the program for you. You have to want to learn it, but when you do, Human Japanese is here to hold your hand. Buy it! I pray that he makes an intermediate and advanced levels, because I don't want to learn from anyone or anything else. :)\n\nLong response! Eh??", "summary": "MAC USERS WE'VE GOT IT TOO", "unixReviewTime": 1356825600}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "12 30, 2012", "reviewerID": "A7OT82DN460H2", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Cassandra ", "reviewText": "The software is very much like an interactive flash program, and remains small in size, so it is not ideal for someone with eye problems. The information covered is basic, and it is pretty standard for discs of this cost. Overall the instant immersion programs are more interactive.", "summary": "Meh, it is a sufficient intro for the price", "unixReviewTime": 1356825600}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 28, 2012", "reviewerID": "A3R3XZGWCWED2Y", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "yumyumcoconut", "reviewText": "This program is really amazing. I've tried a lot of Learn Japanese programs, and this one is by far the best. I think using a software is so much better than a book, especially if you don't have a teacher or friends who speak Japanese to help you pronounce words. Using Human Japanese it almost feels like I have a real teacher in front of me teaching. Plus it's a lot more fun than reading a book, since there are activities to help the information stick to your brain. It's not just a bunch of memorizing words, in Human Japanese you are actually taught how and when to use the words. Every Japanese word in the book is clickable and will pronounce it for you. Hearing it really helps. I like how the program breaks it up too, you go from learning vocab, to some culture information, to some new Hiragana/Katakana/etc. Doing that keeps it fresh and interesting, and helps a lot because you are slowly introduced into each topic, rather than thrown in and expected to memorize everything. Definitely a great program! Though you can get the digital download for a bit cheaper (I think I paid $19 on the Human Japanese website) if you don't care about having the hard copy of the disc. Definitely worth the small amount of money it costs! Much better than the more expensive ones I've tried!", "summary": "Wonderful!", "unixReviewTime": 1356652800}
{"overall": 5.0, "verified": false, "reviewTime": "12 22, 2012", "reviewerID": "A1EGI4DHOH1GE", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Lina", "reviewText": "For the money, this is an awesome product. Particularly considering the issues one might face when first learning a language whose grammar and pronunciation are entirely different, this program is extremely effective.", "summary": "Need more languages in this format.", "unixReviewTime": 1356134400}
{"overall": 5.0, "verified": true, "reviewTime": "12 15, 2012", "reviewerID": "A2124QQC2HCRK5", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "JohnR", "reviewText": "First off I want to say I have not made it through the entire course yet. However what have gotten through is very well thought out and is presented in an easy to learn pace and structure.\n\nI do want to say that this is NOT like Rosetta Stone. Which is great. I tried Rosetta Stone and quickly returned it, I felt confused the entire time I tried using it. Human Japanese is more like an e-book than a hyper interactive video game learning software. However this is exactly what I wanted. For the price there's nothing better.\n\nI bought the combo deal with the Japanese demystified book plus the Kana Flashcards and would highly recommend it for anyone wanting to learn Japanese.", "summary": "Great Software but not \"Video Gamey\"", "unixReviewTime": 1355529600}
{"overall": 5.0, "verified": true, "reviewTime": "11 24, 2012", "reviewerID": "A3571SJQ7WW2Q8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Sasuke Uzamaki", "reviewText": "This is truly a great product!\nIt's practically a steal due to its cheap price.\nYou definitely get more than you pay for!\nI would try this before moving on to something more expensive such as Rosetta stone.", "summary": "Amazing!", "unixReviewTime": 1353715200}
{"overall": 5.0, "verified": false, "reviewTime": "11 17, 2012", "reviewerID": "A3AY05BWAVYKHF", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "gypsyforlife", "reviewText": "I found this program to be very helpful. The lessons work with words and phrases you would use on a daily basis rather than the \"this is a book, this is a cat\" method that some language programs start with. It also has wonderful cultural explanations and tips.", "summary": "Excellent program for beginners", "unixReviewTime": 1353110400}
{"overall": 5.0, "verified": false, "reviewTime": "11 14, 2012", "reviewerID": "A2Q6O8VKB7Y858", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Dirk B.", "reviewText": "My eleven year old daughter has tried about a half dozen Japanese Language programs and wasn't happy with any of them except Human Japanese. The interface is intuitive and easy to learn. She likes the approach that Human Japanese takes and she's able to easily apply what she's learned and test herself against the correct pronunciations provided. This is easily the best product available to learn Japanese.", "summary": "Hands down best software for learning Japanese", "unixReviewTime": 1352851200}
{"overall": 5.0, "verified": true, "reviewTime": "11 10, 2012", "reviewerID": "A3THUY2M7Z4DTV", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Shannon", "reviewText": "It's great! I've only done up to Chapter 4, and I'm already learning quite a bit. There are quizzes and tips to writing the hiragana properly that actually really helped. Plus, it is quite interesting the tidbits he provides you, and not a hardship at all to read.\n\nYou also can't beat the price.", "summary": "Human Japanese software", "unixReviewTime": 1352505600}
{"overall": 5.0, "verified": true, "reviewTime": "11 5, 2012", "reviewerID": "A3JHTCVS64U9IN", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Robert", "reviewText": "I purchased Human Japanese not knowing what to expect. I read many of the other positive reviews, but was unsure. I was unsure that such an inexpensive product would be helpful, but took a chance. I was pleasantly surprised with this product. Human Japanese is a wonderful product that introduces the Japanese language in simple, easy to understand terms. I have learned more from this product than any other product I have used. If you are seriously interested in learning Japanese I highly recommend this program.", "summary": "Great Product", "unixReviewTime": 1352073600}
{"overall": 5.0, "verified": true, "reviewTime": "10 3, 2012", "reviewerID": "ACLHJVQ9838I8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "ech5", "reviewText": "The author takes you through step by step in a well organized, fluid, learning experience.  I particularly appreciate that he uses the culture to explain how the language is effected by it.", "summary": "Good learning tool", "unixReviewTime": 1349222400}
{"overall": 5.0, "verified": true, "reviewTime": "03 19, 2012", "reviewerID": "AMFSN8747I0D1", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Wayne Cellon", "reviewText": "I've had this software for about a year. I took some time of from using this software to learn some of the kanji (that is the one thing this software does not cover, although it does give an overview of kanji in one chapter) and also due to a death in the family. I just recently started back with my Japanese studies and started this software over. The software reads more like a book (a good book) and even covering the chapters I had already done before was entertaining. When I first started learning last year I struggled with the kana and was using boring hiragana and katakana workbooks. After switching to Human Japanese I breezed through learning the syllabaries and before I knew it, I was reading Japanese without the aid of romaji. The software slowly introduces hiragana, then katakana, then weens you off of the romaji. I hardly noticed this process happening, so it was the perfect pace for me!\n\nEnglish grammar was never a strong-point of mine. But this software does a great job of explaining the grammar and how it relates to English grammar and breaks it down so that it is easy to understand. Using this software, I've had several \"eureka moments\" where a concept made perfect sense after not being able to understand it using other methods of study.\n\nTo sum up, I would highly recommend this software to be part of any beginners arsenal of study materials!", "summary": "A Must Have for Self-Study!", "unixReviewTime": 1332115200}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "03 2, 2012", "reviewerID": "A3PWMVKPVPC2VV", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Koomori", "reviewText": "This product is fantastic for many reasons. Let me begin by saying that I have been studying Japanese already for six years on my own. So, being already learned from books and other software programs I was a bit hesitant to try another one and have to sit through the motions of basic Japanese BUT the way that they organize this software, it kind of lets you skip around so you're not sitting for hours through these boring automated lessons feverishly clicking the stuff you already know just so you can move on. Human Japanese is pretty open to the user so you can approach Japanese from whatever angle you want. I spent the first week with this software hitting the chapters I wanted to touch up on and found that their way of teaching is actually really comforting just like other reviewers have said.\n\nSo much in fact that I am now just going back over the stuff I 'already knew' and am constantly getting pleasantly surprised by the way that they explain those things. Like it makes even MORE sense now.\n\nThe writing style is calm with some mild jovial points that catch your attention, really it IS as if you are sitting there with a Japanese person and an American person, both fluent in the language and they are EXPLAINING it to you, point for point, making connections with English that really - I haven't even seen referenced in many books I own and I'm up to about 35. So as someone who has a growing horde of Japanese Language books, as someone who has sampled Rosetta Stone and as someone who gets confused easily coupled with NO attention span... this software is absolutely perfect for me. It's concise, gives examples, makes connections, doesn't overload you with rules and exceptions...\n\n... seriously. Everyone interested in learning Japanese at any level you may be now. Just try it out. Keep your books, maybe invest in a notebook and use this software to get crackin'. It's totally worth the dollars.", "summary": "Absolute Must Have", "unixReviewTime": 1330646400}
{"overall": 3.0, "vote": "22", "verified": true, "reviewTime": "02 19, 2012", "reviewerID": "A2YFECED2U4FOD", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Brent Llanos", "reviewText": "This product is presented well but strictly for beginners. It mostly covers the three writing system and the very basic Japanese grammar. If you already know Hirigana, Katakana and te-form, then you've learned everything this product has to offer. It's a nifty little product for self-learners but not for people who've already taken a year or two of Japanese at the college level.", "summary": "Only for beginners", "unixReviewTime": 1329609600}
{"overall": 5.0, "verified": true, "reviewTime": "02 13, 2012", "reviewerID": "A3K6KB64LAKMUU", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Mr. S", "reviewText": "This is a fabulous produt for learning Japanese.  I would highly recommend this to anyone that has embarked on the journey to learn Japanese.", "summary": "fabulous product", "unixReviewTime": 1329091200}
{"overall": 5.0, "verified": true, "reviewTime": "02 10, 2012", "reviewerID": "A2WUM81YIU1P68", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "AndreaCL", "reviewText": "I'm a freshman at a community college right now and, unfortunately, going to a University where they teach Japanese just wasn't in the cards right now. I was determined to at least have a general understanding of this language before transferring so I decided I'd give this system a try before paying hundreds of dollars for Rosetta stone. I'm so glad I did because it's great! It's straight forward and it really feels like you're being taught by an instructor. It's only been a week and I've learned so much! I totally recommend this system to those looking to getting a handle on the Japanese language.", "summary": "Can't believe how well this works!", "unixReviewTime": 1328832000}
{"overall": 1.0, "vote": "12", "verified": false, "reviewTime": "01 10, 2012", "reviewerID": "A3NNP0SF31OCV2", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Bigfamily", "reviewText": "This program is not for everyone. It is actually a boring ebook with a few interactive quizzes. It is not suitable for young children and teenagers. An adult may be able to bear it.", "summary": "Don't buy it!!", "unixReviewTime": 1326153600}
{"overall": 4.0, "vote": "12", "verified": false, "reviewTime": "01 3, 2012", "reviewerID": "A290GZQ84UZQ5H", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "aquido", "reviewText": "I am making an review from a linguist's point of view.\nI am fluent in Korean, English, Spanish, and have confidence with Japanese and Chinese.\n\nThis is a very light software with only about 30~40 Mb of data.\n\nThe programme is very user friendly, if you click any of Japanese words, there is a voice example for an exact pronunciation.\nAlso, there are Japanese culture explanations every now and then to keep your attention.\n\nPlease keep in mind that this is for VERY VERY BEGINNERS!!\nIf you already are already familiar with letters (hiragna + katakana) and basic grammar forms (present, simple past, etc), this progamme won't be very useful.\n\nHowever, this will be extremely useful if this is your first time learning Japanese.", "summary": "Very good introduction to Japanese language and culutre", "unixReviewTime": 1325548800}
{"overall": 4.0, "verified": false, "reviewTime": "09 3, 2011", "reviewerID": "A3R16XFXBZG755", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "C. Payne", "reviewText": "I don't know a lot of Japanese language yet, I've only been at this for a few weeks and am not the most dedicated person in the world, however, I have collected a few different resources and, now that college started, am in an introductory Japanese class.\n\nOverall, this is a great product for learning the basics of Japanese to an extent that allows basic communication, especially speech. The integrated audio files demonstrating pronunciation are a life saver and help demonstrate proper pitch accent to keep your own speech clear and comprehensible.\n\nThere's a lot of good vocabulary and grammar, and at the end of each chapter there are quizzes to help you judge how well you retained the material and also to practice. My only complaint is that the quizzes are often very large, making it difficult to learn smaller groups of vocabulary at a time, and that you are not able to generate custom, cumulative quizzes to test your knowledge overall.\n\nSomething I thought was lacking was the writing aspects. While the introduction to Hiragana is great, the material on Katakana is more stretched out, and many foreign words are first written in Hiragana because of your lack of knowledge in a certain chapter. Additionally, the Hiragana chapter has additional memory exercises, whereas the Katakana is limited to a matching game which isn't a particularly good way to memorize them. For this reason, I still haven't.\n\nAnd finally, in my introductory college textbook, even a few kanji are introduced per chapter as the book goes on. I'm not saying this product should have hundreds of kanji to teach, but I feel introducing some of the more basic ones would have helped.\n\nHowever, Human Japanese Intermediate should solve my kanji complaint, and I will of course purchase another amazing product from these developers.", "summary": "Great Software for Language Learning", "unixReviewTime": 1315008000}
{"overall": 5.0, "verified": false, "reviewTime": "08 13, 2011", "reviewerID": "ASNJXTX1XFYRX", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "allenmf", "reviewText": "Human Japanese is a major reason why I did so well in my Japanese classes back in high school.  It allowed me to study at my own pace, and because every grammatical structure and element is described so thoroughly yet concisely, I was able to feel 100% competent that I had a complete understand of the language's basic characteristics.  I'm entering Japanese 101 in the fall (2011), and plan on using this software alongside my class in order to further cement my grasp of the language.\n\nIt's very inexpensive for what you get.  The progression of each lesson is logical, slow and steady, and far from confusing.  There are vocal and grammar quizzes at the end of most chapters (those that don't have their own are grouped with the next).  This is a highly enjoyable and educational program that will have you thinking, speaking, writing, and reading basic Japanese in a month's time.", "summary": "Excellent introduction to Japanese", "unixReviewTime": 1313193600}
{"overall": 1.0, "verified": true, "reviewTime": "08 4, 2011", "reviewerID": "A10Z3FTSP8X91M", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "D. Griffin", "reviewText": "sucks i tell you... your better off buying a japanese stone tablet and staring at it for a week... you'll learn more japanese and be more encouraged to try.", "summary": "It would've been nice had this software walked you through it.. but it just suck all around.", "unixReviewTime": 1312416000}
{"overall": 5.0, "verified": false, "reviewTime": "07 9, 2011", "reviewerID": "A38A2MI499GVD", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "James M. Elgin", "reviewText": "The first three chapters were so well written and captivation that I could not put it aside.  I totally agree with this approach to learning a language.  The examples and vocal gave me almost instant understanding of what I had been hearing and why it was that way.  I feel that it has improved my small knowledge base and will allow me to develop my language skill in the right direction.", "summary": "Funny and well written start", "unixReviewTime": 1310169600}
{"overall": 5.0, "verified": true, "reviewTime": "06 29, 2011", "reviewerID": "A16BKOCIROBDA8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Patti", "reviewText": "This is possibly the best way to learn Japanese. Before I got this program, I really wanted Rosetta Stone. Now, I realize how stupid that urge was. Human Japanese has easy-to-understand lessons that never drag on and never rush. The cultural articles, which may sound boring now, are actually quite interesting and make me want to learn even more. I also love the animations for the symbol drawing,and the quizzes and games that have familiar formats. You'll understand when you see them. I guess I just love Human Japanese because it's so... human. \\(^o^)/", "summary": "I just LOVE this program!", "unixReviewTime": 1309305600}
{"overall": 5.0, "vote": "17", "verified": false, "reviewTime": "06 16, 2011", "reviewerID": "A3309IEQSU5WF9", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Amani2", "reviewText": "This is one of the best tools for complete beginners to Japanese. Human Japanese will teach you how to write the kana, why the Japanese writing system is the way it is, as well as basic grammar and about 1800 words/sentences (with good quality audio recorded by native speakers). Everything is explained clearly in plain English and I found it fun to use. I only have a few minor complaints:\n\n-Human Japanese does not mention pitch/word accent. While Japanese does not have a \"stressed\" accent like English does, syllables can be low or high in pitch (similar to how our voice rises when we ask a question in English). However, the pitch accent is very obvious in the recordings, so as long as you model your pronunciation after the audio, you'll know how to say the words properly.\n-This software briefly mentions whispered vowels, but only for \"su\" and not other vowels. When vowels come between certain consonants, they are often whispered. Again, if you copy the audio's pronunciation you'll be fine.\n-The search functionality included in the software is helpful, but it only searches for key words, not the entire text. It would be nice if it showed all instances of a word.\n-Another complaint is that words and sentences must mainly be learned through memorization. They are presented in a list format that is clickable with audio. There are short quizzes and games available to practice, but it would be cool if they made this part of the learning more interactive and fun, especially since this is software. The advantage of the list format is that it gets right to the point, so if you just want to learn words quickly without going through a bunch of animations, you can. It's more like an interactive textbook with good explanations.\n-Additionally, since Human Japanese is a beginner course, it only gives an introduction to kanji and doesn't cover all the grammar found in a regular textbook. Its purpose is to give you the confidence that you can study Japanese, even by yourself! For what it teaches, the price is right.\n\nIt's easy to be overwhelmed by Japanese as a beginner because it is completely backwards from English. Textbooks often assume that you already know how to write the kana and they don't explain the basics in much detail. It's a shame that most textbooks aren't suited for self-learning beginners, but that's where Human Japanese excels. After finishing this course, you'll have a very solid foundation and be able to jump into any popular Japanese textbook series.\n\nIf any of my friends ask me what they should use to start learning Japanese, I'm definitely going to recommend this. It's suitable and friendly for just about anyone with an electronic device. I don't think I can say that about the majority of language materials I own. I really hope this company makes more advanced levels, as well as versions for other languages. I'm also trying to learn some Chinese right now and a Human Chinese would be wonderful!\n\nInstead of reading reviews, just go to the Human Japanese website and try it out for yourself. There is a demo available for your browser as well as a downloadable version for Windows. It goes through 8-12 chapters depending on the demo, and there are 40 chapters total, so you should be able to get a good feel for the full version. Human Japanese is also available for the Mac on the Mac App Store, as well as the iPhone, Android, and Windows 7 phones. For the phones there is also a free \"Lite\" version, which I downloaded prior to writing this review. The phone versions seem to be the same as the PC/Mac ones. I haven't used the phone app much, but it lists the same 40 lessons and the first few chapters have the same exact text and audio. It's obviously a bit easier to read the text on my computer screen than on my phone, but the formatting looks fine.\n\nIf you want to learn through software and you've thought about trying Rosetta Stone, get this instead. It's much better \"bang for your buck\" than Rosetta Stone and you'll have a more thorough understanding of how the Japanese language works. It doesn't cover as much vocabulary as Rosetta Stone or use pictures, but there are so many other cheaper (and more efficient) methods to build vocabulary, such as Anki, a free flashcard software, with user-shared flashcard decks (some even include pictures and audio).\n\nOverall, 9/10.\n\nIf you are looking for an audio program, too, I really like Michel Thomas' Beginners Japanese course. Similar to Human Japanese, it will give you a nice start to speaking and basic grammar. I think it would complement this software well.\n\nA little about my Japanese studies: I'm using&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Japanese-for-Everyone-A-Functional-Approach-to-Daily-Communication/dp/4889962344/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Japanese for Everyone: A Functional Approach to Daily Communication</a>&nbsp;as my main textbook. For Kanji I use&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Remembering-the-Kanji-Vol-1-A-Complete-Course-on-How-Not-to-Forget-the-Meaning-and-Writing-of-Japanese-Characters/dp/0824831659/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Remembering the Kanji, Vol. 1: A Complete Course on How Not to Forget the Meaning and Writing of Japanese Characters</a>. To review vocab/grammar/kanji I use Anki, a free flashcard software with spaced-repetition.\n\nIf you want some more ideas for well-reviewed resources, I've made a Listmania List called The \"Best\" Books/Resources for Learning Japanese: Beginner to Advanced. I also created a guide with a bunch of free resources titled: So you'd like to...Learn Japanese Inexpensively (Free Resources Included). I'll post the links for those in the comments in case you are interested.\n\nGood luck with your Japanese Studies!", "summary": "Wonderful Introduction for Complete Beginners: Great Alternative to Rosetta Stone", "unixReviewTime": 1308182400}
{"overall": 5.0, "vote": "7", "verified": false, "reviewTime": "05 12, 2011", "reviewerID": "A3IXP5VS847GE5", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Dragonflies &amp; Autumn Leaves", "reviewText": "My situation: Both my 8 y.o. son and I are learning Japanese together.  I have taken one year of Japanese in college, my husband speaks some, and we have access to native speakers.  That said, mostly I am a beginner needing a simple, clear, and accurate text that we can use for self-study.\n\nWe are using the i-pod touch application of Human Japanese (which is very handy to carry around in your pocket and use to practice pronunciation and what-not where ever you happen to be.)\n\nReasons this software stands out:\n\n  -I LOVE that I can instantly hear the pronunciation of any Japanese words or sentences simply by touching them.  Japanese writing is introduced immediately, so this is very helpful in building your reading skills and  pronunciation at the same time, which is the only effective way to do it.  This is a HUGE improvement over my college text books, where one has to pop in separate audio C.D.'s to hear the lesson's vocabulary.  With Human Japanese you see it and hear it together all at the same time, and it's easy to access.\n\n  -I love that the hiragana and katakana are animated, so you can see how it is drawn simply by touching it.\n\n  - The explanations and layout are easy and enjoyable to read.  My son enjoys reading the lessons to me in the car, and is not intimidated or confused by it.\nIt's clear this is someone who knows from experience what would be useful to an English speaker learning Japanese (and is no doubt creating the text he WISHED he had when learning.)\n\nMy son and I have been taking a very leisurely pace and are on chapter 10 after about 5 months.  This is mostly due to wanting to get the kana down solidly, and having the limitations of an 8 y.o. attention span.  We aren't doing tons of talking yet, but the delay is worth having a comfortable reading relationship with the kana.  I have skimmed ahead and the other chapters seem well done.\n\nI do find it helpful to do some supplementing:\n\n We could not remember all the hiragana and katakana characters so easily, so we made our own charts, and would quiz ourselves by drawing the characters in the air, until we could do them from memory.  I highly suggest printing out two blank 10 by 5 box grids (plus one drawn in for \"n\") and making a hiragana and katakana chart for yourself.  You can easily print out a chart from the web for reference, but making your own really helps the memory.  We have used practice print outs from a Japanese website for kids, that are fabulous, with cute pictures for the characters that teach you simple words at the same time.  They have corresponding Hiragana and Katakana charts.  The site is kids dot nifty dot com fowardslash study forwardslash index dot htm\nThe chart with the yellow background is the hiragana, the mint-green is the katakana, and the pictures with the pink ice cream and candy are the worksheets.\n\nThis, however, is only to supplement: Human Japanese will teach you what need to know about the characters...this just gives extra practice to those who need to write it themselves, and see it all in a chart in one spot.\n\nFor the numbers chapter I found myself wanting to know what the Kanji for the numbers are, and looking that up on the web.  I wish it had been included in the lesson, even if we weren't technically covering Kanji yet.  Same thing for the days of the week.  I found helpful info. fairly easily online for this [...], and also a more useful way of understanding the number units \"man\" (10,000) and \"oku\" (100,000,000) by showing them grouped by 4 places instead of three (shift that comma over so you get 1,0000 and 1,0000,0000.)  This is a small thing, but very useful for understanding what is going on with the numbers, and I'm surprised it wasn't presented that way.\n\nDespite me wanting to supplement here and there, this is a great program to use as the backbone of your beginning study.\nUltimately, this software is a very pleasant and solid way to start...and is preferable to programs faaar more expensive.", "summary": "Excellent!", "unixReviewTime": 1305158400}
{"overall": 5.0, "verified": true, "reviewTime": "05 4, 2011", "reviewerID": "ADJRBMXK0VO2Y", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "EG", "reviewText": "I'm half way through the program and love it! For years I kept telling myself to learn a second language and used a few different products (Earworms was the last over a year ago) but it never really stuck. This program is fun, interactive, and easy to use. I highly recommend this to anyone that wants to learn Japanese. I'm pretty confident that by the time I finish all 40 chapters I'll have a very good grasp of basic Japanese and will be ready to study on a more intermediate level.", "summary": "Great Learning Tool", "unixReviewTime": 1304467200}
{"overall": 5.0, "verified": true, "reviewTime": "04 19, 2011", "reviewerID": "A2CIMZ5T85GCVG", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Alanna Heck", "reviewText": "This is fantastic software for learning Japanese! I absolutely love it because it has made it so much easier to learn Japanese. I love that instead of starting out with vocabulary it began with simple pronunciation and getting you familiar with the Japanese symbols. It has made it so much easier to learn the language. When you start learning vocabulary the quiz at the end of the first chapter gives you so much repetition that you will start to remember what the words are and how to pronounce them. This is such fantastic software.", "summary": "Absolutely Awesome!!!!", "unixReviewTime": 1303171200}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "04 14, 2011", "reviewerID": "A1GMUUUSK8T4UN", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "OCD Foodie", "reviewText": "I've taken classes and bought software for a variety of languages  - Spanish, French, Italian, Japanese, German and more.  Since I had a positive experience with Rosetta Stone for Spanish, I originally purchased Rosetta Stone for Japanese only to be disappointed in some fundamental lessons that I felt were missing due to the fact that character sets were not part of the lessons.  Human Japanese on the other hand really is the best step-by-step introduction to the language that I could find and a great bargain.  Considering the other products on the market, I have no idea how they were able to afford to produce such a quality product and not charge more.  I highly recommend it and encourage you to try it out.", "summary": "The Best System for Learning Japanese (Review from a Polyglot)", "unixReviewTime": 1302739200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 1, 2011", "reviewerID": "A2TLMFX5QKFI8R", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Angela Smith", "reviewText": "I LOVE this product. Originally my husband and I were planning on buying Rosetta Stone to learn Japanese, but after seeing all the bad reviews we decided against it and stumbled upon this one. It had really great reviews, so we decided to give it a try especially since it was only $25! Not only do I feel like I am really learning from it, but it saved me hundreds of dollars and probably a lot of hassle! I definitely recommend this to anyone that wants to learn Japanese!", "summary": "Loving It!", "unixReviewTime": 1301616000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "03 23, 2011", "reviewerID": "A2V5M5EJPOD2IU", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "David Bradshaw", "reviewText": "This software was super easy to install, took less than a minute!  The software is simple (that is what makes it great) and does not take up much room on your Hard Drive Disk.  The software is broken into chapters with each new items learned ending with a game or trivia to test your knowledge.  The software is mostly written text that you have to read (it does not read to you).  The text is fun and engaging, and offers many interesting topics from the origin or the language to the history and geography of Japan.  It breaks learning into manageable parts, so you are not too overwhelmed.  The software runs smoothly and offers many spoken parts (pronunciation of new words).  Once you are done for the day all you have to do is exit out and when you reopen in the future it starts right back where you left off at.  This software is more like reading a book and having interactive studying materials, but that is exactly what I want.  Something that is easy to start and can be completed at my own pace.  I highly recommend the product and hope that there are future releases that offer advance studying on top of what it learned in this edition.  Also, I have found it helpful to go online and print out a chart of the Hiragana and Katakana characters for reference as you complete the lessons. -- It is easier than going back through lessons.", "summary": "Great Software for learning Japanese", "unixReviewTime": 1300838400}
{"overall": 5.0, "verified": false, "reviewTime": "03 19, 2011", "reviewerID": "AENHELANY8VHO", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "LR", "reviewText": "I love learning languages, but it can be hard to find the right self-teaching devices. Rosetta Stoen has always tempted me from afar, but the price tag has always kept me away. Similar software options promise miracles but all I see are skeptical reviews.\n\nHuman Japanese is like $25. Whaaat? That means it cannot be good. But it's calming and basic and makes me remember that I enjoy learning languages - On my own terms. You can download an extensive (much more so than the Rosetta Stone trial) trial download here:\n[...]\n\nAnd see for yourself. I really enjoyed it and it felt nice giving this guy money for something I just love so much.", "summary": "Exactly How I want to Learn a Language", "unixReviewTime": 1300492800}
{"overall": 5.0, "verified": true, "reviewTime": "03 14, 2011", "reviewerID": "A3YMW76ALZZ96", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Midori", "reviewText": "This is the cutest language learning program I've ever used!  I love how there are culture notes included and unlike some language learning programs, there are no annoying little people on the screen.  Human Japanese is very well laid out and it looks like loads of effort was put into this program.  I have recommended it to my friends and classmates who are trying to learn Japanese.  If this company were to introduce their product for other languages, I'd quickly buy them as well!", "summary": "I love this program!", "unixReviewTime": 1300060800}
{"overall": 5.0, "verified": true, "reviewTime": "03 4, 2011", "reviewerID": "A1YLRF06JZB3PJ", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Diana", "reviewText": "This is the best one to learn japanese it is not like 200 bucks rosetta stone that just puts images to find the words this one teaches you many things even geography of Japan it has fun games and useful i cant wait for their new product human japanese intermediate.", "summary": "Very useful and great.", "unixReviewTime": 1299196800}
{"overall": 5.0, "verified": false, "reviewTime": "03 1, 2011", "reviewerID": "A1FQU7VYKDUBO8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Lydia", "reviewText": "I tried this product on my Android and it is AMAZING. I have been studying Japanese for a while and nothing else has been as thorough as this. It covers all details and leaves nothing out. As a person who notices tiny little flaws in everything, I was very satisfied to have all my questions answered where other materials have not. I did find a spelling mistake, which is my BIGGEST PET PEEVE EVER (watch me make a typo in irony) but this material is so great I was able to look beyond it. A must have for learning!", "summary": "Great!", "unixReviewTime": 1298937600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "02 28, 2011", "reviewerID": "ALJGXOJOM145S", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Mick", "reviewText": "I won't add any to the already glowing reviews of the features and ease of use of this product. I want to let people know about all the options for purchasing this fine program.\n\nIf you go to the humanjapanese.com web site and click the Download tab, you will be able to try out Human Japanese instantly in your web browser, no download necessary! You can also download a trial version for a PC from CNET. Or, you can buy the CD here at Amazon (PC only).\nOr, you can get the Mac App if you run OS 10.6.6 (Snow Leopard) at the Mac App Store.\nThe app versions cost less than the CD.\n\nYou will need the latest version of Adobe Flash Player and Microsoft .NET Framework 2.0 to run it on a PC. These are both free downloads.\nI had to mess with the Activex controls under Internet Options in Win XP on my old Dell laptop.\nHowever, I've been a Mac guy since 2003 so I went to the Mac App Store and downloaded it on my Mac Mini. Runs great.\nI didn't have to download anything else.\n\nAND THERE'S MORE!  If you prefer to have it on an iPhone or IPod Touch, it's at the iTunes store under Apps.\nIt also runs on Android devices and on the Win 7 Phone. How's that for availability?\n\nFinally, if you have any questions at all,  the people are at HumanJapanese.com are easy to contact and v. helpful.\nThanks Brian!", "summary": "Available in MANY formats...including MAC and App!", "unixReviewTime": 1298851200}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "02 11, 2011", "reviewerID": "A1HXL8K4MMMS1C", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Amy C Maddocks", "reviewText": "I have only scratched the surface of this program, but so far, I like what I am learning.  It presents the language in a way I can understand it--naturally instead of technically.  I hope to learn Japanese before I move to the country in June of this year, and so far, this program is helping me to do that!", "summary": "Great resource", "unixReviewTime": 1297382400}
{"overall": 4.0, "vote": "8", "verified": true, "reviewTime": "02 5, 2011", "reviewerID": "A1ES5BB1LN3FPZ", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "G. Rush", "reviewText": "This product is a great way to begin learning Japanese, but it does not really delve into advanced material as much as some students might like.  It is interesting and well-written, and anyone can pick this up and quickly understand the structure and pronunciation of the language, as well as some of the culture and history of Japan.  It will even teach you a fair amount of vocabulary.  However, students learning kanji, advanced vocabulary, or in need of good reference tools should probably look elsewhere.", "summary": "An Excellent Introduction", "unixReviewTime": 1296864000}
{"overall": 5.0, "verified": false, "reviewTime": "02 4, 2011", "reviewerID": "A2WMMGDQVBE0NE", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Elena Merino", "reviewText": "I actually downloaded this program as an app on my Android phone. There is a \"lite\" version that allows you to go through 7 chapters out of 40 for free. I did the lite version and loved it so I bought the full version on my phone for $[...]. Great deal if you don't mind looking at a smaller screen, which I dont.\n\nI have only been through the first seven chapters but it is really amazing so far. Makes learning pretty simple. Has a personal way of teaching the language and explains why and how things are done that particular way. I would definitely recommend this program.\n\nLite version: [...]\nFull version:[...]", "summary": "Great Program!", "unixReviewTime": 1296777600}
{"overall": 2.0, "vote": "18", "verified": true, "reviewTime": "01 27, 2011", "reviewerID": "A2JPHHV50HZUB4", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Gerrits", "reviewText": "I purchase the software and the first thing I notice that the box was opened.  I contacted the company to make sure nothing was missing and they assured me the only thing in the box was the CD. It took me a while to install the software it was asking me to install .net 2.0 this was time consuming.  Once I installed the software I became disappointed.  It was just reading materials regarding the language, stroke order and they did have little quizzes but not interactive at all. I was expecting the software to have more interactive materials. I'm sorry but I'm returning the item.", "summary": "Not sure if this is for me", "unixReviewTime": 1296086400}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2011", "reviewerID": "A2AQMG06QPP5PI", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Michelle A. Iantosca", "reviewText": "Was all set to slap down my bucks for Rosetta Stone, until I saw the reviews that is.  Although they were no very bad, they were far from Great, and shelling out $200 plus for just so-so is a definite negatory for me.  I found this software and decided what the hell for 25$ and I must say, I am impressed with the ease and information that is given. The lessons are short and sweet and the information is helpful and easy to understand.  It is too bad that this is the only level and one of its kind that I have found so far. Awesome!", "summary": "Great alternative to Rosetta...", "unixReviewTime": 1294704000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 28, 2010", "reviewerID": "A3NO15FKC1JA1R", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "P. Chen", "reviewText": "So far, I'm on chapter 4 and really like the program. I can't believe it's only $25 when programs like Rosetta Stone and Pimsleur cost more than  $300. It's well thought-out, with interesting tidbits on how the Japanese language compares to English in terms of numbers of syllables, writing, how it evolved from its initial use of Chinese characters. Very interesting stuff. The tone is conversational, as if you were learning from a live teacher who also has a sense of humor. For example, here's an excerpt from chapter 3: Hiragana:\n\n\"If Japanese used only Hiragana and Katakana, it would be one of the simplest writing systems in the world. Alas, the picture is a bit more complicated than that. See, when Hiragana was invented, Chinese characters didn't just roll over and die. Keep in mind that Kanji were associated with wealth, power, and education. So for centuries, most of the people who had those things continued to write extensively in Kanji.\"\n\nIt's hard to be bored with stuff like that.\n\nI've tried using Pimsleur, but the repetitive, listening-only method doesn't work for me. After saying \"I understand/I don't understand\" 10 times in all its variations, I had to stop. And I was only in the middle of the first 20-or-so-minute less.\n\nHuman Japanese is different because it's engaging. You can click on words to hear the pronunciations, but you can see the romanized spelling of Japanese words and/or the kana and/or the kanji. This is what language-learning should entail--seeing, hearing, and speaking (which you do to yourself, of course). I only wish that Human Japanese had a recording function, like the \"Talk Now!\" series does, which allows you to record your pronunciation and play it back. Then you can determine whether your pronunciation is off or spot-on.\n\nI'll have to get to later chapters (or the end) to give a more detailed review.", "summary": "Like learning from a live, patient teacher", "unixReviewTime": 1293494400}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "11 10, 2010", "reviewerID": "A69W1GQPU6IX2", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "S. Coombs", "reviewText": "''''' '''''\n\nAfter only a couple months of (not very diligent) study, I've already learned to read and write in Hiragana, some Katakana, and make basic sentences as well as greetings and the like. It's been a very enjoyable experience, and it's the one part of \"schoolwork\" I always enjoy. The whole thing is presented in a very clean and organized matter, along with voice clips to aid in pronunciation. I used a flash card app (free) for my iPod to drill the Hiragana characters into my brain better, but that's the only other resource I've had to use. I've never had this much fun learning a language, and I've tried to before. Best money spent ever!", "summary": "The perfect resource for forming a solid Japanese foundation.", "unixReviewTime": 1289347200}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "11 7, 2010", "reviewerID": "AK59ZZJJ1S94H", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Lexy", "reviewText": "I used this program as somewhat of a litmus test, in the sense that I didn't want to go ahead and spend a lot of money on a Japanese textbook before I knew if I could be capable of learning it. After my experience with Human Japanese I feel more confident to go forth with my studies, and spend a little more money on more advanced resources.\n\nMy biggest thing, is that I feel like I got my monies worth out of this product, unlike a lot of costly programs currently on the market. For 25 bucks you get 40 chapters of dense vocab and grammar notes, along with cute cultural notes. My only criticism would be that for certain chapters its difficult to remember the vocab with it just listed. For the body section for example, it would have been easier to understand it if he had some sort of body diagram and listed the parts on a picture of the body. I would have also been really happy if instead of listing the hiragana or katakana he showed the kanji of the word to the side, so I won't have to go back and re-learn them. Despite my nitpicks, I still enjoyed this unique program, and I would recommend it to others.\n\n(On a side note) After finishing Human Japanese, I felt confident enough to invest in an online textbook with a heftier price tag. I chose [...] which is specifically made for people teaching themselves Japanese. It helps in reviewing the basics, and has a fun innovative way to learn kanji. So that's my two cents, I hope it helped someone ^__^", "summary": "Fun, Charming, and Aesthetically Pleasing", "unixReviewTime": 1289088000}
{"overall": 5.0, "vote": "49", "verified": false, "reviewTime": "07 18, 2010", "reviewerID": "A3TTDEJRZ92ME1", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Sunshine S.", "reviewText": "Before buying Human Japanese, I had tried Rosetta Stone Japanese. What a WASTE of time!\nTo me, this is simply the best place to start your Japanese learning. It gives you a solid foundation in the basics of Japanese writing, grammar, sentence structure, culture, and gets you over many of the hurdles that beginning Japanese learners face.\n\nThis product is an amazing deal, in my opinion. For such a low price, you learn so much, you enjoy learning it, and you actually remember what they teach. This software is like a favorite, enjoyable book that you just can't put down.\n\nSome of my favorite features of this program:\n- Awesome cultural tidbits and information about Japan and geography!\n- Useful vocabulary and phrases and a way to look up any Japanese word that the program uses!\n- A warm, inviting approach that makes it HUMAN and not like a textbook.\n- The tech support is amazing. The creators are really nice, always trying to improve their software and bring it to new places and levels. They respond immediately.\n\nWhat's in it for you?\n- If you don't know hiragana and katakana, you'll learn how to write it, stroke order, stroke number, and little tips to remember how to write the kana well. If you're like me and already know it, it can give you a nice refresher course!\n- Culture, history, geography, and more presented in a way that keeps you interested.\n- Nice, clear photographs and clear male and female speaking voices.\n- Dialogue that helps you learn to recognize speech patterns, sentence patterns, vocabulary, and learn to read hiragana and katakana at the rate they are speaking, instead of relying on romaji.\n- Easy to navigate chapters and reviews. Reviews that include flash cards and the very helpful vocabulary quizzes.\n- Compliments books and other learning methods well, and is a great, easy to use reference for anything you need a refresher on - like wa and ga, or what that darn word for kitchen is.\n\nThis product is simply excellent. It is a MUST buy. Don't believe me? Try the demo on their website.\nI was skeptical, too, but after trying the demo I was absolutely HOOKED.\nTop 10 Reviews put it at number 5 out of 11, but in my opinion, it belongs much higher on the list!\n\nDomo arigatou gozaimasu, Human Japanese!", "summary": "The perfect approach to learning Japanese!", "unixReviewTime": 1279411200}
{"overall": 5.0, "verified": false, "reviewTime": "04 24, 2010", "reviewerID": "ANM5BBM33DW8V", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Philip Seyfi", "reviewText": "Human Japanese is probably the ideal Japanese learning software available to beginners today. It doesn't go very far into advanced grammar points or kanji, but what it does, it does really well. The lessons are very well-written and easy to read, and every now and then, an article about Japanese culture and lifestyle pops-up which allows one to make a break from learning, yet discover more about the beautiful country, it's history, and traditions. Those willing to go a little deeper into advanced topics, as well as review what they've learned with Human Japanese, may want to try my Japanese educational game NihongoUp - [...].", "summary": "Ideal program for beginners", "unixReviewTime": 1272067200}
{"overall": 5.0, "vote": "15", "verified": false, "reviewTime": "03 23, 2010", "reviewerID": "AFL7RQCOPJ0JV", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Aaris Delilah", "reviewText": "I bought this because of the price and the reviews.  I had taken part of a semester of Japanese at the city college and boy was I disappointed.  I have a good deal of language learning experience and I just felt like the teacher I had was making it way too complicated (although I think she was trying to make it easier in her defense).  It really isn't all that difficult of complex a language.  It's simply mysterious because of the writing system and grammar differences.\n\nHere's my advice.  Take the hiragana and write down the first ten characters.  Repeat repeat repeat until you can do it from memory.  Then add ten more.  Repeat procedure.  You will have all of your hiragana and katakana down in no time.  Honestly, a couple of days would suffice if you really want to learn it quickly.  Once you have that down, you will feel like you have your feet on the ground and the rest will not be so scary.  If you would like to practice, you can google \"hiragana practice\" or something like that and find quite a few little quizzes or games, etc.  That's a good way to keep it current.\n\nAnyway, Human Japanese is exactly that, human.  It's not going to treat you like a robot student and try to program you with information.  Expect to be told digestable amounts of information.  It will obviously be quite different than English, so just accept it and move on.  Things will start to come together before long and you will find there are some things you actually understand.  This is encouraging.  Now and then, bits and pieces of cultural knowledge will come up to break up the lessons and keep it from getting boring.  This is all done in a very friendly way, as if you were learning from a gentle tutor who just wants you to enjoy learning and eventually understand.  Honestly, this is how it should be.\n\nAlso, customer support is very friendly.", "summary": "So Gentle to the Learner", "unixReviewTime": 1269302400}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "11 4, 2009", "reviewerID": "A2Y1T75BOCLKY8", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "M. Jones", "reviewText": "I've taken a Japanese class (using the Genki text) and this software supplemented my previous knowledge almost from the very beginning. The interface is simple but elegant. The tone of the chapters is friendly and conversational. I like how it introduces Hiragana and Katakana immediately. Also, the verbal pronunciation of the terms, the cultural asides, and the games are great features. I highly recommend Human Japanese to anyone who is looking for an easy introduction to the Japanese language.", "summary": "Excellent Japanese learning tool", "unixReviewTime": 1257292800}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "10 19, 2009", "reviewerID": "A2U1OX47JSP504", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Bill Dunham", "reviewText": "I really liked this program. it was simple and easy to understand. It covers speaking and writing very well, I would recommend for the beginner. Another cool thing is it installs on your computer so you don't have to use the CD everytime. Works great if you have a laptop with an external CD drive like I have. It also remembers where you left off from the last time.", "summary": "Very good", "unixReviewTime": 1255910400}
{"overall": 4.0, "vote": "10", "verified": true, "reviewTime": "10 2, 2009", "reviewerID": "AJFB2RC9C59CA", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Otis", "reviewText": "I have not yet really mastered the Japanese language yet due to me being lazy and not having much time, but the time I have spent using \"Human Japanese\" has been well spent.  The lessons seem to progress logically and are informative.  All in all i am satisfied with this product and would buy it again.  Now it should be noted that I only gave this product 4 out of 5 stars, but that is not saying there is anything wrong with this product.  It is just that I do not give 5 star ratings unless the product I am reviewing exceeds my unreasonably high expectations.  All in all I would say if you are on the fence about this product, I don't think you will find a better piece of software for the money and probably many that are not as good for more.\n\nBuy it.\n\nOtis", "summary": "It was good... get it", "unixReviewTime": 1254441600}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "09 22, 2009", "reviewerID": "A306D2RZWTNZ5I", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Roberta Wright", "reviewText": "This program is for beginners, but it is a lot of fun to use! I really enjoy this! I love the quizzes that it has. It is so fun!", "summary": "Learning Japanese is fun using this program, for beginners.", "unixReviewTime": 1253577600}
{"overall": 5.0, "vote": "16", "verified": false, "reviewTime": "05 2, 2009", "reviewerID": "A2KVM4WZ5TGKVF", "asin": "0615179088", "reviewerName": "B. Nguyen", "reviewText": "This is a great CD software for someone who wants to learn the language or maybe to use to review the basics or vocabularies. It does show a fairly good details how the grammer works and explains brief culture of Japan along the way in the lessons. This way you get an idea what Japan life is like. The best feature I like this is option of listing to native japanese speaker speaks either a word or sentence. This will help tune your accent to sound like real japanese. Also I like how it explains the lesson in a simple and casual manner. Not very technical to the point your head hurts or needed a teacher to explain. If you cannot afford Rosette Stone yet (which I also recommend), this is software to start with. By the way, you need internet to use your program to verify verification.", "summary": "A great introduction to learning Japanese", "unixReviewTime": 1241222400}
{"overall": 5.0, "vote": "10", "verified": false, "reviewTime": "04 10, 2009", "reviewerID": "A2L4JC36RTLIL3", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "E. Wolf", "reviewText": "I wanted to learn Japanese but couldn't take a class for it because our school doesnt have one. So never having had prior experience in japanese I had no idea what to look for. Sure I started by looking at Rosseta Stone&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Rosetta-Stone-Version-3-Japanese-Level-1-2-3-Set-with-Audio-Companion/dp/B001AFFYSW/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Rosetta Stone Version 3: Japanese Level 1, 2 & 3 Set with Audio Companion</a>, but it cost wayyyy too much for me. So I started looking around on amazon. I found Human Japanese and was leary at first but after reading the reviews I decided to try it. I've had it for a little more than a week and I've already learned a lot. This program does teach you Japanese but it takes it from basics. It also gives history about how the language started, no there are no quizes on this lol. But this is a great product for any one! FIVE STARS!!", "summary": "I was new to Japanese", "unixReviewTime": 1239321600}
{"overall": 5.0, "vote": "4", "verified": false, "reviewTime": "04 8, 2009", "reviewerID": "AOCVW5RIEFUFX", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Sunny", "reviewText": "I have purchased 6 books, tried Rosetta Stone and Pimsleur, but this is the best way to learn Japanese! This really is a human approach to learning, because it doesn't focus simply on memorization or boring text book style.  Not only does it give brief and interesting descriptions of the language, it compares it to English so you have a clear understanding of how it works.\n\nIn addition, it gives pronunciation of words and phrases, which is the best part.  Sometimes I can learn a word from a book, but I have no way of knowing if I'm saying it properly, this really helps you to say it.  Each chapter also has a little quiz and I actually had so much fun the first day I downloaded it ([...]) I didn't want to stop.\n\nBy far the most comprehensive and easy to learn software I have found, and the best part was the price... under $20 to download.  Excellent overall, fun and I rate this program 5 stars.  This will definitely help me to incorporate all the Japanese books I have laying around.  I feel like this is step 1 in learning the language.", "summary": "Comprehensive and easy to understand", "unixReviewTime": 1239148800}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "04 1, 2009", "reviewerID": "A1I384QDCZCNC7", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Gwanma", "reviewText": "I really enjoy using this program.  You are able to hear the Japanese pronunciation and also learn katakana, which I don't know.  The little insights into Japanese culture is helpful too.", "summary": "Human japanese", "unixReviewTime": 1238544000}
{"overall": 5.0, "vote": "19", "verified": false, "reviewTime": "01 9, 2009", "reviewerID": "A15PXOR2MJNF1Q", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Anthony Di Benedetto", "reviewText": "I came into Human Japanese with some experience with other software learning products as well as books.  I must say this is GREAT learning software.  Many competitive software products either spend too much time on memorizing phrases or random vocabulary, focus too much on pedantic grammar rules, or make little or no attempt to present the written word in Japanese.  Human Japanese is, in my opinion, the BEST in integrating the spoken with the written word.  You will learn plenty of grammar but it is presented in a user-friendly way. You will get lots of vocabulary, and you will be recognizing sentences in kana before you know it.  But importantly, once you have worked your way through the lessons you will find that your confidence is way up.  There is quite simply an excellent balance between phrases, grammar, vocabulary, and the written word.  And you cannot ignore the price.  Software that is ten times the price is not necessarily better.  If you sincerely want to learn Japanese and put the time in to the lessons, you will make rapid progress and will really surprise yourself.  I am totally self-taught and I must say that the Human Japanese lessons are the closest I have ever had to a personal tutor walking me through the lessons at my own speed and with a real interest in my learning.  Good luck!", "summary": "This is GREAT language learning software", "unixReviewTime": 1231459200}
{"overall": 5.0, "vote": "165", "verified": false, "reviewTime": "12 19, 2008", "reviewerID": "A1KYQ4OWEFZWJT", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "J. L. Ross", "reviewText": "About me: a freshman in college, took three years of Japanese in high school and now am taking it at my university.\n\nIf you're just getting into Japanese, this is the best $24.95 you'll ever spend in your learning endeavors. It's essentially a sensei-in-a-box. The format is like how I was taught--you learn the writing while learning grammar while learning culture, but in a fluid, logical way. Short of taking a class or getting a tutor, this is the best way to learn Japanese. I even suggest it to those in beginning Japanese classes. It is an excellent supplement.\n\nThe writing style is genuine and interesting, and it almost feels like the conversation of a close friend. It compels one to read further and takes away any sense of learning as a chore.\n\nRosetta Stone is a poor excuse for a language-learning program. It's essentially a vocabulary building program with no actual thought to teaching the workings of a language. Not to mention that the aesthetics of this program are FAR superior than Rosetta, despite Rosetta's hefty price tag. Continually amazes me.\n\nSimply the best language-learning program around.", "summary": "Revolutionary", "unixReviewTime": 1229644800}
{"overall": 5.0, "vote": "15", "verified": false, "reviewTime": "11 4, 2008", "reviewerID": "A78MMTPEGRPC", "asin": "0615179088", "style": {"Format:": " CD-ROM"}, "reviewerName": "Mitchell O. Olson", "reviewText": "great product for getting your japanese up and off the ground! They way they present it is perfect i had no miss understandings at all (witch is alot coming from me) Though I do sugest you download the trial first from there main website ^^ . . .\nJaa Mata!", "summary": "A very satisfide 14 year old anime addict", "unixReviewTime": 1225756800}
