{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 31, 2010", "reviewerID": "A3NSN9WOX8470M", "asin": "0006564224", "reviewerName": "mmm", "reviewText": "I don't use these for their original use, and in 1988 I purchased 2 and have needed replacements for the last year.  I never even thought of using the Internet to find new ones but to my pleasant surprise I found them immediately and actually paid LESS for them than I did in 1988!", "summary": "Many uses...", "unixReviewTime": 1283212800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 2, 2010", "reviewerID": "A2AMX0AJ2BUDNV", "asin": "0006564224", "reviewerName": "John R. Welch", "reviewText": "Seems a bit expensive for a plastic bottle, but I couldn't find better value on the Internet. Product performs as advertised. Very fast response from this supplier.", "summary": "Dispenser bottle", "unixReviewTime": 1270166400}
{"overall": 5.0, "verified": true, "reviewTime": "11 5, 2015", "reviewerID": "A8LUWTIPU9CZB", "asin": "0560467893", "reviewerName": "Linda Fahner", "reviewText": "Great product, love it!!", "summary": "Five Stars", "unixReviewTime": 1446681600}
{"overall": 4.0, "vote": "4", "verified": true, "reviewTime": "10 29, 2015", "reviewerID": "AABKIIHAL0L66", "asin": "0560467893", "reviewerName": "TheBlueChain", "reviewText": "This is a sturdy floating corner shelf!  We mounted a TV on the wall in the corner of the room and needed a shelf for the cable box. This product is perfect for our needs! We had to cut down the rear corner for the wires to run up the wall behind this shelf, but that wasn't an issue with the product itself. It looks great!  I'm giving it 4 stars because the enclosed instructions weren't very helpful at all. Thankfully my husband is good at handyman type things, so he was able to figure it out.", "summary": "Sturdy Shelf, Poor Installation Instructions", "unixReviewTime": 1446076800}
{"overall": 3.0, "verified": true, "reviewTime": "09 9, 2015", "reviewerID": "A3DA0KIQ5OBK5C", "asin": "0560467893", "reviewerName": "angelaarden", "reviewText": "I purchased 4 of these shelves. they look great. Thought they were wood. I guess I didn't read thoroughly. Anyway, that didn't matter to me, as they look real nice and were the size I was looking for. I gave them 3 stars as one of my shelves is coming apart at one end. I have used these less than 4 months. They all have way less than 30 lbs on them. It may be a minor issue and just a bad one as the others are great - no issues. My husband is going to try and glue and clamp it.", "summary": "Look great - one bad one...", "unixReviewTime": 1441756800}
{"overall": 1.0, "verified": true, "reviewTime": "08 23, 2015", "reviewerID": "A32IGEYSCMEMOD", "asin": "0560467893", "reviewerName": "love", "reviewText": "I truly wanted to like this item.  It fell apart while I was installing it with a screwdriver.", "summary": "One Star", "unixReviewTime": 1440288000}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "05 7, 2015", "reviewerID": "A3B6GKQQ1JJ167", "asin": "0560467893", "reviewerName": "Harry Slaughter", "reviewText": "Pretty flimsy, but does the job. If your corner is not square and flat, the shelves will probably not end up level. These shelves should probably be going for half the price.", "summary": "Meh", "unixReviewTime": 1430956800}
{"overall": 3.0, "vote": "9", "verified": true, "reviewTime": "12 31, 2014", "reviewerID": "A2OEROVWM53QR7", "asin": "0560467893", "reviewerName": "Ken", "reviewText": "Note, the way this shelf mounts to the wall is nothing like the instructions say. it's not very difficult to figure out, but it's a completely different mounting system than the picture.", "summary": "mounting instructions need to be updated", "unixReviewTime": 1419984000}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "12 15, 2014", "reviewerID": "A3VKOWFHJUAAHE", "asin": "0560467893", "reviewerName": "Trayson H.", "reviewText": "It's a shelf.  it was inexpensive and holds a 19\" flatscreen TV without exposed braces.", "summary": "It's a shelf. it was inexpensive and holds a ...", "unixReviewTime": 1418601600}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "12 5, 2014", "reviewerID": "A19CYDS573LII9", "asin": "0560467893", "reviewerName": "Carolyn C Cook", "reviewText": "Instructions are wrong and it is not very sturdy.", "summary": "Two Stars", "unixReviewTime": 1417737600}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 23, 2010", "reviewerID": "A3T2DUQAOSS5JW", "asin": "0681795107", "reviewerName": "S. Scales", "reviewText": "This mug comes in a variety of colors most of which are hard to find on Amazon, easy to find on the seller's website but not easy to order. It's worth the effort of figuring out how to place the order though, as this mug keeps tea hot for a good couple of hours, and even longer if left in a sunny car. I have tried a variety of different travel mugs of similar size and this one is by far the best for not retaining the flavor of the previous cup of tea thanks to its metal instead of plastic interior. Additionally it is better designed, fitting nicely in the car cup-holder and having a flat lid that doesn't poke your nose every time you take a sip, and allows you to close the hole in the lid by sliding the cover with your teeth so you don't have to take both hands off the wheel while driving. The only minor quibble is that the sliding cover is a little hard to clean underneath (by hand, we don't use a dish-washer for anything) - this is not a problem for black or fruit teas, but if you take milk, a gunge can build up once in a while. Timolino addressed this problem in their version 2.0 mug by making the cover un-clippable for easier washing, but unfortunately also modified the rest of the lid so that now it has a big lip like other mugs, making it hard to sip, and also added more weight to the top of the mug with unnecessary extra plastic and a thicker handle. The best would be to revert to this version 1.0 mug and just make the sliding cover un-clippable.", "summary": "Best travel mug ever", "unixReviewTime": 1264204800}
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "01 23, 2010", "reviewerID": "A3T2DUQAOSS5JW", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "S. Scales", "reviewText": "This mug comes in a variety of colors most of which are hard to find on Amazon, easy to find on the seller's website but not easy to order. It's worth the effort of figuring out how to place the order though, as this mug keeps tea hot for a good couple of hours, and even longer if left in a sunny car. I have tried a variety of different travel mugs of similar size and this one is by far the best for not retaining the flavor of the previous cup of tea thanks to its metal instead of plastic interior. Additionally it is better designed, fitting nicely in the car cup-holder and having a flat lid that doesn't poke your nose every time you take a sip, and allows you to close the hole in the lid by sliding the cover with your teeth so you don't have to take both hands off the wheel while driving. The only minor quibble is that the sliding cover is a little hard to clean underneath - this is not a problem for black or fruit teas, but if you take milk, a gunge can build up once in a while. Timolino addressed this problem in their version 2.0 mug by making the cover un-clippable for easier washing, but unfortunately also modified the rest of the lid so that now it has a big lip like other mugs, making it hard to sip, and also added more weight to the top of the mug with unnecessary extra plastic and a thicker handle. The best would be to revert to this version 1.0 mug and just make the sliding cover un-clippable.", "summary": "Best travel mug ever", "unixReviewTime": 1264204800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "09 20, 2009", "reviewerID": "AV24U7RX2TX2X", "asin": "0681795107", "reviewerName": "Eden A. Millecchi", "reviewText": "This is hands down the best travel mug I have used. It goes with me every day and is a joy to use while driving. The caps seals tightly to the cup, the clip covering the opening slides easily and the handle is just the right angle for tipping to drink. It requires the absolute minimal distraction from my attention to the road.\n\nI only wish it was dishwasher safe, but none of the others I've tried were either, so I've given up on that. Also the clip in the lid is removeable so you can clean any coffee residue out from under it. I don't think replacement clips are available for sale, but that would be the only other improvement I can think of.", "summary": "this mug rocks", "unixReviewTime": 1253404800}
{"overall": 5.0, "verified": true, "reviewTime": "10 10, 2014", "reviewerID": "A2UQSEHHIUKYXS", "asin": "0681795107", "style": {"Color:": " Black"}, "reviewerName": "pal", "reviewText": "Great coffee mug.", "summary": "Five Stars", "unixReviewTime": 1412899200}
{"overall": 3.0, "verified": true, "reviewTime": "07 28, 2014", "reviewerID": "A1CQEO4BCUNTNW", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Uncle Al Everyone&#039;s Pal", "reviewText": "CAN'T BEP[UT IN DISHWASHER  LEAKS WHEN IT FALLS FROM VERTICAL TO HORIZONTAL\nPOSITION.  ONLY KEEPS OPTIMAL TEMPERATURE FOR LESS THAN FIFTEEN MINUTES\nSHODDY CHINESE FABRICATION.  RELIED ON ADVICE FROM AMERICAN TEST KITCHEN\nTHEY SURE WERE WRONG OR I HAVE THE WRONG UNIT.", "summary": "CAN'T BEP[UT IN DISHWASHER LEAKS WHEN IT FALLS FROM VERTICAL ...", "unixReviewTime": 1406505600}
{"overall": 4.0, "verified": true, "reviewTime": "06 11, 2014", "reviewerID": "A3MQNM6NOG0HCX", "asin": "0681795107", "style": {"Color:": " Black"}, "reviewerName": "Dave", "reviewText": "Been using this model of insulated mugs for years. It's a tank that can be dropped and be no worse for wear. Meets my needs but wish it would keep coffee hot longer that 45 minutes.", "summary": "Works for me", "unixReviewTime": 1402444800}
{"overall": 5.0, "verified": true, "reviewTime": "04 1, 2014", "reviewerID": "A1Q99NP69KSR2Q", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Carole C. Mayo", "reviewText": "This mug is a great size, keeps chai tea hot and is a good investment.  Great gift, which I have provided for others.", "summary": "Great mug", "unixReviewTime": 1396310400}
{"overall": 5.0, "verified": true, "reviewTime": "01 22, 2014", "reviewerID": "A3MCTN65BU7XRA", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "luckyg", "reviewText": "So much better than plastic mug types--keeps coffee warm and doesn't stain. We bought it because Cook's Country rated it tops.", "summary": "Recommend", "unixReviewTime": 1390348800}
{"overall": 1.0, "verified": true, "reviewTime": "10 30, 2013", "reviewerID": "A7JVZFSXVY9RL", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Nickleen", "reviewText": "I like my coffee hot; borderline scorching but drinkable.  About 10 years ago I purchased several Avantro coffee mugs that are very similar to these.  Those have been able to keep my coffee at my preferred drinking temperature for well over 4 hours even on the coldest of days.  I work outside so hot coffee is crucial in these nasty New England winters.\nWell, day one with this new mug and I am quite disappointed.  This mug barely kept my coffee warm for an hour.  That is quite unacceptable seeing as how this company is the one that bought out Avantro.", "summary": "Not keeping coffee hot for long enough", "unixReviewTime": 1383091200}
{"overall": 1.0, "verified": true, "reviewTime": "09 20, 2013", "reviewerID": "A2RQ7VLAK1SHPU", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Lacemaker427", "reviewText": "This mug does only a fair job of keeping coffee hot.  It will absolutely NOT protect your shirt, pants, carseat, or anything else from spills and drips!  The lid does help to keep the coffee hot in that without the lid it is exposed to the air.  That slight benefit and it's attractive appearance are the only advantages I found.  If you have NO concern about leaking/dripping, this mug is sufficient, however, the Contigo Autoseal West Loop is a much better product, and for essentially the same price.  I have returned my Timolino PABLO-46GREmug and purchased 2 Contigo Autoseal West Loop thermal mugs in 2 of the many colors available (I like lilac & gunmetal).  This Timolino thermal mug, in my opinion, should cost only $10 due to it propensity to leak!", "summary": "Leaks like a waterfall when at an angle!", "unixReviewTime": 1379635200}
{"overall": 4.0, "verified": true, "reviewTime": "08 3, 2013", "reviewerID": "A2Y7ABSQZXPSJS", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Mandy Bergman", "reviewText": "Comfortable to use for with temperature beverage and fits in all my car's tiny cup holders without tipping. Not dishwashing, though. Handwash only.", "summary": "really like", "unixReviewTime": 1375488000}
{"overall": 5.0, "verified": true, "reviewTime": "05 17, 2013", "reviewerID": "A1ACIEJU98KF3F", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Josh Dix", "reviewText": "This cup worked well. It is not entirely leak proof but was a good office cup especially if you were like me and drank your coffee within an hour or so. Simple stainless and worked.\n\nI think someone stole mine to be honest I don't know where it took off to.", "summary": "This cup", "unixReviewTime": 1368748800}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "05 17, 2013", "reviewerID": "A3LBVWKEMTISND", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Hugh Stratford", "reviewText": "This cup keeps your drink cold or hot and fits the holder in my car, only down side is if it falls over it leaks and at 89 I am good at knocking any cup over.", "summary": "Drink up", "unixReviewTime": 1368748800}
{"overall": 4.0, "verified": true, "reviewTime": "03 22, 2013", "reviewerID": "A1CV69KIB30WW3", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "PhilaSanctuary", "reviewText": "right size, attractive, keeps it hot, fairly easy to clean though it has that little hole on the bottom that travel mugs always have allowing small amount of water to leak back into the cup. Saw it recommnended on American Test Kitchen, otherwise would not have purchased it.", "summary": "right size, keeps it hot", "unixReviewTime": 1363910400}
{"overall": 4.0, "verified": true, "reviewTime": "03 20, 2013", "reviewerID": "A3RMC04VRINS4W", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "cindy francis", "reviewText": "Have not used it often enough, but does what it is supposed to do, ie, keeps drinks hot AND does NOT leak. I am looking forward to giving these as gifts next Christmas", "summary": "Dependable", "unixReviewTime": 1363737600}
{"overall": 3.0, "verified": true, "reviewTime": "02 26, 2013", "reviewerID": "A9IWX56NDNJKS", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Patricia Hanley", "reviewText": "Convenient shape, good handle; but doesn't hold temperature as long as I would like on a long trip.  Good for short commute or errands around town.  Fits cupholder well.", "summary": "Timolino PAB-46GRE travel mug", "unixReviewTime": 1361836800}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "01 21, 2013", "reviewerID": "AVE60P73ELI2P", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "danielc74", "reviewText": "LOVE these cups! My husband has hand one for 10 years and it's still going strong. This particular purchase was so he'd have a cleaner, newer one. The only thing we suggest is hand washing. After it's been washed in the dishwasher it leaks water like crazy from the bottom.", "summary": "Travel Mug", "unixReviewTime": 1358726400}
{"overall": 3.0, "vote": "4", "verified": true, "reviewTime": "12 25, 2012", "reviewerID": "ADNDEQWSAIOSX", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "shopper 5757", "reviewText": "Convenient with a handle on the mug, keeps my coffee hot/warm for 2 -3 hrs, easy to wash and clean the lid -- these are expected from reading reviews.\nBut it leaks from the lid while walking with it in my hand -- major inconvenient.  Also, the mug feels hot when the coffee is hot.", "summary": "It leaks from the lid", "unixReviewTime": 1356393600}
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2012", "reviewerID": "AO84V2TFRX9OB", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Meddybempster", "reviewText": "These mugs do what they are designed to do, i.e., keep liquids hot or cold for hours, don't leak, easy to clean and attractive to look at.  But, do not put them in the dishwasher as they lose their magic!", "summary": "Keeps your drinks hot or cold for hours", "unixReviewTime": 1333670400}
{"overall": 4.0, "verified": true, "reviewTime": "11 25, 2011", "reviewerID": "A1SLSU5VAOYTH0", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Scott Pelton", "reviewText": "Like that this cup is stainless inside and out (which is why I bought it).  But the price is a little high.  Not lid is not leak proof but does a decent job of keeping the liquid inside.  Other than that, your basic mug.", "summary": "Descent, but a little high priced", "unixReviewTime": 1322179200}
{"overall": 5.0, "verified": true, "reviewTime": "11 20, 2011", "reviewerID": "A2E6AHFDJ3JBAZ", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "robosolo", "reviewText": "I purchased two of these cups for camping but I like them so much I use one daily. Unlike other thermos-type cups, this one actually keeps the beverage hot for quite some time, especially if you place the cap on it. The cap itself is really unique in the way it works. After filling with a hot liquid the cap fits rather loosely in place. But, after a few seconds heat expands it and it wedges itself in place very securely. You can still pry it off but not easily when it's hot which is just what you'd want. Also, that cap has a neat little sliding anti-splash tab on the top that actually works.\nThe cup is wide enough to be stable sitting on a flat surface - with or without liquid in it - yet fits easily into a car tray cup holder for travel.\nAfter using the cup for a few days I decided that I didn't want the nylon handle. I simply used a heat gun (on low) to gently heat it up and just pulled it down and off of the cup.\nThat handle is secured to the cup with some glue and a slight ridge running around its inner circumference. It was easy to clean off the remaining glue from the stainless steel and I could - if I wanted to - re-glue and reattach the handle.\nThis is a great insulated stainless steel cup with or without a handle and well worth the price.", "summary": "Insulated stainless steel cup that actually works", "unixReviewTime": 1321747200}
{"overall": 4.0, "verified": true, "reviewTime": "11 12, 2011", "reviewerID": "A22JPQM47XD7Q8", "asin": "0681795107", "style": {"Color:": " Black"}, "reviewerName": "Gashauler", "reviewText": "Overall it is a nice mug. it is easy to use and comfortable to hold. I wish it had better insulation. If you are looking for your coffee to stay hot for a long time, this mug is NOT for you. If you want a nice mug for short trips, this mug is perfect.", "summary": "Nice mug", "unixReviewTime": 1321056000}
{"overall": 5.0, "verified": true, "reviewTime": "11 26, 2010", "reviewerID": "A1Q7OYGRG2BK84", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "R. Morrison", "reviewText": "I love this mug. It cleans easily and keeps drinks hot. The red is REALLY red; I might have chosen another color, but it's a great mug.", "summary": "red mug", "unixReviewTime": 1290729600}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "05 19, 2007", "reviewerID": "A1TMCLGUVV7F39", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "TheScientist", "reviewText": "I was surprised when I finished reading this book and I asked myself \"is this the end of the series?\". This book completely lacked the story and the humor and wit associated with other Asterix series. A. Udeerzo tried something new with mix of flying saucers and UFO's, robots, super clones which can fly, galactic council similiar to ones in Star Wars and all important the magic potion of the Gauls but to the dismay did not make a good story. It looked like everytihing 'just fell out of the book'.", "summary": "This book is not sky high", "unixReviewTime": 1179532800}
{"overall": 2.0, "vote": "3", "verified": false, "reviewTime": "05 11, 2007", "reviewerID": "A2EDZH51XHFA9B", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Robert Beveridge", "reviewText": "Albert Uderzo, Asterix and the Falling Sky (Dargaud, 2005)\n\nI'm not terribly sure what Uderzo was smoking when he came up with this one, but as a tribute to Walt Disney, he has the indomitable Gaulish village invaded by... space aliens? Yes, you heard that right. You can expect some of the punning, but nothing else that's made the series so much fun over the years is to be found here. The worst book in the series to date. **", "summary": "Just plain bad.", "unixReviewTime": 1178841600}
{"overall": 1.0, "vote": "19", "verified": true, "reviewTime": "02 2, 2007", "reviewerID": "AK690YP01HENW", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "aroyc", "reviewText": "Rene Goscinny was the storyteller for the original Asterix series, while Albert Uderzo was the illustrator. Since Goscinny's demise, Uderzo has taken on both the tasks himself. Unfortunately, Uderzo's storytelling leaves much to be desired. The result is that in the latest installments of Asterix' adventures, including \"Asterix and the Falling Sky\", the illustrations are as good as they used to be, but the actual story has suffered heavily. The plots are nowhere close to what Goscinny could conjure up; most missed is the subtle, sly humor that made Asterix so enjoyable to me and my friends growing up.\n\nNevertheless, this is still Asterix, and I almost enjoyed reading the Falling Sky. It is actually better, in my opinion, than \"Asterix and the Secret Weapon\" - another all-Uderzo affair. Normally I would have given it 3 or 4 stars.\n\nHowever, I was dismayed by what I figured out to be thinly-veiled disparagement of certain ethnicities in the Falling Sky adventure. The bad alien in here has the complexion and facial features very similar to people from some Oriental ethnicities, and there is dialogue about how they are jealous of the good aliens (represented by popular Disney characters, with a name that is an anagram of \"Walt Disney\" .. you figure out which society is being referred to here), and how the bad aliens try to steal the ideas and technologies of the good aliens.\n\nNormally I don't read too much into such things, but taken together, this is impossible to ignore or wave off as mere coincidence (I am still hoping that I am wrong here). Racial/ethnic stereotyping is never acceptable, but when it creeps into an adventure of a much-beloved comic hero, especially when the adventure is written in the 21st century, it is simply reprehensible. I am deeply disappointed, and forced to give it a single star.", "summary": "Missing the wit and charm of the old Asterix series; instead, this one has racist undertones", "unixReviewTime": 1170374400}
{"overall": 3.0, "vote": "25", "verified": true, "reviewTime": "12 13, 2006", "reviewerID": "A1JZLZGQZ62RSO", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Thomas Wikman", "reviewText": "Spaceships, super clones, a nice tellytubby looking space alien and a bad grasshopper looking space alien, and above all a mediocre story line. What is next? Asterix and Obelix travel in time to New York, or Roman Soldiers in Space? This was not a typical Asterix. Old Asterix lovers like me and the previous reviewers will not enjoy this one. People new to Asterix and Obelix should not buy it either, since this is not what Asterix is about.\n\nOn the other hand, I asked my nine year old what he thought of it. He liked the fact that Uderzo introduced some space ships and aliens into the story. He thought it was \"different, and creative\". He liked it as much as he liked all the other ones. He has already read it several times.\n\nThinking about it, he actually has a point. Children see it differently, many of them like this stuff. Monsters, science fiction, fighting clones, if you were nine years old maybe you would like it too. So to give the new generation a voice I gave it three stars. In the end I don't regret buying it.", "summary": "Asterix of the future?", "unixReviewTime": 1165968000}
{"overall": 2.0, "verified": false, "reviewTime": "11 17, 2006", "reviewerID": "A207IYGZTAF0DS", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "NoWireHangers", "reviewText": "This certainly is an odd entry in the Asterix saga. Perhaps Uderzo is running out of ideas, since he needed to introduce aliens. The story is only mildly interesting although it has its moments, but at no point does it reach the same level as the old adventures. The art is great as always though.\n\nI wish I could give it 2,5 stars, but since that's not possible I give it two stars. While most of the Asterix adventures deserve 5 stars and are always great fun for both kids and adults, this one probably appeals more to kids. They're usually great adventures full of humour. This one is neither. I still don't think it's as awful as most reviewers seems to think. It's good enough to kill some time with, but that's all. Asterix fans might want to check it out but don't have too high expectations. If Albert Udernzo would happen to read this, please, put some heart into the story next time, and if you can't come up with a better story than this, please hire a writer.", "summary": "This Asterix album will appeal mostly to children.", "unixReviewTime": 1163721600}
{"overall": 1.0, "vote": "22", "verified": false, "reviewTime": "11 1, 2006", "reviewerID": "A1EF9XSZSNUCMY", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "JM", "reviewText": "I agree with everything written by previews reviewers. This is the worst Asterix book by far. I know it's the only one I will never have a desire to read again. The story is ... well, there really isn't much of a story here. Asterix and the villagers are secondary characters at best -- just there in the background.\n\nIt's sad because the series is, without any exaggeration, the best \"children's\" book series ever. Even the books after Goscinny's death (post Asterix in Belgium) were fairly good and had some redeeming parts to them. This one, however, truly has no redeeming qualities. Uderzo is a wonderful cartoonist but Asterix has always been about much more than just pretty pictures.\n\nI'd say, do yourselves a favor and buy all the other Asterix books, particulary the ones written by Goscinny (and if you already have them, re-read them; I've re-read them a million times, they're that good). Take a pass on Asterix and the Falling Star; it'll just depress you.", "summary": "The end of Asterix ...", "unixReviewTime": 1162339200}
{"overall": 1.0, "vote": "15", "verified": false, "reviewTime": "07 30, 2006", "reviewerID": "A8FJ46175HC7W", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Macky T", "reviewText": "I have been a MASSIVE asterix fan since childhood. When I heard of a new book in the works I was excited by the prospect of another Asterix book. Perhaps the last too! I hoped that the new comic book would prove better than the last, Asterix and the Actress, a mediocre attempt to recycle some classic Asterix characters while adding an unnecessary family element to it. Judging by the cover of Falling Sky I anticipated it would be a really good read. I was so WRONG!\n\nFirst of all the main characters are just bystanders in the story, watching good Disney-like alien creatures battle bad Anime-style ones. There is no plot to the story. All this book does is reflect Albert Uderzo's animation prejudices and his obvious antagonism towards Japanimation.\n\nThis book does not compare to any of the Asterix classics that have brought joy to many. Books like Asterix and Cleopatra and Asterix and the Laurel Wreath are great in so many levels. Even some of Albert Uderzo's solo Asterix works, although not as good as the ones done with Goscinny, were really good.\n\nIf you are a newcomer to the world of Asterix, DO NOT start with this book, and if you're a lifelong fan like me, DO NOT ruin the image of Asterix by reading this!", "summary": "SORELY DISAPPOINTED!", "unixReviewTime": 1154217600}
{"overall": 1.0, "vote": "6", "verified": false, "reviewTime": "04 28, 2006", "reviewerID": "A1G9FX1KV45N41", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Gary Selikow", "reviewText": "Having grown up with Asterix , I must agree with the other reviewers that Asterix and the Falling Sky is an abysmal offering. It is nothing like the Asterix we have grown up with and loved through the years.\nIt has no story , no historic or classic allusions that characterize Asterix albums , no real wit , and full of things that are out of place in Asterix.\nA few years ago , while reviewing Asterix and Obelix All at Sea , I wrote that the time was coming for Uderzo to lay down his pen. This one proves me right , even though Uderzo had produced some excellent Asterix albums on his own such as Asterix and the Black Gold and Asterix and the Flying Carpet.\nI simply cannot see anything worthwhile in the Falling Sky.", "summary": "Who wrote this?", "unixReviewTime": 1146182400}
{"overall": 1.0, "vote": "8", "verified": false, "reviewTime": "11 3, 2005", "reviewerID": "A3JBV5WXXGC22I", "asin": "0752873016", "style": {"Format:": " Hardcover"}, "reviewerName": "Nethegauner", "reviewText": "I have one simple advice for You: DO NOT BUY. I'm wrecking my brain, but I can't even begin to imagine why Albert Uderzo put THIS on the market. I was utterly disappointed.\n\nAsterix fighting aliens? ALIENS? AND CLONED SUPERMEN? Oh, come on. This is ridiculous...\n\nYou want Asterix? Fine. Go ahead and read one of his classic adventures. You are interested in European comics? Great! Buy Tintin. Enjoy Lucky Luke. Have fun with the Smurfs. Look for a copy of Karl -- but stay away from the falling sky. It seems to have fallen right on its creator's head...\n\nIt's like I wrote in my review for the original French edition of this latest installment in the Asterix series: This is no longer the Asterix we have come to known over the past few decades. This is something... weired!", "summary": "Asterix? No, it is not...", "unixReviewTime": 1130976000}
{"overall": 2.0, "vote": "2", "verified": false, "reviewTime": "11 2, 2005", "reviewerID": "A3B0YNN6NFH18D", "asin": "0752873016", "style": {"Format:": " Hardcover"}, "reviewerName": "Amazon Customer", "reviewText": "I'm an adult Asterix fan and I have been reading Asterix albums since I was 9 years old so I think I know a little about how Asterix albums 'should be' (or at least 'how they used to be'). I expected this new Asterix album with so much impatience but when it was published I couldn't get it inmediately. I read on forums that this new Asterix album was the worse album in the collection so when I got it some days ago I have mixed feelings. I knowed I'll find Asterix talking with extraterrestrial people (and even I know that some personages look like Arnold S.), that some characters represent US comics and other represents Manga comics, and many other things about it but still I wanted to read it by myself thinking that 'maybe it's not so bad'. Well, it wasn't. Although I also think it's the worse Asterix album, it's not so bad. It certainly isn't an Asterix album for its adult fans, but I think children from 0 to 7 years old will really enjoy it, because Uderzo once again has given us a beautiful art work, and also it has a lot of enormous drawings in order to impress the children readers.\n\nThe story has this line: some extraterrestrial people (that looks like US comic) arrive at the gaulish town in order to confiscate their 'secret weapon', then some things happen and another extrarrestial race (that looks like manga comic) arrive at the town in order to steal that 'secret weapon' (they're the 'bads'). Other things happen and then the bads left the Earth. Then the last 10 pages are filled with garbage but with beautiful drawings. Then it finish.\n\nI think Uderzo's Asterix scripts are not so good as Goscinnny's ones, and that Uderzo has created stories that are much more fantastic than Goscinny's ones but still they deserve respect. Maybe we will never have another Asterix album like the better ones, where old history plays an important role and the stories are more intelligent, produced and interesting, but after all, I think it's better to have new albumes than not to have more.", "summary": "Not good for adult Asterix fans", "unixReviewTime": 1130889600}
{"overall": 5.0, "verified": true, "reviewTime": "11 28, 2013", "reviewerID": "A23Q738B8RL36P", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "paulusmc", "reviewText": "Glad you had this in stock and always a big fan of Asterix & obelix in there adventures in life.  just story read and view.", "summary": "a big fan", "unixReviewTime": 1385596800}
{"overall": 2.0, "verified": false, "reviewTime": "07 13, 2013", "reviewerID": "A2SYCKV9A2SE0F", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Abhinav Agarwal", "reviewText": "Spaceships, aliens, an unfunny tribute to Walt Disney, flat punchlines - or should they be called flabby punchlines? While some of the earlier Asterix comics had been disappointing, like \"All at Sea\" and \"The Class Act\", this latest one has truly plumbed the depths. While one could arguably laud the author for trying out something new with the series - aliens and spaceships, the near-complete absence of a plot condemns the comic to a slow and embarrassingly painful demise. If you are new to the Asterix series, read \"Asterix and Caesar's Gift\" (#21) and any of the ones before that. In fact, \"Asterix and The Soothsayer\" (#19), \"The Mansion of the Gods\" (#17), \"Asterix and the Laurel Wreath\" (#18), \"Asterix in Switzerland\" (#16)... are among the very best in the series - the plot, story, dialogues, jokes, the running gags, and the richly illustrated panels.", "summary": "Yes, the sky indeed has fallen.", "unixReviewTime": 1373673600}
{"overall": 5.0, "verified": false, "reviewTime": "06 5, 2012", "reviewerID": "AU35ONCXASKXZ", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Susana Brand", "reviewText": "got this for my son for xmas . he really enjoys reading it. and im glad he likes it too. its easy reading. great thing to buy if your wanting to encourage reading more.", "summary": "book", "unixReviewTime": 1338854400}
{"overall": 3.0, "verified": false, "reviewTime": "04 15, 2012", "reviewerID": "A2NH4D9NIP0Q94", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Sheetal Bahl", "reviewText": "I'm going to be a little more generous that most of the reviews on this book, because while this book is really different, and not entirely pleasantly so, from the entire series before it, it's still a readable Asterix. The book has all the characters we love, a lot of the familiar situations, and the witty comments and repartees (though these aren't of the same quality as the other books). It is a little disconcerting to watch spaceships and ETs in an Asterix book, but it's just that - disconcerting, and no more. It's not a terrible idea, or terrible treatment - I think it's just the loyalty to the old Asterix that makes us cringe. But if you can get past that knee-jerk reaction, the book is ok.\n\nI would not recommend this book for early Asterix readers i.e. folks reading their first few Asterix books, and maybe not even for die-hard loyalists (like me) who have read most of the books unless they are open to a dramatic change. It's probably best for casual, occasional readers of Asterix.", "summary": "Disappointing, but still an Asterix", "unixReviewTime": 1334448000}
{"overall": 1.0, "vote": "5", "verified": false, "reviewTime": "04 2, 2011", "reviewerID": "A1NBEOXW7SYOFT", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Bidencope", "reviewText": "Awful. Just awful. Albert Uderzo penned some decent Asterix adventures following the death of his long-time collaborator, Rene Goscinny, but the quality of his stories ultimately started to go into decline. This painful process hits rock bottom with this mess of an album.\n\nUderzo took the faintest inkling of an idea and stretched it out into 44 thinly-spread pages of nothing. Well, almost nothing; there's a perfunctory political allegory intermingled with Uderzo's reactionary attitudes towards manga, but it all amounts to very little. The emaciated story peters out around about page 35, floundering pathetically for the rest of the book.\n\nThis story had the potential to be a worthwhile inclusion to Asterix's fine legacy, in a \"that's crazy enough to work!\" sort of way. Unfortunately, it has become evident that Albert Uderzo ran out of ideas long ago.", "summary": "The nadir of Asterix", "unixReviewTime": 1301702400}
{"overall": 2.0, "vote": "3", "verified": false, "reviewTime": "01 22, 2011", "reviewerID": "A3R8PXSFGY9MC2", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Spider Monkey", "reviewText": "I am sad to say that `Asterix and the Falling Sky' is a huge disappointment and as a fan of the series I hate starting a review in this way. It isn't so much that this looks at space creatures visiting the village, which is a huge departure from the Roman era stories we are used to, but it is that this book has none of the charm or humour that the series is renowned for. I was eagerly expecting the tongue in cheek remarks and puns so beloved by fans of Asterix and instead we are offered tired jokes that play on past glory rather than anything new moving the books on. The story is sadly unoriginal, with yet another group of `baddies' after the magic potion, the only deviation from this plot line is that they come from outer space. This is written in tribute to Walt Disney and in fact the space character looks a great deal like a Disney character (look at the gloves to see what I mean!) and his name is an anagram of Walt Disney. This may be admirable but detracts from the authenticity of the Asterix franchise. If you like the series then there will be something here for you to enjoy, the art work is as great as ever for example, but you may also be left disappointed and will have to reread a past book to remind yourself just why you loved these books so much. This is one for avid collectors, but if this is your first foray into the series then I recommend you try other books initially before you work your way to this one.\n\nFeel free to check out my blog which can be found on my profile page.", "summary": "Asterix and the Falling Sky", "unixReviewTime": 1295654400}
{"overall": 3.0, "verified": false, "reviewTime": "11 13, 2008", "reviewerID": "A1LB3XRER68NND", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Roberto Roca", "reviewText": "...pero el resultado final no es a lo que nos tienen acostumbrados Asterix y sus amigos.\nDe todas formas, considero que vale la pena leerlo, y por supuesto comprarlo, si uno se considera un fan de la serie.", "summary": "Tal vez la intencion fue buena...", "unixReviewTime": 1226534400}
{"overall": 1.0, "vote": "13", "verified": false, "reviewTime": "06 3, 2008", "reviewerID": "A19ZFQAGZTLOPD", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Marco Ferraro", "reviewText": "Since Goscinny's death the asterix stories have been on a slow decline. But this one is really really god awful.\nIn short 2 seperate alien races come to earth to attain the magic potion for themselves. Eventually they find out it won't work on their physiologies and they leave. Thats it.\nNone of the usual character interplay and in fact we hardly see any of the characters at all. I didn't even get most of the puns.\nMaybe Uderzo should just give it away.", "summary": "please, no more", "unixReviewTime": 1212451200}
{"overall": 1.0, "vote": "11", "verified": false, "reviewTime": "05 25, 2008", "reviewerID": "AT12C3M9O2EUY", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Keen Bean", "reviewText": "Aliens visit the little Gaulish village we know so well - ? - HUH? - Aliens? What's wrong with the Romans? The classical jokes, the motifs that make reading Asterix magic, the way it works at multiple levels so I enjoy it on one level, my 9yo on another and my 6yo on yet another? All missing.\n\nThis book lacks the character, wit, humour and charm of the earlier books. It is completely out of character with them, and I'm really disappointed to see a great series stoop to this level. Even my children say they don't like it.\n\nThe icing on the cake is that the pages are falling out of my copy after only a few days. Normally I'd exchange the book and get another one, but this one can just go straight to the recycling.\n\nAt the end, the alien \"fixes it\", to quote, \"for the Gauls to remember nothing about me, thus obliterating all traces of this grotesque adventure!\". I wish, I wish...", "summary": "If you love Asterix - don't read this", "unixReviewTime": 1211673600}
{"overall": 3.0, "verified": true, "reviewTime": "07 30, 2007", "reviewerID": "A37VA45R86I9T1", "asin": "0752873016", "style": {"Format:": " Paperback"}, "reviewerName": "Mary S. Chingwa", "reviewText": "This one is OK but not up to early standards.  The series, as a whole, is losing its edge.  They are less and less witty than the earlier books.  I think I'll just pass them up in the future.", "summary": "Wit is falling", "unixReviewTime": 1185753600}
{"overall": 4.0, "vote": "4", "verified": true, "reviewTime": "02 15, 2012", "reviewerID": "A345HVYNQJUGQM", "asin": "0768205921", "reviewerName": "JenJen", "reviewText": "This is a great learning tool for teaching children how to tell time. The numbers are printed clearly and easy to read, including the seconds. The hands are easy to move. There is a piece on the back that can be used to prop up the clock, and the piece can pop off easily. It is easy to put back on though. I also ordered the \"Telling Time with the Judy Clock\" workbook. The little booklet that comes with the Judy clock has a lot of the same pages as the workbook, but it's a lot smaller. The \"Telling Time\" workbook gives children a lot more practice with learning to tell time.", "summary": "Great learning tool", "unixReviewTime": 1329264000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 8, 2011", "reviewerID": "A3S33CZAH5JNWV", "asin": "0768205921", "reviewerName": "Rachelle Mortensen", "reviewText": "This has been so valuable in teaching my children to tell time.  It's fun, accurate, and educational.  I highly recommend it.", "summary": "Wonderful learning tool", "unixReviewTime": 1323302400}
{"overall": 5.0, "vote": "7", "verified": true, "reviewTime": "06 16, 2011", "reviewerID": "A24NRZ0QHDM9PY", "asin": "0768205921", "reviewerName": "Amazon Customer", "reviewText": "I have been extremely pleased with my purchase of the mini Judy clock for my 5 1/2 year old son.  He had already been very interested in telling time with a digital clock so I figured we would try introducing telling time concepts with a real clock face.  I chose this particular clock versus all the other \"toys\" that teach time because I remembered learning how to tell time on a big Judy clock when I was young.  I wasn't too keen on buying the big full size Judy clock for one-on-one teaching so the mini size was the perfect solution for at-home use.  I also purchased the Rock'N Learn Telling Time DVD to reinforce what we are working on and my son loves having his own clock to follow along with the songs.  Granted, every child will learn at a different pace, but my son picked up the concepts quickly thanks to playing with the Judy clock and is now able to tell time to the nearest minute after just a few weeks.", "summary": "Fantastic Clock to Teach Your Child to Tell Time", "unixReviewTime": 1308182400}
{"overall": 5.0, "vote": "12", "verified": true, "reviewTime": "01 13, 2011", "reviewerID": "A37RV8LC1Y8G9P", "asin": "0768205921", "reviewerName": "E. C.", "reviewText": "I love the Judy clock and use it in my classroom. This particular one is small however and only useful for one on one instruction. This clock shows the movement of both hands when you move the hour hand. This is very helpful when showing kids that the hands aren't always exactly on the number when telling certain times. It shows hours, minutes and seconds as well. I have no complaints about this product.", "summary": "Great Educational Tool", "unixReviewTime": 1294876800}
{"overall": 5.0, "verified": true, "reviewTime": "08 11, 2015", "reviewerID": "AQ9UQK6HEQVJH", "asin": "0768205921", "reviewerName": "Sweet  Lorraine", "reviewText": "This is a nice little clock, and the hands line up very well, so is perfect for teaching children to read time. Recommended", "summary": "This is a nice little clock", "unixReviewTime": 1439251200}
{"overall": 5.0, "verified": true, "reviewTime": "07 24, 2015", "reviewerID": "A2HJHXBEUSYYGI", "asin": "0768205921", "reviewerName": "Amanda Nail", "reviewText": "I purchased one for each of my children instead of just a single large clock because my kids LOVE playing with them! They are small enough to sit beside their beds so at night time we can review bed time and what time they can get up in the morning (an actual working clock is in their room for reference). Makes learning time fun and easy for them and will be a great supplement to future homework as my oldest begins kindergarten this year.", "summary": "Fun!", "unixReviewTime": 1437696000}
{"overall": 5.0, "verified": true, "reviewTime": "12 2, 2014", "reviewerID": "AQG1XL43QAXA", "asin": "0768205921", "reviewerName": "E.F.", "reviewText": "Easy to use.  Especially like the gears that move the hour hand into position.  Doesn't frustrate my son like the clocks where you need to set both hands manually.", "summary": "Easy to use", "unixReviewTime": 1417478400}
{"overall": 5.0, "verified": true, "reviewTime": "10 16, 2014", "reviewerID": "A30IBTB5KJOKC4", "asin": "0768205921", "reviewerName": "Amy Ricker", "reviewText": "we LOVE our Judy Clocks!", "summary": "Five Stars", "unixReviewTime": 1413417600}
{"overall": 5.0, "verified": true, "reviewTime": "10 12, 2014", "reviewerID": "A129N8HISQ97T", "asin": "0768205921", "reviewerName": "A. Patel", "reviewText": "Love this product. Using it with my daughter to play all kinds of telling time games. I did not like how the 5-10-15 .... intervals are written on the clock, but they are easy enough to blot out with a sharpie.", "summary": "Nostalgic Time Telling", "unixReviewTime": 1413072000}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2014", "reviewerID": "A1KU2VHK8BECRW", "asin": "0768205921", "reviewerName": "Judith A. Pilgrim", "reviewText": "The Judy clock is a marvelous teaching aid for children learning to tell time. This is a perfect size to have at home for practice.", "summary": "Great clock for little hands.", "unixReviewTime": 1388707200}
{"overall": 3.0, "verified": true, "reviewTime": "10 5, 2013", "reviewerID": "A2IHLDGUQAYQQO", "asin": "0768205921", "reviewerName": "roger pare", "reviewText": "This clock is as advertised, nothing really special either way. My son was interested for a few days.......not so much now.", "summary": "as advertsed", "unixReviewTime": 1380931200}
{"overall": 5.0, "vote": "12", "verified": true, "reviewTime": "06 20, 2013", "reviewerID": "A2114M46F4MO2W", "asin": "0768205921", "reviewerName": "Outdoorsy Boy&#039;s Mom", "reviewText": "I felt like my son's kindergarten class didn't cover telling time very effectively and when I discovered he could only tell time on the hour (and called it 'twelve sixty' instead of 'twelve o'clock') I ordered this clock for him. Within 2 days of MAYBE 5 minutes per day of me explaining how the clock worked, he could tell time to the exact MINUTE and get it perfectly right every time!\n\nMy boy is CRAZY about gears and the fact that this clock has two internal gears showing through a clear window grabbed his eyes and riveted his attention the second he saw it. He immediately wrestled the clock from my hands to play with it. Since playing is learning, I let him have it. The hands are cleverly geared to where the hour hand will advance when the minute hand is turned but the hands are not \"locked\" so you can move the minute and hour hand to wherever you want them to be. This is VERY helpful when you are first teaching time. I could place the hour hand EXACTLY on 12 and the minute hand EXACTLY on the 6 to help him identify 12:30. With other clocks the hour & minute hands lock so when the minute hand is on the half hour, the hour hand is between the 12 and 1 and it won't let you move it forwards or back. I LOVE LOVE LOVE that this clock does not lock like that and lets me move the hands completely independently or in tandem as I choose! Sure, he can see that when he moves the minute hand, the hour progresses on its own towards the next hour number and NOW he understands how to read a clock when the hour hand is halfway between two numbers but before he was confused by the hand being between the 12 and 1 and would guess at the time (sixty o'five?)\n\nAnother thing I love about this clock is that around the outside edge of the numbers is a blue painted \"gear\" circle shape (shown as a green outer ring in the preview) that has the five minute increments written beside every number and the \"teeth\" of the gear mark the individual minutes in between each 5 minute number. He latched on to the gear concept instantly so explaining to him that each gear tooth represented one minute made learning to tell time a SNAP. Literally, I explained the very basics and as he played with the clock, he got it. Easiest thing I have EVER taught him thanks to this little Judy clock!\n\nIf you feel like maybe you can't put your understanding of telling time into words, don't worry! The little booklet that comes with the clock gives you step-by-step teaching sentences you can repeat to your child and even covers what 'quarter hour' means. The booklet is about 5x7 inches with some small coloring pages, a few short question worksheets and time telling challenges, etc. I started to use the booklet and got to the part about where I explain quarter hours (the clock is like a pizza and you can slice the time into 4 equal parts of 15 minutes each) and my son was hushing me up because he suddenly understood telling time and wanted to make the clock read the same time as our digital microwave clock. This was in the first five minutes of the thing being in his hands and he did it!\n\nIf you have a child who is a tactile-kinesthetic learner, has had difficulty telling time or you just want to make homework a million times easier, get this clock! (And I suggest this style - 'My Own Little Judy Clock' that has non-locking hands). Confusing homework sheets with bland black-and-white clock images become soooo much easier to understand when your child can hold a clock, move the hands around, count by fives along the outer minute rim or count the individual teeth if necessary to answer math questions. If only all of teaching was this easy!\n\nClock is yellow plastic with plastic hands and internal gears. It isn't flimsy but could crack if stepped on. Hands are not brittle and have some give to them, which is nice because they get much more handling. 5 inches tall by 5 inches wide with little plastic easel stand in the back for upright display. Black printed numbers with a blue printed outer minute ring. Red & green internal wheels behind clear plastic window.", "summary": "AWESOME Little Clock - Kindergartener Telling Time In 2 Days!", "unixReviewTime": 1371686400}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2012", "reviewerID": "A3JV39XNJ373F4", "asin": "0768205921", "reviewerName": "Chelle", "reviewText": "This is very useful when teaching about time especially when teaching elapsed time as the hour hand moves when you turn the minute hand.", "summary": "Great tool for teaching time", "unixReviewTime": 1356825600}
{"overall": 3.0, "verified": true, "reviewTime": "11 23, 2012", "reviewerID": "A2ZQB9T6U696ER", "asin": "0768205921", "reviewerName": "K. Fell", "reviewText": "It works to help kids learn time but i thought it would be bigger and come with game ideas to make learning more fun", "summary": "Educational", "unixReviewTime": 1353628800}
{"overall": 5.0, "verified": true, "reviewTime": "09 18, 2013", "reviewerID": "A15TUOLV511HHV", "asin": "0805469613", "reviewerName": "Amazon Customer", "reviewText": "exactly as described when used as communion cups", "summary": "exactly as described , works well", "unixReviewTime": 1379462400}
{"overall": 4.0, "verified": true, "reviewTime": "05 11, 2013", "reviewerID": "A29EEOB4R7K24L", "asin": "0805469613", "reviewerName": "L. A. Freeman", "reviewText": "nice for small churchs like ours. I appreciate being able to get\n500 small count rather than the large 1000 count, for these\nwill last us a long time, they serve their purpose well.", "summary": "ok for small fellowships", "unixReviewTime": 1368230400}
{"overall": 3.0, "verified": true, "reviewTime": "03 24, 2013", "reviewerID": "A276F4KZLUD5GA", "asin": "0805469613", "reviewerName": "Michella Marie Goodwin", "reviewText": "I have no promblem with the cup, but I brought the wrong ones. I will use them at church for communion. I will tell my family and friends about you.", "summary": "Cups", "unixReviewTime": 1364083200}
{"overall": 5.0, "verified": true, "reviewTime": "01 15, 2013", "reviewerID": "ADJTP69RHSSSN", "asin": "0805469613", "reviewerName": "David H", "reviewText": "Great for the price and convenience. these cups are just like you would find in the store but they deliver", "summary": "PERFECT", "unixReviewTime": 1358208000}
{"overall": 5.0, "verified": true, "reviewTime": "11 2, 2012", "reviewerID": "A1K781NUVYCB9O", "asin": "0805469613", "reviewerName": "Chk", "reviewText": "We have had problems with sharp edges on cheaper Communion Cups, but these are better quality, so far.  My only complaint is that it cost nearly double the price of 1000 cups for the previous ones we bought. It seems you should be able to get safer cups by the 1000 at less than double the cost. Besides, you shouldn't have to worry about anyone cutting their lip on any cup, whatever the price!", "summary": "Good But Pricey", "unixReviewTime": 1351814400}
{"overall": 5.0, "verified": true, "reviewTime": "10 27, 2011", "reviewerID": "A357EVTEOVEHH8", "asin": "0805469613", "reviewerName": "David Chebotarev", "reviewText": "The cups are great and we like them. As anything, it takes time to carefully place them and fill them. Our team of ladies can do it in about an hour for 500 people.", "summary": "Great product", "unixReviewTime": 1319673600}
{"overall": 5.0, "verified": true, "reviewTime": "05 16, 2011", "reviewerID": "A3C1CZTLYYAX25", "asin": "0805469613", "reviewerName": "Christen N. Specht", "reviewText": "Great cups for communion, just wished I would have ordered the 1000 pack instead.  Our church goes through this size box in about 2 months.", "summary": "Communion Cups", "unixReviewTime": 1305504000}
{"overall": 4.0, "verified": true, "reviewTime": "03 7, 2014", "reviewerID": "A188Q5391NGXZJ", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Master&#039;s Program ECU Student.", "reviewText": "Good/Bad Garden Bugs (Mac's Guides (Charts)) by Craig MacGowan. is helpful is distinguishing good insects from the bad ones. Small, though.", "summary": "Good/Bad Garden Bugs (Mac's Guides (Charts)).", "unixReviewTime": 1394150400}
{"overall": 5.0, "verified": true, "reviewTime": "10 14, 2013", "reviewerID": "A2NZ4GP5T81704", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Christy Rowe", "reviewText": "Easy to read, laminated, good visuals when you are wondering what's out there in your garden.\nMacGowan has several various guides and we own several. He also was a fabulous teacher at my kid's high schools!", "summary": "All of Mac's Guides are great!", "unixReviewTime": 1381708800}
{"overall": 5.0, "verified": true, "reviewTime": "04 7, 2013", "reviewerID": "A2TWN5W0OYNC2H", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Carol Mills", "reviewText": "Good chart, easy to see insects and good pictures.  Handy for quick reference.  Good for gardeners of any level.  Wish I could afford hundreds to had out in insect and gardening classes.", "summary": "Great chart", "unixReviewTime": 1365292800}
{"overall": 1.0, "vote": "6", "verified": true, "reviewTime": "03 26, 2013", "reviewerID": "A290XBB6PW17B3", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Bob Wolfe", "reviewText": "The Amazon title just says Good Bugs/Bad Bugs.  It does not indicate for which region. The Amazon product description does not list for which region.  It is not until you enlarge the picture of the chart that it says of the Pacific Northwest.  Since I live in Ohio, it will not do me any good.  The other two charts I ordered will be very helpful in identifying the good and bad bugs in my garden.", "summary": "Title Misleading", "unixReviewTime": 1364256000}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "03 25, 2013", "reviewerID": "A18YLD9C16H0L", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Catwoman", "reviewText": "I found this chart to be quite useful in my garden. I am new to gardening and the bugs that show up were a constant quandry: should I blast them with the hose, or coddle them? This chart is the go-to reference point--even for my tech-saavy daughter who gardens with me.", "summary": "good product", "unixReviewTime": 1364169600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "03 18, 2012", "reviewerID": "AB95X24GTKFC6", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Patricia Sechi", "reviewText": "This handy guide will help you know who your friends and enemies are! It is laminated so that you can take it into the garden, where it all goes down!", "summary": "Know Your Bugs!", "unixReviewTime": 1332028800}
{"overall": 4.0, "vote": "5", "verified": true, "reviewTime": "10 17, 2010", "reviewerID": "A1N4KAAWWAP1N3", "asin": "089886531X", "style": {"Format:": " Wall Chart"}, "reviewerName": "Ribbonso", "reviewText": "My only complaint is that it's too small to see easily. But, if I had looked at the dimensions listed beforehand, I would have known that. Other than the size I liked it. It was very informative and listed all the bugs in our area, good and bad.", "summary": "Print too small", "unixReviewTime": 1287273600}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "06 22, 2014", "reviewerID": "A2NQ2KTPHOQ09A", "asin": "0980092191", "reviewerName": "Pam", "reviewText": "Received Oskar Jr very quickly.  It was in perfect and clean condition.  Works great!  So glad I have a Jr. back in my kitchen!  Thank you!", "summary": "Oskar Jr.", "unixReviewTime": 1403395200}
{"overall": 5.0, "verified": true, "reviewTime": "03 12, 2013", "reviewerID": "A2EO9RJHH4HNWZ", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "nikkic1975", "reviewText": "This was way better quality than I thought it would be.  I was looking for a sticker book like I had in the 80s and this was the only one I found and my daughter loves it.", "summary": "Daughter loves it!", "unixReviewTime": 1363046400}
{"overall": 4.0, "verified": true, "reviewTime": "02 7, 2013", "reviewerID": "A12SQ660JU45KG", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "T.G", "reviewText": "I bought for my daughter so she could put her stickers in it. I love that the pages are laminated so you can remove stickers and move them around. Its a good size and has lots of room for stickers. Though i feel the little pocket it comes with to hold stickers could have been a bit bigger.", "summary": "Nice sticker book", "unixReviewTime": 1360195200}
{"overall": 5.0, "verified": true, "reviewTime": "02 6, 2013", "reviewerID": "A2VASVQ9IRBWAO", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "Amazon Customer", "reviewText": "It was more than I expected, It had a cover that moved when you move the book. Was surprised about this.", "summary": "My Sticker Book  Princess swing", "unixReviewTime": 1360108800}
{"overall": 4.0, "verified": true, "reviewTime": "01 30, 2013", "reviewerID": "A8THV1OK4VNFP", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "K. Christensen", "reviewText": "After years of just putting stickers on paper only to be thrown away later, I purchased this sticker book for my daughter so she can 'collect' the stickers she receives.  There are plenty of pages for stickers.  It is nice that there are themed pages and blank pages. Being spiral bound allows for easy page turning.", "summary": "Sticker book", "unixReviewTime": 1359504000}
{"overall": 5.0, "verified": true, "reviewTime": "01 27, 2013", "reviewerID": "A2I8YPISSWF89P", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "StacieL", "reviewText": "Very cool sticker book. You can stick, remove, and re-stick all the stickers. Just like the sticker books we had when I was a kid!", "summary": "Stick, remove, and re-stick!", "unixReviewTime": 1359244800}
{"overall": 5.0, "verified": true, "reviewTime": "01 6, 2013", "reviewerID": "A24YEZT66C6VTR", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "A. flynn", "reviewText": "This is a real sticker book for girls to store their stickers.  I couldn't find this in stores.  Several of the pages are labeled with \"Stickers from Doctor's Office\" or \"Stickers Relating to the Sea\" but there are also some blank pages.  My only criticism is that the spiral seems cheap, maybe slightly too short, and I don't know if the spiral will contain the book for a couple of years.  My 6 year old loves it.", "summary": "Hard to Find", "unixReviewTime": 1357430400}
{"overall": 3.0, "verified": true, "reviewTime": "12 20, 2012", "reviewerID": "A21UFW7YNHYY6U", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "Ebarn", "reviewText": "When I was a girl I had a book like this although the pages weren't too stiff so it was easy to get a hold of stickers to move them from page to page.  This book has very high quality, stiff pages.  However it's tough for little fingers to move the stickers around.  Otherwise, it's brilliant.  Arrived on time.", "summary": "Great book, stiff pages", "unixReviewTime": 1355961600}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "09 8, 2012", "reviewerID": "A2OQ1DXMGYEKOS", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "Terry L. Cormier", "reviewText": "I looked long and hard to find a sticker album that actually allowed the stickers to be removed and repositioned. There really were not many options. Overall, I am happy with these I just wish there was a large pocket to store sheets of unused stickers (there is a small envelope style pouch in the back but a full size one would make this book perfect). Still far better than anything else I've found.", "summary": "Great book", "unixReviewTime": 1347062400}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "09 4, 2012", "reviewerID": "A1PCAPMUNQ0X5L", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "Marianne", "reviewText": "Finally, a sticker book like I had when I was young!  Re-usable pages so she can move stickers around!  No commercialized cartoony themes, just pages for stickers from the doctor, stickers from school, animal stickers, food stickers, etc.  Even a little compartment for stickers to trade!  The perfect sticker book.  I do wish they made a more gender-neutral version with animals or something, since my daughter isn't too into \"princess,\" but the transportation and dinosaur books were pretty masculine-looking.  Thank you Sticker Solutions!  I'm getting a bunch for birthday gifts!", "summary": "So glad they make this!", "unixReviewTime": 1346716800}
{"overall": 5.0, "vote": "8", "verified": true, "reviewTime": "08 9, 2012", "reviewerID": "A1P8F9NS16MVS", "asin": "0983124248", "style": {"Format:": " Spiral-bound"}, "reviewerName": "missfuturemba", "reviewText": "I wanted a blank, reusable sticker book for each of my daughters, and after searching online for quite awhile, I finally came across this sticker book.  I'm so happy I did...it's absolutely adorable, with durable, high quality pages.  I'm not sure who's more excited about this book...me or my daughter.\n\nGet this book.  You won't be disappointed!", "summary": "Excellent", "unixReviewTime": 1344470400}
{"overall": 5.0, "verified": false, "reviewTime": "11 24, 2015", "reviewerID": "AIL1U1ISAJIWI", "asin": "0986341622", "reviewerName": "LML", "reviewText": "Every ornament has a story.  This sensitive tale of love of family and the magic of Christmas makes your heart swell .  We can all relate to the story of Oliver and his friends.  Oliver will be front and center on my tree this year and for many years to come.  I cannot wait for the next year's series.  Best gift ever!", "summary": "The beginning of a new family tradition!", "unixReviewTime": 1448323200}
{"overall": 5.0, "verified": false, "reviewTime": "11 22, 2015", "reviewerID": "A1DN32LF3Q47DN", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "What a heartwarming story! I always enjoy telling stories about my ornaments each year when I decorate the christmas tree. They all bring back such fond memories. This book really brings the spirit of christmas to life.", "summary": "Heartwarming story with beautiful illustrations", "unixReviewTime": 1448150400}
{"overall": 5.0, "verified": false, "reviewTime": "11 22, 2015", "reviewerID": "A1K5AYF15P2Z9M", "asin": "0986341622", "reviewerName": "LSS", "reviewText": "This book is just SWEET!  Nothing will get you in the mood to put up your tree and be in the Christmas spirit like this book.  Oliver and his friends are what Christmas is about...sharing memories and making new ones with family and friends.  I LOVE this book!  And the ornament is adorable!", "summary": "This book is SWEET!", "unixReviewTime": 1448150400}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/81fgP0eX1-L._SY88.jpg"], "overall": 5.0, "verified": false, "reviewTime": "11 22, 2015", "reviewerID": "A2DLKJLME91H8D", "asin": "0986341622", "reviewerName": "niko", "reviewText": "I was fortunate enough to purchase an anvanced copy of Oliver and the story and the message is beautiful.", "summary": "Great story, great cause!", "unixReviewTime": 1448150400}
{"overall": 5.0, "verified": false, "reviewTime": "11 18, 2015", "reviewerID": "A3VNSVX8K7OEG9", "asin": "0986341622", "reviewerName": "bmalpolo", "reviewText": "Just in time for the holidays!  This is a heartwarming story that will be enjoyed year after year with your family at Christmas time.", "summary": "This is a heartwarming story that will be enjoyed year after year with your family at Christmas time", "unixReviewTime": 1447804800}
{"overall": 5.0, "verified": false, "reviewTime": "11 18, 2015", "reviewerID": "AIWXEAISHFZ04", "asin": "0986341622", "reviewerName": "TK", "reviewText": "It's a great story and one that everyone can relate back to their childhood. Can't wait for the next in the series to come out next year!", "summary": "The gift that keeps on giving", "unixReviewTime": 1447804800}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 18, 2015", "reviewerID": "A1GFI4PF1H8EP4", "asin": "0986341622", "reviewerName": "Derek Torrey", "reviewText": "I'll try to tell this from the eyes of my 10 year daughter, who was fortunate to receive an advanced copy of book and ornament. The story is approachable, socially relevant (for all ages!) without coming across as a lesson, includes imaginative and fun illustrations for all of the characters, and most importantly - is a wonderfully emotional story for the holiday season. My daughter enjoys reading it aloud to us before bed, and it has become somewhat of a ritual (already and it isn't even Thanksgiving!). We're all looking forward to decorating our Christmas Tree and giving Oliver a prominent position. Enjoy!", "summary": "who was fortunate to receive an advanced copy of book and ornament", "unixReviewTime": 1447804800}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2015", "reviewerID": "AYPFTHK5CGAIZ", "asin": "0986341622", "reviewerName": "Becky Stefanick", "reviewText": "What a great gift to give to a boy named Oliver!  The story is very well written with a message for whole family to enjoy.", "summary": "A new favorite book at the holiday's!", "unixReviewTime": 1450656000}
{"overall": 5.0, "verified": false, "reviewTime": "12 12, 2015", "reviewerID": "AKNO3DHI4CJAS", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "My wife bought this book for us and I just bought a copy for my friend's family because it is so so great! We loved the book. It was well written and easy for my 10 year old to read. I loved all of the different characters and see many new story lines for each ornament. Oliver has a great message to teach kids and a great holiday story. This will be a great addition to our Christmas traditions. Can't wait to share this with many others!", "summary": "An excellent holiday story and new tradition!", "unixReviewTime": 1449878400}
{"overall": 5.0, "verified": false, "reviewTime": "12 5, 2015", "reviewerID": "AZS7GH5NF4TDT", "asin": "0986341622", "reviewerName": "A Fulton", "reviewText": "Love, Love, Love Oliver the Ornament. Everyone who reads this book is sure to relate to Oliver and friends, after all doesn't every ornament tell a story?  I've bought the book for my children who have enjoyed the story so much I plan on giving as gifts to my nieces and nephews this year.", "summary": "A new holiday tradition with Oliver", "unixReviewTime": 1449273600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 4, 2015", "reviewerID": "A3DWRLABQXGPU3", "asin": "0986341622", "reviewerName": "Patricia P.", "reviewText": "A darling seasonal story to share with your family. I have given my children ornaments each year to reflect special events and they do evoke such special memories each year as we decorate the tree. The ornament is really cute and families will enjoy its clever story. This set makes a wonderful gift!", "summary": "Such a sweet story...and ornament", "unixReviewTime": 1449187200}
{"overall": 5.0, "verified": false, "reviewTime": "12 2, 2015", "reviewerID": "A3A50V36FCLOFU", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "This is not only a wonderful story, but the beginning of a family tradition.  My 9 year old daughter and seven year old son love it!  A fanstatic story of courage, love and friendship.", "summary": "This is not only a wonderful story, but the beginning of a family tradition", "unixReviewTime": 1449014400}
{"overall": 5.0, "verified": false, "reviewTime": "12 2, 2015", "reviewerID": "A1YISO36AXLPH4", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "Oliver the Ornament is an amazing story and very heartwarming for the holidays.  I highly recommend the book for the holidays!!!", "summary": "Oliver the Ornament is an amazing story and very heartwarming for the holidays", "unixReviewTime": 1449014400}
{"overall": 5.0, "verified": false, "reviewTime": "12 2, 2015", "reviewerID": "AHZ6RYGEI8NNV", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "Frosty, Rudolph, and now OLIVER!  Oliver the Ornament is going to be my new Christmas tradition!  This little guy is adorable and the story is equally adorable!  It's a wonderful and timely story that made me think of the story of each one of my ornaments as I decorated my tree!", "summary": "A New Tradition", "unixReviewTime": 1449014400}
{"overall": 5.0, "verified": false, "reviewTime": "12 1, 2015", "reviewerID": "A3T0UTND4D5HRS", "asin": "0986341622", "reviewerName": "Jeffrey H.", "reviewText": "Our family loves this book and we have a new tradition of reading it in front of the Christmas tree while putting up ornaments. Great heart-warming message for kids and adults alike. My 7 year old son loved it so much he brought it to school to read to his class. And, I love the children's hospital charity connection. Go Oliver!", "summary": "Heartwarming story for kids and grown ups!", "unixReviewTime": 1448928000}
{"overall": 5.0, "verified": false, "reviewTime": "11 29, 2015", "reviewerID": "A2WDCU2PR4D95A", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "As a former librarian I have read and given many children's books over the years, and this lovely book will be my newest Christmas favorite. Great story that will capture the hearts of children and adults. Loved the illustrations that make the book visually appealing. Can't wait for the next installment.", "summary": "and this lovely book will be my newest Christmas favorite. Great story that will capture the hearts of ...", "unixReviewTime": 1448755200}
{"overall": 5.0, "verified": false, "reviewTime": "11 24, 2015", "reviewerID": "A3JD8FR4PTETM0", "asin": "0986341622", "reviewerName": "Amazon Customer", "reviewText": "What a wonderful story!!! My kids adore this book, and you certainly don't have to celebrate Christmas to appreciate its message and characters. Oliver the Ornament will be proudly displayed on our Hanukkah bush, and we look forward to having other characters join him in future years.\n\nThis is a beautifully packaged holiday gift; buy one for your child/niece/nephew/neighbor.", "summary": "Funny, Smart and Engaging ...", "unixReviewTime": 1448323200}
{"overall": 5.0, "verified": true, "reviewTime": "12 27, 2012", "reviewerID": "A1CYQANXZJ90FY", "asin": "1574893122", "reviewerName": "Brandie", "reviewText": "this was a great gift for my bro in law who is a doctor, he loved it and so did everyone else", "summary": "Great gift for my brother in law!", "unixReviewTime": 1356566400}
{"overall": 4.0, "verified": true, "reviewTime": "08 25, 2012", "reviewerID": "A10SMZTBSWJLFD", "asin": "1574893122", "reviewerName": "Faraday", "reviewText": "The quality of the paper the poster is made out of is wonderful, as well as the print. The order arrived very quickly, more quickly than my order of poster tack so I'm going to have to wait to put it up. No complaints here. :) However, if you are looking to use this poster for something to help studying (like I was), you might want to find a more educational one. The print labeling the different parts of the body is very, very small and you have to hold your eyes very close to be able to read it. When I ordered it I knew it would be small, but not that small. Oh well! It will still look very impressive on my wall and I'm happy with the overall quality.", "summary": "Quick Shipping, Small Lettering", "unixReviewTime": 1345852800}
{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2011", "reviewerID": "A36VIQM7MRS6ZZ", "asin": "1574893122", "reviewerName": "Rose GM", "reviewText": "First of all, if you buy this expecting an educational tool, you might be disappointed..  The text is very small, and while legible, is just not nearly big enough to be helpful in a classroom setting.  This aside, if you're looking to buy this as a vintage anatomical poster to display on your wall, you are going to LOVE it.  The quality of the paper is wonderful and truly looks vintage; this is one of those pieces you'd never think to put on your wall but is a really innovative and beautiful poster.", "summary": "A Beautiful and Innovative Piece of Wall Decor", "unixReviewTime": 1320796800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 28, 2011", "reviewerID": "A1VUAL7V324BZV", "asin": "1574893122", "reviewerName": "Amazon Customer", "reviewText": "Love the look of these posters.  Adds such a classic warm look to our homeschool room.  Paper is not very heavy, but I'm very pleased with it.  Have had many ask me where I got these posters!", "summary": "love it!", "unixReviewTime": 1314489600}
{"overall": 4.0, "verified": true, "reviewTime": "02 27, 2016", "reviewerID": "A2I7W03P5P794T", "asin": "1574893122", "reviewerName": "Nico Poulos", "reviewText": "Awesome vintage/medical poster, I love the aesthetics of this \"time period\"/style, call it what you will, the only problem I have with this poster was I thought having it up I'd be able to maybe learn a little here and there (which is possible, still) but the text/font is near illegible due to it's tiny size of print used,  People with amazing eyes will probably be able to read it real well and with a magnifying glaSS I can read it pretty clearly and see the details and exact minuscule information.  I love it regardless!  I'd give it 4.5 if I could.", "summary": "4.5 not 4 just because the text on the poster is like size 4pt", "unixReviewTime": 1456531200}
{"overall": 5.0, "verified": true, "reviewTime": "02 25, 2016", "reviewerID": "AQSP45XJ932GT", "asin": "1574893122", "reviewerName": "Amazon Customer", "reviewText": "had to hang up as soon as a got it", "summary": "very happy with", "unixReviewTime": 1456358400}
{"overall": 4.0, "verified": true, "reviewTime": "01 19, 2016", "reviewerID": "A1E8TU9UCNY6OP", "asin": "1574893122", "reviewerName": "Amazon Customer", "reviewText": "Beautiful quality print. Only 4 stars though as it is somewhat difficult to read the text.", "summary": "Four Stars", "unixReviewTime": 1453161600}
{"overall": 4.0, "verified": true, "reviewTime": "11 16, 2015", "reviewerID": "A24E720R2ZJNOK", "asin": "1574893122", "reviewerName": "Will", "reviewText": "This item didn't come laminated it's all paper other then that I'm satisfied with the item it's rustic and has a lot of information.", "summary": "Some what satisfied", "unixReviewTime": 1447632000}
{"overall": 1.0, "verified": true, "reviewTime": "11 8, 2015", "reviewerID": "A2TE1L8853WO83", "asin": "1574893122", "reviewerName": "KSM", "reviewText": "Terrible. Murky printing and arrived rumpled, wrinkled and creased, had to return it. Very disappointed because I based my purchase on good reviews. Not even worth one star.", "summary": "Terrible. Murky printing and arrived rumpled", "unixReviewTime": 1446940800}
{"overall": 5.0, "verified": true, "reviewTime": "10 12, 2015", "reviewerID": "ATG60QNG3VQ5K", "asin": "1574893122", "reviewerName": "Vicki Pesek", "reviewText": "excellent product and delivery time", "summary": "Five Stars", "unixReviewTime": 1444608000}
{"overall": 5.0, "verified": true, "reviewTime": "08 29, 2015", "reviewerID": "A3CPDIS8BDFLKB", "asin": "1574893122", "reviewerName": "Katrina Lee", "reviewText": "Awsome", "summary": "Five Stars", "unixReviewTime": 1440806400}
{"overall": 4.0, "verified": true, "reviewTime": "06 21, 2015", "reviewerID": "AP7IV2AE745EV", "asin": "1574893122", "reviewerName": "Rosalie Robinson", "reviewText": "Great chart.  Had an older feel.  It served its purpose for information and decoration once framed.", "summary": "Good Investment for Education & Decoration", "unixReviewTime": 1434844800}
{"overall": 4.0, "verified": true, "reviewTime": "05 12, 2015", "reviewerID": "A3B8QRVRD6SU8W", "asin": "1574893122", "reviewerName": "Bullkirs", "reviewText": "Beautiful product. The paper was not a sturdy as I expected, but still heavy and good for framing. I purchased a 28\"x20\" frame and this poster was 1\" too tall for my frame.", "summary": "Beautiful product. The paper was not a sturdy as ...", "unixReviewTime": 1431388800}
{"overall": 5.0, "verified": true, "reviewTime": "04 14, 2015", "reviewerID": "A2MCVVLCMAJTS6", "asin": "1574893122", "reviewerName": "William K Harris", "reviewText": "As advertised", "summary": "Five Stars", "unixReviewTime": 1428969600}
{"overall": 4.0, "verified": true, "reviewTime": "04 8, 2015", "reviewerID": "A3EV0DTX8ZQY8T", "asin": "1574893122", "reviewerName": "C. Nebeker", "reviewText": "When I saw this on a different site, I knew I had to have it. I found a much cheaper version here on Amazon and ordered it. It has a really cool vintage look to it. My only complaint is how small the text is. I was hoping to use it to help study for my anatomy class.", "summary": "Cool", "unixReviewTime": 1428451200}
{"overall": 5.0, "verified": true, "reviewTime": "12 24, 2014", "reviewerID": "A212UKX4UFSRLK", "asin": "1574893122", "reviewerName": "Jessie", "reviewText": "Love it! I have been on the hunt for a vintage/antique looking posters for our homeschool room and was so happy to find this on Amazon for a reasonable price. It looks awesome and is good quality.", "summary": "Love it! I have been on the hunt for ...", "unixReviewTime": 1419379200}
{"overall": 5.0, "verified": false, "reviewTime": "10 24, 2014", "reviewerID": "A3CYPCO3EJ1UJM", "asin": "1574893122", "reviewerName": "Katrina", "reviewText": "Excellent poster, looks exactly like the picture.  No regrets in purchasing this at all!", "summary": "Five Stars", "unixReviewTime": 1414108800}
{"overall": 5.0, "verified": true, "reviewTime": "05 17, 2014", "reviewerID": "AK3UOLPIJ7FH8", "asin": "1574893122", "reviewerName": "KEM", "reviewText": "This is a beautifully antiqued poster...such a gorgeous rich color!  I bought it for a steampunk installation in our library, and it looks smashing in a beautiful wood frame.  No one would ever guess that it cost so little.  A lovely piece of quirky art!  The paper is thick and of good quality, and it arrives in a heavyweight shipping roll, so no creases or any other marks mar the piece.", "summary": "Simply gorgeous and a real steal!", "unixReviewTime": 1400284800}
{"overall": 5.0, "verified": true, "reviewTime": "03 3, 2014", "reviewerID": "A1XJYJDG5MQ3ML", "asin": "1574893122", "reviewerName": "K. Murray-Emmons", "reviewText": "I bought this poster as an addition to our home-school space. I love it's vintage look and the thick quality (parchment-like texture) of the paper used. The print is clear. Wonderful print at a wonderful price.", "summary": "Great addition to our home-school space", "unixReviewTime": 1393804800}
{"overall": 5.0, "verified": true, "reviewTime": "01 30, 2014", "reviewerID": "A31064ZCNDUJID", "asin": "1574893122", "reviewerName": "Matthew Fowler", "reviewText": "great poster. gets many positive comments. shipped fast and in poster tube. exactly what you would expect. would highly recommend for anyone who would like to add a vintage feel to any room.", "summary": "vintage look", "unixReviewTime": 1391040000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 27, 2013", "reviewerID": "A3L2A7MXA55RHJ", "asin": "1574893122", "reviewerName": "Sam", "reviewText": "The packaging was secure and nice. I love that there was an extra paper inside to protect the poster. I am hanging this in my college dorm and I love it so much. good quality.", "summary": "COOL", "unixReviewTime": 1377561600}
{"overall": 5.0, "verified": true, "reviewTime": "06 12, 2013", "reviewerID": "A19NWSIK85UK0F", "asin": "1574893122", "reviewerName": "Janell Morisoli", "reviewText": "I bought this poster to put up in my study and the antique look is great.  Makes a great addition to the room.", "summary": "great poster", "unixReviewTime": 1370995200}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "04 7, 2013", "reviewerID": "A2EW93V6CQELHR", "asin": "1574893122", "reviewerName": "JRO", "reviewText": "All right, one thing's for sure- this poster is highly detailed and very neat. It has an interesting style to it, like old and neatly organized. My only issue, is how it is printed. Not the paper, I really like the material, not that cheep waxy poster material; this is thicker and holds better. The issue was the text. It's very hard to read, but it can be read (as long as you look close enough). In any event, I recommend this product for the detail, but perhaps not the labeling.", "summary": "Neat design; Small text.", "unixReviewTime": 1365292800}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "04 5, 2013", "reviewerID": "A2AQ5NSE7ALLOF", "asin": "1574893122", "reviewerName": "Marco", "reviewText": "Came quick... and looks great... I would highly recommend it to anyone looking for the old medical feel from a poster. great buy.", "summary": "Wow", "unixReviewTime": 1365120000}
{"overall": 5.0, "verified": true, "reviewTime": "01 19, 2016", "reviewerID": "A2EX7WCI5O69JG", "asin": "1579280633", "reviewerName": "sherry thompson", "reviewText": "perfect replacement for the angel the dog ate...", "summary": "Five Stars", "unixReviewTime": 1453161600}
{"overall": 5.0, "verified": true, "reviewTime": "11 21, 2015", "reviewerID": "A2A9YHBVH0MX9N", "asin": "1579280633", "reviewerName": "Amazon Customer", "reviewText": "It was a gift but my daughter loved it for her antivity set.", "summary": "Five Stars", "unixReviewTime": 1448064000}
{"overall": 5.0, "verified": true, "reviewTime": "09 21, 2015", "reviewerID": "A3ND72IK6GFWKD", "asin": "1579280633", "reviewerName": "miasampietro", "reviewText": "This angel is absolutely gorgeous! I purchased it to go with my nativity set but unfortunately it was too small so unfortunately I'll be returning it. However, the colors and painting are absolutely lovely and the material is extremely durable. I still give it 5 stars!!", "summary": "This angel is absolutely gorgeous! I purchased it to ...", "unixReviewTime": 1442793600}
{"overall": 3.0, "verified": true, "reviewTime": "01 16, 2015", "reviewerID": "AGYK3SL34OBNA", "asin": "1579280633", "reviewerName": "Barbara J. Birk", "reviewText": "Didn't care for the facial painting", "summary": "Sad angel", "unixReviewTime": 1421366400}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "01 21, 2013", "reviewerID": "A3RX1UZ7GPO6Q", "asin": "1579280633", "reviewerName": "Colorman", "reviewText": "She is quite lovely although her paint job is thin and mostly the flesh colored plastic shows through.  I am hoping she will go well with my porcelain nativity set.", "summary": "nativity angel", "unixReviewTime": 1358726400}
{"overall": 5.0, "verified": true, "reviewTime": "01 15, 2017", "reviewerID": "A1IRHOBVXTB55Q", "asin": "1579280633", "reviewerName": "RFM", "reviewText": "Very well crafted and painted. The one I received was new old stock.", "summary": "Well crafted", "unixReviewTime": 1484438400}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2017", "reviewerID": "AT8F6VM9CINXO", "asin": "1579280633", "reviewerName": "Light Guy", "reviewText": "The FONTANINI 5' KNEELING ANGEL is a great addition to my Nativity Scene.  Very unusual but inspiring attitude for a Nativity Angel.  It is made of a hard rubber so it's very strong and not fragile or easily broken.  The colors are pretty and would go with any Nativity Creche.  Lovely face.  (JMJ)", "summary": "The FONTANINI 5' KNEELING ANGEL is a great addition to my Nativity Scene", "unixReviewTime": 1484265600}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2017", "reviewerID": "A269DFYNBAPGL4", "asin": "1579280633", "reviewerName": "Steve Foresman", "reviewText": "Beautiful Nativity Angel handpainted by Fontanini. These are always my favorite!", "summary": "Five Stars", "unixReviewTime": 1484092800}
{"overall": 5.0, "verified": true, "reviewTime": "12 28, 2016", "reviewerID": "A3NL04PSQRQNUZ", "asin": "1579280633", "reviewerName": "beckylov", "reviewText": "Fontana never disappoints.", "summary": "Five Stars", "unixReviewTime": 1482883200}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2016", "reviewerID": "A9NA09NEXI4JQ", "asin": "1579280633", "reviewerName": "Jn", "reviewText": "She is beautiful !!  Exactly what I wanted to add to my nativity scene.  Product delivery was\nextremely fast and was package with lots of cushion as well as in a box.  Thank you !", "summary": "She is beautiful!! Exactly what I wanted to add to ...", "unixReviewTime": 1482278400}
{"overall": 4.0, "verified": true, "reviewTime": "11 16, 2016", "reviewerID": "A2Y263O8BVY9Z2", "asin": "1579280633", "reviewerName": "Mary A. Farrell", "reviewText": "I LOVE the Fontanni figures and our Nativity set is a tradition in our home.  We add a piece each year and have been doing this since my daughters were small.  There are grandchildren now and they always look forward to placing Baby Jesus in the manger each year just like their moms.  On the negative side I do feel that the painting on my new figure is not as good as in the past.", "summary": "I LOVE the Fontanni figures and our Nativity set is a ...", "unixReviewTime": 1479254400}
{"overall": 5.0, "verified": true, "reviewTime": "08 4, 2016", "reviewerID": "A1OB19ILFMIABU", "asin": "1579280633", "reviewerName": "Amazon Customer", "reviewText": "A very nice piece for my collection.  Very Satisfied.", "summary": "Thank you.", "unixReviewTime": 1470268800}
{"overall": 5.0, "verified": true, "reviewTime": "04 12, 2016", "reviewerID": "A16N4FZ03TF2VC", "asin": "1579280633", "reviewerName": "SomethingFun", "reviewText": "Love this!", "summary": "Five Stars", "unixReviewTime": 1460419200}
{"overall": 5.0, "verified": true, "reviewTime": "03 3, 2016", "reviewerID": "A28O0BGR4ALDRX", "asin": "1579280633", "reviewerName": "anita", "reviewText": "Got this for a gift and they loved it.", "summary": "Xmas Nativity", "unixReviewTime": 1456963200}
{"overall": 5.0, "verified": true, "reviewTime": "02 11, 2016", "reviewerID": "A2WJ5IHBME4XXW", "asin": "1579280633", "reviewerName": "Lorrie", "reviewText": "A beautiful start to our Fontanini collection.  We have had the base set for years but decided to start adding.  Fontanini is very detailed compared to other collections.  It is also wonderful that we have the opportunity to build an extensive collection as the years go by.", "summary": "A Collection that allows you to add over time.", "unixReviewTime": 1455148800}
{"overall": 4.0, "verified": true, "reviewTime": "08 9, 2013", "reviewerID": "ACQGF9PXBB35M", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "Ed Mirabal", "reviewText": "Its a nice variation on the kids book and the little cookies disapear as you turn the pages.....its a kids book, come on, how mean of a review are you going to write about this. Its for kids.", "summary": "Kids book", "unixReviewTime": 1376006400}
{"overall": 5.0, "verified": true, "reviewTime": "02 2, 2013", "reviewerID": "A3P565UNR58SPG", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "Monnie D.  Brewster", "reviewText": "The book teaches many things, how to count, to have a conscience, to have fun and to ask forgiveness when you do something wrong.", "summary": "Very good for kid and we love it too.", "unixReviewTime": 1359763200}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2013", "reviewerID": "A3LT7ZV6LZZF7N", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "tetani", "reviewText": "Purchased this book as a gift for the grandchildren, it has a cute story and the raised cookies are fun to count! We love how Daddy shares the cookie at the end!", "summary": "Fun book", "unixReviewTime": 1357948800}
{"overall": 5.0, "verified": true, "reviewTime": "11 29, 2012", "reviewerID": "A13S4950ZDHDQG", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "Kindle Customer", "reviewText": "We read this EVERY day at daycare.  Santa has brought one for each of the children to enjoy!  They love to count the cookies!", "summary": "My children's favorite book!", "unixReviewTime": 1354147200}
{"overall": 3.0, "verified": true, "reviewTime": "07 22, 2012", "reviewerID": "A13QQN9O57I2HO", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "L", "reviewText": "This book is cute my 18 month old likes it.  It is the popular kids song but with different characters such as the dog, cat, goldfish, and a guinea pig.  I wish it completely rhymed because I noticed it does not, but other than that it's a fun book to read.  I did find it weird that the Guinea Pig in the story works out...", "summary": "Cute.", "unixReviewTime": 1342915200}
{"overall": 1.0, "verified": true, "reviewTime": "12 15, 2011", "reviewerID": "A4IY73NKWP3XC", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "janet", "reviewText": "I had the original book from the library and we had fun reading it.  I decided to buy a copy for christmas and saw the \"mini\" version.  I thought \"mini\" meant smaller, but it really means half the story.  The full version starts with 10 cookies, this \"mini\" version, starts at 5.\n\nI was very disappointed and returned the book.", "summary": "mini means half the story", "unixReviewTime": 1323907200}
{"overall": 5.0, "verified": true, "reviewTime": "05 14, 2010", "reviewerID": "A1FZV5FWLJKYU7", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "L. Stephens", "reviewText": "I originally only knew this story/song in French!  Now my baby can also learn it in English.  She's only 3 months, but she enjoys us reading it in a sing-song way and doing sound effects for the animals.  It's short enough to keep her attention and let us finish this one.  Very cute!", "summary": "Fun for my baby girl", "unixReviewTime": 1273795200}
{"overall": 1.0, "vote": "2", "verified": true, "reviewTime": "02 11, 2007", "reviewerID": "A3DPHU1UEI919U", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "MomWife", "reviewText": "This is so mini edition, that they should have written the word 'mini' in smaller print. I can't even read the print. I'm very disappointed.\n\nI thought this would only have fewer pages but not mini in size.\n\nI wish the description explained that it was mini in dimensions length x width, and not leaving for one to possibly assume that it was only with less pages, but in the regular dimenstions a book would be.\n\nToo much money for what I received.", "summary": "mini?  this is the mini of the mini", "unixReviewTime": 1171152000}
{"overall": 5.0, "verified": false, "reviewTime": "02 25, 2006", "reviewerID": "A3G9BWSC4KOGFM", "asin": "1581174292", "style": {"Format:": " Hardcover"}, "reviewerName": "Marsha L. Mcginnis", "reviewText": "My six year old grandson loves this book. He is a beginning reader and at that stage where words are opeinig up a whole new world for him. He likes the humor of the story  as well as the fact that each set of pages has one page that is repetitive and easily remembered by verse, and the next page offers new words easily sounded out by new readers. This is a great buy for this sweet book.", "summary": "My Grandson Loves This Book!", "unixReviewTime": 1140825600}
{"overall": 5.0, "verified": true, "reviewTime": "12 14, 2014", "reviewerID": "A2EEX725TDLH2I", "asin": "1605160113", "reviewerName": "Lana Urquhart", "reviewText": "JUST WHAT I THOUGHT IT WAS AND ORDER WENT SMOOTHLY :)", "summary": "Five Stars", "unixReviewTime": 1418515200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "12 13, 2014", "reviewerID": "A1B2S5K5D20C47", "asin": "1605160113", "reviewerName": "Grayling", "reviewText": "After I saw the motion picture, Heaven is for Real, I knew I wanted these wallet size pictures to give to friends. Good size & wonderful clarity of the photo.", "summary": "Wallet photo of Jesus", "unixReviewTime": 1418428800}
{"overall": 5.0, "verified": true, "reviewTime": "12 8, 2014", "reviewerID": "ACD0YG0SIZLUO", "asin": "1605160113", "reviewerName": "drp", "reviewText": "Great quality of image and prompty service, great shipping! DP", "summary": "Five Stars", "unixReviewTime": 1417996800}
{"overall": 5.0, "verified": true, "reviewTime": "12 5, 2014", "reviewerID": "A1YVZAXCFK1Z4B", "asin": "1605160113", "reviewerName": "shirrie jordan", "reviewText": "Loved them gave them out to sunday bible study", "summary": "Five Stars", "unixReviewTime": 1417737600}
{"overall": 5.0, "verified": true, "reviewTime": "11 29, 2014", "reviewerID": "A23O361J8EUVQZ", "asin": "1605160113", "reviewerName": "Joel C.", "reviewText": "Arrived in perfect condition. No complaints.", "summary": "Five Stars", "unixReviewTime": 1417219200}
{"overall": 5.0, "verified": false, "reviewTime": "10 30, 2014", "reviewerID": "A2B5JTPA7ZPBWP", "asin": "1605160113", "reviewerName": "Lady", "reviewText": "I hand these wonderful Prince of Peace cards out as gifts to friends to carry in their wallets.  EVERYONE LOVES OUR YESHUA", "summary": "Five Stars", "unixReviewTime": 1414627200}
{"overall": 5.0, "verified": true, "reviewTime": "10 15, 2014", "reviewerID": "A2OSIB0BSDRVD4", "asin": "1605160113", "reviewerName": "Jackson", "reviewText": "Exactly what I thought it would be. Love the photos I purchased.", "summary": "Love the photos I purchased", "unixReviewTime": 1413331200}
{"overall": 5.0, "verified": true, "reviewTime": "09 28, 2014", "reviewerID": "A213V8YE1BYJRJ", "asin": "1605160113", "reviewerName": "Hugo Borst", "reviewText": "As described; fast delivery", "summary": "Five Stars", "unixReviewTime": 1411862400}
{"overall": 5.0, "verified": true, "reviewTime": "09 20, 2014", "reviewerID": "A28LW0FRG8PR74", "asin": "1605160113", "reviewerName": "jdulaigh", "reviewText": "I love them and will order more very soon.", "summary": "Five Stars", "unixReviewTime": 1411171200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "09 16, 2014", "reviewerID": "AT5VNCFHVUECT", "asin": "1605160113", "reviewerName": "Veronica Alexander", "reviewText": "Beautiful wallet cards.  I have been sharing them with Christian friends.  I also\nkeep a card under the glass on my night table.  Comforting.", "summary": "Beautiful Artist Design", "unixReviewTime": 1410825600}
{"overall": 5.0, "verified": true, "reviewTime": "07 27, 2017", "reviewerID": "A27A355NULDE7T", "asin": "1605160113", "reviewerName": "Sandi", "reviewText": "Love this picture of Jesus!!  Done by Akiane Kramarik!!", "summary": "Five Stars", "unixReviewTime": 1501113600}
{"overall": 5.0, "verified": true, "reviewTime": "07 11, 2017", "reviewerID": "A8D8QMY4O64FN", "asin": "1605160113", "reviewerName": "tt", "reviewText": "Very thankful to have received this.", "summary": "Five Stars", "unixReviewTime": 1499731200}
{"overall": 5.0, "verified": true, "reviewTime": "07 6, 2017", "reviewerID": "A1G2ZY3XRFRV4F", "asin": "1605160113", "reviewerName": "Ward Jones", "reviewText": "Excellent cards at an excellent price", "summary": "Five Stars", "unixReviewTime": 1499299200}
{"overall": 5.0, "verified": true, "reviewTime": "06 21, 2017", "reviewerID": "A1MFSYKR7XM42J", "asin": "1605160113", "reviewerName": "Debbie Venedam", "reviewText": "I love it and have given out so many I need more.", "summary": "Five Stars", "unixReviewTime": 1498003200}
{"overall": 5.0, "verified": true, "reviewTime": "04 24, 2017", "reviewerID": "A19P9SXVRGRWV7", "asin": "1605160113", "reviewerName": "Claudia R.", "reviewText": "Perfect all the way....Just perfect!", "summary": "Five Stars", "unixReviewTime": 1492992000}
{"overall": 5.0, "verified": true, "reviewTime": "03 29, 2017", "reviewerID": "A2R3JI8YFCAK90", "asin": "1605160113", "reviewerName": "Sueg", "reviewText": "I wanted one of these pictures. I believe in God. When I saw these cards with the picture on it. I had to get them. The price was right, so I had to buy them.", "summary": "Great buy!!", "unixReviewTime": 1490745600}
{"overall": 5.0, "verified": true, "reviewTime": "03 29, 2017", "reviewerID": "AZGWOUV8EMH92", "asin": "1605160113", "reviewerName": "Amazon Customer", "reviewText": "Excellent quality and prompt arrival!", "summary": "Five Stars", "unixReviewTime": 1490745600}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/71EJ56HOQXL._SY88.jpg"], "overall": 5.0, "vote": "9", "verified": true, "reviewTime": "03 16, 2017", "reviewerID": "A2CDLJU98TUNGD", "asin": "1605160113", "reviewerName": "Rainestormrose", "reviewText": "Only one back of the card was as shown on Amazon.  I wanted them all to have The Lord Promises on the back as I wanted to give them as gifts to others and I liked the messages on the back. Only one has the right message and the other 9 cards do not.  Disappointed that I paid $15 and only really got one correct card. (see photo attached). UPDATED:  I contacted seller and they immediately (within minutes)  apologized and are sending 10 new cards and letting me keep the ones that they already sent.", "summary": "Lovely artwork but the backs are not as shown.  Seller immediately corrected.", "unixReviewTime": 1489622400}
{"overall": 5.0, "verified": true, "reviewTime": "02 26, 2017", "reviewerID": "A3GOBC9ORVAY7Q", "asin": "1605160113", "reviewerName": "rachael ventresca", "reviewText": "fantastic", "summary": "Five Stars", "unixReviewTime": 1488067200}
{"overall": 5.0, "verified": true, "reviewTime": "02 24, 2017", "reviewerID": "A1V1MOSYS92JIR", "asin": "1605160113", "reviewerName": "Julie Stuart", "reviewText": "Excellen quality as expected", "summary": "Five Stars", "unixReviewTime": 1487894400}
{"overall": 5.0, "verified": false, "reviewTime": "11 7, 2014", "reviewerID": "A2I2DXRV84VX1R", "asin": "1605161810", "reviewerName": "Maggie", "reviewText": "Beautiful", "summary": "Five Stars", "unixReviewTime": 1415318400}
{"overall": 5.0, "verified": false, "reviewTime": "10 14, 2014", "reviewerID": "A1KFBVEY11BAAC", "asin": "1605161810", "reviewerName": "Marilyn Porter", "reviewText": "Love this magnet of Jesus.  Keep it on my fridge where I see it daily.", "summary": "Five Stars", "unixReviewTime": 1413244800}
{"overall": 5.0, "verified": true, "reviewTime": "10 7, 2014", "reviewerID": "A2R4NUZWLP4QUL", "asin": "1605161810", "reviewerName": "Robert R.", "reviewText": "I loved it", "summary": "Five Stars", "unixReviewTime": 1412640000}
{"overall": 5.0, "verified": false, "reviewTime": "10 5, 2014", "reviewerID": "A1UV89K5YL5KWB", "asin": "1605161810", "reviewerName": "Susan McDargh-Deiseroth", "reviewText": "I love looking at Jesus everyday on my refrigerator.", "summary": "Five Stars", "unixReviewTime": 1412467200}
{"overall": 5.0, "verified": true, "reviewTime": "09 20, 2014", "reviewerID": "A28LW0FRG8PR74", "asin": "1605161810", "reviewerName": "jdulaigh", "reviewText": "I just have to get some more!", "summary": "Five Stars", "unixReviewTime": 1411171200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "09 11, 2014", "reviewerID": "A3UW0D8M5P642L", "asin": "1605161810", "reviewerName": "Midnight Hour", "reviewText": "This is stunning to look at. It seems to speak to your soul. The truth is it makes me feel closer to my Christ. Is it the true picture of our Christ, only God knows, but it sure pulls at your soul.", "summary": "Amazing", "unixReviewTime": 1410393600}
{"overall": 1.0, "verified": true, "reviewTime": "09 7, 2014", "reviewerID": "APRKM7HBJNUJG", "asin": "1605161810", "reviewerName": "Deborah", "reviewText": "Adheres to the refrigerator well.", "summary": "One Star", "unixReviewTime": 1410048000}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "07 18, 2014", "reviewerID": "A2SATCUKH06DK8", "asin": "1605161810", "reviewerName": "Rosanna S.", "reviewText": "A true work of art!", "summary": "Inspirational", "unixReviewTime": 1405641600}
{"overall": 5.0, "verified": true, "reviewTime": "02 8, 2017", "reviewerID": "A2D42JDM0R0GMA", "asin": "1605160113", "reviewerName": "Elodie", "reviewText": "I love these cards. I took 2 of them and am hanging them back to back in the rear view mirror of my car. I want to look at them while eating my lunch outside in my car on my working days.  I think they are so pretty.  They included in the package one \"Father forgive them card and one of the virgin Mary holding baby Jesus.  I highly recommend them.", "summary": "I love these cards", "unixReviewTime": 1486512000}
{"overall": 5.0, "verified": true, "reviewTime": "01 8, 2017", "reviewerID": "A2ISRCA1Z99PV1", "asin": "1605160113", "reviewerName": "Amazon Customer", "reviewText": "It was more than I expected it to be. I give Amazon a 5 star rating.", "summary": "Five Stars", "unixReviewTime": 1483833600}
{"overall": 5.0, "verified": true, "reviewTime": "11 29, 2016", "reviewerID": "A1RG59RTYQCU6K", "asin": "1605160113", "reviewerName": "Gary L. Johns", "reviewText": "These wallet pictures are beautiful as well as quality produced.  I have given one to all my grandchildren and added a mini piece of magnetic tape.\nThat way the Jesus picture can be placed on the refrig or in their wallets as a daily reminder.  I plan to send a Jesus card to all of my relatives inside my Christmas card.  Great way to introduce my family to our Wonderful Savior!  (If they don't know him already!)", "summary": "These wallet pictures are beautiful as well as quality produced", "unixReviewTime": 1480377600}
{"overall": 5.0, "verified": true, "reviewTime": "10 29, 2016", "reviewerID": "AHNBJCD8URHKA", "asin": "1605160113", "reviewerName": "Julie", "reviewText": "LOVE the story behind this. Amazing. Every year, I buy these and frame them with a wallet sized frame from the dollar store to give as Christmas gifts to my third grade Sunday School class.  When I do, I read them the children's version picture book of Heaven is For Real, so they understand that this could truly be what Jesus looks like. My three children each have their own framed picture of Jesus, too. As for the card quality, it's perfect and includes an explanation on the back about the artist. Love this.", "summary": "LOVE the story behind this", "unixReviewTime": 1477699200}
{"overall": 5.0, "verified": true, "reviewTime": "09 22, 2016", "reviewerID": "A3FFMER98HCVN3", "asin": "1605160113", "reviewerName": "Amazon Customer", "reviewText": "I wish for such a talent as the young girl who drew this picture.  Cards are sturdy and clear coated to protect surface.  All I can say is beautiful.", "summary": "Cards are sturdy and clear coated to protect surface", "unixReviewTime": 1474502400}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "09 17, 2016", "reviewerID": "A19RSJ3PEAYXCD", "asin": "1605160113", "reviewerName": "SH1860", "reviewText": "These cards are quality cardstock and beautiful coloring of Akiane's painting which I adore.  I only gave them 3 stars due to the \"preaching\" printed on the back!  \"If you confess with your mouth...\" etc.  covers the entire back of the card!  I bought this card at a local bible store for a gift enclosure and it was plain on the back.  I purchased these with the intent of adding this card to birthday, sympathy and other greetings or gift enclosure and knew my \"giftees\" would appreciate the fine \"painting\" to carry in their wallet or frame.  I do not feel comfortable enclosing a \"revival\" message.  So disappointed.", "summary": "Not disclosed, \"preaching\" on back of this beautiful card...", "unixReviewTime": 1474070400}
{"overall": 5.0, "verified": true, "reviewTime": "09 15, 2016", "reviewerID": "A35IW2KZOFCZ2A", "asin": "1605160113", "reviewerName": "V. Gallagher", "reviewText": "These are great little reminders of my faith and easily kept in a wallet.  Packet came with 10 so I like to hand them out to my friends especially to those that may be going through a difficult time to remind them they are never alone.", "summary": "Good Qualtiy and Nice to Give", "unixReviewTime": 1473897600}
{"overall": 5.0, "verified": true, "reviewTime": "09 3, 2016", "reviewerID": "A1D14X1GOP3ZDU", "asin": "1605160113", "reviewerName": "Amanda Vogler", "reviewText": "These wallet cards are perfect to hand out to people, and share the gospel! I keep one in my wallet!", "summary": "These wallet cards are perfect to hand out to people", "unixReviewTime": 1472860800}
{"overall": 3.0, "verified": true, "reviewTime": "09 2, 2016", "reviewerID": "ANTWEKAQAGYW2", "asin": "1605160113", "reviewerName": "Lorraine Dallaire", "reviewText": "One of the 10 pictures was great the other 9 seemed washed out.", "summary": "Just OK", "unixReviewTime": 1472774400}
{"overall": 5.0, "verified": true, "reviewTime": "08 19, 2016", "reviewerID": "A29014J0FJR8T4", "asin": "1605160113", "reviewerName": "flower power", "reviewText": "Great for gifts when some one is down", "summary": "Gteatness", "unixReviewTime": 1471564800}
{"overall": 5.0, "verified": true, "reviewTime": "09 1, 2015", "reviewerID": "A1PNQ4F0UC9V4", "asin": "1605161810", "reviewerName": "party", "reviewText": "I like this and thank you.", "summary": "Five Stars", "unixReviewTime": 1441065600}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/511bHvSf+3L._SY88.jpg"], "overall": 5.0, "verified": true, "reviewTime": "08 14, 2015", "reviewerID": "AC1W8G7HU9VH8", "asin": "1605161810", "reviewerName": "Jeanette Dodds", "reviewText": "My mom loves it! Delivery was exactly on time. Thank you!", "summary": "Five Stars! Beautiful!", "unixReviewTime": 1439510400}
{"overall": 5.0, "verified": true, "reviewTime": "07 18, 2015", "reviewerID": "AFY118HH4OG7F", "asin": "1605161810", "reviewerName": "GothicPoohBear", "reviewText": "good quality!", "summary": "good quality", "unixReviewTime": 1437177600}
{"overall": 5.0, "verified": true, "reviewTime": "06 19, 2015", "reviewerID": "AG6BH7V520TJ5", "asin": "1605161810", "reviewerName": "Deb", "reviewText": "Beautiful!", "summary": "Love it!", "unixReviewTime": 1434672000}
{"overall": 5.0, "verified": true, "reviewTime": "06 13, 2015", "reviewerID": "A3MNFE8HZDJ3WC", "asin": "1605161810", "reviewerName": "Madeline Collins", "reviewText": "Perfect magnet for my fridge.  The picture inspires me.", "summary": "Great magnet", "unixReviewTime": 1434153600}
