{"overall": 2.0, "vote": "12", "verified": false, "reviewTime": "09 22, 2016", "reviewerID": "A1IDMI31WEANAF", "asin": "0020232233", "reviewerName": "Mackenzie Kent", "reviewText": "When it comes to a DM's screen, the space on the screen itself is at an absolute premium. The fact that 50% of this space is wasted on art (and not terribly informative or needed art as well) makes it completely useless. The only reason that I gave it 2 stars and not 1 was that, technically speaking, it can at least still stand up to block your notes and dice rolls. Other than that, it drops the ball completely.", "summary": "The fact that 50% of this space is wasted on art (and not terribly informative or needed art ...", "unixReviewTime": 1474502400}
{"overall": 1.0, "vote": "21", "verified": false, "reviewTime": "09 18, 2016", "reviewerID": "A4BCEVVZ4Y3V3", "asin": "0020232233", "reviewerName": "Jonathan Christian", "reviewText": "An Open Letter to GaleForce9*:\n\nYour unpainted miniatures are very not bad. Your spell cards are great. Your board games are \"meh\". Your DM screens, however, are freaking terrible. I'm still waiting for a single screen that isn't polluted with pointless artwork where useful, reference-able tables should be. Once again, you've created a single use screen that is only useful when running the \"Storm King's Thunder\" adventure. Even despite the fact that it's geared to that adventure path, it's usefulness negligible, at best. I massive swath of the inner panel is wasted on artwork and a bloated overland map, which could have been easily reduced to a single panel in size. And the few table you have are nigh-useless themselves.\n\nIn short, stop making crap DM screens.", "summary": "Another worthless Dungeon Master's screen from GaleForce9", "unixReviewTime": 1474156800}
{"overall": 3.0, "vote": "19", "verified": true, "reviewTime": "09 12, 2016", "reviewerID": "A2EZ9PY1IHHBX0", "asin": "0020232233", "reviewerName": "unpreparedtodie", "reviewText": "Nice art, nice printing.  Why two panels are filled with a general Forgotten Realms map is beyond me.  Most of one of them is all blue ocean.  Such a waste.\n\nI don't understand why they can't make these DM Screens more useful for these \"kinds of adventures\" rather than solely the specific adventure.  You're supposed to be able to transpose this adventure to other lands outside the Forgotten Realms.  So even just a list of new monsters or NPCs would at least be useful than the map.  Even more would just be stuff related to running the game but broad-use stuff related to giants.\n\nSame thing with Curse of Strahd.  Why not make it useful for raven loft, undead or horror campaigns in general... instead a huge amount of screen space is solely mapping out Castle Ravenloft, which is only useful during a small fraction of the time even for the Curse of Strahd adventure, let alone various other Ravenloft adventuring.\n\nThey really kill the extended use of these screens by not thinking about their potential use, both for the adventure in question, as well as use in a broader sense.\n\nThe Rage of Demons screen is far more useful for broad under dark adventuring - covering a lot of rules for the various conditions you may suffer... and the map is only one panel.\n\nThis Storm Giants one is decent for a few tables it includes - but really misses the mark.  Maybe they should ask a few DMs what they would use?", "summary": "pretty, but also pretty useless", "unixReviewTime": 1473638400}
{"overall": 5.0, "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A139PXTTC2LGHZ", "asin": "0020232233", "reviewerName": "Ashley", "reviewText": "Amazing buy! Bought it as a gift for our new dm and it's perfect!", "summary": "Five Stars", "unixReviewTime": 1488412800}
{"overall": 1.0, "vote": "3", "verified": true, "reviewTime": "02 8, 2017", "reviewerID": "A3IB33V29XIL8O", "asin": "0020232233", "reviewerName": "Oghma_EM", "reviewText": "As my review of GF9's previous screens these were completely unnecessary and nearly useless. Skip them, this is the definition of a waste of money.", "summary": "Money trap", "unixReviewTime": 1486512000}
{"overall": 5.0, "verified": true, "reviewTime": "01 27, 2017", "reviewerID": "A1J86V48S4KRJE", "asin": "0020232233", "reviewerName": "Cynthia A. Evoniuk", "reviewText": "Grandson loves", "summary": "Five Stars", "unixReviewTime": 1485475200}
{"overall": 5.0, "verified": false, "reviewTime": "01 2, 2017", "reviewerID": "A14J12PRBLGHF4", "asin": "0020232233", "reviewerName": "Amazon Customer", "reviewText": "I have bought many gm screens over the years, but this one is the best I have ever seen. It has all the relevant information I need , and no crap filler on it. Very happy with this screen.", "summary": "Best gm screen ever", "unixReviewTime": 1483315200}
{"overall": 5.0, "verified": true, "reviewTime": "12 17, 2016", "reviewerID": "A2UKOWP9ICU416", "asin": "0020232233", "reviewerName": "anon9df0", "reviewText": "Came in perfect condition.", "summary": "Five Stars", "unixReviewTime": 1481932800}
{"overall": 4.0, "verified": false, "reviewTime": "12 15, 2016", "reviewerID": "A2ONKKDETRWT79", "asin": "0020232233", "reviewerName": "Consumer Dad", "reviewText": "Could be better but its still great. I love the things on the DM's side of the screen and I actually like the map in the middle makes it easy to reference whats around at any given time.", "summary": "Great but could be even better", "unixReviewTime": 1481760000}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/718LAfAbT2L._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/I/718LAfAbT2L._SY88.jpg"], "overall": 3.0, "vote": "13", "verified": true, "reviewTime": "12 9, 2016", "reviewerID": "AK9GN9KZZNTEP", "asin": "0020232233", "reviewerName": "Dallas Gamer Family", "reviewText": "My review will mirror others in that this kind of misses the mark and there are some lost opportunities to help DM's.  I wouldn't advise new DM's to use this by itself.  They should stick to the generic 5e DM screen and just copy/print the other useful information for SKT.\nI do like that the information they did put in the screen was relevant to the game and makes accessible some of the frequently visited tables from the adventure book.  I also like the map from the perspective that it contains the page references to the cities and locations. This is pretty useful, especially during Ch 3 of the adventure.\nHowever, there is a very Large amount of wasted space that could easily have been utilized instead of having the whole map take up 2 panels of the screen. The middle of the ocean could have contained info on the Giant hierarchy, the Giant Rune symbols, the Random encounters at Sea table from the DMG, trap tables, or any number of other usefully applicable information to the story.  I would have done away with the Sea portion of the map completely and used that space more efficiently.  In all actuality, the entire map could have been an extra insert, freeing up far more space and making this product far more appealing...or the Adventure book could have included it as a tear out.  There should have been better collaboration on this product.\nOn a different note, the printing on my copy of the screen was not sized correctly.  The Left and right creases are right over the edge of the words...especially on the Right side.  It is almost illegible when the screen is up and in it's general position at the gaming table.(See attached pic)\n\nI can understand the idea and desire to produce tailored DM Screens for these adventure books, but I don't feel they've truly taken the time to get feedback on their ideas from enough sources before printing. It's coming across as licensed money grab instead of a Value Add product to the adventure line.", "summary": "Another missed opportunity.  Not a value add to the product line.", "unixReviewTime": 1481241600}
{"overall": 5.0, "verified": true, "reviewTime": "12 7, 2016", "reviewerID": "A26HO01PDWN6O5", "asin": "0020232233", "reviewerName": "Amazon Customer", "reviewText": "Works very well", "summary": "Five Stars", "unixReviewTime": 1481068800}
{"overall": 5.0, "verified": true, "reviewTime": "11 5, 2016", "reviewerID": "A8PF4X87CS3ZZ", "asin": "0020232233", "reviewerName": "B. Felkins", "reviewText": "Can't wait to use it!", "summary": "Love the map!", "unixReviewTime": 1478304000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "11 4, 2016", "reviewerID": "A28QGCUNS22JPH", "asin": "0020232233", "reviewerName": "Daniel Gabriel Horton", "reviewText": "This is a campaign specific DM screen meant to work with The Storm Kings Thunder adventure.  It is not a general use screen.  The reason I'm  giving it 5 stars is that every named place on the map also has the page number of locations entry in TSKT. That feature has saved me time in Adventures League play. Other AL DMs will tell you how precious every minute is in the standard 2 hour format.", "summary": "Not a general DM screen", "unixReviewTime": 1478217600}
{"overall": 2.0, "vote": "3", "verified": false, "reviewTime": "04 24, 2017", "reviewerID": "A2X2RJWNAV4FM0", "asin": "038536539X", "reviewerName": "J Person", "reviewText": "This is one of the worst games I have ever played.  You basically have to come up with puns on the spot.  Not only are puns generally pretty bad, you have to generate puns that are worse than your run of the mill groaners.  I can't imagine many people enjoying it, but it is slow paced and generally does not generate any level of enjoyment unless you're very skilled with the English language.", "summary": "Very weak game", "unixReviewTime": 1492992000}
{"overall": 2.0, "vote": "6", "verified": true, "reviewTime": "04 17, 2017", "reviewerID": "A1DIRJ8YNI5TKL", "asin": "038536539X", "reviewerName": "ZacWolf", "reviewText": "It sounded like a really amazing concept, but when we tried to play it, it fell completely flat. Maybe if we were fans of the television show that the game is originally based upon? But having no \"prior experience\", we tried three rounds (even using the \"hints\" to get people started) and everyone just looked at each other and we decided to play something else. This was a high IQ group, and we often use puns in day to day banter, but the game just fell completely flat. :-(\n\nSad, because the quality of the box set is very nice, and comes with everything needed to play (pads, pencils, etc.).", "summary": "Fell completely flat...", "unixReviewTime": 1492387200}
{"overall": 5.0, "verified": true, "reviewTime": "01 26, 2017", "reviewerID": "A2G5IDD919P2DK", "asin": "038536539X", "reviewerName": "Marcy A. Danenmann", "reviewText": "Very fun game for my family", "summary": "Five Stars", "unixReviewTime": 1485388800}
{"overall": 4.0, "vote": "13", "verified": false, "reviewTime": "03 16, 2004", "reviewerID": "AGCAAWP1AVVZR", "asin": "0486277577", "style": {"Format:": " Paperback"}, "reviewerName": "M. P. Schiesl", "reviewText": "Pretty good book with a variety of unique card sleights (palming, manipulating cards in the deck, etc.). These sleights are the 'real work', so it will take a little perseverance. Many of these utility sleights are ones that you ought to know if you want to be a card sleight-of-hand worker.\nThe instructions are generally clear, but sometimes a detail here and there gets a little confusing. There's a fair number of photos showing how to do many of the sleights.\nSometimes a sleight is a little more complicated than it needs to be. My recommendation is to follow the author's steps in slow-motion with a deck of cards in hand. After you are familiar with the overall effect, you can make adjustments based on what your comfortable with. There may also be other newer methods for learning these sleights if you want to invest in newer card sleight instruction (such as the Daryl Encyclopedia of Card Sleights videos, etc.).\nRight now, I'm working on the side steal sleight. He gives a T. Nelson Downs version which has some merit, but it is much more complicated than necessary. The author's own version is a little more do-able. But even the author's method becomes a little too fidgety, so I've made minor modifications to make it work well for me. I start in slow-motion, counting through the substeps to keep pace while I do the move (1..2..3..4). Then I repeat it until I can bring it up to full speed.\nIf you want to learn sleights for cheap, try this book. You may have to pick and choose through the sleights, and there may be better methods to perform some of these sleights now, but it's not bad for under $10.", "summary": "Good book", "unixReviewTime": 1079395200}
{"overall": 5.0, "vote": "16", "verified": false, "reviewTime": "04 28, 2002", "reviewerID": "AD2CIUI4TSVY7", "asin": "0486277577", "style": {"Format:": " Paperback"}, "reviewerName": "Mark Thomas", "reviewText": "When I unexpectedly came across a picture of Buckley on the first page of the book, and after hearing the other reviews of how difficult and advanced the techniques in the book were, I couldn't believe my eyes. I was surprised to see the face of a handsome teenager, of which my previous impression was COMPLETELY the opposite to the one I held in my hands. And this guy was a professional card magician at the age of 18, and able to do tricks infront of hundreds of people on-stage in 1908!\nI have a feeling that this guy's mystery and skill probably gained him significant success with girls his age. The mysterious effects of these difficult to execute sleights are priceless and dazzling beyond belief. If a 3 columns card trick can make girls believe in magic.. then Buckley's stuff probably knocked their socks off... literally! Believe me, this guy would be able to blow David Blaine out of the water and make him look like Bob Longe.\nThat being said and out of the way, the book itself is amazing. There are very clearcut photos of Buckley's hands and very impressive card tricks, or as he calls them in the fourth section, \"Card Experiments\". Best of all, this book isn't like most others where the authors seem to purposely be vague (S.W. Erdnase) and not give the best descriptions. Mr. Buckley gives you every detail and is your friend throughout the book, showing you exactly how everything is done without any confusion.\nAnd there is SO much different good stuff in here, that you'll probably never need another book for advanced materials.\nIt is a great book and a great reference to help you on your way to card excellence and showmanship. You will not be disappointed with this purchase.", "summary": "Buckley was a card mommer", "unixReviewTime": 1019952000}
{"overall": 5.0, "vote": "14", "verified": false, "reviewTime": "08 3, 2001", "reviewerID": "APTEPFKL03QA0", "asin": "0486277577", "style": {"Format:": " Paperback"}, "reviewerName": "Christian A. Fisanick", "reviewText": "If you've mastered Hugard and Braue's stuff, if you can do 60 classic passes per minute, if you have all the time in the world to devote to card sleight of hand, then this is the book for you!  Seriously, this is a truly excellent book.  Buckley's sleights, though not for the faint of heart, are superb.  (He must've been one heckuva cardician!) This is a serious, serious card magic book.  But if you are serious yourself, you'll get it.  Of course, you'll overlook the antiquated prose and Buckley's tremendous ego throughout.  (When you read this material you'll forgive Buckley's self-congratulatory tone.) This is a splendid work for those who want to be the best...", "summary": "Very advanced, but as good as it gets", "unixReviewTime": 996796800}
{"overall": 5.0, "vote": "21", "verified": false, "reviewTime": "10 15, 2000", "reviewerID": "A14FXEKB1PXTZG", "asin": "0486277577", "style": {"Format:": " Paperback"}, "reviewerName": "Jose Berlin", "reviewText": "I've yet to see a bad review for this book, and there's a reason. This book is terrific. There is however one issue to be addressed. This book is hard!!! Definitely not for beginners, it has some of what I believe are the greatest but hardest card manipulations out there. I definitely recommend it however to the serious card magic enthusiast. There are enough valuable ideas in here to last you a lifetime.", "summary": "You better know what you're getting into", "unixReviewTime": 971568000}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "09 21, 2007", "reviewerID": "A1X9QQFMPGDW70", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "Justabuyer", "reviewText": "I don't know how well they work, if they're a miracle, they're too expensive for the quantity.  When I opened it, I thought they'd forgotten to send the tatoos.\n10 for 3.50 makes this the ultimate \"skimpy product\".", "summary": "Don't bother", "unixReviewTime": 1190332800}
{"overall": 1.0, "vote": "2", "verified": false, "reviewTime": "01 16, 2007", "reviewerID": "A1NTAPB1XPB6KK", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "Mandible", "reviewText": "These are cute tatoos for those who love pirates, however, the retail price is $1.50 and Amazon's price is MORE THAN DOUBLE.  I have never paid OVER the retail price for an item at Amazon.  I was shocked.  There are only a handful of tatoos, and for 1.50 I wouldn't mind, but to charge 3.50 for an item that sells anywhere else for 1.50 is criminal.  Find it at a local drugstore and save your $.", "summary": "The worst value I've ever seen", "unixReviewTime": 1168905600}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "01 12, 2007", "reviewerID": "A34S86H4OJGGVR", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "An Aerospace Engineer", "reviewText": "While my 3 year old son liked th tattos you'd think that a few more could be supplied.  I think there were something akin to 8-10 total.  A few more skull and cross bone flags would be nice.\n\nThe tattoos did seem to transfer well but didn't last longer or less than most other temporary tattoos.", "summary": "Not enough product", "unixReviewTime": 1168560000}
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "01 10, 2007", "reviewerID": "A2SGKF4BT5NWYO", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "Mauricio De Maria Campos", "reviewText": "There are only few tatoos so in one week they are gone, it could be better if there were more so they can share with brothers or friends. the alternative is to buy like 4 or 5 of these so the kid doesn't get upset when they are gone to quick. Also with one bath they are gone, so they don't last enough like other tatoos (2 TO 5 DAYS).", "summary": "Good product but...", "unixReviewTime": 1168387200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "11 3, 2006", "reviewerID": "AVPT4Q2E2PK9O", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "Derrick", "reviewText": "I'd buy again as a gift for a young kid obsessed with pirates.  However, I never actually had any hands-on time with the tattoos.  The tattoos reminded me of my favorite Cracker Jack prize.", "summary": "Temporary Tattoos were good gift.", "unixReviewTime": 1162512000}
{"overall": 5.0, "vote": "7", "verified": false, "reviewTime": "09 20, 2005", "reviewerID": "A17AF3GZQEKMYC", "asin": "0486402029", "style": {"Format:": " Paperback"}, "reviewerName": "J. Mag", "reviewText": "My young son was thrilled to have tattoos just like a real pirate.  These are easy to use and remove.  I great find!", "summary": "Huge Hit", "unixReviewTime": 1127174400}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2015", "reviewerID": "A2GH1A5JGI8PUN", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Tara", "reviewText": "Gorgeous, I love the book and the pictures are beautiful!", "summary": "Gorgeous pictures!", "unixReviewTime": 1421107200}
{"overall": 5.0, "verified": true, "reviewTime": "08 21, 2014", "reviewerID": "AOJTIHPYWGGHQ", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Kindalyn Phelps", "reviewText": "Beautiful art work", "summary": "Five Stars", "unixReviewTime": 1408579200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 14, 2014", "reviewerID": "A38U7ERUZCBOJ5", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Joanne Philip Battiston", "reviewText": "These are intricate designs for older children and adults. This book is full of beautiful designs just waiting to be awakened by your choice of colors. Great for creativity.", "summary": "Wonderful designs.", "unixReviewTime": 1407974400}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "08 7, 2014", "reviewerID": "A12VWMI909LC3Y", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "sharon wheeler", "reviewText": "This coloring book was so much fun to color.  I love the fact that you can color both sides & blend the colors!!!!  I would recommend this book for anyone that loves Wizards & Dragons & loves to color with fantastic results!!!!!!!!!!\nSharon", "summary": "WOW, GREAT COLORING BOOK!!!!!!", "unixReviewTime": 1407369600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "10 6, 2013", "reviewerID": "A2LSCFZM2FBZK7", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Ginger", "reviewText": "The stained glass pages are pretty cool. And it is nice how the black outlines are super dark and thick. And that the dragons aren't all fighting with the wizards.", "summary": "Nice book", "unixReviewTime": 1381017600}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "08 9, 2013", "reviewerID": "A3IXP5VS847GE5", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Dragonflies &amp; Autumn Leaves", "reviewText": "My 11 y.o. loved this...and so do I (you know I really bought this because I wanted to see the pictures myself...I'm just lucky enough to have someone I could justify buying it as a present for.)\nDragons and Wizards...says it all!  With the wonderful see-through vellum like pages, that make it \"stained glass.\"  Color it with marker, or anything else really (colored pencil, watercolors maybe), and the light shining through the page makes it look luminous and gorgeous!\n\nEven the perfectionist that gets intimidated with art and drawing tends to find these stained glass books easy to get results they are happy with, so it tends to be an enjoyable and confidence building experience. :)", "summary": "Great pictures", "unixReviewTime": 1376006400}
{"overall": 5.0, "verified": false, "reviewTime": "12 25, 2012", "reviewerID": "A22WPJ8XFBR00Z", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Douglas B. McFarling", "reviewText": "Awesome! My 8 year old's favorite Xmas gift! It's 9:15 am xmas morning and he's already colored three of these!!", "summary": "Perfect!", "unixReviewTime": 1356393600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "08 18, 2010", "reviewerID": "AYLMHOQOT0S4N", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "C. Murphy", "reviewText": "This book has wonderful pictures in it, from dragons to wizards. It is much more than just a coloring book. Very pleased and do recommend it for all ages.", "summary": "Well done....", "unixReviewTime": 1282089600}
{"overall": 5.0, "vote": "10", "verified": false, "reviewTime": "09 16, 2008", "reviewerID": "AJ8YOQ9V6WTQM", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Kimberely J. Hardy", "reviewText": "I loved this book. the pictures are suitable to hang in windows or glass doors and the pictures really reflect the light. I recomend this for all ages who love art.", "summary": "My relaxation", "unixReviewTime": 1221523200}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "02 6, 2007", "reviewerID": "A1GGAQIGLJ9PJ0", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "A. Freeman", "reviewText": "I bought this for my son who loves to draw.  The pictures are simply beautiful and it is a unique way to produce a coloring book.", "summary": "Beautiful coloring book", "unixReviewTime": 1170720000}
{"overall": 5.0, "verified": true, "reviewTime": "04 5, 2016", "reviewerID": "A1274GG1EB2JLJ", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "barbara ann", "reviewText": "The pictures are great , I've done one and gave it to a friend of mine who likes dragons.", "summary": "The pictures are great, I've done one and gave it to a ...", "unixReviewTime": 1459814400}
{"overall": 5.0, "verified": true, "reviewTime": "03 20, 2016", "reviewerID": "AY0ZTKGL6YRVP", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Samantha A.", "reviewText": "Great buy! Can't wait to work on this book. The dragon images are lovely.  Once I'm done coloring, I will frame and hang in a window to let the sun shines through.", "summary": "Great buy! Can't wait to work on this book", "unixReviewTime": 1458432000}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "03 4, 2016", "reviewerID": "A2UJW1N1C1EWZ1", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Cassiopeia", "reviewText": "Holy cow! Ok, so we use Sharpies to color, and this book is AMAZING! We color one side, and the colors transform on the other side. It's so cool, even my husband colors! The designs are great (and I'm a snob) and the price is VERY good for such a cool product.", "summary": "Stained Glass Perfection!", "unixReviewTime": 1457049600}
{"overall": 4.0, "verified": true, "reviewTime": "02 18, 2016", "reviewerID": "A3BUUV7JLOVSF9", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "SF", "reviewText": "I gave this as a Christmas present and it seems it went over quite well.", "summary": "Four Stars", "unixReviewTime": 1455753600}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "02 13, 2016", "reviewerID": "A30X5EGBYAZQQK", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Samantha", "reviewText": "I absolutely love this book! Its translucent paper make it super fun to use. I have been using Paint Brush Markers and Sakura Gel Pens on it with excellent quality. The only thing that I would recommend is a blank white sheet of paper to make the lines easier to see.", "summary": "So beautiful!", "unixReviewTime": 1455321600}
{"overall": 5.0, "verified": true, "reviewTime": "02 2, 2016", "reviewerID": "A3N2A0YZYWZJ55", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Phil Pickett", "reviewText": "Wow, great images on vellum, got this for my husband. He used a combination of colored pencil and marker for pictures, they are beautiful.", "summary": "Great pictures", "unixReviewTime": 1454371200}
{"overall": 5.0, "verified": true, "reviewTime": "01 4, 2016", "reviewerID": "A1FI4XG4R6BCB4", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "MRMoore", "reviewText": "Very nice book. Just wished there was more pages. Can't wait too start using it.", "summary": "Very Nice!", "unixReviewTime": 1451865600}
{"overall": 5.0, "verified": true, "reviewTime": "12 10, 2015", "reviewerID": "A3U6UNXLAUY6ZV", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "CP in Texas", "reviewText": "I love it!", "summary": "Five Stars", "unixReviewTime": 1449705600}
{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2015", "reviewerID": "A11Z603ZIPLVWN", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Absolutely great pictures even before coloring!", "summary": "Five Stars", "unixReviewTime": 1447027200}
{"overall": 5.0, "verified": true, "reviewTime": "11 7, 2015", "reviewerID": "AO4V4WNNOIO1", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Menolly", "reviewText": "Great purchase and got it in good time.", "summary": "Five Stars", "unixReviewTime": 1446854400}
{"overall": 5.0, "verified": true, "reviewTime": "10 26, 2015", "reviewerID": "A1SAJF5SNM6WJS", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "LOIS LABIER", "reviewText": "MY HUSBAND LOVED IT. HE IS IN TO DRAGONS.", "summary": "Five Stars", "unixReviewTime": 1445817600}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2015", "reviewerID": "A6K7LYRKJDBSC", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "swiftysue", "reviewText": "The dragons are really interesting and fun to color.", "summary": "Five Stars", "unixReviewTime": 1445040000}
{"overall": 5.0, "verified": true, "reviewTime": "10 12, 2015", "reviewerID": "A2HK5AVQW6AUQ5", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "scootergirl1952", "reviewText": "love it", "summary": "Five Stars", "unixReviewTime": 1444608000}
{"overall": 4.0, "verified": true, "reviewTime": "09 15, 2015", "reviewerID": "AHJWO3SI0S0OR", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Saundra Hatley", "reviewText": "cool", "summary": "Four Stars", "unixReviewTime": 1442275200}
{"overall": 3.0, "verified": true, "reviewTime": "09 7, 2015", "reviewerID": "A3UMI9SLWY2MKA", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "mary frasier", "reviewText": "It's fun.", "summary": "Three Stars", "unixReviewTime": 1441584000}
{"overall": 5.0, "vote": "77", "verified": true, "reviewTime": "07 29, 2015", "reviewerID": "A1LNKKDBF2KOK3", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "M. Downey", "reviewText": "<div id=\"video-block-R3BD06E4PUN30\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/B141O4IiwKS.mp4\" class=\"video-url\"><input type=\"hidden\" name=\"\" value=\"https://images-na.ssl-images-amazon.com/images/I/810gEm9-iYS.png\" class=\"video-slate-img-url\">So many times I've purchased something based on liking a sample (books, albums, whatever) then it turns out that the best thing about the item was the sample.  That is not the case with this Wizards and Dragons stained glass coloring book.\n\nI hesitated to buy this coloring book for fear I wouldn't like the majority of the images, but to my pleasant surprise, every page contains an image I like.  So, I'm posted this quick video review for anyone else like myself, who might be considering this item, but is hesitating due to not knowing what all the images are.  Hope this helps someone.", "summary": "I Like Every Image Contained In This Stained Glass Coloring Book", "unixReviewTime": 1438128000}
{"overall": 5.0, "verified": true, "reviewTime": "07 13, 2015", "reviewerID": "A2Y9ADG1ST9LWT", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "It was so cool the way the pages are transparent so that the coloring shows through and can be hung in a window as a stained glass picture.", "summary": "Creative stained glass pictures", "unixReviewTime": 1436745600}
{"overall": 5.0, "verified": true, "reviewTime": "05 24, 2015", "reviewerID": "ALLSNTNR6N6UL", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Exactly as described, nice pictures, great transaction, thank you!", "summary": "nice pictures, great transaction", "unixReviewTime": 1432425600}
{"overall": 3.0, "verified": true, "reviewTime": "04 19, 2015", "reviewerID": "A3UQFJSEAPSO0G", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Richard D. Chapman", "reviewText": "5 stars for the delivery. Got it in 2 days after I ordered it. Wow!! As for the coloring book itself, the pages are perforated and you can see through them and your crayons/ pencils show through to the other side. Putting cardboard or a thick piece of paper in between the pages will avoid that. Drawings are nice and you can put them in your windows when done. Thus the perforated pages and thin paper.", "summary": "Drawings are nice and you can put them in your windows when ...", "unixReviewTime": 1429401600}
{"overall": 5.0, "verified": true, "reviewTime": "02 18, 2015", "reviewerID": "A1MWAQOCENQQ5K", "asin": "0486427706", "style": {"Format:": " Paperback"}, "reviewerName": "Robert Cole", "reviewText": "Great!", "summary": "Five Stars", "unixReviewTime": 1424217600}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "04 20, 2011", "reviewerID": "A18MVTKTTE8OS8", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "JudiAU", "reviewText": "Sometimes you need something new and special that gives you 30 minutes of piece. I used these waiting at the dentist or a graduation or something. They are small so they slip into a bag and cheap enough, especially with the 3 for 4 price on amazon.com . The robots and funny faces are a lot of fun. Probably best at 3-4-5 rather than 2 because the stickers are small.\n\nI love all of the great not-licensed-character stuff by Dover.", "summary": "Great 30 minute toy", "unixReviewTime": 1303257600}
{"overall": 5.0, "verified": false, "reviewTime": "04 2, 2011", "reviewerID": "A2C2TLRMMMLAJV", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "D. Workman", "reviewText": "These little books are great! They are small, but perfect for birthday party favors, which is what we used them for! There is a blank page after each page of stickers, so that's where my kids made their robots. They were a huge hit!", "summary": "great!", "unixReviewTime": 1301702400}
{"overall": 2.0, "vote": "4", "verified": true, "reviewTime": "02 7, 2011", "reviewerID": "APTGPJM3QRMHT", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "thunification", "reviewText": "This is indeed a small book. This particular ROBOT sticker book was at best, OK.\nWhy? Well, there's really no space to create multiple robots. Stickers are not easy to remove.\nNot recommended unless you just gotta have it to entertain a child. But this may only last ten minutes.\nPlus side, small enough to stick in purse for travel.", "summary": "Only OK ...AT Best", "unixReviewTime": 1297036800}
{"overall": 4.0, "verified": false, "reviewTime": "02 11, 2010", "reviewerID": "AJL8EN4QAFA9K", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "A. V. Richards", "reviewText": "I bought several of these as party favors at a robot themed birthday party.  My son really seemed to like it and made a series of different robots.  The only issue is that most of the pages are not such that they stickers can be re-stuck so we really only used most of the configurations once as we made them on regular pages rather than taking pieces on and off the robot at the back of the book.", "summary": "Fun!", "unixReviewTime": 1265846400}
{"overall": 5.0, "verified": true, "reviewTime": "01 30, 2010", "reviewerID": "A311D6DHG4VFZ9", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "The Z&#039;s", "reviewText": "I was happy to find this little sticker book.  Inside were facial features & other stickers. The size was just right to use with a robot kit we had found .The grandson was very happy with the whole gift.\n I'd read another review how these little sticker books were given out as birthday party favors. For the price it's a good deal & good product.", "summary": "Robot themed gift for 6 yr old", "unixReviewTime": 1264809600}
{"overall": 4.0, "vote": "21", "verified": false, "reviewTime": "12 2, 2008", "reviewerID": "A158E7P5QO99Z8", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "John Lopez", "reviewText": "We had a robot themed first birthday party for our son, and had a really tough time finding little robot items for the guest thank-you bags. Stumbled upon this and took a chance. They were perfect! The book is small, maybe 4x6, and includes stickers of robot arms, legs, heads, etc. that the children can use to build a robot. They were a hit!", "summary": "Great Party \"Thank You\" Bag Addition", "unixReviewTime": 1228176000}
{"overall": 2.0, "vote": "4", "verified": true, "reviewTime": "07 10, 2007", "reviewerID": "A185NXJQ704COK", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Mountainlady", "reviewText": "I thought this would be much bigger.  It's more like a little stocking stuffer.  My kids were 5 and 9, and neither really took to the book.  I'd recommend it for even younger children.", "summary": "tiny book", "unixReviewTime": 1184025600}
{"overall": 1.0, "verified": true, "reviewTime": "08 16, 2015", "reviewerID": "A3O6CP5TT54LJE", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Gaby", "reviewText": "total waste of money. the stickers do not stick down even once\nit is just a tiny amount of stickers which do not work, and that is basically it. I thought the backgrounds would make this special but it just is tiny and does not work.\nmuch better to simply buy packs of stickers and use paper\nthe activity books in this series are better", "summary": "save your money", "unixReviewTime": 1439683200}
{"overall": 5.0, "verified": true, "reviewTime": "06 17, 2015", "reviewerID": "A216BPGO0ZBR5N", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "jean", "reviewText": "Nephew, age 5 loved the booker.", "summary": "age 5 loved the booker", "unixReviewTime": 1434499200}
{"overall": 5.0, "verified": true, "reviewTime": "06 10, 2015", "reviewerID": "A3OJCR7TKQIPQM", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "PQ", "reviewText": "Very Cute!", "summary": "Very Cute!", "unixReviewTime": 1433894400}
{"overall": 2.0, "verified": true, "reviewTime": "06 1, 2015", "reviewerID": "AMDBW1NOR5ZP7", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Oggs", "reviewText": "The book is just stickers, it is NOT an activity book. Each sheet of sticker consist of the many pieces to create one robot and there are about four or five robots. So you could create one or multiple robots from the many sticker pieces in this book. There is only one page that doesn't have any stickers and if you are trying to make a robot from the stickers in the books you can only fit one robot in that page.\n\nWe thought the small size would be great for their little hands, but If you buy this as an activity book it just doesn't work and I would give it one star because there are no activities in it and your child will need a separate book to put all of the stickers.\n\nIf you buy this just for the stickers, they are fun but at $4.00 (current price on Amazon) it doesn't work either, four dollars is a lot of money for these stickers. At that price you are better off buying a sticker activity book from \"early learning\" or \"My Little World\" they are great little books.\n\nI would not recommend this children's book by Dover Publications because of its high cost and very little content.", "summary": "Just sticker at a premium", "unixReviewTime": 1433116800}
{"overall": 1.0, "verified": true, "reviewTime": "04 19, 2015", "reviewerID": "A11B2ZTVBJ33A5", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "joann mccormack", "reviewText": "My grandson loved this book, he is all about robots and how they work, fun ideas for him to share with a friend.", "summary": "My grandson loved this book", "unixReviewTime": 1429401600}
{"overall": 3.0, "verified": false, "reviewTime": "03 31, 2015", "reviewerID": "A2DSZOLDOG70GC", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Kalistah", "reviewText": "This is pretty much just an average sticker book.  It is cute, but didn't have as much variety as I had hoped.  For the price, it is worth it though, my son will enjoy making his own sticker robot.", "summary": "This is pretty much just an average sticker book", "unixReviewTime": 1427760000}
{"overall": 5.0, "verified": true, "reviewTime": "03 31, 2015", "reviewerID": "A2UYZHZA7U16BZ", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "B. Bigart", "reviewText": "This is a great book to throw in your bag to have while waiting in line or at a restaurant with a small, alternately bored and energetic,person. My 3-year-old loves that she can put together robots using different parts and create her own or match the pieces to the picture on the back cover. This is a very small book -really a pamphlet almost - which is the best part actually.", "summary": "This is a great book to throw in your bag to have while ...", "unixReviewTime": 1427760000}
{"overall": 5.0, "verified": true, "reviewTime": "03 18, 2015", "reviewerID": "A1ZXYT6S1SZ087", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "sandy lindquist", "reviewText": "AGE APPROPIATE. G'SON LOVED", "summary": "Five Stars", "unixReviewTime": 1426636800}
{"overall": 4.0, "verified": true, "reviewTime": "03 16, 2015", "reviewerID": "A3K4NTIXV7Z559", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "TexasVaughans", "reviewText": "its a cute little book, but it's a tiny little guy.", "summary": "Tiny", "unixReviewTime": 1426464000}
{"overall": 3.0, "verified": true, "reviewTime": "03 5, 2015", "reviewerID": "A3SHG02AS5DRSA", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "The Stig", "reviewText": "This is a tiny book. Only a few pages of stickers. The stickers don't stick very well after the first time placing them. It did however entertain my son during a trip. Stickers for making 4 different robots, all different colors. I would suggest it for younger kids, my son is 3.", "summary": "Worked for a trip, Only a few pages", "unixReviewTime": 1425513600}
{"overall": 4.0, "verified": true, "reviewTime": "03 2, 2015", "reviewerID": "A1RCJMO8HR648A", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Ellen Rea", "reviewText": "This was a gift; have not heard how it worked out.", "summary": "Four Stars", "unixReviewTime": 1425254400}
{"overall": 2.0, "verified": true, "reviewTime": "02 17, 2015", "reviewerID": "A1U19YWKMAXYO7", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "SuchaGoodDeal", "reviewText": "Although $1.99 isn't much, it was disappointing to see this small booklet (4 pages) of stickers. Should have read details more closely.", "summary": "Should be a buck at Dollar Store!", "unixReviewTime": 1424131200}
{"overall": 2.0, "verified": true, "reviewTime": "02 15, 2015", "reviewerID": "A3EAVL6N8Q6MOA", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "SharSteg", "reviewText": "They were ok but not really considered it a book. Really small disappointed!", "summary": "Really small disappointed!", "unixReviewTime": 1423958400}
{"overall": 5.0, "verified": true, "reviewTime": "02 11, 2015", "reviewerID": "A3BVLVRFQNOM2R", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "eyebanks", "reviewText": "Great for kindergarten birthday goody bag.", "summary": "Five Stars", "unixReviewTime": 1423612800}
{"overall": 4.0, "verified": true, "reviewTime": "02 2, 2015", "reviewerID": "A1IJQ1P01VQD8E", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Sara", "reviewText": "This book is very cute but make sure you look at the size it's very small don't anticipate anything large.", "summary": "Small book", "unixReviewTime": 1422835200}
{"overall": 5.0, "verified": true, "reviewTime": "01 30, 2015", "reviewerID": "A15UXQOOJ0TL8K", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Vitor Augusto Boschetti Barbieri", "reviewText": "Good product", "summary": "Five Stars", "unixReviewTime": 1422576000}
{"overall": 5.0, "verified": true, "reviewTime": "01 29, 2015", "reviewerID": "A2S8YV63JSMREY", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Secret Rose", "reviewText": "Great fun for my grandson who loves robots.", "summary": "Five Stars", "unixReviewTime": 1422489600}
{"overall": 5.0, "verified": true, "reviewTime": "01 29, 2015", "reviewerID": "AL3UBB9FK67Z9", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "emilysometimes", "reviewText": "My daughter loves these little books.  They're the perfect size to keep in the car or a diaper bag or purse.  I keep them on hand for times when we're stuck waiting in a doctor's office or anywhere else.", "summary": "They're the perfect size to keep in the car or a diaper ...", "unixReviewTime": 1422489600}
{"overall": 4.0, "verified": true, "reviewTime": "01 18, 2015", "reviewerID": "AI3JLLMYH16NZ", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Laura Snelson", "reviewText": "This was a stocking stuffer for my son.  It was cute and he enjoyed using it a couple of times.  For the price of a little over a dollars didn't mind that he only used it a few times.  It is hard to tell from the picture but this is small.", "summary": "It was cute and he enjoyed using it a couple of times", "unixReviewTime": 1421539200}
{"overall": 4.0, "verified": true, "reviewTime": "12 10, 2014", "reviewerID": "A7RX7ZLYMRYOR", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "HeroMom", "reviewText": "Very fun on the plane for my 3 & 5 year olds.", "summary": "Four Stars", "unixReviewTime": 1418169600}
{"overall": 5.0, "verified": true, "reviewTime": "12 5, 2014", "reviewerID": "A2KBV1CL6U7CBV", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Debra S. Overfield", "reviewText": "Fun gift", "summary": "robot", "unixReviewTime": 1417737600}
{"overall": 3.0, "verified": true, "reviewTime": "12 1, 2014", "reviewerID": "ARA6ZCG8TL49K", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "C. Mellom", "reviewText": "I was very surprised to see how tiny the book was.  I probably should have looked at the reviews or the description closer.  I guess it's a stocking stuffer now...", "summary": "I was very surprised to see how tiny the book ...", "unixReviewTime": 1417392000}
{"overall": 5.0, "verified": true, "reviewTime": "11 24, 2014", "reviewerID": "AS88XU0QRN79Z", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Kipperdale", "reviewText": "I buy these books to insert in cards to send to my grandsons. They love them.", "summary": "Lots of Fun for a small amount of money", "unixReviewTime": 1416787200}
{"overall": 5.0, "verified": true, "reviewTime": "11 19, 2014", "reviewerID": "ARMU5CK7T1RZ9", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Olive", "reviewText": "great book", "summary": "Five Stars", "unixReviewTime": 1416355200}
{"overall": 5.0, "verified": true, "reviewTime": "11 11, 2014", "reviewerID": "A3LDN8D925FPJF", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "lee  eckhoff", "reviewText": "Small book but great stickers", "summary": "Five Stars", "unixReviewTime": 1415664000}
{"overall": 5.0, "verified": true, "reviewTime": "11 10, 2014", "reviewerID": "AO0J4Z9FJHNQV", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Christi", "reviewText": "This was a great little activity book. There are only a few pages, but it was awesome for a birthday party give-away and bought me quite a bit of time at a doctor's office.", "summary": "This was a great little activity book", "unixReviewTime": 1415577600}
{"overall": 5.0, "verified": true, "reviewTime": "10 22, 2014", "reviewerID": "A2G7033C3Z61KL", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Pamela D. Jones", "reviewText": "Grandson loved it", "summary": "Five Stars", "unixReviewTime": 1413936000}
{"overall": 1.0, "verified": true, "reviewTime": "10 13, 2014", "reviewerID": "A194LPKQWHUMRI", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "FBrown", "reviewText": "Contains enough stickers to create a tiny robot. Not really worth buying.", "summary": "One Star", "unixReviewTime": 1413158400}
{"overall": 3.0, "verified": true, "reviewTime": "10 11, 2014", "reviewerID": "A3OCGSK51IMAU8", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "PATRICIA A VOGEL", "reviewText": "Thought it would be larger. A four year old's fingers might have trouble.  However it is a great idea.", "summary": "However it is a great idea.", "unixReviewTime": 1412985600}
{"overall": 5.0, "verified": false, "reviewTime": "09 17, 2014", "reviewerID": "AE11PXVIP0EAX", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "digi", "reviewText": "This little book is so cute! My kids love it. The cover of the book is a slick surface so you can peel the stickers off and start over again. The inside of the back cover has a robot base you can use to build off of if you so choose.", "summary": "Getting a surprising amount of use out of this little thing", "unixReviewTime": 1410912000}
{"overall": 5.0, "verified": true, "reviewTime": "09 12, 2014", "reviewerID": "A1NVBHOKOP8N9G", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Nancy Baudry", "reviewText": "This is a small book", "summary": "Five Stars", "unixReviewTime": 1410480000}
{"overall": 5.0, "verified": true, "reviewTime": "09 10, 2014", "reviewerID": "A2D61RN2CV9UDH", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amanda E. Gilmore", "reviewText": "great", "summary": "Five Stars", "unixReviewTime": 1410307200}
{"overall": 5.0, "verified": true, "reviewTime": "09 6, 2014", "reviewerID": "A1NH7LYE1XIICF", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "karen", "reviewText": "a wonderful little sticker book that i put with the robot two sided puzzle in a busy bag for a 3 year old.", "summary": "a wonderful little sticker book that i put with the robot ...", "unixReviewTime": 1409961600}
{"overall": 5.0, "verified": true, "reviewTime": "08 30, 2014", "reviewerID": "A1RLLTUBCFQV22", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Paula the Gourmet", "reviewText": "This was gift for a highly intelligent 4 year old boy who is interested in Robots.  The illustrations are cute, and the peel and stick accessories are reusable.  He enjoys playing with it.", "summary": "A fun activity book for 4-6 year olds", "unixReviewTime": 1409356800}
{"overall": 4.0, "verified": true, "reviewTime": "08 27, 2014", "reviewerID": "A3SSAXHVN3J2YL", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Flutterby420", "reviewText": "Cute little book. Wish there was a little more to it, but can't beat it for the price.", "summary": "Won't keep them occupied for long", "unixReviewTime": 1409097600}
{"overall": 2.0, "verified": true, "reviewTime": "08 19, 2014", "reviewerID": "A2L6E8ZFLSK158", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "L.Grady", "reviewText": "Smaller than we thought, kind of disappointed in it.", "summary": "Smaller than thought", "unixReviewTime": 1408406400}
{"overall": 5.0, "verified": true, "reviewTime": "08 3, 2014", "reviewerID": "A3H0AW7EAWQEWT", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Kindle Customer", "reviewText": "Inspiring creativity!!", "summary": "Fun!", "unixReviewTime": 1407024000}
{"overall": 4.0, "verified": true, "reviewTime": "07 27, 2014", "reviewerID": "A2GA8TO2HJEU30", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Added this for my son's 3rd birthday present. He had a blast creating his own robots and it lasted for nearly an hour. There are only a few pages, and it would be nice to get more stickers, but I would say it was worth the smiles.", "summary": "and it would be nice to get more stickers", "unixReviewTime": 1406419200}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "07 4, 2014", "reviewerID": "A3CZVHWCZACLM", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Tamara Ramsey", "reviewText": "The book is only 4 pages and it's about the size of a 3x5 note card... not much fun at all.", "summary": "Small and boring", "unixReviewTime": 1404432000}
{"overall": 5.0, "verified": true, "reviewTime": "07 4, 2014", "reviewerID": "A1PUUL79303A4T", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Janet M Eppers", "reviewText": "Very nice product.", "summary": "Five Stars", "unixReviewTime": 1404432000}
{"overall": 3.0, "verified": false, "reviewTime": "05 19, 2014", "reviewerID": "A2EL4KWP8JDJC3", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Jori Borchert", "reviewText": "I was surprised at the size.  If it was on the information I missed it.  The drawings are cute.  Haven' tried it on a child yet.", "summary": "Size is off", "unixReviewTime": 1400457600}
{"overall": 2.0, "verified": true, "reviewTime": "03 31, 2014", "reviewerID": "A25UOSQ1II09QA", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "cmeyers", "reviewText": "It's a bit thin, was expecting more. There is a robot in the back and you cover him with new stickers, the stickers are almost like clothes instead of actual robot parts. It would be nice if there was a section of heads, section of bases and torsos and you could combine them together to build unique robots. You are supposed to put the stickers back in the book when you are finished, I doubt that will work with my son. We will see how long this lasts, I am going to guess about 5 minutes.", "summary": "A pretty thin book of 38 stickers.", "unixReviewTime": 1396224000}
{"overall": 3.0, "verified": true, "reviewTime": "03 21, 2014", "reviewerID": "A1CP9G7FJPQJXY", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "esophian", "reviewText": "i think there are 4 robots in here to build. i was expecting a lot more. oh well! gotta steer clear of the \"little\" books.", "summary": "great scenes, but not many of them", "unixReviewTime": 1395360000}
{"overall": 4.0, "verified": true, "reviewTime": "03 16, 2014", "reviewerID": "A3FEZU57GLQYQI", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "MLewisK", "reviewText": "Most of the Dover Little Books are high quality. I use them to get those few more dollars for free shipping. My grandsons enjoy looking to find one.  They will play with duplicates of ones  they received before.", "summary": "\"Engineering fun for little ones", "unixReviewTime": 1394928000}
{"overall": 5.0, "verified": true, "reviewTime": "03 8, 2014", "reviewerID": "A12EP076ETOAKP", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Kara Lobbestael", "reviewText": "This create your own robot sticker book is exactly what I was hoping it would be!  I would definitely recommend this to any sticker collector (such as myself) or to any parent/grandparent/aunt/uncle buying this is a gift for a kid! Seven thumbs up!", "summary": "Love it!", "unixReviewTime": 1394236800}
{"overall": 5.0, "verified": true, "reviewTime": "03 1, 2014", "reviewerID": "A3C7G5BVYWVTTM", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "M Coffin", "reviewText": "My four year old robot lover had fun with this.  His five year old brother loved it, too.  It didn't provide hours of entertainment, more like minutes, but it was a fun stocking stuffer and they really appreciated it.", "summary": "Fun for little ones", "unixReviewTime": 1393632000}
{"overall": 4.0, "verified": true, "reviewTime": "03 1, 2014", "reviewerID": "A24EI07FMP7DGH", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Fits perfectly in a party favor bag. Really great for travelling and any kids who like stickers will love dressing up the robot. The stickers do loose their stickiness after a couple of times but since there are a couple of robot \"outfits,\" it's feel like it's worth the price. It would be nice if there was a special deal in buying in bulk.", "summary": "Cute party favor item", "unixReviewTime": 1393632000}
{"overall": 3.0, "verified": true, "reviewTime": "02 27, 2014", "reviewerID": "A2MRM5FWJCKK9R", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Peter", "reviewText": "This book is probably smaller than you think. Only a few pages, and will entertain a kid for 10-30 mins depending on their imagination. At less than $2 I can think of worse ways to spend money on a kid. Although Legos are probably a better investment because everyone loves playing with legos for years, and years.", "summary": "Hey, Robots are cool!", "unixReviewTime": 1393459200}
{"overall": 5.0, "verified": true, "reviewTime": "01 22, 2014", "reviewerID": "A148Y89ISWOPLD", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "j", "reviewText": "My 3 year old niece loves robots. She loved playing with this sticker book. It's a small pocket type book - they are inexpensive, I would advise buying more than one. Great for entertaining them on trips, outings etc.", "summary": "Fun for a 3 year old", "unixReviewTime": 1390348800}
{"overall": 4.0, "verified": true, "reviewTime": "12 20, 2013", "reviewerID": "A3G8TUSMOASPSB", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "TxChik", "reviewText": "I added this to a birthday present for my 3-year old nephew. He loved it, but I was surprised at how small this was. In the back, there is a picture of a robot, and you \"dress\" him using the stickers.", "summary": "Nice, but very small", "unixReviewTime": 1387497600}
{"overall": 5.0, "verified": true, "reviewTime": "12 17, 2013", "reviewerID": "A2X3URUQBF9EU4", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Pat", "reviewText": "If you have a child interested in robots this is a fun activity for them.  It allows the child to build a robot with colorful stickers.", "summary": "This is a little sticker book for a little kid?", "unixReviewTime": 1387238400}
{"overall": 5.0, "verified": true, "reviewTime": "12 9, 2013", "reviewerID": "A24VPJFSMGU686", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Holly", "reviewText": "This is a VERY small book, but for $2, it was a fun 10 minute activity for my robot loving 3 year old.", "summary": "Cute", "unixReviewTime": 1386547200}
{"overall": 5.0, "verified": true, "reviewTime": "11 26, 2013", "reviewerID": "ASIJ3I1CRGQD6", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "OP", "reviewText": "Very interesting. Is creative, increase knowledge and hours of entertainment. Bought for my grandson for Christmas. I know that he will enjoy it very much.", "summary": "Hours of entertaintment.", "unixReviewTime": 1385424000}
{"overall": 5.0, "verified": true, "reviewTime": "11 24, 2013", "reviewerID": "A9CU9PW2VQT8Q", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Ms. Mary", "reviewText": "This was a great little book for my Robot \"Boy's Night\" Party. Loved the robot craft in the back of the book:) Great price!", "summary": "Robot Time", "unixReviewTime": 1385251200}
{"overall": 4.0, "verified": true, "reviewTime": "11 16, 2013", "reviewerID": "A1V5E2LYHO5EO4", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Becky", "reviewText": "I bought this as a Christmas gift for my grandson.  Its a sticker book. So how can I go wrong with this gift.", "summary": "Stickers", "unixReviewTime": 1384560000}
{"overall": 2.0, "verified": true, "reviewTime": "10 18, 2013", "reviewerID": "A3JR8YFXZQQBU0", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Not sure why there are so many rave reviews for this product. It is literally the size of an index card and only about 4 pages long (some activity book!) The stickers are bright and colorful but there are only enough to make about 3-4 sticker robots. You could probably find something similar at the dollar store.", "summary": "Smallest Activity book EVER", "unixReviewTime": 1382054400}
{"overall": 1.0, "verified": true, "reviewTime": "09 5, 2013", "reviewerID": "A18MG1GPSEAPE9", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "but definitly NOT...  tiny book..  make robot with stickers that comes inside... whoo whoo big deal wow faint wow...  thats how bad", "summary": "i thought wow", "unixReviewTime": 1378339200}
{"overall": 5.0, "verified": true, "reviewTime": "09 3, 2013", "reviewerID": "A2T4SJTJAQ5AIN", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "a cook", "reviewText": "Lots of \"parts\" stickers to customize your robot.  There is a sticky page that you can use to build the robot or you can just put them on paper.", "summary": "fun activity for the kids", "unixReviewTime": 1378166400}
{"overall": 5.0, "verified": true, "reviewTime": "08 7, 2013", "reviewerID": "APNPNMZUM3E31", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "S. Carter", "reviewText": "I am using these little sticker books as party favors for my son's birthday partyl. He will have a robot party. These books complement the theme quite nicely.\n\nWhy buy cheap plastic toys as party favors? They will just end up broken and in the trash a couple of days later.\n\nI enjoy these mini-Dover books. When the kids need a quiet activity, I pull them out. I carry couple of them with me in my purse/diaper bag. The kids will use them in restaurants or at church.", "summary": "Dover products are top notch!", "unixReviewTime": 1375833600}
{"overall": 4.0, "verified": true, "reviewTime": "07 11, 2013", "reviewerID": "A373NAFXSSBQO1", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Jolene P.", "reviewText": "We bought this to give to young children that attended our wedding. Kid's ranged from 4-10 years old. It would have been to have multiple robots to decorate, but the price of the book and actually the small size came in handy for us - perfect to give out to kids and fit nicely in a little treat box for them. This is great for a little gift to make a child feel special - and to keep them occupied for a bit!", "summary": "Great for a gift!", "unixReviewTime": 1373500800}
{"overall": 5.0, "verified": true, "reviewTime": "05 20, 2013", "reviewerID": "A1WM6JPPSVAUIK", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "This book is small in size and probably best for 4 to 5 years old due to having to piece the robots together without knowing what a robot is.  My 3.5 year old didn't show much interest in it other than them being stickers.  However, I saved it and he will more than likely go for it in a year or two.", "summary": "Small sized...", "unixReviewTime": 1369008000}
{"overall": 3.0, "verified": true, "reviewTime": "03 20, 2013", "reviewerID": "A2OK03GKP0HDEA", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "SonnyBlack", "reviewText": "got it for my 8 year old but it was very small like only a few pages. i don't even know where it is now", "summary": "its ok", "unixReviewTime": 1363737600}
{"overall": 4.0, "vote": "3", "verified": true, "reviewTime": "03 20, 2013", "reviewerID": "AI9K7IX2BUMJP", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Lourdes", "reviewText": "Nice book but it was so small.  I should have read the size of the book.  It's about as big as my palms.  The activities looks fun for little ones, good for the car.  It will keep him busy for a few minutes.", "summary": "Nice", "unixReviewTime": 1363737600}
{"overall": 5.0, "verified": true, "reviewTime": "02 20, 2013", "reviewerID": "A2RJCHNUGQEL2O", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Erin DeGroot", "reviewText": "My 5 year old son loves robots, and he really loved creating his own robots with this little Dover book. As always, these are high quality for the price. The Little Activity Books are small, and will get you through a waiting room visit, or a restaurant sitting, but not longer than that. They are worth their small cost though! Love it!", "summary": "What a fun activity book!", "unixReviewTime": 1361318400}
{"overall": 5.0, "verified": true, "reviewTime": "02 17, 2013", "reviewerID": "A1W0Y4O31E2D97", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Happy Mama", "reviewText": "... In a little package. My 6 year old loved making little robots with the stickers. I had originally got it to bump my order up to $25 to get free shipping, but I'm glad I got it. Now I want to get the other little sticker books from Dover for my son.", "summary": "Lots of fun...", "unixReviewTime": 1361059200}
{"overall": 5.0, "verified": true, "reviewTime": "01 29, 2013", "reviewerID": "A1PQ5KKPEFGE8S", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "E Dog 23", "reviewText": "love this little book for an extra little fun stocking stuffer or reward item. Bots are a big thing with little boys!", "summary": "fun cheap silly", "unixReviewTime": 1359417600}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2013", "reviewerID": "ANKAORCG7F0XB", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "eaglecliff", "reviewText": "My grandbaby is enjoying creativity with her activity book, according to her Momma. We will crank-up her working robot when I get to see her in January, but for a small package representative of robots for her latest enthusiasm, the sticker activity book is working.", "summary": "3 year old grand-daughter having fun", "unixReviewTime": 1357862400}
{"overall": 5.0, "verified": true, "reviewTime": "12 19, 2012", "reviewerID": "A32XWGNC8LPNBB", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Juliette", "reviewText": "It is a fun little book for those of you that have someone that loves robots in your life. Fun for all ages.", "summary": "Small and fun!", "unixReviewTime": 1355875200}
{"overall": 1.0, "verified": true, "reviewTime": "12 4, 2012", "reviewerID": "A1L1KU8GUZBGOH", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "NellBell33", "reviewText": "This is advertised as stickers to build your own robot, what I received was the cover of the book with one sheet of stickers folded inside (not even stapled just stuck inside) and they were not even robots, they were firetrucks.", "summary": "Not as advertised", "unixReviewTime": 1354579200}
{"overall": 4.0, "verified": true, "reviewTime": "11 26, 2012", "reviewerID": "A161R617NMN5EG", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "LadyDior", "reviewText": "My son enjoyed picking the parts to assemble his own sticker robot.  Fun for home or trips in the car.", "summary": "Cute for Robot Loving Little Ones", "unixReviewTime": 1353888000}
{"overall": 1.0, "vote": "7", "verified": true, "reviewTime": "11 3, 2012", "reviewerID": "A1IEAZ67W0ORHI", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "shopRAVE", "reviewText": "Sticker Activity Book my arse. This \"book\" is 2 pages of stickers, folded in half and stapled inside a cover jacket. It's not a book, and there are no activities to speak of, except for peeling off the stickers (robot parts) and affixing them to the back page.\n\nOh, and did I mention this is TINY?  The whole book is about the size of a passport (but with less pages) and there is about 4 robots total on the little pages (parts are parts, but I counted 1 head, 2 arms, 2 legs, 2 feet, and a body on each of the 4 pages).\n\nSo that works out to $1.00 per assembled robot - total ripoff.", "summary": "Smaller than life.", "unixReviewTime": 1351900800}
{"overall": 5.0, "verified": true, "reviewTime": "10 29, 2012", "reviewerID": "A1GNUZ0Z0OWXAY", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "dekenstein", "reviewText": "This occupied my almost-3 year old for nearly an hour.  Stickers were durable and easy to peel.  Afterwards, he kept going back to the box to see if there were more robot stickers to assemble in there.\n\nI'll probably drop another dollar and buy it again for his Christmas stocking.  Three cheers for the short memory of a preschooler!", "summary": "Perfect for Preschooler", "unixReviewTime": 1351468800}
{"overall": 5.0, "verified": true, "reviewTime": "08 5, 2012", "reviewerID": "A3R7NYDAEW4RW3", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "acres87", "reviewText": "This kept my 3 year old son quite entertained whilst on a lengthy flight.  Recommend it for parents whose children are into robots", "summary": "Robot", "unixReviewTime": 1344124800}
{"overall": 1.0, "verified": true, "reviewTime": "08 3, 2012", "reviewerID": "A11KO7WSJFUO4", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "Was not what I expected...not enough to do. Should be free with purchase of a product. Purchased to give to campers at an educational robotics camp. Kids not impressed, neither was I. Should be recommended for kids under 6.", "summary": "Should be free with purchase....", "unixReviewTime": 1343952000}
{"overall": 5.0, "verified": true, "reviewTime": "07 10, 2012", "reviewerID": "A1VEQDU7N6GVZC", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "D. Foote", "reviewText": "This little Dover book is like the others of the series - fun and entertaining.  I was not happy to see that the price on the back was $1.50 and I paid $2.51 with Amazon.  I am used to getting a better deal than the stores, but this certainly was not!", "summary": "good, but not a good price", "unixReviewTime": 1341878400}
{"overall": 5.0, "verified": true, "reviewTime": "05 24, 2012", "reviewerID": "A3171W06FF8EE6", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Chelsie", "reviewText": "My 4 year old loves this robot sticker book! Yes, it is small, but its priced right for the size.  This provided lots of entertainment for my son, as he got to create his own robots.  He loves to intermix the parts and mis-matched robots. Definatly worth 1.50.", "summary": "Awesome little sticker book", "unixReviewTime": 1337817600}
{"overall": 4.0, "vote": "6", "verified": true, "reviewTime": "02 27, 2012", "reviewerID": "A3JERSPQZ0Z97H", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "NewHope", "reviewText": "My Grandson adores robots, I think Buzz Lightyear started it all ;-)\n\nThese he has had great fun with. I didn't give it 5 stars only because like other reusable stickers they really aren't very reusable. They only stay 'sticky' for the first few uses then they kept falling off which frustrated him. But the price wasn't bad so as long as you consider them consumable and don't plan on them lasting forever you'll be getting a pretty neat product. He really did enjoy them a lot, he is age 3 1/2 (does 100pc puzzles, builds with regular Legos, very mechanically inclined.)", "summary": "Great idea...", "unixReviewTime": 1330300800}
{"overall": 5.0, "verified": false, "reviewTime": "01 15, 2012", "reviewerID": "A2ERIMKILVEZIL", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Sue B.", "reviewText": "I bought 8 of these for my 3 year old daughter's robot themed birthday party as favors for the little ones and it was a great hit! I didn't realize that the stickers were robot parts that the kids assemble themselves to create their own robots! That was a lot of fun and for the price, it was well worth it!", "summary": "Awesome sticker activity for the price", "unixReviewTime": 1326585600}
{"overall": 4.0, "verified": true, "reviewTime": "12 27, 2011", "reviewerID": "AHF976BFWTTVG", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "L. S. Littrel", "reviewText": "My son is 5 and LOVES robots. He likes to change the parts around to make different robots. There are 4 different types to interchange.", "summary": "robot lover", "unixReviewTime": 1324944000}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "04 24, 2011", "reviewerID": "A2UNKYXPZRWX5", "asin": "0486448789", "style": {"Format:": " Paperback"}, "reviewerName": "Stroller Snob", "reviewText": "Perfect for that long airplane ride for my almost 6 year old son. Small enough to fit into my handbag. The stickers can be re-used over and over again to make new robots. A must for any busy mom!", "summary": "Entertains A 5 Year Old Boy!", "unixReviewTime": 1303603200}
{"overall": 3.0, "verified": true, "reviewTime": "05 10, 2013", "reviewerID": "A3T8MS4V4EXMOJ", "asin": "0545325234", "reviewerName": "Liz W", "reviewText": "My one-year-old got this as a birthday present. Within a week, the head fell off the handle of the hammer (we glued it back in place with rubber cement) and one of the peg holes no longer holds a peg in place. The plastic part that helps hold the peg is broken or has shifted. I don't know how to fix that.", "summary": "Doesn't hold up well", "unixReviewTime": 1368144000}
{"overall": 3.0, "verified": true, "reviewTime": "04 28, 2013", "reviewerID": "A2Y2HURKWJWU0D", "asin": "0545325234", "reviewerName": "sally butcher", "reviewText": "MY kids grew up with a peg bench and hammer and loved it, but I bought this brand for my grandson and was disappointed. The pegs  fit too loosely into the bench and he does not even use his hammer to pound them in, as he can  just push them in with his hand, or sometimes they fall through automatically.  My suggestion is to make the pegs fit a little tighter so the kids can learn skills of coordination, etc when pounding them in.  The pegs are nice and thick for little hands, but just not snug enough fitting to really use the toy as it is intended,", "summary": "Disappointed", "unixReviewTime": 1367107200}
{"overall": 1.0, "verified": false, "reviewTime": "01 13, 2013", "reviewerID": "A1Q72NO1MBXHSV", "asin": "0545325234", "reviewerName": "Coloradigirl", "reviewText": "This is a poorly put together piece of junk. We try to purchase toys that are simple and built with materials that will last. We loved this toy as kids. Sadly the pegs fall right through and the ends of the block are wobbly so we can't use it. Return shipping was more than it was worth to send it back.", "summary": "Junk", "unixReviewTime": 1358035200}
{"overall": 3.0, "verified": true, "reviewTime": "01 8, 2013", "reviewerID": "A2R4PRZK0WTUFD", "asin": "0545325234", "reviewerName": "Michelle", "reviewText": "The hammer fell apart right away, but was able to fix with glue.  The hassle free packaging was nice, but didn't appeal as a Christmas present.", "summary": "OK", "unixReviewTime": 1357603200}
{"overall": 3.0, "vote": "4", "verified": true, "reviewTime": "12 2, 2012", "reviewerID": "ASDTJOZI8ZJO9", "asin": "0545325234", "reviewerName": "Amazon Customer", "reviewText": "I bought this for my son because I remember how much fun I used to have with Pound a Peg! Anyway, we get the toy and my son pulls the pegs out and when I go to put them back in I notice that the pegs are suppose to be held in place by plastic rings set in grooves in the holes. Which aren't fitted. The plastic rings move around in the groove. The wood doesn't actually provide tension like old pound a peg toys. Soo the pegs don't fit right. My son doesn't even get to hammer 3-4 of them because they just fall right through. I was very disappointed. =/", "summary": "Eh", "unixReviewTime": 1354406400}
{"overall": 4.0, "verified": true, "reviewTime": "09 21, 2014", "reviewerID": "A1AVB9BG957JH", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "James B.", "reviewText": "My five year old grandson, my wife, and I were able to draw some characters that were recognizable. Without this book...no way.", "summary": "My five year old grandson, my wife, and ...", "unixReviewTime": 1411257600}
{"overall": 5.0, "verified": true, "reviewTime": "03 6, 2014", "reviewerID": "A177YI1Y3TCA64", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "M. Morgan", "reviewText": "The book gives a nice feel and step by step directions. I bought thins for my son with high functioning Autism. He has been using it often.", "summary": "Great for the comic lover", "unixReviewTime": 1394064000}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "02 23, 2014", "reviewerID": "A3N0AXNEZVE686", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Kindle Customer", "reviewText": "The packaging for a draw-your-own DC Universe makes it look easy enough, but think twice before purchasing it for your own beginning artist.  It is entirely possible that he/she will be ultimately disappointed (or at least frustrated) that their art won't resemble the professional examples provided considering the minimal directions given.\n\nFour double-sided color pencils (for a total of eight different colors), a black marker (for bolding), speech balloon stencils,  and an eraser are provided.  The problem here is that it really becomes more practice in tracing than actually learning how to draw.  Each exercise is four steps: 1. a stick figure; 2. the pipes 3. details; and 4. \"detailed\" details.  There aren't any transitional instructions on how to actually get from Step 1 to the final image; it is just a visual demonstration.  This book is best for those amateurs with some basic art class experience in terms of knowing how to draw details once they've have made the circles and connecting lines.\n\nRating: 3/5 stars (No recommended age, as any person's artistic talent will vary, no matter the age.  Instead, a beginning drawing class is best before tackling this book).", "summary": "Great Idea But Needs More Instructions & Details For Beginning Artists", "unixReviewTime": 1393113600}
{"overall": 5.0, "verified": true, "reviewTime": "02 6, 2014", "reviewerID": "A15ZVKJYE78JI4", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Jasmine", "reviewText": "My son loves this.  He has drawn the most MIND BLOWING art in this book.  So good.  He is learning so much.  It is really well put together with tracing pages and all sorts of tips.  I highly recommend this, even for adults.", "summary": "This is FANTASTIC!", "unixReviewTime": 1391644800}
{"overall": 4.0, "verified": false, "reviewTime": "01 22, 2014", "reviewerID": "A33VBX34BJSIAS", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Emmerson Dwarika", "reviewText": "This book takes you from fairly simple to much more advanced drawing techniques. Get it for anyone that is interested in drawing comics that can draw a little already even a child.", "summary": "Very good book", "unixReviewTime": 1390348800}
{"overall": 5.0, "verified": true, "reviewTime": "01 4, 2014", "reviewerID": "A7FS8IUY3J8MC", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "AMB", "reviewText": "Klutz X D. C. = highly engaging for pre-teen boys. We had one of our own, and a friend loved it so much we had to get him one.", "summary": "very engaging", "unixReviewTime": 1388793600}
{"overall": 2.0, "verified": true, "reviewTime": "12 30, 2013", "reviewerID": "A2DAI8HUWOXWX0", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Amazon Customer", "reviewText": "The drawing instructions were good but I was disappointed to find no colored pencils in the attached part. Thank goodness I had purchased other drawing utensils.", "summary": "Picture part was good but there were no pencils", "unixReviewTime": 1388361600}
{"overall": 5.0, "verified": true, "reviewTime": "05 30, 2013", "reviewerID": "A3RBDX2DDBT6IN", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Quinnell Trujillo", "reviewText": "This makes a great gift for anyone who loves Super Heroes and also loves to draw. Top quality pencils too. And the best part....totally affordable.", "summary": "Beautiful", "unixReviewTime": 1369872000}
{"overall": 4.0, "vote": "15", "verified": true, "reviewTime": "11 14, 2012", "reviewerID": "AXZCAKY84NIGI", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Desert Toyman", "reviewText": "I'm 37 years old and I just took up drawing again for the first time since high school.  I wasn't that great at it then so I'm not all that advanced of an artist.\n\nThis book is the perfect skill level for someone like me.  I mostly can copy things right now, but if I draw something from memory, my lack of skill is apparent. That was my motivation behind buying this book.  I needed to build on my skills and this book looked like the perfect thing to help with that.\n\nThe book starts out with having you trace some pictures just to get your hand and eye used to drawing different lines.  I have to say that this may have been one of the most interesting pieces of advice that I have learned from this book so far.  I would have never even considered tracing something in the past, but now I want to go buy some tracing paper and try a little more tracing.\n\nAs you move through the lessons they become more difficult.  After tracing, you work on stick figure frames for the characters, next you practice \"piping\" which is where you draw guides for the outside lines, and then finally you move on to the detailing that really makes your drawings come alive.\n\nThe book is set up so that you can draw in the book itself.  This is a great idea as well, but this is also where I ran into my issues with the book.\n\n1. It's too small.\n\nAt 8.5 x 8.6 inches the book isn't even as big as a standard piece of paper.  It's tough to practice drawing details when you don't have much room to fit those details into.\n\n2. The book doesn't lay flat\n\nThe book has a traditional binding so the pages have and arch to them when you try to lay it out flat to draw in it.  You need to press down on the pages to flatten them and even then there is still a little curve to them.  It makes it tough to draw straight lines at times and since I, and the target audience of this book, aren't that great of artists at this point, it really makes it frustrating to do some of the lessons.\n\nIf this book had spiral binding, like a notebook, and was larger I would give it 5 stars in a heartbeat.  As it stand now, it's 4 stars for me.  I am still glad I bought it because I really feel like it gave me some good things to practice.", "summary": "Good for beginners", "unixReviewTime": 1352851200}
{"overall": 4.0, "vote": "9", "verified": true, "reviewTime": "09 21, 2011", "reviewerID": "AHN1X9XWITFYF", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Carey", "reviewText": "I like the book, just wish it was larger.  It is targeted more for kids, than aspiring artist, but it still has valuable lessons in it.  I would recommend this book to anyone that is interested in learning how to draw the classic look of the DC characters, since they have now been changed in the ridiculous \"new 52\" event.", "summary": "It's good", "unixReviewTime": 1316563200}
{"overall": 5.0, "verified": true, "reviewTime": "10 4, 2015", "reviewerID": "A2TGSRD2HCL81Y", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Dylan", "reviewText": "Love it, very helpful", "summary": "Five Stars", "unixReviewTime": 1443916800}
{"overall": 2.0, "verified": true, "reviewTime": "05 17, 2015", "reviewerID": "A22TO7LO5I04CL", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Erin Oliver", "reviewText": "this wasn't really what I thought it would be...", "summary": "Two Stars", "unixReviewTime": 1431820800}
{"overall": 5.0, "verified": true, "reviewTime": "05 13, 2015", "reviewerID": "A1EHGC7RM11TQB", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Demon", "reviewText": "I have always been able to draw what i saw with limits now i can create them from my own imagination.", "summary": "I have always been able to draw what i saw ...", "unixReviewTime": 1431475200}
{"overall": 5.0, "verified": true, "reviewTime": "02 19, 2015", "reviewerID": "A1YJP532CJMQT", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Ricky Hammond", "reviewText": "My 8 year old Son LOVES this Drawing Book.... LOVES IT!!!!!", "summary": "Awesome Book...", "unixReviewTime": 1424304000}
{"overall": 5.0, "verified": true, "reviewTime": "02 11, 2015", "reviewerID": "A1BG2P9Y8RCIAZ", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Lisa NG", "reviewText": "Our little artist loves this kit.", "summary": "Five Stars", "unixReviewTime": 1423612800}
{"overall": 5.0, "verified": true, "reviewTime": "01 28, 2015", "reviewerID": "A2T6UJ8K87W4HU", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "JanetD", "reviewText": "This was a Christmas present for a nephew who loves to draw and he loves superheroes.  He was very happy with his gift!", "summary": "He was very happy with his gift", "unixReviewTime": 1422403200}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "01 18, 2015", "reviewerID": "A2NKECPWN20YAQ", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Denine", "reviewText": "The quality of the book is awesome. I gave it a 3 star review because, This is a book for someone who is more advanced than a beginner. You can trace mostly. It lacks instructions for the comic book drawing beginner.", "summary": "Not for beginners, however great for the comic book lovers.", "unixReviewTime": 1421539200}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2015", "reviewerID": "A9V7MUGGFFT7R", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Monique K.", "reviewText": "Awesome book", "summary": "Five Stars", "unixReviewTime": 1421020800}
{"overall": 5.0, "verified": true, "reviewTime": "01 4, 2015", "reviewerID": "AR4T6MHMX375H", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "Tater", "reviewText": "love this delivered on time", "summary": "Five Stars", "unixReviewTime": 1420329600}
{"overall": 5.0, "verified": true, "reviewTime": "11 29, 2014", "reviewerID": "A2PU5WLK5270D2", "asin": "0545346193", "style": {"Format:": " Paperback"}, "reviewerName": "J. Martinez", "reviewText": "Awesome. Starts of by showing basic stick figures and then adding more details first. Outstanding book and I would\nhighly recommend to anyone looking to learn the DC way to draw heroes!!!", "summary": "Awesome. Starts of by showing basic stick figures and ...", "unixReviewTime": 1417219200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "11 5, 2013", "reviewerID": "A20IB5KQKH7CCB", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "MissCindypieO", "reviewText": "fun stuff for the kid.. kind of messy but.. still lots of fun for them.. my kid is good at crafts so she made three dogs right away..", "summary": "fun stuff", "unixReviewTime": 1383609600}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/81ffFikS0uL._SY88.png", "https://images-na.ssl-images-amazon.com/images/I/6184eSuqIWL._SY88.png"], "overall": 5.0, "vote": "55", "verified": false, "reviewTime": "10 16, 2013", "reviewerID": "A29MXJTBLR1Y46", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "luvmodern", "reviewText": "My daughter is a huge fan of Klutz books and couldn't wait to get her hands on Pom-Pom Puppies. She made a Chihuahua, a Dalmation and a few mutts and they're getting cuter and cuter. The directions are really good (it can be challenging for an 8 year old to cut the yarn). I highly recommend this as a present to any kid who loves dogs, the results are really cute.", "summary": "My Daughter Adores this Book", "unixReviewTime": 1381881600}
{"overall": 5.0, "vote": "50", "verified": true, "reviewTime": "10 7, 2013", "reviewerID": "AZQQI7C36YF1G", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "J. Patton", "reviewText": "My daughter just turned 6 and spotted this at a Scholastic book fair. I bought it for a birthday present, and so far we've made one puppy. It is definitely a collaborative effort at this age, though she can do a lot of the work -- trimming the pom poms, gluing, etc. The directions are clear, the photos are adorable and the materials are of good quality. We will definitely have to get more glue -- I think we've used half a tube on one project -- but I think it's just basic white school glue. So far, it's a big hit -- and fun for grown-ups, too!", "summary": "So far, so cute!", "unixReviewTime": 1381104000}
{"overall": 3.0, "verified": true, "reviewTime": "12 9, 2017", "reviewerID": "A1NRMZA5YUGW3Y", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Marci Rinehart", "reviewText": "The concept for this is great but even I had a hard time with these. ", "summary": "Cute idea", "unixReviewTime": 1512777600}
{"overall": 5.0, "verified": true, "reviewTime": "10 23, 2017", "reviewerID": "A2LBN1U2ZSOOZU", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Kelly A. Kearns", "reviewText": "This kit is so cute.  I have given it as gifts to two of my nieces!", "summary": "Five Stars", "unixReviewTime": 1508716800}
{"overall": 1.0, "verified": true, "reviewTime": "10 22, 2017", "reviewerID": "AR1CNW7TN6HNY", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "K.  Romaner", "reviewText": "Horrible!\nNothing more to say\nWould give zero stars if possible", "summary": "Horrible! Nothing more to say Would give zero stars ...", "unixReviewTime": 1508630400}
{"overall": 2.0, "verified": true, "reviewTime": "10 21, 2017", "reviewerID": "A243M6TBOHSP4H", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Ginger L. Ryall", "reviewText": "I sent this product to my granddaughter. The pom-pom maker comes in two parts and is supposed to snap together to create the pom-poms. However, both parts were the same making it unusable. If you can't make the pom-poms the kit is useless. Since this was sent as a gift, I do not have it to return. Very disappointed.", "summary": "Faulty Product", "unixReviewTime": 1508544000}
{"overall": 5.0, "verified": true, "reviewTime": "10 11, 2017", "reviewerID": "A2SITMHP0VTUIN", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Ruben P. Kim", "reviewText": "Great product and clear instructions.", "summary": "Five Stars", "unixReviewTime": 1507680000}
{"overall": 3.0, "verified": false, "reviewTime": "08 20, 2017", "reviewerID": "A3N0QZZPFPOTR4", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "momofkidsanddogs", "reviewText": "This kit was very frustrating and not at all something my 7-year-old could do on her own. The puppy turned out cute, but nothing like the photo. We also ran out of yarn, mid-project. The puppy took about 2 hours to complete.", "summary": "but nothing like the photo", "unixReviewTime": 1503187200}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/718eZpbiTWL._SY88.jpg"], "overall": 4.0, "verified": true, "reviewTime": "08 18, 2017", "reviewerID": "A3C6T1060AMN0R", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Holly Cruse-Shepherd", "reviewText": "I'm 32 and really need a hobby, so I bought this kit. The instructions were easy to follow, my only tips are to have more yarn (I ran out of black on the first puppy) and use a hot glue gun. I did this based on other reviews, didn't even mess with the glue that was included.", "summary": "Need more yarn & a hot glue gun", "unixReviewTime": 1503014400}
{"overall": 2.0, "verified": true, "reviewTime": "08 8, 2017", "reviewerID": "A1U4NOUWOCP8H2", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "GW", "reviewText": "At age 31 I found these very difficult to make, I can't imagine how an 8 year old would do it by themselves.", "summary": "At age 31 I found these very difficult to make ...", "unixReviewTime": 1502150400}
{"overall": 2.0, "verified": true, "reviewTime": "08 2, 2017", "reviewerID": "A2LSN49OTWTU78", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "W. Armstrong", "reviewText": "I double checked the contents to make sure everything was there but this was intended as a gift. The kit had obviously been opened and the packaging ripped. So it looks used and secondhand, which makes it a bit tacky to give as a gift. And as the instruction book is attached to the box, I can't repackage it myself. I'm giving it two stars because the kit does look fun bit in this case, it was a waste of money for me.", "summary": "Box wasn't new", "unixReviewTime": 1501632000}
{"overall": 3.0, "verified": true, "reviewTime": "07 31, 2017", "reviewerID": "A2O6VH77ZMZCAQ", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Amazon Customer", "reviewText": "It's a cute project idea with easy to follow instructions. The pom pom maker works well and the materials seem quality. There is WAY too little yarn and other materials though. You can make two or three dogs tops depending on the colors you want to use and then you have to go searching for more yarn.", "summary": "It's a cute project idea with easy to follow instructions", "unixReviewTime": 1501459200}
{"overall": 4.0, "verified": true, "reviewTime": "07 25, 2017", "reviewerID": "A3I81XCUEJ75RN", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Doc Margy", "reviewText": "We had a great time with this craft set.", "summary": "Four Stars", "unixReviewTime": 1500940800}
{"overall": 1.0, "verified": true, "reviewTime": "07 17, 2017", "reviewerID": "AWUPAM7C4GTWZ", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Jason", "reviewText": "Incomplete kit!  Very disappointing!", "summary": "INCOMPLETE KIT!", "unixReviewTime": 1500249600}
{"overall": 1.0, "verified": true, "reviewTime": "07 4, 2017", "reviewerID": "A1CVNDBISROIAP", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Gaby U.", "reviewText": "Incomplete set. Was missing the bead eyes the felt and a couple other things i was excited but was highly dissappointed that i was unable to do them", "summary": "Incomplete", "unixReviewTime": 1499126400}
{"overall": 4.0, "verified": true, "reviewTime": "06 10, 2017", "reviewerID": "A3RG3MC3E9EU1W", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "R. Hughes", "reviewText": "Nieces loved it.", "summary": "Four Stars", "unixReviewTime": 1497052800}
{"overall": 5.0, "verified": true, "reviewTime": "06 3, 2017", "reviewerID": "A1APR7NZTD7AQB", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Maria Beatriz Alessi", "reviewText": "Kit and instructions make easy to learn the process. A basic video would be a nice resource as well.", "summary": "Five Stars", "unixReviewTime": 1496448000}
{"overall": 2.0, "verified": true, "reviewTime": "05 28, 2017", "reviewerID": "A2DOZ7ZQBMOQ2D", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "M", "reviewText": "Hard to put together.", "summary": "Cute idea, hard to do", "unixReviewTime": 1495929600}
{"overall": 5.0, "verified": true, "reviewTime": "05 9, 2017", "reviewerID": "A3UIANT9G4O9FO", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Kandi Esslinger", "reviewText": "Great product. Took a little practice and time, but after you get the hang of it. It turns into a cute cuddly little friend. Mine didn't turn out exactly like the picture, but it adds a taste of your own sense of style. They are super cute and comes with everything it says it will.", "summary": "Awesome", "unixReviewTime": 1494288000}
{"overall": 1.0, "verified": true, "reviewTime": "05 4, 2017", "reviewerID": "A3OG7VNLL84IU", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Amazon Customer", "reviewText": "Do not buy! They look cute. But my daughters could not do this on their own. It took a couple of adults reading the directions (multiple times) do be able to put only 1/2 of one together. It took so long that even I was over it. Ridiculous product!", "summary": "Do not buy! They look cute. But my ...", "unixReviewTime": 1493856000}
{"overall": 5.0, "verified": true, "reviewTime": "04 27, 2017", "reviewerID": "ALUX652JZJX1R", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Claudia J.", "reviewText": "This is a fun craft project! I just wish I could buy refills of the collars and other add ons!", "summary": "This is a fun craft project", "unixReviewTime": 1493251200}
{"overall": 3.0, "verified": true, "reviewTime": "04 8, 2017", "reviewerID": "AQPRNOTQZVD62", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "shopeen", "reviewText": "Super cute but I ended up doing them myself. Too hard for my 6 yr old to do. Not sure what the age is on it...", "summary": "Too hard for 6 yr old", "unixReviewTime": 1491609600}
{"overall": 5.0, "verified": true, "reviewTime": "04 7, 2017", "reviewerID": "A2HHNO2T382683", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Rosemarie Reinman", "reviewText": "Great item arrived in record time.  Birthday present for my granddaughter.  She love them.", "summary": "Five Stars", "unixReviewTime": 1491523200}
{"overall": 5.0, "verified": true, "reviewTime": "03 16, 2017", "reviewerID": "A2Q80KMX66E5BW", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Aelyn", "reviewText": "Super cute crafts! My 10 and 12 year olds created darling puppies all by themselves.", "summary": "Super cute!!", "unixReviewTime": 1489622400}
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A33ESKAGJX0BC5", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Showmefirst", "reviewText": "I ran out of yarn, actually ran short while making the second Pom Pom for one dog. Don't even bother with the glue, just use your own from the start (Klutz is useless). The carrier is okay but too small so useless. The idea and presentation is charming and if easier it would be terrific for a slumber party! I wonder if there is an easier way to make a Pom Pom?", "summary": "So promising but doesn't deliver", "unixReviewTime": 1488844800}
{"overall": 5.0, "verified": true, "reviewTime": "03 4, 2017", "reviewerID": "A2D0AVXUJVHK1T", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Honest purchaser", "reviewText": "Awesome gift", "summary": "Five Stars", "unixReviewTime": 1488585600}
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "03 1, 2017", "reviewerID": "A1ZVZXZGOQAXUD", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "MMC70", "reviewText": "It's okay. I would rate it as 10 and up . . . . it isn't easy to apply the ears and eyes and have them stay. It's definitely something that has to go on a shelf untouched after making. The yarn that comes with it will not make up many of these, so be prepared to go buy more yarn.", "summary": "it isn't easy to apply the ears and eyes and have them ...", "unixReviewTime": 1488326400}
{"overall": 3.0, "verified": true, "reviewTime": "02 24, 2017", "reviewerID": "A3UOSAXS8BM79N", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Karthik L", "reviewText": "This is a bit difficult. There are too many steps and we have to go back and forth to put the head , body together. If you are looking for something easy and fun , don't buy this. It will get you all wound up.", "summary": "Did not like it", "unixReviewTime": 1487894400}
{"overall": 2.0, "verified": true, "reviewTime": "02 23, 2017", "reviewerID": "A1I9B6F4Z82EJR", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Sagefemme", "reviewText": "Not very easy, just lots of yarn. Maybe for a 10 year old.", "summary": "looks cuter that it is", "unixReviewTime": 1487808000}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2017", "reviewerID": "A74I9RE63LWLR", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "Marti", "reviewText": "Totally loved this kit! Easy enough to do.", "summary": "Love it!", "unixReviewTime": 1487635200}
{"overall": 5.0, "verified": true, "reviewTime": "02 18, 2017", "reviewerID": "A2U2QDVHGTE3Q5", "asin": "0545561647", "style": {"Format:": " Product Bundle"}, "reviewerName": "superbzmom", "reviewText": "This is a fantastic product!  I highly recommend it for pretty much ANY age!", "summary": "Great product!  Darling puppies!", "unixReviewTime": 1487376000}
