{"reviewerID": "AKM1MP6P0OYPR", "asin": "0132793040", "reviewerName": "Vicki Gibson \"momo4\"", "helpful": [1, 1], "reviewText": "Corey Barker does a great job of explaining Blend Modes in this DVD. All of the Kelby training videos are great but pricey to buy individually. If you really want bang for your buck just subscribe to Kelby Training online.", "overall": 5.0, "summary": "Very thorough", "unixReviewTime": 1365811200, "reviewTime": "04 13, 2013"}
{"reviewerID": "A2CX7LUOHB2NDG", "asin": "0321732944", "reviewerName": "Bernie", "helpful": [0, 0], "reviewText": "While many beginner DVDs try to teach you everything there is to know about Photoshop CS5, this introductory course shows you the critical things you need to know to start feeling confident in your Photoshop skills. Bestselling author and Photoshop trainer, Matt Kloskowski shows you exactly what you need to know about tools, filters, adjustments, palettes, and menu items to hit the ground running in Photoshop. These include: layers and how they're key to mastering Photoshop, selections and the essential tools you really need to worry about, getting started with Camera Raw and which Retouching tools you'll find the most helpful. When you're done with this DVD you'll have a solid grasp of the most important features and be at the next level in no time.", "overall": 5.0, "summary": "Adobe Photoshop CS5 Crash Course with master Photoshop trainer, Matt Kloskowski", "unixReviewTime": 1341100800, "reviewTime": "07 1, 2012"}
{"reviewerID": "A2NWSAGRHCP8N5", "asin": "0439886341", "reviewerName": "bowmans2007", "helpful": [1, 1], "reviewText": "It never worked. My daughter worked to earn the money to get this and it never worked for her. I had to buy her a new one to replace it", "overall": 1.0, "summary": "absolutely horrible", "unixReviewTime": 1367193600, "reviewTime": "04 29, 2013"}
{"reviewerID": "A2WNBOD3WNDNKT", "asin": "0439886341", "reviewerName": "JAL", "helpful": [1, 1], "reviewText": "Some of the functions did not work properly.  My daughter bought this with her own money and was disappointed that it did not function as advertised.", "overall": 3.0, "summary": "Disappointing", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A1GI0U4ZRJA8WN", "asin": "0439886341", "reviewerName": "Truthfull", "helpful": [4, 4], "reviewText": "Do not waste your money on this thing it is terrible i boutght this product for my son and when i put in phone numbers for him to remember or the date and  it would always reset then i would have to do it all over again i couldn't do anything about it it was getting very frustrating so we just threw it away DO NOT Absolutely DO NOT SPEND YOUR MONEY ON THIS", "overall": 1.0, "summary": "TERRIBLE DONT WASTE YOUR MONEY", "unixReviewTime": 1334707200, "reviewTime": "04 18, 2012"}
{"reviewerID": "A1QGNMC6O1VW39", "asin": "0511189877", "reviewerName": "CK", "helpful": [0, 0], "reviewText": "Dog got the old remote and destroyed it.  Didn't feel like explaining to the folks at the Time Warner Cable office what happened.  Saw the price on Amazon for this one and chose the low hassle option.  It works perfectly.  Price was right.", "overall": 5.0, "summary": "Works Great with my TWC box", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"}
{"reviewerID": "A3J3BRHTDRFJ2G", "asin": "0511189877", "reviewerName": "EJ Honda \"ejhonda\"", "helpful": [1, 1], "reviewText": "This remote, for whatever reason, was chosen by Time Warner to replace their previous silver remote, the Time Warner Synergy V RC-U62CP-1.12S.  The actual function of this CLIKR-5 is OK, but the ergonomic design sets back remotes by 20 years.  The buttons are all the same, there's no separation of the number buttons, the volume and channel buttons are the same shape as the other buttons on the remote, and it all adds up to a crappy user experience.  Why would TWC accept this as a replacement?  This remote is virtually impossible to pick up and use without staring at it to make sure where your fingers are.  Heck, you have to feel around just to figure out if you've grabbed it by the top or bottom, since there's no articulation in the body of the thing to tell you which end is up.  Horrible, just horrible design.  I'm skipping this and paying double for a refurbished Synergy V.", "overall": 2.0, "summary": "Ergonomic nightmare", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"}
{"reviewerID": "A2TY0BTJOTENPG", "asin": "0511189877", "reviewerName": "Johnny Exx", "helpful": [0, 1], "reviewText": "We had an old Time Warner Cable remote that was dropped into a bucket of dirty mop water.  We dried it out and it seemed to work &#34;fine&#34; except for the few times one of the batteries began to sizzle and smoke and became hotter than anything I had ever felt before and literally burned a hole in our couch upholstery.  Needless to say, this remote, the CLIKR-5, is awesome, easily programmed, and works perfectly with our TWC equipment and all the other A/V components.  I love this remote... great product.  (Probably goes without saying, but just in case, you don't get the TWC logo on it.)", "overall": 5.0, "summary": "Excellent replacement to Time Warner Cable remote", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A34ATBPOK6HCHY", "asin": "0511189877", "reviewerName": "Nancy C. Johnson", "helpful": [0, 0], "reviewText": "This unit works just like the TEC unit only better. I like it and would buy another if needed. OK?", "overall": 5.0, "summary": "Great piece", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}
{"reviewerID": "A89DO69P0XZ27", "asin": "0511189877", "reviewerName": "Stephen Schultz", "helpful": [0, 0], "reviewText": "It is an exact duplicate of my Time warner remote.I bought it so my wife could control the TV from her chair and not ask me to do it every time.It works great.I would reccomend it to anyone.", "overall": 5.0, "summary": "Time Warner cable remote", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "AZYNQZ94U6VDB", "asin": "0511189877", "reviewerName": "Terri L. Pittman", "helpful": [0, 1], "reviewText": "Works on my t.v. that no other remote works on.  Was hard as heck to find a compatible one.  Even works with my old blu ray player.  Doesn't work with my old VCR but that thing is so old it would be like walking on water if it did.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"}
{"reviewerID": "A1DA3W4GTFXP6O", "asin": "0528881469", "helpful": [0, 0], "reviewText": "Love it has everything I wanted any problems were quickly resolved", "overall": 5.0, "summary": "love it", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
{"reviewerID": "A29LPQQDG7LD5J", "asin": "0528881469", "reviewerName": "Alfred Delgado", "helpful": [0, 0], "reviewText": "I have owned two Rand McNally GPS devices over the last two years. Buyer beware! They are pieces of junk. The software is great, but the hardware does not last. The first GPS lasted a year. I spent another $400, that one lasted about 14 months. If you don't mind spending $400 a year for a GPS buy one. Otherwise do not buy it it is the worst and most expensive piece of junk I have ever bought. I still use my original GARMIN I purchased in 2006.", "overall": 1.0, "summary": "Piece of Junk", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"}
{"reviewerID": "AO94DHGC771SJ", "asin": "0528881469", "reviewerName": "amazdnu", "helpful": [0, 0], "reviewText": "We got this GPS for my husband who is an (OTR) over the road trucker.  Very Impressed with the shipping time, it arrived a few days earlier than expected...  within a week of use however it started freezing up... could of just been a glitch in that unit.  Worked great when it worked!  Will work great for the normal person as well but does have the \"trucker\" option. (the big truck routes - tells you when a scale is coming up ect...)  Love the bigger screen, the ease of use, the ease of putting addresses into memory.  Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck.  I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!", "overall": 5.0, "summary": "Gotta have GPS!", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"}
{"reviewerID": "AMO214LNFCEI4", "asin": "0528881469", "reviewerName": "Amazon Customer", "helpful": [12, 15], "reviewText": "I'm a professional OTR truck driver, and I bought a TND 700 at a truck stop hoping to make my life easier.  Rand McNally, are you listening?First thing I did after charging it was connect it to my laptop and install the software and then attempt to update it.  The software detected a problem with my update and wanted my home address so I could be sent a patch on an SD card.  Hello?  I don't think I'm all that unusual; my home address is a PO box that a friend checks weekly and that I might get to check every six months or so.  I live in my truck and at truck stops.  If you need to make a patch available on an SD card then you should send the SD cards to the truck stops where the devices are sold.  I ran the update program multiple times until the program said that the TND 700 was completely updated.I programmed in the height (13'6\"), the length (53') and the weight (80,000#) of my rig and told it that I preferred highways.  I was parked at a truck stop in the Cincinnati OH area.  My next pickup was about 15 miles down the same freeway but on the other side of it a couple of blocks.  My cell phone GPS (Sprint) said to get on the freeway to get to my pickup.  The TND 700 routed me thru 23 miles of residential streets before finally getting me to my pickup.  Very exciting, especially since every time I refused to turn down a street posted \"No Trucks\" the TND 700 took almost 5 minutes to figure a re-route, and it happened multiple times on that short trip.I decided to give it another chance.  After my pickup on the north side of Cincinnati just off of I-75 I needed to head to Phoenix AZ via I-71.  Easy route is to just hop on I-75 and drive west and south to the intersection of I-71.  Indeed, that is what my cell phone advised.  The TND 700, however, wanted to route me over surface streets across the city and pick up I-75 on the other side of the city.  I turned it off and the next time I passed a truck stop of the same chain I purchased it at I returned it and got my money back.I then spent $30 on a cheap printer.  Now I take a minute to set up my route on Google and print it out.  Hasn't gotten me lost yet over several cross country trips.", "overall": 1.0, "summary": "Very Disappointed", "unixReviewTime": 1290643200, "reviewTime": "11 25, 2010"}
{"reviewerID": "A28B1G1MSJ6OO1", "asin": "0528881469", "reviewerName": "A. O Sandness", "helpful": [21, 22], "reviewText": "This is a great truck GPS. I've tried others and nothing seems to come close to the Rand McNally TND-700.Excellent screen size and resolution. The audio is loud enough to be heard over road noise and the purr of my Kenworth/Cat engine. I've used it for the last 8,000 miles or so and it has only glitched once. Just restarted it and it picked up on my route right where it should have. The exit lane screen has been spot on every time and gives me plenty of time to get my rig into the appropriate lane safely. I also love the multi-stop route planning and use it a lot. Updated regularly, it has shown me all the construction zones and has a feature to allow me to detour around them. Creating Groups and storing locations in them is a breeze so I can separate warehouse from store locations, etc.I'm running an HP Pavilion laptop with Windows 7 OS for the dock and update. The USB port DOES charge the GPS, at least with my laptop, despite the warning in a previous review. Even if it didn't, the supplied 12-volt and AC chargers take care of getting the battery up to speed.My complaints are relatively minor:Battery life when it is unplugged isn't great. However, since I use it plugged in in the cab 95% of the time, it doesn't create too much of a problem.The announcement of state borders coming up is nice but it doesn't tell you (or show you on the map display) what state you are in and/or going into. Again, a minor issue because I know where I am but all my other GPS units had this feature. For $500 smackers, I don't expect this kind of slip-up.There is a Micro SD slot on the unit and I bought a card for it. Unfortunately, the manual has absolutely no information on using it. The only reference is on the page showing the physical features of the unit, showing the position of the slot. Annoying.Clean up the minor issues and this unit rates a solid 5.Rand McNally 528881469 7-inch Intelliroute TND 700 Truck GPS", "overall": 4.0, "summary": "Great Unit!", "unixReviewTime": 1280016000, "reviewTime": "07 25, 2010"}
{"reviewerID": "A3N7T0DY83Y4IG", "asin": "0528881469", "reviewerName": "C. A. Freeman", "helpful": [43, 45], "reviewText": "Well, what can I say.  I've had this unit in my truck for about four days now.  Prior to that I had a Garmin 755T non-truck GPS.  One of my favorite features in that unit was the ability to plan a route by determining mileage using the stop or via feature.  What I would do is using a map I would route myself several different ways forcing the unit by putting in stops or vias at different locations along the route, otherwise, like most GPS 's, it determines what it thinks is the best route.  I could add up to 10 Via's or stop points for each route and then based on mileage and other factors determine which is the best route to take.  Multiple stops and the ability to route was the most important reason for having the Garmin.  However it was not truck specific.  And considering I am now hauling strictly hazmat I wanted something that would take that into consideration.  After perusing various forums, review sites, and word-of-mouth my choices boiled down to the Garmin 465T or the RAND McNally Intelliroute TND 700.  Even though it was quite a bit more than the Garmin I chose the TND 700 for several reasons.  The main one being the extra screen size, and its ability to coordinate with the RAND McNally truck atlas and also its ease of updating.Now on to my first impression of the TND 700.  It seems to be an aesthetically pleasing and durably built unit.  The first thing I noticed was it's very slow to boot compared to my old Garmin.  Whether this is unique to the TND 700 or is common amongst all truck specific gps units I cannot tell, but it's really not that big of a deal.  The second thing I noticed was the overwhelming wealth of information put forth.  That might explain why the manual (available via the TND dock) is well over 100 pages long.....  There is somewhat of a learning curve with this unit.  The next thing I noticed was the complexity of entering routes.  As previously mentioned I like to force it into my preferred routing by the use of stops or vias.  That was a big no go with this unit.  While you can enter multiple stops or vias it is nowhere near as user-friendly as my old Garmin.  Furthermore there is no way you can determine total mileage on the route that you have chosen, as I could with the Garmin.  Totally flummoxed by what appeared to be an omission of one of the best routing tools a trucker could have I went online and verified through an expert source connected with RAND McNally that no, that feature was a couple updates down the line and was not available at this point.  Unbelievable.  Also forcing the unit to follow a specific route can be very challenging.  For a unit of this price, and feature laden, I find this totally unacceptable.  I am still mulling over selling this unit  and buying the Garmin 465T.  I really do like this GPS, the screen is magnificent, and the volume is awesome.Another thing I've noticed, which I do not think is unique to this unit, is some of the weird routing that it does.  I've never owned a truck specific GPS before but after playing with this one for a couple of days I get the impression that what RAND MacNally (and the others that use Navteq) has done is take a plain old car specific Navteq map and a road atlas with truck restrictions and made notifications on the map.  In most databases there is not a 100% thorough listing of every road in the country.  What I mean is that this unit will route you down roads you don't belong on.  Today while coming home it tried routing me on several  9 ton County roads.  What that means is that a truck is limited to 73280 unless the road is posted at 10 tons.  County roads do not have that restriction listed in the RAND McNally road atlas, so I believe that is why it is not listed.....  Also unacceptable in a unit of this price and sold as truck specific.  However I'd be willing to bet the other truck specific units are the same way as no one has ever done a truck specific version of NavTeq.Another bone I have to pick is the POI's. Not only the truck specific ones but the others all seem to be somewhat outdated.  I think the Garmin, at least the ones that I have used, are more current.  It would also be nice if I could add my own POI'sTo sum it up I will keep this unit a little longer to see if I can make it workable.  If not I will go back to Garmin.  I like the concept and I like the unit but at this point I'll have to say I am somewhat unimpressed.pros:Large screenterrific imagesoutstanding volumecons:inability to determine route mileage by multiple stops and viasa somewhat outdated POI information.Non-truck specific routings.Cost.", "overall": 3.0, "summary": "1st impression", "unixReviewTime": 1283990400, "reviewTime": "09 9, 2010"}
{"reviewerID": "A1H8PY3QHMQQA0", "asin": "0528881469", "reviewerName": "Dave M. Shaw \"mack dave\"", "helpful": [9, 10], "reviewText": "Not going to write a long review, even thought this unit deserves one. I've driven well over 1-mil miles and done most of my own routing so I pretty know whats the fastest and shortest. Have been using a basic garmin for the past three years and with ANY Gps unit they'll ALL get you in trouble if you let them. I was really excited about this unit, due to the size and the features. Allot of great grafics and on screen info thats usefull. But the most basic item that it was lacking was the gps tracking. I gave this unit allot of leadway on its mistakes due to the fact that it had allot of cool stuff that it did, but its ability to track you and route you was not even close to what the basic garmin could due. Its like the prossesor that they installed in the TND 700 was 10 years old. Example if I needed to make a simple route change I.E. in town down to the next street due to the fact that I couldn't make the turn or the street was blocked off, it would take the TND 700 upwards of 45 seconds to a minute and a half to reroute me. Here I'm sitting at a stop light waiting for directions and waiting that long with cars on my backside didn't make me happy. This is a problem that happened evertime you had to reroute, weather it was a simple street change or a major highway change. Also from the time you turned the unit on it would take twice as long to boot itself up. At least a dozen times with in a week it put me on the wrong roads and when I made a wrong turn it got it self lost....I.E. take left on xyz street, and it was some ones drive way. Or turn left in 800 yards and the turn was less than 10 feet away. You might think in a conjested city situation I might get a little mixed up, but this is out in the country. Twice it put me under 12'6\" bridges when I'm 13'6\". Of course I made sure all my truck setting where they were supposed to be. I also updated the OS version,via Rand McNally. All in all I expected alot out of this unit and got a unit that should of been field tested with some people that drive allot. It just had to many route mistakes. Going back to the basic garmin. This isn't just my complaints, I have three friends that bought the same unit and have the same complaints. All of us returned the units.", "overall": 2.0, "summary": "Great grafics, POOR GPS", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
{"reviewerID": "A2CPBQ5W4OGBX", "asin": "0528881469", "reviewerName": "Dclownfish03 \"Dclownfish03\"", "helpful": [23, 32], "reviewText": "My brother is a trucker and pre-ordered this.  He was out on the road when it arrived, so he asked me to charge it, update it, and play with it.  FUN!  I am not a trucker, but from what I hear from my brother, the tools on this device are awesome.  It looks like it would be very helpful for him.  The thing is huge, a 7\" screen!  Overall, this seems to be a great tool.My problem with it is that it cannot update.  I have a brand new computer running Windows 7 64 bit.  It's a Dell Studio XPS 8100 (i5 processor).  After reading on forums and contacting Rand McNally, I have learned that Windows 7 does not send enough power to the USB ports to allow the TND 700 to go into \"connected\" mode when it's plugged in to a computer.  Supposedly this is a problem that occurs mostly with laptops and some Dell systems (\"Dell Latitude or Inspiron PC (it may occur on other models as well)\").  Rand McNally send a very helpful email with some solutions to the problem, though it sounds like they are still unsure of all fixes or what causes the problem.  I am disappointed that a brand new device does not work with a brand new operating system, though that seems to be the nature of all things now-a-days.  I am hoping that it will update on my brother's XP laptop. we'll see when he gets back home.", "overall": 2.0, "summary": "New GPS doesn't work with new Windows 7", "unixReviewTime": 1277078400, "reviewTime": "06 21, 2010"}
{"reviewerID": "A265MKAR2WEH3Y", "asin": "0528881469", "reviewerName": "doublebunk", "helpful": [1, 1], "reviewText": "This unit is a fantastic aide for truckers. Many great features that make it useful. Accuracy does not always seem to be current. At times it takes you many miles out of the way to get to where you are going. Also the graphics are very jerky. They could be a lot smoother. Very informative, but could be a lot smoother. Also, it does not zoom in like it should when exiting or turning.", "overall": 4.0, "summary": "Trucker GPS as a trucker uses it", "unixReviewTime": 1294790400, "reviewTime": "01 12, 2011"}
{"reviewerID": "A37K02NKUIT68K", "asin": "0528881469", "reviewerName": "dpr1961", "helpful": [12, 12], "reviewText": "I did a lot of comparison shopping and decided to buy the Rand McNally 7\" GPS.  Has better graphics than Cobra 7\".  It does have lane assist which is important when in large metro areas and need to be in correct lane for exits, etc Atlanta, GA.  I have read some of the negative comments written earlier and I do not have those problems.  Sure, sometimes it does not give the fastest or the simplest route but it has never sent me down a non truck route like all the prior gps i have had in the past.  I am a car carrier so I set truck size at 13' 8\" and it has kept me from going down roads with 13'6\" bridges.  The only negative comment I have is that it constantly changes map views from city to county to state way to often.  Other than this, I love the fact that:  1) it shows mileage to destination, arrival time (which you can change to time left),  2) shows the city, county and state you are current located (how often we truck drivers pull over at a rest area or truck stop and wonder what city we are located).  3) large 7\" color screen for easy viewing and screen changes automatically for night time driving  4) list truck poi and non truck poi (wish Rand McNally had a feature that would let us send them an update for poi, maybe when we get at a Loves that use to be a Pilot, just tap on the screen and edit info, then when I connect gps to computer for weekly update the map will get updated.  5) able to update construction info by linking gps to computer and get updates given to Rand McNally by the states.  Unfortunately like usual  the states are mostly behind on updates given to Rand McNally.  This is where we the consumer should have the ability to tap screen and make corrections and send it to Rand McNally.  Many times I have gone into areas that it said \"Construction Ahead\" and no construction is being done because it has been completed.  6)  speed limits of highways and Interstates and shows your current speed just below it (also shows truck speed limits in red) Still the states have to report these limits to Rand McNally and as usual they are slow on reporting.  But still most of the time 95% it is correct.  7)  great truckers tools like driving hours left.  It automatically changes to driving when truck has moved for more than 1 mile and changes to off duty if it is idle for 15 minutes.  It lets you know when you have 1 hour left to drive and that driving time has expired. You reset every day manually.  Also have total hours worked for day and hours left to work for the week. You will have to manually override this sometimes because it doesn't distinguish off duty and on duty hours well, you have to manually tell it you are on duty.  I just manually configure at the end of the day.  The important one is driving hours and end of the week hours.  8)  service reminders for your perimeters you set, such as 8000 and 16000 services.  You reset manually when completed.  9)  able to set many multiple stops set and ability to add more stops in route  10) loud enough to hear spoken text to speech street names over engine noise (and believe me my truck is loud)  11) ability to save your own poi (I do it all the time)  12) it tells you when you are 3 miles from approaching a weight station (you can configure it up to 5 miles)  13) it tells you when you are 1 mile from state border and tells you when you cross border and what state you are in.  14) it tells you all mileage you driven that day and mileage by state and mileage by day.  saves info for 1 year.  Overall, this is definitely a truckers friend and I absolutely love this GPS.  A definite must buy.", "overall": 5.0, "summary": "Excellent buy", "unixReviewTime": 1293235200, "reviewTime": "12 25, 2010"}
{"reviewerID": "A2AW1SSVUIYV9Y", "asin": "0528881469", "reviewerName": "ED", "helpful": [1, 2], "reviewText": "I purchased this product not to use in commerical trucking but rather to use when I am traveling with my 5th wheel RV.  So far this product as been very good.  Rand McNally folks seem to be working to continue to improve the software along with prompt updates.  Although designed for the trucking industry it works great for us RV folks as well.  I found for a 2500 HD pickup the unit is a little large for the windshield.  I use the unit with a mount that fits in my cup holder and that has worked out great.  I would recommend this product.", "overall": 4.0, "summary": "TND 700 Truck GPS", "unixReviewTime": 1289001600, "reviewTime": "11 6, 2010"}
{"reviewerID": "A2AEHUKOV014BP", "asin": "0528881469", "reviewerName": "ERICL67", "helpful": [5, 7], "reviewText": "EXCELLENT. BEST TRUCK GPS I'VE USED. GOOD GRAPHICS. GREAT VOLUME, OVERCOMES TRUCK BACKGROUND NOISE. EXCELLENT CATALOG OF DESTINATIONS. CAR MODE. NITE MODE MAKES IT EASY ON THE EYES. 99.5% ACCURATE. DIRECT ROUTE TO DESTINATION. DRIVER PTS. OF INTEREST: SCALES, TRUCK STOPS, REST AREAS, BORDERS, WEIGH STATIONS, SCALES, ETC. EASY TO PROGRAM. CONTINUAL FREE UPDATES VIA YOUR COMPUTER. OTHER DRIVER FRIENDLY OPTIONS. COMES FROM THE PEOPLE WHO'VE BEEN GETTING DRIVERS TO THEIR DESTINATION FOR DECADES.", "overall": 5.0, "summary": "TRUCK GPS", "unixReviewTime": 1284249600, "reviewTime": "09 12, 2010"}
{"reviewerID": "AMLFNXUIEMN4T", "asin": "0528881469", "reviewerName": "infidel359", "helpful": [2, 2], "reviewText": "I was real psyched when i got it and all the features are what i was looking for in a truck gps. Well that all went away real quick.1.The log feature and milage is inaccurate.2.The speed limits are way off all throughout the country.3.The screen is hard to read on sunny days.4 The  suction cup mount is clunky and comes loose constantly.5.It sent me over ebbers pass while trucking to Lake Tahoe last week.  (14% grade for 15 miles) I won't do that again.6. The power switch has recessed into the unit and will not turn back on.7.Called tech support about returning the unit and the guy barely spoke english.8.I expected better from rand mc'nally.", "overall": 1.0, "summary": "Don't buy the hype on this one.", "unixReviewTime": 1307836800, "reviewTime": "06 12, 2011"}
{"reviewerID": "A2O8FIJR9EBU56", "asin": "0528881469", "reviewerName": "Joe", "helpful": [67, 67], "reviewText": "Well as one of the first to get this I figured I'd give a review. The screen is great. It's pretty clear and seems tough enough not to need a screen protector. The plastic that was on the screen out-of-the-box left glue residue which was a pain to remove. It comes with a stylus that works great but navigating around with your finger is easy and works just fine. I usually just have to tap it with the back of my finger. When you get it, charge it for a few hours before you use it at all. I'm not sure if my over sized good laptop even was charging it. So use the wall outlet. It comes with nice cables for both wall outlet and 12 volt, as well as a good usb cable. The supplied mount is excellent and easy to use. No tools required. The screen part snaps into another flat part on the mount and you have to make sure it's clicked in all the way or it will drop out.. AFTER IT IS FULLY CHARGED, plug it in the pc and get your first free lifetime update. The software loads fine and tries to start up each time you use the computer. I stopped that and made a shortcut to start it myself. There are no options I saw to disable it from auto starting... I used ccleaner/tools/startup to disable it. The program DOES use a lot of resources when running, but you only need to update once in a while.My first drive with it was Tampa to El Paso. It saves my height, width, weight and hazmat class. I was hauling hazmat. It gave a killer route that would have saved time but I had to alter it for the company fuel stops and routes. It tells you everything you need to know. Where travel centers are and what they have, scales and weigh stations and much more which can all be symbols on the map if you wish. YAY now i don't have to buy an iphone. Some stuff in the manual says parts are for future use so I'm guessing the updates are going to give even more. You can manually adjust the zoom. The automatic screen zooming works great. One time it was dark and cloudy with a cool looking sky and I looked at my screen and saw the exact same thing as I approached a ramp. You can save all your addresses and stops and put notes in them for phone numbers and gate codes etc. Then make groups (folders) for your addresses so you can find them even quicker. I sat there for 9 hours like a jerk and typed in all the company terminals and drop yards. It was fun. I'm saving each new stop now with notes too.Once the GPS kinda got confused and mixed up my current rout with a completed one. It may have been my fault but I don't think so. I just restarted it real quick and it worked fine again.I also used it in my car. It's easy to switch between truck and car mode. I drive a medium large car and the 7 inch unit was a bit to big and did obstruct my view a little.The voice is fine and easy to adjust. The thing is nice and it works good. The traffic and road updates for life. I don't have to use internet or buy a netbook (with gps) and software... I'm happy I got it. I don't get lost anymore.I like the TND 700. I'd just like to tell Rand Mcnally that since we spent as much on this as for a laptop, please make this the best and keep updates and innovations coming to us for the next few years at least. I'm kinda expecting you to make the software on the unit and on the TND DOCK (pc software) a bit better. I'd also like to be able to set up routes INTERSTATE to INTERSTATE to INTERSTATE to FINAL in order to comply with company route solutions. Sometimes we can't take all those better routes the unit suggests. You can make this worthy of five stars with just a little more effort.  Well, I gotta haul A$$. Joe", "overall": 4.0, "summary": "really nice truck GPS", "unixReviewTime": 1278547200, "reviewTime": "07 8, 2010"}
{"reviewerID": "A3IQGFB959IR4P", "asin": "0528881469", "reviewerName": "Keith DC", "helpful": [1, 1], "reviewText": "Thought the unit was going to be a good unit, but was I wrong very wrong. The unit has a bad probleum with the 12 volty pulg in. They replaced the unit once in 6 months and the second unit last about 8 months before it started giving me trouble, but would they stand behind it NO NO NO. They said it had been over a year since I had bought the first unit so it was not covered.  The person I talked with at the Tec centered knew very well what I was talking about. If I made something that cost as much and made claims of how great a unit it was I would stand behind it and if I knew of probleums with the 12 plug in I would come up with a fix.  So take your chances if you buy one from Rand McNally hope it last for you but I have my doughts. Have a friend this last week his started have the same probleum so I told him he had better send it in.", "overall": 1.0, "summary": "BAD BAD BAD TND-700", "unixReviewTime": 1327363200, "reviewTime": "01 24, 2012"}
{"reviewerID": "AYTBGUX49LF3W", "asin": "0528881469", "reviewerName": "Laura McClinnis", "helpful": [0, 0], "reviewText": "Was fast and what was expected. Great condition. Only issue is the lifetime maps...cannot access them or purchase the pack.", "overall": 4.0, "summary": "Good Seller!", "unixReviewTime": 1398470400, "reviewTime": "04 26, 2014"}
{"reviewerID": "A24QFSUU00IZ05", "asin": "0528881469", "reviewerName": "lazybum", "helpful": [4, 4], "reviewText": "Twice this item has turned into a useless brickTech support is only 5 days a week during business hours and then you send the unit in for repair, twice in 7 months is not a good signThey tell you it is only a tool and you should preplan the route before trusting its chosen routeMy use of this GPS is to google maps first, pick the best route then use the tnd700 as a guideI do like the features of finding rest stops and scales on route but they are not accurateRecalculating is slow after you miss a turn...They are trying to make it a good product but I feel like they are still in Beta testing of the unit.maybe in in a year or two it will be a decent  productThey also are talking about a new map upgrade that will cost close to $100How about loading it with the right maps before releasing the product?", "overall": 2.0, "summary": "returned twice in 7 months", "unixReviewTime": 1293580800, "reviewTime": "12 29, 2010"}
{"reviewerID": "A1NG5X8VYZWX0Q", "asin": "0528881469", "reviewerName": "lonestar trucker", "helpful": [15, 16], "reviewText": "DONT WAIST YOUR MONEY ON THIS PRODUCT MY CELL PHONE GIVES ME BETTER DIRECTIONS AND FASTER ROUTES TO MY DESTINATION EVEN THOUGH ITS MAINLY A CAR ROUTE. RAND MCNALLY TND 700 HAS GOTTEN ME IN SEVERAL TIGHT SPOTS INCLUDING NON TRUCK ROUTES THAT I HAD TO BACK UP MY TRACTOR TRAILER IN THE MIDDLE OF DOWNTOWN CHARLOTTE.THIS PRODUCT ALSO CANNOT READ MAPS CORRECTLY. IT HAS TOLD ME TO MAKE U TURNS AND GO SOUTH FOR 3 MILES TO CATCH A BY PASS ROUTE TO GET ON I 95  WHEN ALL I HAD TO DO WAS CONTINUE STRAIGHT FOR ABOUT 800 FEET AND MAKE A LEFT TO THE I95 ON RAMP.THE LIST GOES ON AND ON. AND IHAVE TRIED TO CONTACT AMAZON SO THAT I CAN RETURN THIS PRODUCT AS IT REALLY SUCKS. NOW ITS FEATURES LIKE MILEAGE TRACKING BY STATE AND DAY TRAVELED ITS GREAT, BUT WHAT GOOD ARE ITS FEATURES WHEN YOU CANT GET TO YOUR DESTINATION ON TIME OR GET LOST BY THE SAME INSTRUMENT THAT IS SUPPOSED TO ELIMINATE JUST THAT.", "overall": 1.0, "summary": "RAND MCNALLY TND700 SUCKS", "unixReviewTime": 1286582400, "reviewTime": "10 9, 2010"}
{"reviewerID": "A1E4WG8HRWWK4R", "asin": "0528881469", "reviewerName": "Mary", "helpful": [0, 1], "reviewText": "We had the GPS for quite a while with a minimal amount of problems.  The plug in port bent but Rand McNally replaced it.  We puchased the new TND720 and gave the TND700 to our driver.  Well, our ex driver - he was technologically challenged and let the until hang off the dash on a trip from KY to TX. When I told him to secure it to the dash, he threw it in the storage department above the dash, thus the ex employee,I highly recommend the Rand McNally.  Rand McNally provides an excellent product and excellent support.", "overall": 5.0, "summary": "Loved it.....", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "A2AOEW5UGXFOOQ", "asin": "0528881469", "reviewerName": "Roscoe Lee Brown", "helpful": [1, 2], "reviewText": "Back in the old days we used to use a phone number and a road atlas.Those days are over now.Just type in the address and go.The Intelliroute will get you there with no worries about low underpasses or any other areas those 4-wheeler GPS systems may not be aware of.If you don't have one,what are waiting on?", "overall": 5.0, "summary": "Can't be without this...", "unixReviewTime": 1294790400, "reviewTime": "01 12, 2011"}
{"reviewerID": "A2XSWV6AQI90BR", "asin": "0528881469", "reviewerName": "Snidely", "helpful": [2, 2], "reviewText": "I have had this TND700 since October. #1 IT IS VERY VERY VERY VERY SLOW!!! IT TAKES SO LONG TO RECALCULATE A ROUTE WHEN YOU MISS A TURN THAT YOU WILL PROBABLY MISS THE NEXT TURN ALSO!! On 1 regular trip it wants to route me 98 miles further than necessary. It shows truck restricted routes where there are none (Route US2 in Vermont & Route US1 bypass in Portsmouth, NH for 2 examples). Friday 03/11/11 it told me to go South when I knew I should go North. Another very irritating feature is that the \"back\" buttons are in different places in each screen. Near Waterbury Connecticut it shows the speed as 45 mph on I84 when in reality it i55 mph. The unit stopped working and I thought it was the 12 volt power cord so I got a return authorization and sent it back with the 12 volt cord. Rand McNally sent me a \"refurbished\" which still does not work because the power cord is bad. I had to pay the return shipping. It tracks state mileage for IFTA reporting but that too is inaccurate. In 500 miles it is off more than 25 miles. In short I would not recommend this to anyone.", "overall": 1.0, "summary": "Not worth buying", "unixReviewTime": 1299974400, "reviewTime": "03 13, 2011"}
{"reviewerID": "AR84FMFYCQCWF", "asin": "0528881469", "reviewerName": "somewhereinusa", "helpful": [3, 3], "reviewText": "I've had this for about 6 months now. This is the worst GPS I've owned out of 4. It very seldom picks the best, or shortest route. It will let you put in multiple stops, but you only get info to the NEXT one. If you don't like a route and put in a VIA, guess what you only get info to the new VIA, how am I supposed to know if the new route is better? Routing is unbelievably slow, I've had it take up to 30 minutes, then get it wrong. Adding things to the notes just puts it into one long line. How about putting a return so I can at least organize a little bit. Very cumbersome to use, it's of little or no use for long range trip planning. I wouldn't recommend this to anybody at any price.", "overall": 1.0, "summary": "VERY poor GPS", "unixReviewTime": 1296691200, "reviewTime": "02 3, 2011"}
{"reviewerID": "A19TBA1WARJS55", "asin": "0528881469", "reviewerName": "trucker", "helpful": [0, 0], "reviewText": "I bought this product to use primarily for work. I log 3200+ mile a week and thought this would be a good to tool to have. I love the graphics. There were a few times that it routed me thru some residential areas and a couple of times I wondered if a truck was even legal at all. I loved the feature where I could see if there was a truck stop or rest area close by though it does not have them all. My main concern or problem with this device is in the charging port. The unit get to hot at this port. I went thru 3 12vlt chargers and 1 house wall charger. eventually the plug in had got to the point of being brittle and fell apart. I talk to Rand McNally about this they sent me 1 12 volt charger. But I had to pay for the rest and if I wanted them to look at it I would have to pay shipping out of my pocket. I have a problem with that because I paid so much for it to start. I had it about 2 mos. when it started having problems. I had it 10 mos. when it finally became useless and I thrrew it away. I replaced it with the rand Mcnally 510. It's a whole different animal with a whole lot more problems and will be taken back today.", "overall": 2.0, "summary": "some what disappointed", "unixReviewTime": 1340496000, "reviewTime": "06 24, 2012"}
{"reviewerID": "A3C5SMBSKKWNPT", "asin": "0528881469", "reviewerName": "Trucking dude", "helpful": [5, 8], "reviewText": "This GPS ROCKS!! Dont even bother with other questionable units. The extra features alone make this one of the best GPS purchases you will ever make. There is too much to list, but it is one of my daily driving tools that I couldent live without. Sure it's a little spendy, but the updates are free and lifetime. The timers and logs feature alone saves me a lot of time and keeps me infrmed when my driving day is current and legal.", "overall": 5.0, "summary": "Buy this Unit!!", "unixReviewTime": 1285113600, "reviewTime": "09 22, 2010"}
{"reviewerID": "A24EV6RXELQZ63", "asin": "0528881469", "reviewerName": "Wayne Smith", "helpful": [0, 0], "reviewText": "I've had mine for a year and here's what we got. It tries to route be down non truck routes while telling me the truck route is illegal for me. This is such a bad problem that even Interstate 25 in Denver Colorado is listed (according to this GPS) as a non- truck route and will route you through the city instead. There are several drivers within our company who own one and more than half (of about 50) have crashed to an un-recoverable state. Our company representative said that Rand McNally informed them that the GPS was not designed to say on for a long period of time. Really? it's a truck driver GPS. We have one driver with a $2400 dollar ticket due to this GPS routing him down the wrong road. The companies response was to update the unit. I've had mine for a year, I never noticed one update that corrected functionality, they only seem to keep messing the tools. I want a GPS that routes, if I wanted tools I'd buy software for my computer.My suggestion is to by a nice Garmen. My one rated for cars actually routes me better than this one rated for trucks.Wayne", "overall": 1.0, "summary": "Major issues, only excuses for support", "unixReviewTime": 1317254400, "reviewTime": "09 29, 2011"}
{"reviewerID": "A3T6ZQONABIJSG", "asin": "0528881469", "reviewerName": "WCN49", "helpful": [0, 0], "reviewText": "Great software; horrible hardware.  Replaced it with a 720.  Best GPS program on the market for truck drivers,IMO, but Rand McNally &#34;has no fix&#34; for the excessive and early death rate on the 700 and 710.  Still...it's a great program and  I bought the 720.  Hope they fixed the morbidity problem.....", "overall": 1.0, "summary": "Lasted less than 3 months", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
{"reviewerID": "A132P6YSJSI5G2", "asin": "0528881469", "reviewerName": "wild willie", "helpful": [2, 2], "reviewText": "never was loud enough. trying to get rand to repair it now. had to buy a new set of head phones to find out if the problem was in the speaker or elswhere. hole for audio output is 2.5mm, really a bad idea rand! all external speakers have 3.5mm plugs, mp3 players 3.5. pain in the butt. i loved my tom tom but 53 foot trl. and residential areas dont mix. tom tom has 35? different voices .... rand 2. speed limit for trucks in il. is 65 on interstates except for chi. area but rand says 55 everwhere. needs a seperate clock, not just eta or clock, needs both. loved the announcement ... arrive dest. on right or left when i could hear it.,.......... just got it back from rand fast turnaround 4 days speaker now works but still not loud enough for an old man in a screaming truck with the window opened acrack to let the smoke out, mp3 or xm up loud etc. found a speaker at pilot that fits.....for telephones, has to have a seperate power source.... i wouldnt advise buy this gps ,too many bugs in it.", "overall": 2.0, "summary": "speaker died after 2 weeks, .", "unixReviewTime": 1298851200, "reviewTime": "02 28, 2011"}
{"reviewerID": "A1NQPG5IJ43HJI", "asin": "0558835155", "reviewerName": "William J. Saylor", "helpful": [0, 0], "reviewText": "Works ok, but I do not like the feel of the ear pieces, they are hard to keep on your ear, would not recommend.", "overall": 3.0, "summary": "Works ok, but ear pieces are uncomfortable", "unixReviewTime": 1372550400, "reviewTime": "06 30, 2013"}
{"reviewerID": "A2WOJCFAWI8VS8", "asin": "059400232X", "reviewerName": "Carol B.", "helpful": [0, 0], "reviewText": "This cover fits very nice, and looks like rich leather, fits my nook to a tea, also has extra pockets in it.", "overall": 5.0, "summary": "Cover for my nook.", "unixReviewTime": 1379376000, "reviewTime": "09 17, 2013"}
{"reviewerID": "A22FB2WSZSXSHH", "asin": "059400232X", "reviewerName": "Kayti", "helpful": [1, 2], "reviewText": "I bought this for my daughter. I'm the writer she's the reader..so it fit. lolThis cover is beautiful, and sturdy. Makes the nook have the look and feel of a real book. And according to my daughter is inconspicuous in class. :)It's synthetic leather but it's very elegant. Also. It's not gender specific. My Son wouldn't feel embarrassed to carry it around. :)", "overall": 5.0, "summary": "Beautiful", "unixReviewTime": 1348790400, "reviewTime": "09 28, 2012"}
{"reviewerID": "AZQZ3STMCBG5H", "asin": "059400232X", "reviewerName": "Rose Mitchell", "helpful": [0, 0], "reviewText": "Very happy.with.my nook cover.  I want one with a different quote but this one is fine.  I love the cover.", "overall": 5.0, "summary": "love it.", "unixReviewTime": 1395705600, "reviewTime": "03 25, 2014"}
{"reviewerID": "A2EGPA22UHMQXL", "asin": "0594012015", "helpful": [0, 0], "reviewText": "Didn't work, had to send back", "overall": 1.0, "summary": "One Star", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "AC57CU3TF6ZMJ", "asin": "0594012015", "reviewerName": "Becky K.", "helpful": [0, 0], "reviewText": "just what I needed!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
{"reviewerID": "A2YX0Z6RHA8Y2H", "asin": "0594012015", "reviewerName": "Chortovka", "helpful": [0, 0], "reviewText": "I need to buy my third power cord within 1 year.  I refuse to do so.  The Nook power cord is NOT designed to last and causes nothing but problems ... it's either discharging or not charging.  And, I'm dismayed that I cannot buy a Nook external charger to charge my Nook while on a 3 week vacation.  I'm giving up the Nook and going to a Kindle Fire.", "overall": 1.0, "summary": "Power Cord", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A38T51B7J6QVD9", "asin": "0594012015", "reviewerName": "emma young bey", "helpful": [1, 1], "reviewText": "Does not charde the Nook tablet or Nook color as states. Has een in touch with company for feedback and NOTHING...Never again", "overall": 1.0, "summary": "Does not work", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}
{"reviewerID": "A1HOSS7PNC1LMU", "asin": "0594012015", "reviewerName": "Leo Ockert", "helpful": [3, 3], "reviewText": "Sending it back,they had in theirs ad as charger for Nook Color,it is not. The only good thing it came superfast. It is for black and white Nook. They over charge for it. Like twice as much for b&w; Nook,you can get at B&N;store. I now notice they don't  any longer put now it is for Nook Color.", "overall": 1.0, "summary": "They had down for a Nook color,it is not.", "unixReviewTime": 1374537600, "reviewTime": "07 23, 2013"}
{"reviewerID": "A9HI77BE35VYE", "asin": "0594012015", "reviewerName": "Maya", "helpful": [1, 1], "reviewText": "It's doesn't charge my nook at all !! I want my money back! It's more like a phone charger & changes a phone so DO NOT BUY THIS !!", "overall": 1.0, "summary": "Horrible !!", "unixReviewTime": 1373932800, "reviewTime": "07 16, 2013"}
{"reviewerID": "A3HFUWKSPF5QEH", "asin": "0594012015", "reviewerName": "Paula Shah", "helpful": [0, 1], "reviewText": "I received my power cord in a very quick manner and although I haven't opened it because it's for a friends Nook, I'm grateful the seller was able to get it to me so fast and in perfect condition.", "overall": 5.0, "summary": "review", "unixReviewTime": 1374278400, "reviewTime": "07 20, 2013"}
{"reviewerID": "A38ETMHM9ATSF0", "asin": "0594012015", "reviewerName": "Pen Name", "helpful": [2, 2], "reviewText": "Horrible! It doesn't charge my Nook at all! Do not buy this charger for your Nook. I want a refund.", "overall": 1.0, "summary": "Don't do it", "unixReviewTime": 1374105600, "reviewTime": "07 18, 2013"}
{"reviewerID": "A34O6MND17VDDH", "asin": "0594017343", "reviewerName": "Mark A. Peot", "helpful": [1, 1], "reviewText": "My 11 year-old daughter saved her money for a long time to purchase an eBook reader. She finally selected a NOOK Touch and purchased the eBook (only) without the extended warranty. She selected the NOOK because of the plethora of free books offered for this platform and because of the touch screen display.The touch screen shattered after a week of light use. Unfortunately, this breakage is not covered under the normal NOOK warranty. She was devastated.I gave her the now-ancient Kindle 1 that we acquired in 2007. This Kindle has traveled extensively and seems absolutely bullet-proof.Neither my daughter nor I will purchase another NOOK. The NOOK Simple Touch is a piece of junk.", "overall": 1.0, "summary": "Nook Touch screen is fragile.", "unixReviewTime": 1323216000, "reviewTime": "12 7, 2011"}
{"reviewerID": "A3JSAGWSLY5044", "asin": "0594017580", "reviewerName": "Norma Cullen", "helpful": [0, 0], "reviewText": "Just so you know ... you need to put something in front of the reader so the pages don't turn.  I think the &#34;pocket&#34; in front hits the glass and makes the page turn back (sometimes several pages).", "overall": 3.0, "summary": "Just so you know... you need to ...", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}
{"reviewerID": "A3B12X05JZKM94", "asin": "0594033896", "helpful": [0, 0], "reviewText": "Very nice.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
{"reviewerID": "AKZOMZCNU41GZ", "asin": "0594033896", "reviewerName": "Cheriese Williams", "helpful": [1, 1], "reviewText": "Paid less than $5 for these protectors (99 for the product,  around $4 for shipping). Good to protect your nook from scratches on the screen. Cleaned the screen as instructed but still had a few air bubbles. Wished the protector fit the entire front of the nook (doesn't cover the black part of the screen) but again I only paid less than $5 for the protectors and happy to keep my nook clear of scratches.", "overall": 4.0, "summary": "good for the cost", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A2XTFY0GJDF3R2", "asin": "0594033896", "reviewerName": "C. Park", "helpful": [1, 1], "reviewText": "Does not effect screen visibility, but a bit tricky to put on. I would recommend starting from the top edge and simultaneously press on to the screen while peeling off the backing.", "overall": 4.0, "summary": "Good protection for Nook Color screen", "unixReviewTime": 1300233600, "reviewTime": "03 16, 2011"}
{"reviewerID": "A3ILG56NE5QU37", "asin": "0594033896", "reviewerName": "Debbie Abbott", "helpful": [0, 0], "reviewText": "Works great for my Nook, saves on grand kids ruining the nook. Will be buying more of the product again", "overall": 5.0, "summary": "clear screen protector", "unixReviewTime": 1399420800, "reviewTime": "05 7, 2014"}
{"reviewerID": "AOK77THMKCGXZ", "asin": "0594033896", "reviewerName": "Wolfy", "helpful": [0, 0], "reviewText": "These screen protectors fit the size of the screen, but I personally find them very hard to clean, and they seem to increase the glare of the screen.  They did arrive on time and as described.", "overall": 4.0, "summary": "Screen protector", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"}
{"reviewerID": "A24RBL3W5W6SAN", "asin": "0594033926", "reviewerName": "Angelique Clarke", "helpful": [1, 1], "reviewText": "This is my third cover since I've had my nook and this one brings my two-year-old Nook back to life. Sturdy, elegant, and better than the other options in the store or online. Even better than I expected. Love the inside pocket. I got a really great deal for this price.", "overall": 5.0, "summary": "Excellent cover", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}
{"reviewerID": "A2RX85Y4S27N2J", "asin": "0594033926", "reviewerName": "Cathey Holton", "helpful": [2, 3], "reviewText": "This was an old size for an older Nook that was no longer sold in B&N. did not fit my Nook. There was no way to know this before purchase.", "overall": 1.0, "summary": "Nook cover", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"}
{"reviewerID": "A253JJFXQNPCOJ", "asin": "0594033926", "reviewerName": "Colleen", "helpful": [0, 0], "reviewText": "The product claimed to be new but the outer packaging was extremely beat up so I had to take the product out of its case and gift it that way. The product looked new but the packaging was not presentable at all which in turn made me questions whether or not the product was actually new.", "overall": 4.0, "summary": "Good Product, Bad Packaging", "unixReviewTime": 1387584000, "reviewTime": "12 21, 2013"}
{"reviewerID": "AHYURLVH267MA", "asin": "0594033926", "reviewerName": "D. Jeshurin", "helpful": [1, 1], "reviewText": "I am very happy with my Nook tablet cover. The quality is very high and I really like the protection it offers my tablet.", "overall": 5.0, "summary": "Great fit and beautifully made", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
{"reviewerID": "A1FXYTO11KEJ2P", "asin": "0594033926", "reviewerName": "Emily", "helpful": [0, 1], "reviewText": "I rated it 4 star because I didnt get the right cord to charge the nook. Was sent the wrong power cord and had to buy the right cord for almost the same price I bought the nook for.", "overall": 4.0, "summary": "sent wrong power cord to charge nook", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
{"reviewerID": "A2TKKYL3GKFS2M", "asin": "0594033926", "reviewerName": "G. Sweet", "helpful": [1, 1], "reviewText": "I received my purchase in perfect condition, The packaging was in great shape, and the product is brand new. You can tell that it is new because it is a bit stiff when you open it, as is any new book. Very happy with this product and would definitely buy again at this price.", "overall": 5.0, "summary": "Excellent product.", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "A3F069UFW04K1E", "asin": "0594033926", "reviewerName": "Joyce Jensen", "helpful": [1, 1], "reviewText": "Exactly as described, very fast shipping, it's perfect! Very happy with my purchase. I love that you can get hard to find items here for a very reasonable price.", "overall": 5.0, "summary": "perfect, exactly as described", "unixReviewTime": 1392249600, "reviewTime": "02 13, 2014"}
{"reviewerID": "A3HQ8RXUMJ2Y58", "asin": "0594033926", "reviewerName": "Judith Donegan", "helpful": [1, 1], "reviewText": "Received the Nook cover in the time that was suppose to and the cover was in excellent condition. Was glad to be able to find this as it is not available in the stores any longer. Was pleased with the product and timely manner in which it was received.", "overall": 5.0, "summary": "Barnes & Noble Leather Cover for Nook", "unixReviewTime": 1400976000, "reviewTime": "05 25, 2014"}
{"reviewerID": "A2MNKBHPMBB0EA", "asin": "0594033926", "reviewerName": "Linda Sullivan", "helpful": [1, 1], "reviewText": "I was amazed at the price of this leather cover.  It is exactly the same as what youpay three times as much in the book store.  Well done Amazon", "overall": 5.0, "summary": "Very happy with this product.", "unixReviewTime": 1390003200, "reviewTime": "01 18, 2014"}
{"reviewerID": "A3HGTTFIDLCWDJ", "asin": "0594033926", "reviewerName": "Medici", "helpful": [1, 1], "reviewText": "The cover is snazzy looking if a bit stiff, probably due to the leather. I wish it had the extra little pockets that the original vinyl one had (from April 2012), made of the same material and color as the cover, with the lining as contrast, but, at least it has one pocket, good for the hand to slip into and hold the tablet with the cover bent backwards. I prefer the leather look one I had to the real leather, because it wasn't as stiff and was slightly less heavy.B&N; has the best covers for devices by far. This may come from their long experience with book publishers. They should make them for all devices. The 3 point holders are perfect, as is the construction of the cover. Whatever it's made of, it's well suited to the purpose.", "overall": 4.0, "summary": "Sharp looking", "unixReviewTime": 1396483200, "reviewTime": "04 3, 2014"}
{"reviewerID": "AYM7NJTTX3M0L", "asin": "0594033926", "reviewerName": "Mike", "helpful": [1, 1], "reviewText": "Love the cover and it works great.  Could not believe the quality of the cover for the price I paid.", "overall": 5.0, "summary": "Great Cover", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A2PL24SVISXZM9", "asin": "0594033926", "reviewerName": "Shermika", "helpful": [1, 1], "reviewText": "Recently gave a friend my Nook Color because I upgraded to the Nook HD+ so when I came to find a cover for my case I thought I would look for one for him friend also. Since hes a guy I figured he would want something basic and dark not to flashy and this is what I found. I myself also love this look and wish they had it for the HD+ also. This cover costs way more at Barnes and Noble and you're getting here for a steal who wouldn't love that.", "overall": 5.0, "summary": "What a steal!!! In a good way. LOL", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}
{"reviewerID": "A3I1C8WM8DLSMM", "asin": "0594033926", "reviewerName": "tmr", "helpful": [1, 1], "reviewText": "I bought this nook really cheap, being a little obsolete,  so to find this cover still available was a great surprise! I was looking for a cheap generic one and this one was even cheaper, but is a genuine nook leather cover.  Great protection and looks great too.", "overall": 5.0, "summary": "yes it is a little outdated!", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}
{"reviewerID": "A29LNVZLBG0IYN", "asin": "0594033926", "reviewerName": "Todd Schlientz", "helpful": [0, 0], "reviewText": "Excellent value for the money. Way nicer than I thought it would be. I am pleasantly surprised. I would recommend.", "overall": 5.0, "summary": "Great product at a great price.", "unixReviewTime": 1402876800, "reviewTime": "06 16, 2014"}
{"reviewerID": "A2CP4GY6XAWIII", "asin": "0594033926", "reviewerName": "tracy beeler", "helpful": [0, 0], "reviewText": "I already had a Nook Cover just like this one, it has been used regularly for the last 3-4 years and has worn out . I am so glad I found this on line, because they are not sold in stores anymore.I ordered this on a Thursday and received it on the following Monday!! Much sooner than I expected. Very happy with the product and service!", "overall": 5.0, "summary": "Very Impressed", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "A1UMFN4RKU451R", "asin": "0594033934", "reviewerName": "Ashley Crawford", "helpful": [0, 0], "reviewText": "I bought this case because I loved the color and quote on it. I was extremely happy when it came due to the great quality of the leather and how durable it feels when you hold it. I have used it for over a year now and it is still in great condition. I would recommend this to anybody.", "overall": 5.0, "summary": "Great Buy", "unixReviewTime": 1359244800, "reviewTime": "01 27, 2013"}
{"reviewerID": "A3T3XKC7H5ACI1", "asin": "0594033934", "reviewerName": "KyMama", "helpful": [0, 0], "reviewText": "Received this cover awhile ago and I absolutely love it! It looks exactly like the picture and my nook fits very securely in it. Only thing that would make it better would maybe be a slot to hold a stylus and something to keep the cover closed. All in all I love love love it! This goes everywhere with me", "overall": 5.0, "summary": "Love it!", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"}
{"reviewerID": "A1NQNJ3EAZ6CMZ", "asin": "0594202442", "reviewerName": "Nik G", "helpful": [0, 0], "reviewText": "I bought this cover for my girlfriend for Christmas. The only complaint she's had so far is the taking a photo with the case on. You have to kinda hold the flap in order to take it. That sounds pretty minor to me though.", "overall": 4.0, "summary": "Very Nice Cove", "unixReviewTime": 1360108800, "reviewTime": "02 6, 2013"}
{"reviewerID": "A34TPQUVSQXXPX", "asin": "0594287995", "reviewerName": "Tome Collector", "helpful": [0, 0], "reviewText": "what can i say? it's kate spade... that implies an attention to detail that should say it all... it does", "overall": 5.0, "summary": "great", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A2B4F6LP0ZLI8E", "asin": "0594296420", "reviewerName": "Carol", "helpful": [1, 1], "reviewText": "I bought this item to replace the original charger that I'd lost. think is pricey and I was disappointed when I noticed the box only had the adapter, as the original box had both the plug and adapter. Don't buy just by the picture displayed, make sure to read the description. I am still missing the USB cable", "overall": 3.0, "summary": "Plug replacement needed", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "A1RKH6803HVOQL", "asin": "0594296420", "reviewerName": "Col \"Col\"", "helpful": [1, 1], "reviewText": "This is a NOOK product and works as advertised. When I'm travelling without a laptop or don't have a computer around to recharge my Nook, this is great -- just plug it into any  110 outlet and plug in your Nook with it's cable. You can also sit there and continue reading while Nook charges-- very handy if someone else is hogging the computer. It could be my imagination, but Nook seems to charge faster this way rather than by going through computer. There was no color choice and the product I received is white.", "overall": 5.0, "summary": "Works with NOOK as advertised", "unixReviewTime": 1365379200, "reviewTime": "04 8, 2013"}
{"reviewerID": "A3ZNVCQCG57AY", "asin": "0594296420", "reviewerName": "Kelly K.", "helpful": [0, 0], "reviewText": "I purchased this plug to see if it would work with the Mediabridge Brand USB to Micro USB card that I had purchased, because after getting the cable, my tablet wouldn't charge plugged into just any outlet.  I have a NOOK Color, and that plug worked to charge the tablet.  So I saw this one (at the largest Mass Merchandising store) for half the price here at Amazon and purchased it to try.  And it works.  Charges my Toshiba Excite perfectly through the micro USB port.  Now I can leave my original plug and cable at home and use this Nook Plug and Mediabridge Cable at work.  Perfect!  No more cords in my purse.The Mediabridge cable I purchased:Mediabridge High Speed USB 2.0 - (Coiled) - A-Male to Micro-B CableFor under $20 I have an extra cable and plug to charge my Toshiba Excite.", "overall": 5.0, "summary": "Works to Charge my Toshiba Excite Tablet", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A1HM74IXWXQ5D8", "asin": "0594296420", "reviewerName": "Matthew Frank", "helpful": [1, 1], "reviewText": "Got a nook for my wife and figured a wall adapter would help her out.  This was a great price and works well.", "overall": 5.0, "summary": "Great Item", "unixReviewTime": 1392854400, "reviewTime": "02 20, 2014"}
{"reviewerID": "A2DUI0YVE1DZ48", "asin": "0594296420", "reviewerName": "Pen Name", "helpful": [0, 0], "reviewText": "Perfect for me so that I don't have to take my computer on travel just to charge my nook.  Works with the cord that came with my nook.", "overall": 5.0, "summary": "Nook charging adapter", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
{"reviewerID": "AH3LYMIBZ6DKF", "asin": "0594296420", "reviewerName": "robert engstrom", "helpful": [0, 0], "reviewText": "now i can charge my nook anywhere, no need for pc. a touch pricey at about $10, but i'm happy.", "overall": 5.0, "summary": "love it", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "AWA0CM7TY98QX", "asin": "0594450209", "reviewerName": "steve martell", "helpful": [0, 0], "reviewText": "my third nook, my third lautner cover, nothing beats them. I would definitely purchase this cover for my nook again. Fits my Nook HD 7\" perfectly", "overall": 5.0, "summary": "great nook cover", "unixReviewTime": 1382313600, "reviewTime": "10 21, 2013"}
{"reviewerID": "A244IAP7UBVHH6", "asin": "0594450209", "reviewerName": "virginia p westacott", "helpful": [0, 1], "reviewText": "I think the item was a quality item. The problem is that it is the wrong cover for my granddaughter's Nook.  Who knew there were different sizes of Nook?  I certainly didn't.", "overall": 5.0, "summary": "Nook comes in two sizes.  My Christmas gift didn't fit.", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "A3E7PG9CHDBICA", "asin": "0594450705", "reviewerName": "Amazonian", "helpful": [0, 0], "reviewText": "After reading other reviews and becoming worried about the cap popping off, I'm pleased to say that this has not been an issue with mine.  It's surprisingly handing to have a pen/stylus combo on hand at all times and the stylus part is very responsive.  I haven't had any problems yet with the stylus portion but I am a bit worried that it could pop off as I've had this problem with other styli.  The tip is a bit softer than other styli I've had so I'll be watching.  Otherwise though, I love this thing.", "overall": 5.0, "summary": "Stylus Surprised", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
{"reviewerID": "A2JXAZZI9PHK9Z", "asin": "0594451647", "reviewerName": "Billy G. Noland \"Bill Noland\"", "helpful": [3, 3], "reviewText": "I am using this with a Nook HD+. It works as described. The HD picture on my Samsung 52&#34; TV is excellent.", "overall": 5.0, "summary": "HDMI Nook adapter cable", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A1RTWWRHVIVWQW", "asin": "0594451647", "reviewerName": "Brenda Hayn", "helpful": [0, 0], "reviewText": "Works perfectly for tv viewing.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A2P5U7BDKKT7FW", "asin": "0594451647", "reviewerName": "Christian", "helpful": [0, 0], "reviewText": "The cable is very wobbly and sometimes disconnects itself.The price is completely unfair and only works with the Nook HD and HD+", "overall": 2.0, "summary": "Cheap proprietary scam", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "A262D8GC5XRU31", "asin": "0594451647", "reviewerName": "Craig R. Kern \"cooknman\"", "helpful": [0, 1], "reviewText": "It does exactly what is says.  Can't get any better than that!  Nice to be able to watch movies on the big screen as opposed to my little Nook screen!", "overall": 5.0, "summary": "Works just dandy", "unixReviewTime": 1400025600, "reviewTime": "05 14, 2014"}
{"reviewerID": "AAZ084UMH8VZ2", "asin": "0594451647", "reviewerName": "D. L. Brown \"A Knower Of Good Things\"", "helpful": [0, 0], "reviewText": "This adaptor is real easy to setup and use right out of the box. I had not problem with it at all, it is well worth the purchase. I recommend this adaptor very much for viewing your Nook videos on your HDTV. I just disagree with other reviews on the length of the adaptor, I found it to be fairly adequate as to how and where it is connected to my TV. For me it was just right not too long or too short, I was able to place my Nook right below the connection on the TV stand, it did not fall or anything else, it is fine. Use your own judgement, I'm too busy watching my movies :)", "overall": 5.0, "summary": "A Perfdect Nook HD+ hook up", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"}
{"reviewerID": "A3M122DYN9L5N8", "asin": "0594451647", "reviewerName": "Ilya V.", "helpful": [0, 5], "reviewText": "Adapter does not work from the begining.It is absolit.Didl not have time to sent it back.Going to return it sioon.", "overall": 1.0, "summary": "Adapter does not work.", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A3S0RV5ZQ37538", "asin": "0594451647", "reviewerName": "laura holmes", "helpful": [0, 0], "reviewText": "adapter was so easy to hook up my 72 year old mother did it herself. she loves it. it works great.", "overall": 4.0, "summary": "nook adapter kit for hdtv", "unixReviewTime": 1399075200, "reviewTime": "05 3, 2014"}
{"reviewerID": "A150Y5KRN7FWJJ", "asin": "0594451647", "reviewerName": "leonel osorio", "helpful": [3, 5], "reviewText": "THIS IS GREAT NOW I CAN WATCH THE MOVIES FROM MY NOOK ON MY TV THATS BADASS THAT IS COOL", "overall": 5.0, "summary": "COOL", "unixReviewTime": 1384646400, "reviewTime": "11 17, 2013"}
{"reviewerID": "AEZ3CR6BKIROJ", "asin": "0594451647", "reviewerName": "Mark Dietter", "helpful": [0, 0], "reviewText": "This adapter easily connects my Nook HD 7&#34; to my HDTV through the HDMI cable.  This is good for traveling because it makes any hotel TV a potential smart TV so long as there is an accessible HDMI port.  It is also good for sharing photos from FB on a bigger screen. A bit pricey, but a good accessory to have.  Be sure to note that this is ONLY for the Nook HD and HD+ series.  It will not work with a standard Nook.", "overall": 4.0, "summary": "A nice easy to use accessory.", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A3BY5KCNQZXV5U", "asin": "0594451647", "reviewerName": "Matenai", "helpful": [3, 3], "reviewText": "This product really works great but I found the following items you need to keep in mind:- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device.", "overall": 5.0, "summary": "This works great but read the details...", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A1JIOBEWHVV8MC", "asin": "0594451647", "reviewerName": "Mitchell Weaver", "helpful": [0, 0], "reviewText": "You just plug it in and change the source on your display. Boom. Mirrored tablet.I haven't had any troubles with this since I've had it, and it's proven mighty useful. Want to watch some YouTube videos at a friend's place, but don't want to gather around a tiny screen? Just hook it up to the TV, use the YouTube app on your nook, and everyone's happy.", "overall": 5.0, "summary": "Simple to use", "unixReviewTime": 1393545600, "reviewTime": "02 28, 2014"}
{"reviewerID": "A2OJRZGW5YVGNS", "asin": "0594451647", "reviewerName": "oldman", "helpful": [2, 3], "reviewText": "This is a must have for the nook.  You can project anything on your display to the tv such as netflix, applications such as games.No other tablet i know of does this at HD quality.  I use it like a DVR.", "overall": 5.0, "summary": "A must have", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A14KUMEJ094IZ3", "asin": "0594451647", "reviewerName": "pgb52", "helpful": [0, 0], "reviewText": "Provides HDMI interface and allows charger to be connected at the same time.  Now I can watch Netflix on my older, non internet ready HDtvs.  The Nook is so much faster than the TV's or my Blu-Ray player, I now us it to watch anywhere in the house.", "overall": 5.0, "summary": "Works Great", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"}
{"reviewerID": "A212UCG62RO8JF", "asin": "0594451647", "reviewerName": "Susan Akridge", "helpful": [3, 3], "reviewText": "Great to be able to hook your nook up to TV and watch netflix, hbo-go, etc on it.  Cord could be a bit longer, but works okay - just have to have nook close to the tv.", "overall": 5.0, "summary": "Works well", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A18U7ZDE2VHD01", "asin": "0594477670", "reviewerName": "J. C. Martin \"Family Gamer\"", "helpful": [0, 0], "reviewText": "Great screen protector! I took it to the store to have them install it and there are no bubbles at all. If I had done it there would have been lots of bubbles. LOL", "overall": 5.0, "summary": "Really saves your screen", "unixReviewTime": 1361232000, "reviewTime": "02 19, 2013"}
