{"reviewerID": "A9DMTMLFR9CO5", "asin": "0001393774", "reviewerName": "Albert Luguterah", "helpful": [0, 0], "reviewText": "fantastic. old time religion is good for me. the Gospel never expires, as valid today as it was when composed", "overall": 5.0, "summary": "i love it", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "AHG1GTQZUYNJN", "asin": "0001393774", "reviewerName": "CAROLYNE CHAMBERLAIN", "helpful": [0, 0], "reviewText": "I HAD THE ALBUM FOR YEARS AGO ....AND I AM VERY HAPPY TO REPLACE IT INT HE CD FORM....HE IS THE MUSICAL EVANGEL.....", "overall": 5.0, "summary": "PURE JOY!", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}
{"reviewerID": "A2TFO7NREP2B2D", "asin": "0001393774", "reviewerName": "cindy terpening_smith", "helpful": [0, 0], "reviewText": "Pure praise to throne room. He had a unique style all his own. He was taken in death to soon.", "overall": 5.0, "summary": "pure", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"}
{"reviewerID": "A2YAPAG1IPNK7K", "asin": "0001393774", "reviewerName": "diane tousley", "helpful": [0, 0], "reviewText": "I have always loved Keith Green's music and hadn't heard it in over 30 years.  I was thrilled to find it available on Amazon.  It's a beautiful and spiritual CD", "overall": 5.0, "summary": "Love this CD!", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}
{"reviewerID": "AEKGGV851HY3K", "asin": "0001393774", "reviewerName": "D. MILLS", "helpful": [13, 15], "reviewText": "Keith Green had a passionate love for Jesus.  This is evident in his life as well as in his music.  He didn't preach Jesus at concerts sponsored by beer companies.  He didn't get divorced and remarried.  He didn't live a life of luxury off of his royalties while billions starved.  He was the real deal.  He was a real Christian.Much of his music consists of love songs to God, and listening to this music Keith's love for Jesus encourages me.  Hearing the tender serenades of a true lover of Jesus fans the flame of the listener's own passion.  It's contagious.", "overall": 5.0, "summary": "Passionate Faith Is Contagious", "unixReviewTime": 1130803200, "reviewTime": "11 1, 2005"}
{"reviewerID": "A2MRQG8RN5JI7R", "asin": "0001393774", "reviewerName": "janice", "helpful": [0, 0], "reviewText": "i love this cd i had a cassette so had to get a cd the songs have so muchmeaning and i think of the children that were lost. love it", "overall": 5.0, "summary": "songs for the shsephers", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"}
{"reviewerID": "A12R54MKO17TW0", "asin": "0001393774", "reviewerName": "J. Bynum", "helpful": [1, 1], "reviewText": "Keith Green / Songs for the Shepherd:  His previous albums were more focused on encouragement and correction towards the Church.  This, his last, is focused on Praise.  This one is still not as great as his first album, but it is a strong enough Praise album to earn Five Stars.", "overall": 5.0, "summary": "His last album is focused on Praise", "unixReviewTime": 1326067200, "reviewTime": "01 9, 2012"}
{"reviewerID": "A1C7NPVPFF4OO8", "asin": "0001393774", "reviewerName": "Lisa L. Powell", "helpful": [1, 1], "reviewText": "As soon as it reached me, I played and listened to it and I had a flashback moment to the eighties when I heard it and when I saw him in concert just before his death.  I wept but smiled because I was soo blessed by the music and I hope you are encourage to get this as well.", "overall": 5.0, "summary": "This is album is absolutely Blessed!", "unixReviewTime": 1374364800, "reviewTime": "07 21, 2013"}
{"reviewerID": "A22X72C51HQ7AS", "asin": "0001393774", "reviewerName": "Martha Ory", "helpful": [0, 0], "reviewText": "It is a very good CD for my collection of Keith Green music. I am so glad I was able to find it", "overall": 5.0, "summary": "Keith Green Collection", "unixReviewTime": 1390262400, "reviewTime": "01 21, 2014"}
{"reviewerID": "A1JE8B5PU9ISMC", "asin": "0001393774", "reviewerName": "Michelle Toste", "helpful": [1, 1], "reviewText": "The product (tape) arrived quickly, and in excellent condition. Seller also included some bonus tapes which were a nice touch. I appreciate the great service, and the generosity of the extra tapes. Would like to buy from this seller again!", "overall": 5.0, "summary": "Went over and above in meeting expectations!", "unixReviewTime": 1238457600, "reviewTime": "03 31, 2009"}
{"reviewerID": "A1WX42M589VAMQ", "asin": "0001393774", "reviewerName": "Mir", "helpful": [10, 10], "reviewText": "I cannot tell you how many tears I've shed listening to these songs and how many prayers I've sent up in response to these lyrics. I can tell you that if you love the Lord, this album should be part of your collection--if you can find it. I still have my original LP, the music book, and the songs in various Keith collections.There isn't a dud on here, but the ones that shine the most for me include his rendition of the 23rd psalm (still my fav of all versions of this most beloved of psalms). A friend of mine from my previous church, the pianist/music teacher, used to play this when we got together for fellowship, her on piano and me singing, and it's still just the most beautiful adaptation in popular music of \"The Lord Is My Shepherd.\" Keith's vocals are full of emotion and true spiritual fervor and faith. Astonishing.Another favorite is \"How Majestic Is Your Name\" (Psalm 8), a song I occasionally sing a capella when moved by the night sky or a sunset or some other wonder of nature. \"When I consider the heavens, the work of they fingers...\"  Keith's sense of wonder at God shines through this semi-meditative but passionate song.On the darker, heavier side, you get a \"spiritual\" called \"Oh God, our Lord\" which is great to sing, but not an easy subject to digest with lyrics such as:\"Who you gonna throw in the lake of fire, O God our Lord?Who you gonna throw when the flames get higher, O God our Lord?The Devil and the man with the dark desire, O God our Lord.\"Keith really gets into it, his voice low and heavy at times, high and full of pain at others.Another deep, difficult song describes those times when we feel in need of assistance and we can only cry to God out of our frustration and helplessness:\"My flesh is tired of seeking God,But on my knees I'll stay.I want to be a pleasing child,Until that final day.My mind is full of many thoughtsThat clutter and confuse.But standing firm, I will prevail,In faith that I'll be used.Amen! I'm asking once again.Won't you help me my friend, Lord Jesus.\"Keith's voice is beautiful in those lines of pleading..\"won't you help me, my friend, Lord Jesus.\"\"There Is A Redeemer\" is a simple melody, simple earnest lyrics, and is so \"singable\" that it has earned a place in hymnals and worship services across the land. \"There is a Redeemer, Jesus, God's own son. Blessed Lamb of God...Messiah! Holy One. Thank you, oh, my Father, for giving us your Son and leaving Your Spirit till your work on Earth is done.\" It's a basic expression of gratitude and worship and it holds up.\"Jesus is Lord of All\" and \"You Are The One\" and \"The Promise Song\" are peppy and bouncy and full of joy and affirmation of truth. From the last of those we get this:\"Oh if you keep My word,I'll make you as a tree,Planted by the streams of life,If you'll submit to me.And if you love the hateful ones,Who mistreat you constantly,The book of life shall bear your name,If you love your enemies.\"\"Glory Lord Jesus\" is effervescent and energetic and will have you with your hands up in the air.Like his version of Psalm 23, Keith's version of \"Holy, Holy, Holy\" is part of the reason why that is among my most favorite of all classic hymns. I never tire of it.Those are most of the songs, and I think you will find pleasure and an encouragement to worship here. These are truly \"Songs for the Shepherd\" that all the sheep can treasure. Keith's earnest and passionate vocals, his skill on the piano, and the evident faith that colors all his songs shine decades after he got called home.Mir of Mirathon blog", "overall": 5.0, "summary": "Keith's Last and Best Album, A Classic and a Keeper!", "unixReviewTime": 1167350400, "reviewTime": "12 29, 2006"}
{"reviewerID": "A1BA3VR9EKXI87", "asin": "0001393774", "reviewerName": "M. Mikeska", "helpful": [0, 0], "reviewText": "Though it has been over 3 decades since Keith left this life, his music still resonates with truth.  This was one of the first albums I purchased of Keith's &#34;back in the day&#34;.  What a sweet album of praise as he moves through the Psalms!", "overall": 5.0, "summary": "Keith Green - Relevant for the Ages", "unixReviewTime": 1367452800, "reviewTime": "05 2, 2013"}
{"reviewerID": "A3IWBNNKB5Y1ZY", "asin": "0001393774", "reviewerName": "Serendipity \"Sandy\"", "helpful": [1, 2], "reviewText": "These songs are absolutely beautiful and beautifully rendered. It's amazing how much Keith Green accomplished in his short life.", "overall": 5.0, "summary": "Incredible", "unixReviewTime": 1224288000, "reviewTime": "10 18, 2008"}
{"reviewerID": "A2CNQ98AQMTF1T", "asin": "0001393774", "reviewerName": "Shauna Ladnier", "helpful": [0, 0], "reviewText": "Keith Green's talent is unmatched and his understanding of the Word and God's Love that he writes about in his songs are enlightening. I love his music and this CD is one of the best.", "overall": 5.0, "summary": "WONDERFUL!", "unixReviewTime": 1367366400, "reviewTime": "05 1, 2013"}
{"reviewerID": "A293MJV7OBALZ8", "asin": "0001393774", "reviewerName": "SHERRY LOU STEPHENS", "helpful": [0, 0], "reviewText": "A good singer, songwriter, who truely loves our Lord.  Listen and be amazed. I recommend it highly. Please listen to it.", "overall": 5.0, "summary": "follower of keith green", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}
{"reviewerID": "AWA4RHNCRLQNS", "asin": "0001393774", "reviewerName": "S. Johnson", "helpful": [5, 5], "reviewText": "I bought this in LP form when it was brand new, recorded it onto a cassette so I could play it in my car, listened, and listened, and listened.  I have so missed listening to this (no longer have a turn-table) that I've finally reordered it on CD.  YAY!! Can't wait to play it, and play it, and play it.  No one, absolutely no one wears his heart for God on his sleeve like Keith Green!  I can't wait to meet him in heaven.", "overall": 5.0, "summary": "Fave!", "unixReviewTime": 1280966400, "reviewTime": "08 5, 2010"}
{"reviewerID": "A1X15L7VXGNN6Z", "asin": "0001393774", "reviewerName": "Tlexie", "helpful": [2, 2], "reviewText": "I love the songs on this album and how Keith once again focuses all on the Good Shepherd, our Lord Jesus.  The songs are timeless, the anointing is fresh even after all the years since they were written.  I think that's a sure sign of anointing is to see the fruit remain.", "overall": 5.0, "summary": "Anointed!", "unixReviewTime": 1233187200, "reviewTime": "01 29, 2009"}
{"reviewerID": "A3CFBMPKT79R89", "asin": "0001501348", "reviewerName": "Barbara May Gillespie", "helpful": [1, 1], "reviewText": "The music on this cd is wonderful.  It is lively, and full with the celebration of Christ.  The title:  LIFT HIM UP certainly discribes the messages in the songs, and the music will make you want to dance.", "overall": 5.0, "summary": "Very satisfied customer", "unixReviewTime": 1252627200, "reviewTime": "09 11, 2009"}
{"reviewerID": "A1GR2UCKC2NPOT", "asin": "0001501348", "reviewerName": "ceeco", "helpful": [3, 3], "reviewText": "Video tape was in great condition. It is a delight to have this once again. My original copy was damaged in a storm. Its great to have it again and with such great quality; even the case was in good shape.Ceeco", "overall": 5.0, "summary": "Ron Kenoly; Lift Him Up Video", "unixReviewTime": 1289692800, "reviewTime": "11 14, 2010"}
{"reviewerID": "A3CTGXVHCOOSKI", "asin": "0001501348", "reviewerName": "Pamela Kirsch", "helpful": [1, 1], "reviewText": "I bought several of these because my family kept borrowing and we could never find it to watch so we bought them for each of them!", "overall": 5.0, "summary": "An oldie but goodie!!", "unixReviewTime": 1396656000, "reviewTime": "04 5, 2014"}
{"reviewerID": "A2UA9KKUQCTEIN", "asin": "0001501348", "reviewerName": "Tanya C.", "helpful": [1, 1], "reviewText": "I love Ron Kenoly and this is one of the best he ever did, I really felt the presence of the Lord when I watched it.", "overall": 5.0, "summary": "Lift Him Up by Ron Kenoly truly lifted my spirits", "unixReviewTime": 1381017600, "reviewTime": "10 6, 2013"}
{"reviewerID": "A1OYXEHASP0RIU", "asin": "0005072298", "reviewerName": "Jans Read", "helpful": [0, 1], "reviewText": "I play this for my 5 yr old grandson and l like listening to it myself.  Thankful to have this CD.", "overall": 5.0, "summary": "Great God Centered CD", "unixReviewTime": 1382227200, "reviewTime": "10 20, 2013"}
{"reviewerID": "A33BNNNLHJRAJV", "asin": "0005072298", "reviewerName": "Rowen Albertson", "helpful": [0, 1], "reviewText": "I had had a cassette of this recording, and knew I loved it.  I bought several of these CDs so that I could share with nephews, and friends, and keep one for myself.  Very gentle and easy to sleep to.  Words are clearly sung, understandable.  It's been a blessing to me that I was anxious to find and pass on to others.  Great for children-- I was a child when Grandma got me the tape.", "overall": 5.0, "summary": "Wonderful!!!", "unixReviewTime": 1335484800, "reviewTime": "04 27, 2012"}
{"reviewerID": "AADYBHJDIAR5K", "asin": "0005123909", "reviewerName": "JB", "helpful": [4, 4], "reviewText": "My 5 month old loves this video and usually makes it the whole way through...Caution..the songs stick in your head all day..LOL", "overall": 4.0, "summary": "Cute and holds attention", "unixReviewTime": 1093392000, "reviewTime": "08 25, 2004"}
{"reviewerID": "AC9A3ETOBNVIW", "asin": "0005123909", "reviewerName": "Laurie A. Givens", "helpful": [0, 1], "reviewText": "My mother-in-law bought this video for my daughter when she was young.  I was looking for videos the other day for my three year old granddaughter and came across this.  My granddaughter LOVES this video.  She watches it OVER and OVER and OVER.  It is older, dated and corny, but she loves it!  We even find ourselves singing the songs!", "overall": 5.0, "summary": "Memories", "unixReviewTime": 1239753600, "reviewTime": "04 15, 2009"}
{"reviewerID": "AUBQLZIJDARTS", "asin": "0005134188", "reviewerName": "N.T. \"Amazon Shopper\"", "helpful": [0, 0], "reviewText": "I picked up this video (Cedarmont Kids, Toddler Tunes VHS) at a local store's bargain bin for just a buck. I wasn't expecting much out of it but have been pleasently suprised how much my 3 1/2 year old son LOVES LOVES LOVES it. He will watch it over and over again. It features about 10 children ranging from 2 to 10 years old singing, dancing, and in dress-up acting out the songs. Each song they sing has a different theme, like one song they'll all be on a school bus singing, another song at the park, another song at the local store, on a train, at a farm etc. Some seem to be american kids and some seem to be british. There is one or two songs where the scenery looks like they are in England, like one where they are singing with a beautiful castle in the background.The video itself is not high quality production, but more of songs and scenery of older times, it's very sweet, wholesome and simply presented. My son sings the songs when he plays, even when the video is not playing he has memorized them and sings them in play, it's just delightful. When he watches the 35 minute video he just loves watching the children act out the songs, like jack and jill song, two children roll down a hill etc, the songs are acted out. I would recommend for ages 1 to 6 years old.Songs the children sing include:The Wheels on the BusThe Alphabet SongGod Made MeEeney Weeney SpiderThe More We Get TogetherSix Little DucksMulberry BushBaa Baa Black SheepRoll Over (10 In The Bed and The Little One Said, Roll Over)I'm a Little TeapotOld MacDonaldFather, We Thank TheeAre You Sleeping?Jack and JillOh, Where, Oh Where, Has My Little Dog GoneGet on BoardOh Dear, What Can The Matter BePop! Goes The WeasellThis Old ManLondon BrigeMary Had a Little LambThe Muffin ManRow, Row, Row Your BoatBe Kind To Your Web Footed Friends.", "overall": 5.0, "summary": "Excellent Video", "unixReviewTime": 1333584000, "reviewTime": "04 5, 2012"}
{"reviewerID": "A1QYU815OBKZSR", "asin": "0005134188", "reviewerName": "Pat", "helpful": [0, 0], "reviewText": "I like the Cedarmont Kids videos.  They are wholesome and fun.  My 3 year old Grandaughter stands in front of the TV and sings the songs with them. It is real children and they do a great job.  No animation.", "overall": 5.0, "summary": "Wholesome fun tunes sang by children", "unixReviewTime": 1252713600, "reviewTime": "09 12, 2009"}
{"reviewerID": "A258R8TKIF1ONL", "asin": "0005224896", "reviewerName": "2grinkids \"2grinkids\"", "helpful": [2, 2], "reviewText": "This is most likely the most beautiful worship music I've ever heard on a cd. Definitely, the most played cd in our household. Highly recommend!", "overall": 5.0, "summary": "Beautiful worship", "unixReviewTime": 1275177600, "reviewTime": "05 30, 2010"}
{"reviewerID": "A3J2KYGO0RYJ63", "asin": "0005224896", "reviewerName": "cherokee", "helpful": [0, 0], "reviewText": "As a Christian i feel we need to show God that we love Him by singing His very words back to Him to show we love them and appreciate them Chuck has done this with such beautiful music but most important is the words which touch your soul", "overall": 5.0, "summary": "Heaven's music", "unixReviewTime": 1362528000, "reviewTime": "03 6, 2013"}
{"reviewerID": "A6P41US94O8NS", "asin": "0005224896", "reviewerName": "Crystal", "helpful": [2, 2], "reviewText": "I have been listening to this CD for over ten years and have bought several copies for friends.  Listening to it never fails to calm my spirit and focus my mind on God.  It helps usher me into His presence.", "overall": 5.0, "summary": "Enter Into God's Presence", "unixReviewTime": 1282694400, "reviewTime": "08 25, 2010"}
{"reviewerID": "A1ITN92CWNHKA3", "asin": "0005224896", "reviewerName": "havebowwillarrow", "helpful": [0, 0], "reviewText": "If you would like to spend more quality time with the Lord JESUS Christ in worship, then I highly recommend this CD by Chuck Girard!!!", "overall": 5.0, "summary": "Awesome Praise and Worship", "unixReviewTime": 1398384000, "reviewTime": "04 25, 2014"}
{"reviewerID": "A129A0AHSRTAJK", "asin": "0005224896", "reviewerName": "High School Teacher", "helpful": [0, 0], "reviewText": "This CD is a must for leading a person into personal intimate worship of the Lord Jesus Christ!  The artist does a wonderful job of helping us focus on the amazing love of God in Jesus Christ!", "overall": 5.0, "summary": "Wonderful intimate worship music!", "unixReviewTime": 1337212800, "reviewTime": "05 17, 2012"}
{"reviewerID": "A1WRYC2OGD5TSK", "asin": "0005224896", "reviewerName": "His Kid", "helpful": [0, 0], "reviewText": "If you are looking for a CD to draw you into the Lord's presence, this is an excellent resource.  I have used the music for soaking with the Lord, flag worship, walking on the treadmill and even drifting off to sleep at night.  Regardless of my activity, the words and light music draw me into His presence.  After at least 100 listenings, it continues to be fresh and alive.  Wonderful!", "overall": 5.0, "summary": "Wonderful!", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
{"reviewerID": "A2KPZ10PHV91G6", "asin": "0005224896", "reviewerName": "kylie maree armstrong", "helpful": [0, 0], "reviewText": "As a deer is my favourite song it touches my soul each time I here it.I just love Jesus the song explains my love for him.I have put this cd in my collection to be played at my funeral.With having an autistic child chucks music has  had a calming influence for me.thankyou Jesus for his songs.", "overall": 5.0, "summary": "voice of the wind", "unixReviewTime": 1376265600, "reviewTime": "08 12, 2013"}
{"reviewerID": "A2IDXYAQ8A0Q7M", "asin": "0005224896", "reviewerName": "larry waite", "helpful": [4, 4], "reviewText": "I love this cd for it's quiet and intimate worship experience. I enjoy taking this cd with me when I am out walking or sitting at home.  It brings me right into the presence of God.", "overall": 5.0, "summary": "awesome worship", "unixReviewTime": 1120176000, "reviewTime": "07 1, 2005"}
{"reviewerID": "A28TAEPW233MTU", "asin": "0005224896", "reviewerName": "Lois Calderwood", "helpful": [0, 0], "reviewText": "Chuck Girard's \"Voice of the Wind\" Vol. 1 is absolutely my top worship CD for the morning.  It ministers to me deeply, and I feel it really aids me in getting into the Lord's presence. It helps set my day as being \"in Him\" and \"about Him living in me\".  I feel like I've pleased and blessed Him when I worship with this music, and that is a wonderful way to start my day. Don't even doubt that you should get it!", "overall": 5.0, "summary": "Worship CD review", "unixReviewTime": 1274745600, "reviewTime": "05 25, 2010"}
{"reviewerID": "A2SL37IK3BCDC8", "asin": "0005224896", "reviewerName": "Roger Donkin", "helpful": [0, 0], "reviewText": "The gospel in songs. TALK TO ME  makes one swallow with guilt a bit.Played within a group of tension, brings worship and devils flee.people change.  True I have and seen it.PLEASE, ALWAYS STOCK IT.  Blessings, Roger", "overall": 5.0, "summary": "Voice of the Windows", "unixReviewTime": 1360368000, "reviewTime": "02 9, 2013"}
{"reviewerID": "A20BS282KMRQ60", "asin": "0005224896", "reviewerName": "S. Dixon", "helpful": [3, 3], "reviewText": "This album is unbelievable! A mixture of old and new songs, this album creates a worshipful attitude for the listener. The songs are powerful in lyrics, style and worship and as the songs flow from one to another, it creates the feeling that you are in a worship service. The songs stay with you long after the album is over and the presence of the Lord is prevalent as you listen and worship Him. And even after listening to the album many times, the anointing of God is so strong it's hard to do anything other than worship the Lord.", "overall": 5.0, "summary": "Voice of the Wind, Personal Worship album", "unixReviewTime": 1220140800, "reviewTime": "08 31, 2008"}
{"reviewerID": "AVO85H3PRWWC3", "asin": "0005224896", "reviewerName": "Sherry L. Johnston", "helpful": [0, 0], "reviewText": "This is beautiful music by a precious man.  I had the cassette years ago and it broke.  I was so glad that I was able to find a cd with this music.  You feel God's presence as you listen to this.", "overall": 5.0, "summary": "Beautiful Music", "unixReviewTime": 1354838400, "reviewTime": "12 7, 2012"}
{"reviewerID": "AEPQL8RZJREBJ", "asin": "0005224896", "reviewerName": "stan the man", "helpful": [0, 0], "reviewText": "This disk arrived in just the right time and has become the BEST disk for worship that I own!!!  Every time I play it, and that is often, I slow down and allow God to enter the room and into my life.  I love this project.", "overall": 5.0, "summary": "The BEST worship disk I own!", "unixReviewTime": 1366156800, "reviewTime": "04 17, 2013"}
{"reviewerID": "A1K3F17YG0OM2Q", "asin": "0005224896", "reviewerName": "Wodn", "helpful": [0, 0], "reviewText": "I love this cd the best of all my Christian music. I have purchased many copies to give to lots of others who need uplifting.At just the first few notes of music I am taken away from the stress of living in this world into worship of Our Father and His Son. Well worth any money you have to spend.", "overall": 5.0, "summary": "So meaningful!", "unixReviewTime": 1399420800, "reviewTime": "05 7, 2014"}
{"reviewerID": "A30H4UVW0GA341", "asin": "0005441382", "reviewerName": "Destiny", "helpful": [0, 0], "reviewText": "This is the best Christian lullaby CD that I have bought in recent years. The music is so soothing and the ladies voice is so silky and soft that I have fallen asleep many times when listening to it with my daughter. My baby also loves it, we've played it every night since I bought it. Would most definitely recommend this CD.", "overall": 5.0, "summary": "Lovely soothing music", "unixReviewTime": 1357084800, "reviewTime": "01 2, 2013"}
{"reviewerID": "AK68CYL5MIYFZ", "asin": "0005441382", "reviewerName": "hellen", "helpful": [2, 2], "reviewText": "Best baby CD ever!I'm certain the singer/songwriter must be my soul-mate-sister because her songs sing exactly the words I feel, exactly the blessings I want for my babies.  Her voice is beautiful, authentic, kind.I played it while I rocked both my girls (now 5 and 6).They still listen to the CD (which they call \"itty bitty\")to fall asleep at night.It is beautiful. The songs are truly touching.", "overall": 5.0, "summary": "This is the gift I give my friends having baby girls!", "unixReviewTime": 1228435200, "reviewTime": "12 5, 2008"}
{"reviewerID": "A8QRUFLKL3F63", "asin": "0005441382", "reviewerName": "Pam", "helpful": [0, 0], "reviewText": "After giving this 5 stars I am certain it seems like a big contradiction starting the review by saying &#34;I haven't heard it.&#34; However, there is one created for little boys that I owned 20 years ago when my &#34;baby&#34; was an infant. I LOVED that CD, and I sang it to my son for years....I assure you I still remember all the words. :) There is just know reason why I would think that &#34;Bless my little girl&#34; would be any different.", "overall": 5.0, "summary": "Haven't Listened To It", "unixReviewTime": 1379376000, "reviewTime": "09 17, 2013"}
{"reviewerID": "A1OFY4ATO7D13W", "asin": "0026197898", "reviewerName": "Jacob Shepich \"Neo-Luddite\"", "helpful": [2, 2], "reviewText": "Buy this album. Now.  Don't worry about the reviews.  If you love pure, honest music buy this album....you will not be let down.", "overall": 5.0, "summary": "PITCHFORK Eat your heart out!", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "A2KH83L1F70QR8", "asin": "0026197898", "reviewerName": "John Stockton \"JLS\"", "helpful": [1, 1], "reviewText": "The Sudden Passion did a great job with this one. The lyrics are witty, with just the right amount of twang.  This is a whiskey-soaked indie rock jam that captures the soul of modern americana!", "overall": 5.0, "summary": "Americana from the Southlands", "unixReviewTime": 1358121600, "reviewTime": "01 14, 2013"}
{"reviewerID": "A11AHD1AHB6CH2", "asin": "0152222227", "reviewerName": "Evan Selinger", "helpful": [0, 0], "reviewText": "We purchased this CD several years ago at a fundraiser but unfortunately, we lost the CD. I repurchased recently and although my child is several years older and likes to listen to mainstream music almost exclusively, she still enjoyed this CD as much as when she she was younger.", "overall": 5.0, "summary": "Great fun and catchy tunes for kids.", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "A3EVDRB2NK2UHS", "asin": "0307141128", "reviewerName": "Vanessa \"mvchristenson\"", "helpful": [3, 3], "reviewText": "My daughter would watch this everyday if she could. She loves Madeline and her indomitable spirit - but when you add a lovable mutt to the mix it makes a combination little girls can't resist. Genevieve is a resourceful and clever dog who not only saves Madeline from a 'watery grave,' but also steals the hearts of Miss Clavel and the rest of the residents of the old house in Paris. The songs are catchy and the story of loyalty and friendship win out grumpy Lord Cucuface in the end. Highly recommended.", "overall": 5.0, "summary": "A favorite in our house", "unixReviewTime": 1008547200, "reviewTime": "12 17, 2001"}
{"reviewerID": "AF9D2YR94N9XA", "asin": "0307141136", "reviewerName": "Willow", "helpful": [0, 0], "reviewText": "Our children love this great classic story and being able to watch it on TV is awesome Will buy as DVD too", "overall": 5.0, "summary": "Great classic", "unixReviewTime": 1354492800, "reviewTime": "12 3, 2012"}
{"reviewerID": "A3JAIZQ5RS064X", "asin": "0307141144", "reviewerName": "Ken Miller \"kenmiller32\"", "helpful": [0, 0], "reviewText": "The Spanish Ambassador moves in next door to Madeline.Madeline and the girls are surprised to see that, as Miss Clavel says, \"his excellency has as BOY!\"  Well, his excellency's son, Pepito, does a lot of marvelous things:  leads frogs around on strings, dumps poison on ants, and pops the balloons of little girls.  He even carries a cat around in a bag, and lets it out amidst a pack of dogs!As Madeline says, Pepito is a BAD HAT.This hilarious story is about how Pepito comes to be reformed.  It's got a lot of funny scenes, and there are many levels on which the story can be enjoyed.The video has marvelous, enjoyable songs, also!My two year old son asked to see this video over and over, and I finally bought a copy.", "overall": 5.0, "summary": "superb story, hooked my 2-year old", "unixReviewTime": 993600000, "reviewTime": "06 27, 2001"}
{"reviewerID": "A3EVDRB2NK2UHS", "asin": "0307141144", "reviewerName": "Vanessa \"mvchristenson\"", "helpful": [2, 2], "reviewText": "\"Have you learned your lesson, you naughty, naughty boy?\" is my daughter's favorite Madeline song, because she understands that Pepito, the Spanish ambassador's son, hasn't been very nice to the animals in the neighborhood. Likely the best adaptation of the original Bemelmans book in this (Cinar) series of videos, \"Madeline and the Bad Hat\" tells the story of a lonely little boy who tries to get attention by being cruel and mischievous. He learns his lesson when one of his pranks go awry, and then realizes that being nice makes better friends than by being naughty. Highly recommended.", "overall": 5.0, "summary": "Have you learned your lesson, you naughty, naughty boy?", "unixReviewTime": 1008547200, "reviewTime": "12 17, 2001"}
{"reviewerID": "A1Y4GYXJIBXCHA", "asin": "0307141217", "reviewerName": "Anne Woods", "helpful": [2, 3], "reviewText": "A very fun and cute video.  The music is great.  My 3 year old daughter really enjoyed it.  Is very close in content to the actual Madeline book.", "overall": 4.0, "summary": "Madeline in London", "unixReviewTime": 943660800, "reviewTime": "11 27, 1999"}
{"reviewerID": "A102Z4PIK7CYD8", "asin": "030714139X", "reviewerName": "Jessica L. Torres \"cutthefool\"", "helpful": [1, 1], "reviewText": "I admit it, my fifteen-month-old daughter loves this movie so much that i have memorized all of the cute, catchy songs.  the storyline is easy to follow for the older children, but the songs and animation alone are enough to entrance my restless daughter for the full twenty-four minutes.  overall a great investment for any parent.", "overall": 5.0, "summary": "Great for Kids of All Ages", "unixReviewTime": 1026950400, "reviewTime": "07 18, 2002"}
{"reviewerID": "A3RJP3C9D6XDYT", "asin": "030714139X", "reviewerName": "robye delaney", "helpful": [1, 1], "reviewText": "This is BY FAR the best of the Madeline videos!  The music is phenominal!  I find myself even singing the cute little tunes around the house!  It is a must for all Madeline fans!  In short, Madeline and Pepito get left behind at the carnival. They temporarily join the circus and realize it's not as fun as they thought it would be and soon become homesick.  Don't worry kids, it's a happy ending!", "overall": 5.0, "summary": "Best Madeline Yet !!!!", "unixReviewTime": 986774400, "reviewTime": "04 9, 2001"}
{"reviewerID": "A2AOZQ3WTNVVOK", "asin": "030714142X", "reviewerName": "Lonnie E. Holder \"The Review's the Thing\"", "helpful": [0, 0], "reviewText": "Encyclopedia Brown (Scott Bremner) encounters a mystery surrounding a ghost town when his friends and then he meet an eerie figure on horseback.  Is the eerie figure the Wildcat Kid, a character of legend from an era long past?The beautiful young woman who inherited the ghost town is in danger of losing it to taxes.  The town is also badly decayed and in need of repair.  Perhaps there is a treasure hidden in the town that could allow the heiress to keep the town and fix it up.  While there are several people who insist there is no treasure, there seems to be a lot of action in town in addition to the appearance of the strange rider on horseback.Encyclopedia Brown (EB) is on the case as he decides there is something suspicious about the rider.  EB also wonders whether there might be something to the treasure story.  In this 30 minute television show originally made for HBO Encyclopedia Brown amazes everyone as he gets to the truth.  Encyclopedia Brown is on the case!These shows are very oriented to a younger audience.  I would say 7 - 12 year old children would enjoy this particular episode.  The age ranges are approximate because of individual interests and development.  Encyclopedia Brown explains his observations, so there are some educational elements, though the show is primarily light entertainment.  The show is a mystery for young children and will appeal to fans of the book series.", "overall": 3.0, "summary": "Entertaining Light Mystery", "unixReviewTime": 1143676800, "reviewTime": "03 30, 2006"}
{"reviewerID": "ADAOY0MXYLJTN", "asin": "0307141462", "reviewerName": "Ry T", "helpful": [0, 0], "reviewText": "This was one of my favorite movies to watch at my grandparents house! Recently my grandpa threw it out because he didnt think my brother nor I watched it anymore...I was deeply disappointed. So I was pleased to see it here on amazon!! The movie came to my house in excellent condition and played well, though I'm going to have to get it converted from VHS to DVD LOL. Even as an 18 y.o I still enjoy watching the movie from time to time. A new twist on an old classic.", "overall": 5.0, "summary": "Great movie! Even as a young adult (:", "unixReviewTime": 1316131200, "reviewTime": "09 16, 2011"}
{"reviewerID": "A38AKGF4LDHD9H", "asin": "0307141950", "reviewerName": "Andy Michaels", "helpful": [3, 3], "reviewText": "I can't say enough about this video. My son loves all of the Little Critters books. This is the only Little Critter's video I have found. My 6yr old son has over 100 DVD's and Videos. The only videos he wore out were \"Just Me And Dad,\" and \"Mr. Bumpy's Karaoke Cafe.\" I had to re-buy both of them. I don't understand why Mercer Mayer, Inc. has not started making videos of all the books. I have all their CD,s as well. My son loves them. I am only speaking of the read along CD's. I have not seen any Little Critters game CD's. Mercer Mayer's little monster's books and CD's are very much liked as well.", "overall": 5.0, "summary": "They should make MORE videos", "unixReviewTime": 1105228800, "reviewTime": "01 9, 2005"}
{"reviewerID": "A2XVRCU5DQBULH", "asin": "0307141950", "reviewerName": "L. Varnau \"nerff20\"", "helpful": [4, 4], "reviewText": "I suppose giving this video a 5-star is rather vain, but I might as well. Back when I was in Kindergarten, I got the part of playing the voice of the main character, Little Critter. I didn't really understand the significance of this until I got older. Now, I'm well into my high school career (the video was released some time in between '93-'94, when I was in third grade or so). I own several copies and have watched it many times. It's a piece of nostalgia for me and it holds a special place in my heart. I hope you enjoy it.", "overall": 5.0, "summary": "From the voice of Little Critter...", "unixReviewTime": 1043366400, "reviewTime": "01 24, 2003"}
{"reviewerID": "A1HFKUE4IDNZZ6", "asin": "0307141950", "reviewerName": "ReadItDiva \"ReadItDiva\"", "helpful": [6, 6], "reviewText": "What could be better than a Little Critter book?  A Little Critter movie!  Too bad this is the only L. C. video Mercer Mayer produced.  We own several books of this series.  It was fun to hear an actual voice for Little Critter and Little Sister.  The infamous pet spider, grasshopper, and mouse stay silent, but are every bit as comical as in the books. Other enhancements that are not in the 1977 printed version include:1. Little Sister steals her big brother's hiking boots because she wants to go camping, too.2. The recurring theme of the Legend of Big Paw, told by L. S. to scare her brother.3. Crows bend the road signs and snicker because L.C. and Dad get lost.4. L.C. sings!  Song #1 as he looks for firewood.  Song #2 as he tells Dad scary story around campfire.5. A few moments of suspense during the camping trip, but I won't reveal any details so as not to spoil them for you!There is even an underlying message to kids that is not too preachy or heavy-handed: DON'T MESS WITH THE ANIMALS OF THE FOREST.  \"Remember, this is their home and we are their guests,\" Dad tells L.C.  You will enjoy this video whether you are a Little Critter fan or not.", "overall": 5.0, "summary": "Just A Funny Video", "unixReviewTime": 1067644800, "reviewTime": "11 1, 2003"}
{"reviewerID": "A2AXRTL5DZRKG4", "asin": "0307141985", "reviewerName": "ALK \"jessamama\"", "helpful": [2, 7], "reviewText": "I purchased this video for my daughter, remembering it fondly from my own elementary school days ( I think I watched on reel-to-reel...).  I like the way it portrays the faith of the Pilgrim-Separatists, so often lacking in more modern recounts of the first Thanksgiving.  I also love the theme song (Ma-a-a-yflower, Ma-a-a-yflower...)--it brings back warm childhood memories.  What I hadn't realized as a child was just how embarrassingly racist movies back then could be.  None of the antagonists have too much intelligence, but the Native-American Indian is portrayed to be especially idiotic.  I'll still show the movie to my daughter this Thanksgiving and use it as a springboard for meaningful discussion, but I'm sure I'll be cringing along the way.  It's just not as good as I thought I remembered.", "overall": 3.0, "summary": "the not so great olden days of cinema...", "unixReviewTime": 1289174400, "reviewTime": "11 8, 2010"}
{"reviewerID": "A2D58CURLPF7GE", "asin": "0307141985", "reviewerName": "Amazon Customer", "helpful": [2, 2], "reviewText": "I video taped this off of television for my children when they were all little. I taped it because I thought there might come a day when they would not be playing it on TV anymore, turns out I was right about that, however I never saw this on VHS for sale in any store or I would probably have a better quality tape, my video taping skills leave something to be desired.  Now I see the used VHS tapes are quite expensive, perhaps even rare.  Which is why this show needs to be restored and sold on DVD so that families can watch this again. Besides, my poor tape is old and will not last forever so I'd like to see this one up for sale, soon. Returning it to television would be nice too.  My children are all grown now and every year I play this during the Holiday season, often more than once.  I just watched it today with my grandson who is 6 months old, granted he was not as interested as I for obvious reasons.  The movie is an animated children's historical view of The Mayflower Story.  It addresses all things important pertaining to that story, including religious freedom, the hardships the pilgrims suffered, meeting and learning new things from the Indians.  I think this story shows children brotherly love, the importance of prayer and people communicating and working together.  Most of all it shows \"thankfulness\" which is what this holiday represents in the first place.  This is a great family holiday film and there are very few films about Thanksgiving available today anyway.", "overall": 5.0, "summary": "Nostalgic Entertainment", "unixReviewTime": 1227571200, "reviewTime": "11 25, 2008"}
{"reviewerID": "A1X90SEW99DK3G", "asin": "0307141985", "reviewerName": "Aung Htun", "helpful": [2, 2], "reviewText": "\"Set sail with the tiniest Pilgrim for a music-filled voyage to the land of the free!The Mouse on the Mayflower is the classic American tale that provides a DELIGHTFUL LESSON IN OUR NATION'S EARLY HISTORY.Along with our furry hero, kids will join the colonists as they cross the Atlantic, survive the harsh New England winter, befriend the Indians, and finally sit down to this country's very first Thanksgiving dinner.The Mouse on the Mayflower is a holiday treat the entire family will treasure!Approximate Running Time: 50 minutesTold and Sung by Tennessee Ernie FordEddie Albert as Captain StandishJohn Gary as John AldenJoanie Sommer as Priscilla MullinsWritten by Romeo MullerMusic by Maury LawsLyrics by Jules BassProduced and Directed by Arthur Rankin, Jr. and Jules BassMusical Director Maury Laws.NTSC format 1VHS.But, playable with multisystem VHS Player and Television in the world too...\"[from the back cover of the VHS case and experience]", "overall": 5.0, "summary": "Delightful Lesson In Our Nation's Early History", "unixReviewTime": 1226880000, "reviewTime": "11 17, 2008"}
{"reviewerID": "A4HSFJ9B73WYR", "asin": "0307141985", "reviewerName": "B. Haney", "helpful": [7, 8], "reviewText": "I can remember every Thanksgiving me and my cousins would gather around my grandmothers tv watching this movie. I think the first time I remember this movie was when I was 3 and 27 yrs later it no longer plays. Thats sad . Kids these days would love the story and it is a great way to let children see the Thanksgiving story on a level that they would love . This is a must have for kids! I am getting this and the Charlie Brown one today for my son to enjoy !", "overall": 5.0, "summary": "Every child would LOV E this Movie!", "unixReviewTime": 1100304000, "reviewTime": "11 13, 2004"}
{"reviewerID": "A17DBY927PTFOB", "asin": "0307141985", "reviewerName": "Bill McCue", "helpful": [10, 11], "reviewText": "I have watched &amp; enjoyed this cartoon since 1968.Everyone I have shown it to likes it very much.I highly recommend it to anyone with kids or without kids. It even ends with a scripture from the bible.", "overall": 5.0, "summary": "Mouse Forever", "unixReviewTime": 954892800, "reviewTime": "04 5, 2000"}
{"reviewerID": "A36JA0Z0ZAS434", "asin": "0307141985", "reviewerName": "Danica Love", "helpful": [23, 23], "reviewText": "For as long as I can remember, this movie came on TV every Thanksgiving. A few years ago, they stopped playing it. Unaware of that, I looked for it on TV every Thanksgiving. I was very upset when I was unable to find it. Finding it here was a blessing. It has been a few years since I have seen it, but the feelings it invokes in me are the same as they were when I was a child. There aren't very many Thanksgiving movies out there, and this has become a classic in my household. My sisters love it, I love it, and my 15 month old son loves it. I can't imagine a Thanksgiving without it!!", "overall": 5.0, "summary": "Great Holiday Classic", "unixReviewTime": 973641600, "reviewTime": "11 8, 2000"}
{"reviewerID": "A3IEV6R2B7VW5Z", "asin": "0307141985", "reviewerName": "J. Anderson", "helpful": [14, 15], "reviewText": "I don't know who owns the rights to this wonderful production, but considering all the other Rankin/Bass goodies available on DVD, why has Mouse On The Mayflower been ignored for release? It's ludacris! Release it!! For heaven's sake!! This production deserves at least the same repect that was given to lesser productions like \"Rudoloph's Shiny New Year\" or \"The Little Drummer Boy, Book II\", which were not half as good as Mouse On The Mayflower\". Most of us Baby Boomers grew up with this stuff. We got our baths & teeth brushed early so we could watch them before being scurried off to bed, and anxiously awaited repeats year after year. Did anyone else but me sit with a cassette recorder next to the TV speaker so they could record the show audio? LOL. I did. I loved the songs, and I'd listen to the tapes I made and play the visuals over and over in my head. God it was great being a kid! C'Mon Rankin/Bass! Bring this one back on DVD! It's a classic!", "overall": 5.0, "summary": "LISTEN TO THE PUBLIC!!!", "unixReviewTime": 1128556800, "reviewTime": "10 6, 2005"}
{"reviewerID": "A3EOXJC4682YG0", "asin": "0307141985", "reviewerName": "J. Grantham \"Librarygirl\"", "helpful": [0, 0], "reviewText": "Every child I show this video loves it. It is always a hit. Tells the basic story of the pilgrims.", "overall": 5.0, "summary": "Holiday Winner", "unixReviewTime": 1354924800, "reviewTime": "12 8, 2012"}
{"reviewerID": "A2H3ISQ4QB95XN", "asin": "0307141985", "reviewerName": "Joseph Brando", "helpful": [2, 2], "reviewText": "Thanksgiving is devoid of icons to make it a favorite amoung children - Tom Turkey can't compete with Santa Claus or Dracula - and so this holiday which is crammed in between the other two bigger ones comes up short when it comes to fun TV specials marking the celebration. However, you can count on Rankin/Bass, the long-reigning kings of enchanted holiday programming, to have left us this warm, entertaining show.Treading a fine line between historical accuracy and cartoon make-believe, Mouse On The Mayflower tells the tale of the Pilgrims' toilsome trip over to Plymouth Rock from the perspective of its tiniest passenger - a mouse! Although this special was done in traditional animation, and not the charming Animagic puppet-animation the studio is most well-known for, it still bears all of the trademarks of a Rankin/Bass special - with that bouncy background music that gets you all hyped up for the holiday. Also, like most other R/B specials, this one gets better and better each year you view it, with the songs becoming more familiar and enjoyable every time.With the lack of Thanksgiving Day Specials out there, and the beloved legend-like status of Rankin/Bass, you would think that this one would have been released on DVD a long time - but not the case! We are still left with a decade-old VHS release as our only source. Hopefully this will change soon.", "overall": 4.0, "summary": "Rankin/Bass Does Thanksgiving!!", "unixReviewTime": 1322006400, "reviewTime": "11 23, 2011"}
{"reviewerID": "ALK6Q4T2JVHK5", "asin": "0307141985", "reviewerName": "Kate Beaudet", "helpful": [1, 24], "reviewText": "I bought this video to show to my third graders, but after previewing it, I have decided it is very inappropriate. Although this video offers an interesting portrayal of the Mayflower voyage, some of the information is  inaccurate.  Of great concern is its treatment of Native Americans.  Not  only are the drawings stereotypically buffoonish, but the way they made  them speak sounded like &quot;Tonto&quot; from the Lone Ranger.  The  Pilgrims even called them &quot;Red.&quot; Yikes!  The songs are very  old-fashioned and boring, and are not really about the Mayflower; the  lyrics are mostly about some love affair that is being kindled between two  of the Pilgrims.", "overall": 1.0, "summary": "Beware of racism", "unixReviewTime": 951004800, "reviewTime": "02 20, 2000"}
{"reviewerID": "A2PX6O292CD45B", "asin": "0307141985", "reviewerName": "Kathleen M. Freeman", "helpful": [0, 0], "reviewText": "This video is a classic.  I used to show it to my second grade classroom who all loved it.  I am so glad to have gotten a copy to show to my Grandchildren who enjoyed it thoroughly.", "overall": 5.0, "summary": "Mouse on the Mayflower", "unixReviewTime": 1353974400, "reviewTime": "11 27, 2012"}
{"reviewerID": "A3I66IXERB9WS3", "asin": "0307141985", "reviewerName": "Kathy M. Craig", "helpful": [2, 2], "reviewText": "I have not seen this cartoon since I was a child when I would watch it on Thanksgiving morning with my family before the parade. I really enjoyed seeing it again!", "overall": 5.0, "summary": "Childhood Revisited", "unixReviewTime": 1268179200, "reviewTime": "03 10, 2010"}
{"reviewerID": "A3KCVL8H2JMCWG", "asin": "0307141985", "reviewerName": "Lorene A. Wiebe", "helpful": [8, 8], "reviewText": "The Mouse on the Mayflower is a must see for all ages in my opinion.  While I don't remember ever seeing this wonderful movie on TV when I was a child, I learned of it as an adult when my children were small.  Since there are so few movies about Thanksgiving I purchased this on VHS and my children loved it.  Since then I have worn out two tapes and my third is getting \"grainy\".  I teach second grade and every year recommend to parents that they rent this from one of our local Video Rental stores.  The content tells a fairly accurate story of the pilgrims in a way children will enjoy and remember. Having talking mice tell a story of historic value is just one way to teach children of their nation's heritage.", "overall": 5.0, "summary": "A must see for all ages", "unixReviewTime": 1135641600, "reviewTime": "12 27, 2005"}
{"reviewerID": "A1LKAUJTCHJMSJ", "asin": "0307141985", "reviewerName": "Mario Pecora \"Mr.M\"", "helpful": [2, 2], "reviewText": "I have Mouse On The Mayflower On Dvd from 1971 with original commercials by McDonalds,runs 2hr,I all so have 1964 airing of Rudolph The Red Nosed Reindeer with original GE commercials.Email for details.", "overall": 5.0, "summary": "Mouse On The Mayflower", "unixReviewTime": 1257292800, "reviewTime": "11 4, 2009"}
{"reviewerID": "A6GMEO3VRY51S", "asin": "0307141985", "reviewerName": "microjoe", "helpful": [38, 38], "reviewText": "This is a Thanksgiving tale that begins with the ship Mayflower being caught up in a big storm. A churchmouse named William tells the story from a mouses viewpoint. He begins with the decision by the pilgrims preacher to move to America, and the packing of the Mayflower. A disaster at sea threatens to sink the ship, but William the pilgrim mouse has an idea to save the ship. The pilgrims land safely and write the Mayflower Compact. They begin to build their new colony and church, but it is already Fall and they do not have enough food stored. The winter is so harsh and food so limited that many pilgrims do not live through the winter. The pilgrims learn to plant crops in the Spring, and in the Fall celebrate with a big feast, the first Thanksgiving. William also scuttles a plan to blame the Indians for an attack on the pilgrims.Romeo Muller who wrote/adapted the Rudolph special and others wrote this story. Maury Laws who did such a good job with the music on the other specials wrote the music for this one, while Jules Bass wrote the lyrics. The songs include \"Elbow Room\" about the tight conditions on ship, A  song by Priscilla called \"When He Looks at Me\", a love song between John and Priscilla called \"Time Stands Still\" which is reprised with the arrival of Spring. The Pilgrims sing  \"This Land was Meant to be Free\", while they are full of hope and building a new church and village.  Kids love this film, and it has a wonderful ending.This 1 hour TV special originally aired on NBC on November 23, 1968.  It is done in traditional cel animation. The tale is narrated and sung by Tennessee Ernie Ford, Captain Standish is voiced by Eddie Albert, Priscilla is voiced by Joanie Summers (yes, of Happy Days). Four different characters are are performed by the famous voice artist Paul Frees, including Captain Jones, Smiling Buzzard, Quizzler, and Scurv.This was produced by Rankin/Bass Studios, who were in high demand due to the success of their 1964 stop motion hit, \"Rudolph, the Red Nosed Reindeer\". After Rudolph their next holiday special was \"Cricket on the Hearth\" in 1967, a traditional cel animated feature, then the Mouse on the Mayflower the following year. In addition to Rudolph the studio made over 35 TV specials, of which about 19 are holiday specials. Some of the others include Year without a Santa Claus, Nestor the Long Eared Donkey, The Little Drummer Boy, Frosty the Snowman, Santa Claus is Coming'to Town, Here Comes Peter Cottontail, Cricket on the Hearth, the Stingiest Man in Town, 'Twas the Night Before Christmas, A Christmas Tree, Pinnochio's Christmas, Rudolph's Shiny New Year, the First Easter Bunny, The Easter Bunny is Coming'to Town, Leprechauns Christmas, The First Christmas, and Frosty's Winter Wonderland. They also made non-holiday films such as the Hobbit; Flight of Dragons; Mad Monster Party, & the Last Unicorn. It is incredible that one company is responsible for all those TV specials, which are 95% of the ones broadcast every year. Their studio's work includes standard animation, stop-motion animagic, and live action. They really are a huge part of our pop culture history. I hope this comes out on a restored DVD soon, I have bought all the other Rankin/Bass that has been released on DVD.The publishing rights to most of the Rankin/Bass catalog of films is currently owned by Little Golden Books, and they have begin the long and expesive process of preserving and restoring the original films, and releasing them on DVD. They have done a great job with the other films, some that look as good as they did when they were made. They even restored missing footage to Rudolph. Theyhave been adding extra features and behind the scenes featurettes to the DVD's as well, and creating some very nice box sets.", "overall": 5.0, "summary": "Thanksgiving Holiday fun from Rankin/Bass", "unixReviewTime": 1058140800, "reviewTime": "07 14, 2003"}
{"reviewerID": "A3E102F6LPUF1J", "asin": "0307141985", "reviewerName": "Richard J. Goldschmidt \"Rick Goldschmidt\"", "helpful": [15, 16], "reviewText": "This is the BEST THANKSGIVING special around...and I am not just saying that because I am the RANKIN/BASS Historian.  The sound on this VHS is magnificent and it should be on DVD!  I have the original GAS LP Soundtrack on CD.  MAURY LAWS and JULES BASS did a wonderful job with the score.  ELBOW ROOM, sung by TENN. ERNIE FORD was part of the RANKIN/BASS off-Broadway play A MONTH OF SUNDAYS, before it was put to GREAT use in this special!  A GREAT Special!  E-mail me with any questions:  Rickgoldsc@aol.com", "overall": 5.0, "summary": "BEST THANKSGIVING special out there!", "unixReviewTime": 1068076800, "reviewTime": "11 6, 2003"}
{"reviewerID": "A32MQX1KLEHYKZ", "asin": "0307141985", "reviewerName": "Russ", "helpful": [9, 9], "reviewText": "I cannot believe The Mouse and the Mayflower does not come on Television anymore.  It is a true classic that puts you right in the holiday spirit no matter your age.  I am 26 years old and still till this day I love this movie every year.  This film is a great movie to watch the morning of thanksgiving for both adults and children alike.  I can't imagine a thanksgiving without it.", "overall": 5.0, "summary": "A MUST SEE!!!...", "unixReviewTime": 1038182400, "reviewTime": "11 25, 2002"}
{"reviewerID": "A32PY11I1I9GEZ", "asin": "0307141985", "reviewerName": "Shawn P. Cooke", "helpful": [10, 10], "reviewText": "Simply put, this is a fun kids movie about Thanksgiving.  The songs are (I feel) catchy, and act mostly to develop the characters, rather than to convey historical information.The Indian characters are presented in no more buffoonish a manner than their European counterparts.  In fact, great trouble is made to demonstrate that there are scoundrels on BOTH sides of the pond, and to show the nobility and desire for friendship in the native peoples of the area.  It is no use hiding children from racism; it is far more constructive to allow them to confront it and recognize it for what it is--the discarded relic of those who lived 400 years ago.", "overall": 5.0, "summary": "Don't Hide the Past", "unixReviewTime": 1040342400, "reviewTime": "12 20, 2002"}
{"reviewerID": "A1OUGM8CVX8CEI", "asin": "0307141985", "reviewerName": "Thomas Finley", "helpful": [0, 0], "reviewText": "This is one of the best Thanksgiving movies of all time.  We have enjoyed this movie for years and glad we were able to obtain another copy of it.", "overall": 5.0, "summary": "a great classic", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
{"reviewerID": "A2JP0URFHXP6DO", "asin": "0307141985", "reviewerName": "Tim Janson", "helpful": [11, 12], "reviewText": "It's been a number of years since I've seen Mouse on the Mayflower but it was always a favorite when I was a kid.  This was made by Rankin & Bass in 1968,who were at the height of their creative genius in the 60's, most known for Classic Christmas tales like Frosty the Snowman, Rudolph, and Santa Claus is Coming to Town.  This story tells the story of the voyage of the Pilgrims to America, but told from the perspective of mice who also make the perilous journey.  It's narrated by Tennessee Ernie Ford as we learn of the harsh journey over the Atlantic before the Pilgrims make it safely to the new world and are greeted by Indians and start their new lives.  Besides Ford the voice cast also includes Eddie Albert of Green Acres fame as Captain Standish.Like Frosty, this is done in regular animation and in that regard it has a look very similar to other Rankin & Bass specials like `Twas the Night before Christmas and others of the same period.  I always thought Rankin & Bass were vastly underrated as an animation studio.  This was a Thanksgiving tradition for a number of years but I have not seen it pop up on TV for quite a long time.  Unfortunately it's not on DVD yet so tracking a copy down may be hard.  Hopefully this will arrive on DVD soon.Reviewed by Tim Janson", "overall": 5.0, "summary": "A THANKSGIVING TRADITION", "unixReviewTime": 1141171200, "reviewTime": "03 1, 2006"}
{"reviewerID": "A1YAQIF1T73OU1", "asin": "0307141985", "reviewerName": "Tom Thomas", "helpful": [6, 6], "reviewText": "There are few Thanksgiving videos, but this one is top-notch. It portrays the real meaning of Thanksgiving and shows friendship overcoming ignorance.It is not without flaws. There are two \"musical numbers\" that put kids to sleep. If you look closely, you'll see the indians give the pilgrims a pineapple on the first Thanksgiving.The voiceovers of Eddie Albert and Tennessee Ernie Ford are exceptional. The animation is vintgae 1960s, but therein likes its charm.To anyone who doesn't like this video because it defies their rendition of political correctness, go eat your granola and leave the majority of people alone.", "overall": 5.0, "summary": "Excellent Entertainment", "unixReviewTime": 1133481600, "reviewTime": "12 2, 2005"}
{"reviewerID": "AR5PEVEEGSJ37", "asin": "0307142353", "reviewerName": "Robert \"Bstone18\"", "helpful": [0, 0], "reviewText": "I enjoyed this show when I was growing up. I later learned of the Scott Bremner death around 1998 and I wanted to see the show again. The VHS tape came faster then i thought it would and played great. Thou the show did not have the same magic as it did when I was younger. It did send me back to a very good place for a short time.", "overall": 5.0, "summary": "Great Show.", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "A3EVDRB2NK2UHS", "asin": "0307142426", "reviewerName": "Vanessa \"mvchristenson\"", "helpful": [4, 4], "reviewText": "The resident dog of the old house in Paris is Genevieve. She can sing, dance, and an assortment of other amazing feats. Miss Clavel and the girls adore her, so it's obvious that she must be entered in the Paris dog show so they can prove she's the 'most wonderful dog in the world.' Unfortunately, the other contestants' owners don't think she should be entered because she's a 'mutt.' My daughter loves this as much as the other Madeline videos, but I gave it four stars because the music and story isn't as fun as \"Madeline's Rescue\" and \"Madeline and the Bad Hat,\" which are my personal favorites.", "overall": 4.0, "summary": "Genevieve the wonderdog", "unixReviewTime": 1012867200, "reviewTime": "02 5, 2002"}
{"reviewerID": "AJFTX3UCA0H8U", "asin": "0307142698", "reviewerName": "A mom", "helpful": [3, 3], "reviewText": "Apart from being plain-old fun, as all Madeline books and videos are, this video teaches children the important of preserving historical buildings rather than destroying them. (If you want to share that concept with your  kids in other ways, you might also want to read your children the book,  &quot;Barn Savers&quot;, by Linda Oatman High.)", "overall": 4.0, "summary": "Teaches children importance of preserving our heritage", "unixReviewTime": 950832000, "reviewTime": "02 18, 2000"}
{"reviewerID": "A1C02Z83O2MJHO", "asin": "0307142698", "reviewerName": "April", "helpful": [0, 0], "reviewText": "We are big fans of the Madeline books in our house and all my kids have loved them over the years.  We got this movie and it is very sweet and very in line with the books.  The music is simple and the story is sweet.  Madeline's house is in need of repair so they move to a new neighborhood to a modern high rise building but their neighbors are not very nice and do not like children or dogs and despite their efforts to make friends with the neighbors they just can't change their minds.  Madeline gets the idea to fix up their old house so they can move back home.  My boy and my girl love the movie, my only complaint (and it's strictly mine, not my kids') is that the narration is a bit dull but no one else seems to mind.", "overall": 4.0, "summary": "Very Sweet", "unixReviewTime": 1332979200, "reviewTime": "03 29, 2012"}
{"reviewerID": "A3RJP3C9D6XDYT", "asin": "0307142698", "reviewerName": "robye delaney", "helpful": [9, 9], "reviewText": "I have to admit, I was a little apprehensive in buying my son Madeline videos.  But to my surprise, they're absolutely fantastic for boys and girls!  He particuliarly loves this one.  He imitates some of the funny  sounds (like when the girls are going up the elevator and make a  &quot;whuuuuup&quot; sound).  Then there is the &quot;Aww cots!&quot;  that  the girls yell out in disgust. Madeline and the girls dislike their new  quarters from the get go.  But, as usual, Miss Clavel shows them the  brighter side of the situation and sings a wonderful little song (Home Is  Where the Heart Is) where all the little girls join in in unison.  Watching  my son stand in front of the tv joining in as well almost brought tears to  my eyes.  It's so cute seeing him interact with all the videos.  I just  ordered him 3 more Madeline tapes and will continue buying them!", "overall": 5.0, "summary": "One of my son's favorite!", "unixReviewTime": 961891200, "reviewTime": "06 25, 2000"}
{"reviewerID": "A18BDOCEYYVCJ8", "asin": "030714318X", "reviewerName": "Francesco Lovecchio", "helpful": [3, 3], "reviewText": "The story in the video is nice and should teach perseverance. These are the comments on the reviews. However, my daughter of 3 and half soon realized that Madeline was lucky only because she found the prima ballerina willing to help her to take part into the show, despite Madeline made a lot of mistakes during the selection.In fact, the story does not hightlight when and how Madeline is working hard in order to catch up with her companions.Anyway the story is still nice.Another point I want to make is the resemblance with Dora the Explorer. The differences are about context, but the role of a little girl as heroine is quite similar.Dora's VHS contains two episodes (half an hour each), Madeline only one (about half an hour).", "overall": 3.0, "summary": "Nice video and story", "unixReviewTime": 1060905600, "reviewTime": "08 15, 2003"}
{"reviewerID": "A3EVDRB2NK2UHS", "asin": "030714318X", "reviewerName": "Vanessa \"mvchristenson\"", "helpful": [8, 8], "reviewText": "Madeline is usually a very capable girl, but because she is so small she has a hard time being as good a dancer as her friends. Her class is invited to participate in the Paris ballet production of &quot;The Happy Swan,&quot; but her clumsiness causes one disaster after another and almost doesn't get to dance at the primere. She dreams of being a prima ballerina, so the revelation of her inadequacy is discouraging to her. To her credit, she does not give up, and along the way is encouraged by Miss Clavel and an unexpected friend. In the end, even though she isn't perfect, she tries her hardest. My daughter loves the dancing and can relate to Madeline's frustrations of being too small and too clumsy. It's a sweet story that encourages girls to do their best even when disappointed.", "overall": 5.0, "summary": "Sweet story about perservering", "unixReviewTime": 1008547200, "reviewTime": "12 17, 2001"}
{"reviewerID": "A2G1BMXBBZRPEP", "asin": "0307143341", "reviewerName": "Elizabeth Lapicola", "helpful": [0, 0], "reviewText": "I order the videotape for her on valentine 's day and she asked me to watch it with her ! She realy enjoyed watching the videotape for 25 mintues ! My mother loved the videotape I get her from Movies Unlimted !She was glad to watch Little LuLu for the first time on videotape !My mother said \" I was happy to see Little LuLu ! \"", "overall": 4.0, "summary": "Me and mommy review of Little LuLu !", "unixReviewTime": 1180656000, "reviewTime": "06 1, 2007"}
{"reviewerID": "AN73ATR54YW4Q", "asin": "030714335X", "reviewerName": "Dale L. Diorio", "helpful": [7, 9], "reviewText": "HELLO MY NAME IS CHRISTIAN I HAVE A MILYIN OF BARNEY SHRI LEWIS RUDOLPH THE RED NOSED REANDER PLAYHOUSE DISNEY SPOT DISNEY MOVIES ALL DIFRENT ,INDS AND MY SOSTERS ARE WACHING ALL 3 TAPES WHAT DO YOU WANT TO WACH NOW BARNEY SOMGS BARNEYS BEST MANERS BARNEY RIDING IN BARNEY CAR SING AND DANCE WITH BARNEY LAMB CHPPS PASOVER SUPRISE AND LOTS MORE I TOOK THIS TO A SLEPOVER MY AUNT AND MY AUNTS FRIEND LOVED LOVED LOVED THIS VIDEO MY AUNTS FRIEND MARNA Sang and sang to evrything whenever i had a belly ake the song that does ont end would make me fell beater i hope you get this video for ur child", "overall": 5.0, "summary": "LOVE LOVE LOVE THIS ONE", "unixReviewTime": 1140048000, "reviewTime": "02 16, 2006"}
{"reviewerID": "A2HU6BQWUVOGCD", "asin": "030714335X", "reviewerName": "Dawn", "helpful": [1, 1], "reviewText": "... he has watched it hundreds of times, and never gets tired of it.  The songs are really catchy, fun to sing, and teach important lessons about life and the importance of family.  Shari Lewis was a great kids' entertainer.Here's my nephew's impressions:  I love the scene where Lambchop is upset about the application for school.  My favorite song is the Button Factory song.  I also like the Family Tree song because it reminds me of Mum; we watched this tape together all the time when I was a baby.  I would recommend this tape for all kids.", "overall": 5.0, "summary": "My nephew loves this tape ...", "unixReviewTime": 1235260800, "reviewTime": "02 22, 2009"}
{"reviewerID": "A2G7OQHFIDEVN7", "asin": "030714335X", "reviewerName": "K. Malcher", "helpful": [9, 9], "reviewText": "The only way this video could have been better is if some of Sheri's older video footage from the 60's and 70's had been included. Our son loves the  songs and dances, never realizing he's learning to count and spell with  Sheri's warm and familiar friends.  We look forward to a Best Of. . .#2.", "overall": 5.0, "summary": "TIMELESS DISPLAY OF A LOVE FOR CHILDREN!", "unixReviewTime": 945907200, "reviewTime": "12 23, 1999"}
{"reviewerID": "A2CE3CSB27J1BH", "asin": "030714335X", "reviewerName": "MelodyGal55", "helpful": [2, 2], "reviewText": "We got it from the library once, watched it on Youtube several times, and my brother and I were hooked.  I love all the songs on here, especially the Charlie Horse Music Pizza songs, as I don't really remember that show (I was only three when it came out).  My favorite parts (well, two of them, I have a lot!) is when she tells \"The Pied Piper of Hamelin\".  I absolutely love that story, and Shari tells it so wonderfully.  My other one is the Family Tree song.  It is so touching and it can easily get in your head.  If you are thinking about getting this, GET IT!!!  That comes from not only me, but my little brother who absolutely loves the \"She Sells Sea Shells...\" song.  10 out of 10 for this wonderful video!!!", "overall": 5.0, "summary": "A classic in our house", "unixReviewTime": 1312502400, "reviewTime": "08 5, 2011"}
{"reviewerID": "A2ZEIWPF8NM8YS", "asin": "030714335X", "reviewerName": "Misha", "helpful": [1, 1], "reviewText": "This will stay in our video library and we will enjoy it with the grandchildren when they visit.  Good, clean fun -- cheerful and energetic.", "overall": 5.0, "summary": "Shari Lewis 3", "unixReviewTime": 1283472000, "reviewTime": "09 3, 2010"}
{"reviewerID": "A6GMEO3VRY51S", "asin": "0307143619", "reviewerName": "microjoe", "helpful": [2, 3], "reviewText": "THE STORY:  This is a very comical story of Baron Von Frankenstein (who looks like Boris Karloff), and his plans to create a bride for his monster Frankenstein. After he creates the monsters mate, he decides to make arrangements for a lavish wedding at the Transylvania Astoria, where most of the story takes place. Of course when the other monsters that are invited to the wedding begin to show, it turns the whole hotel into a nut house of terrified guests and staff. Igor is jealous of the monster and wants the bride for his own and plots to steal her. One of the prominent characters is Norman, a direct steal of the Jerry Lewis character in \"The Bellboy\". One running gag is about a mailman who was scared nearly to death delivering the invitations to the monsters, and lands up quitting his job to take a job at his uncles' hotel. The same hotel the monsters went to of course, and the bits about his trying to explain all this to his psychiatrist are hilarious.The studio writers wrote a really good script, full of running gags and inside jokes. Many of the jokes are aimed at the adult side of the audience, probably more so than any other special produced by this studio. And it works, it is a very fun special for all ages, enjoyable to watch with the kids.BEHIND THE SCENES: This is an animated special from the Rankin Bass studio, famous for their holiday specials such as Rudolph, Frosty, the Little Drummer Boy, and more. For this special they used traditional cel drawn animation rather than the 3D \"Animagic\" stop motion technique they are so well known for. The show was created as part of series of TV specials created for the \"The ABC Saturday Superstar Movie\", which ran for one hour each. The Rankin/Bass studio produced a total of 4 episodes for this series, including \"That Girl in Wonderland\", \"Willie Mays and Say-Hey Kid\", \"The Red Baron\", and \"Mad, Mad, Mad Monsters\".  This was definitely the best of the group.The crew for this special featured quite a few studio veterans that had worked on so many other specials. The background musical is from Rankin/Bass composer Maury Laws. Character design was by Paul Coker, another studio veteran and a Mad Magazine artist. The writing was done by William Keenan and Lou Silverman who worked on so many of their projects.The premiere release of this cel animated TV special was on ABC on Saturday September 23, 1972. This was 5 years after the studio released its stop motion musical \"Animagic\" theatrical release titled \"Mad Monster Party\", in theaters for the Fall season of 1967.  Many of the characters and plot elements from the theatrical movie appear  in the TV special.This special is now owned by Golden Books Entertainment, as is most of the Rankin/Bass catalog. They have done a good job of re-mastering and releasing high quality DVD versions of the most popular Rankin/Bass titles and loading some of them with extras. They are now getting to the more obscure titles and we can only hope this is one of them. In the meantime enjoy this VHS version, I really recommend it. All in all, a great show, it's hilarious.", "overall": 5.0, "summary": "Hilarious Rankin/Bass Studios TV special from 1972", "unixReviewTime": 1128470400, "reviewTime": "10 5, 2005"}
{"reviewerID": "A2UQIIJ2CD8REE", "asin": "0307143619", "reviewerName": "Monty Moonlight", "helpful": [5, 5], "reviewText": "Many Rankin/Bass fanatics are familiar with \"Mad Monster Party\" nowadays, but few still know about \"Mad, Mad, Mad Monsters,\" which was something of a mini prequel to the theatrical animagic feature. Done a few years later in traditional animation, \"Mad, Mad, Mad Monsters\" tells the story of the Frankenstein Monster's marriage to his newly created Mate. The Baron, extremely proud of his new creation, feels the wedding must be done up right. He rents out a luxurious hotel for himself and his monster friends, much to the distress of the staff and other guests. The monsters quickly wreak havoc throughout, while Igor does his darnedest to steal the Mate for himself. Everything is chaos, and until the last minute,  there's no way to be sure if the wedding will ever really happen at all.As with \"Mad Monster Party,\" the story has no mention of Halloween, so those R&B; fans hoping they have a new holiday special on their hands may be a bit disappointed. Still, if you are the type who just associates anything having to do with classic monsters with the Halloween season, you'll enjoy this one as a new tradition. It's not the most charming of Rankin/Bass specials, but it's an excellent companion piece to \"Mad Monster Party,\" and an enjoyable film in its own right too. But it's a shame that it's only available on VHS right now, when it would have been a lovely extra on the recent, wonderful \"Mad Monster Party\" DVD release.", "overall": 3.0, "summary": "A little-known Rankin/Bass production!", "unixReviewTime": 1067990400, "reviewTime": "11 5, 2003"}
{"reviewerID": "A1BA72K4VK1UN1", "asin": "0393102548", "reviewerName": "Patrick W. Crabtree \"The Old Grottomaster\"", "helpful": [5, 6], "reviewText": "The purpose of this CD set is to take the listener through the various periods of classical music, from Gregorian Chant up to the contemporary period, ending with the First Movement of \"City Life\" by Steve Reich. The FOUR CDs in this set supplement the music appreciation text:The Norton Recordings to Accompany the Norton Scores and the Enjoyment of  Music: Shorter Version.However, you don't need the book at all to savor the superb selections found on the CD. Here is a list of the composers (or excerpt works) that you'll hear:CD #1:-- Gregorian Chant-- Notre Dame School, \"Organum\"-- (anonymous) 13th Century Motet, \"O Mitissima, etc.-- Machaut, \"Puis qu'en oubli\"-- Josquin Desprez, \"Ave Maria\"-- Palestrina, \"Pope Marcellus\" (Mass, \"Gloria\")-- Monteverdi, \"A un giro sol\"-- Farmer, \"Fair Phyllis\"-- Purcell, Didi and Aeneas, Act III\"-- Bach, Cantata No. 80, \"A Mighty Fortress Is Our God\"-- Handel, Messiah, No. 18 & No. 44-- Vivaldi, \"Spring\"-- Handel, \"Water Music, Hornpipe\"-- Mozart, \"Eine kleine Nachtmusik, K. 525, Movements 1-4\"CD #2:-- Jacquet de la Guerre, \"Pieces for Harpsichord\"-- Bach, \"Prelude and Fugue in C minor, from the Well-Tempered Clavier\"-- Haydn, \"Symphony No. 94 (Surprise), 2nd Movement\"-- Beethoven, \"Symphony No. 5 in C minor, Movements 1-4\"-- Mozart, \"Piano Concerto in G major, K. 453, 1st Movement\"-- Mozart, \"The Marriage of Figaro, scenes 6 & 7 from Act I\"CD #3:-- Beethoven, \"Piano Sonata in C minor, op. 13, 2nd Movement\"-- Schubert, \"Erlking, D. 328\"-- R. Schumann, \"And if the Flowers Knew\"-- Chopin, \"Polonaise in A-flat major, op. 53\"-- C. Schumann, \"Scherzo, op. 10\"-- Berlioz, \"Symphonie fantastique, 4th Movement\"-- Smetana, \"The Moldau, from My Fatherland\"-- Brahms, \"A German Requiem, 4th Movement\"-- Verdi, \"Rigoletta, Act III excerpt\"-- Wagner, \"Die Walk&uuml;re, Act III, Finale\"-- Debussy, \"Prelude to The Afternoon of a Faun\"CD #4:-- Tchaikovsky, \"The Nutcracker, Act II\"-- Stravinsky, \"Petrushka, First Tableau, Part I\"-- Schoenberg, \"Pierrot lunaire, op. 21, No. 18\"-- Bartok, \"Concerto for Orchestra, 4th Movement\"-- Copland, \"Billy the Kid, Scene I\"-- Joplin, \"Maple Leaf Rag\"-- Ellington, \"Ko-Ko\"-- Bernstein, \"West Side Story (Mambo & Tonight Ensemble)\"-- Irish Traditional Dances, \"The Wind that Shakes the Barley\" & \"The Reel with the Beryle\"-- Crumb, \"Ancient Voices of Children, 1st Movement\" & \"The Little Boy Is Looking for His Voice\"-- Ligeti, \"Disorder\"-- East African Music, \"Ensiriba ya munange Katego\"-- Ung, \"Spiral\"-- Abing, (Chinese traditional music), \"The Moon Reflected on the Second Springs\"-- Larsen, \"Symphony Water Music, 1st Movement\"-- Reich, \"City Life, 1st Movement\"The orchestras and performers are all first-class. Some examples include The Tallis Scholars, The London Symphony Choir, Academy of St. Martin in the Fields (Marriner), New York Philharmonic (Bernstein), London Symphony Orchestra (Copland), etc. The overall sound quality of the performances is superb.I think that, if I were instructing a music appreciation class, I would have skipped many of the tracks on CD #4, in favor of expanding music from the Classical, Romantic, and Modern periods, yielding more focus on the major composers. For example, there are no examples of Mahler, Shostakovich, etc. But we can't always get everything that we want and the unique compositions on CD #4 are, at the least, interesting.This is an interactive CD and you can download from the discs the information relative to what you're hearing, so that's a nice feature as well. The liner notes are not extensive but they do list the essential details of each work and instructions on downloading the supplemental information.This collection is a great buy at any price -- highly recommended!", "overall": 5.0, "summary": "A terrific classical music sojourn!", "unixReviewTime": 1231372800, "reviewTime": "01 8, 2009"}
{"reviewerID": "A1TI1AJZWNT0R2", "asin": "0393102548", "reviewerName": "Ruza Cali Amon", "helpful": [6, 17], "reviewText": "if you want to live the entire experience of &quot;the enjoynment of music&quot; you really must buy the norton recordings. They complete themselves into a genuine musical experience", "overall": 5.0, "summary": "live a complete experience", "unixReviewTime": 960940800, "reviewTime": "06 14, 2000"}
{"reviewerID": "A14KOSAV1RXQ8O", "asin": "0510599125", "reviewerName": "Gwendolyn Jacobs", "helpful": [1, 1], "reviewText": "Absolutely love this CD!  My girls love to listen to this CD when they go to sleep.  The songs are very soft and beautiful.  The music and vocals are also very beautiful.  Very soft, gentle music.  Perfect for putting a little one to sleep. My favorites are \"Sleep, baby, sleep\", \"All through the night\", and \"Kentucky Babe.\"  This CD has a great variety of songs.  Some I've known all my life and others that I've never heard.  Very well put together.  I would definately recommend this CD.", "overall": 5.0, "summary": "Love this CD!", "unixReviewTime": 1293321600, "reviewTime": "12 26, 2010"}
{"reviewerID": "A24IIZC446AMGL", "asin": "0510599125", "reviewerName": "luvmygirls", "helpful": [0, 0], "reviewText": "This CD is amazing! It is so cute. My girls love to listen to it when they play and again when they go to sleep. I have recommended it to all of my friends. Definitely a must have!", "overall": 5.0, "summary": "a bed time must have!!", "unixReviewTime": 1294876800, "reviewTime": "01 13, 2011"}
{"reviewerID": "A1P9JMP3NIDUUU", "asin": "0510599125", "reviewerName": "Tanny2shus", "helpful": [0, 0], "reviewText": "My 11 month old daughter falls asleep to this CD every time, I don't even bother playing anything else!The Vocals are heavenly, so soothing and sincere. I personally don't get sleepy or fall asleep, but I DO enjoy sitting with my daughter as she dozes off while listening to this CD -- the quality and tone of their voices draw me into a peaceful reverie.  It brings me happy thoughts and memories of cotton white clouds in blue sunny skies and grassy fields of golden rods swaying with the wind. One voice is the voice of ethereal comfort that assures us of peace and safety, that all is well in the world; and the other voice is a voice of sweet innocence that sings with the freedom of a lighthearted spirit and an unburdened heart.  The one complements the other in a sophisticated pairing of raw, god-given talent.Disney, eat your heart out -- this is music (for all ages) at its finest!", "overall": 5.0, "summary": "the ONLY CD in my CD player since it's first playback!!", "unixReviewTime": 1305244800, "reviewTime": "05 13, 2011"}
