{"reviewerID": "A2UESEUCI73CBO", "asin": "0078800242", "reviewerName": "Karen Lange", "helpful": [0, 0], "reviewText": "This is an awesome resource to go with the TE of the same. I am still trying to figure out how to use ALL the awesome information included in this CD!", "overall": 5.0, "summary": "Great Resource to accompany TE", "unixReviewTime": 1374192000, "reviewTime": "07 19, 2013"}
{"reviewerID": "A3BBNK2R5TUYGV", "asin": "0113000316", "reviewerName": "b", "helpful": [0, 0], "reviewText": "even though they were refurbished the colors were vivid and the cartridges lasted a long time. Will order again from these folks", "overall": 5.0, "summary": "worked great", "unixReviewTime": 1359417600, "reviewTime": "01 29, 2013"}
{"reviewerID": "A5J78T14FJ5DU", "asin": "0113000316", "reviewerName": "N. Sommers", "helpful": [0, 0], "reviewText": "A good deal and I can make them work ok, BUT I live in a dry climate and they tend to dry out quickly. I also struggle to take them OUT OF my printer. The tab has to really be squeezed hard and low enough to get the cartridge out. My printer is an old Epson Stylus CX 6000.  Every time I get these I swear I'm going to get the Epson ink but then I can't make myself pay the price & I get angry that the printer companies have designed these to use a little of each color to print BLACK and I don't care how they justify it. I had an old HP inkjet that worked for YEARS and it didn't use all colors when I set it on black only. So I buy this ink  - (which does work) - as a kind of consumer protest. Consumers unite!", "overall": 3.0, "summary": "A good deal", "unixReviewTime": 1318723200, "reviewTime": "10 16, 2011"}
{"reviewerID": "A2P462UH5L6T57", "asin": "043928631X", "reviewerName": "D. Morrissey", "helpful": [0, 0], "reviewText": "Nice added stocking stuffer.  Beautiful addition for the Harry Potter fans to us in marking their location in their books.", "overall": 5.0, "summary": "Beautiful!", "unixReviewTime": 1356912000, "reviewTime": "12 31, 2012"}
{"reviewerID": "A2E0X1MWNRTQF4", "asin": "0439340039", "reviewerName": "Drake's mom", "helpful": [0, 0], "reviewText": "Could not get the game to run.  I have Windows 7, but ran a Windows 98 program (says it will run with Win95,98,Win NT) and it still did not work.", "overall": 1.0, "summary": "Didn't work on my PC", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}
{"reviewerID": "AAYGDWCI3LDQP", "asin": "0439394058", "helpful": [0, 0], "reviewText": "as described", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
{"reviewerID": "AI7SARYVM8FGA", "asin": "0439394058", "reviewerName": "A. Manternach", "helpful": [5, 5], "reviewText": "Nice size, colorful simple pictures and a nice font.  Just wished it was laminated...cost me $50 to laminate it at Kinkos.", "overall": 4.0, "summary": "Perfect for what I was looking for", "unixReviewTime": 1212624000, "reviewTime": "06 5, 2008"}
{"reviewerID": "A1BUVOGGFTGMBN", "asin": "0439394058", "reviewerName": "ANON", "helpful": [5, 5], "reviewText": "This is not coated in plastic as the description indicates.  It is very thin cardboard.  It is not a durable product and therefore I don't believe very useful for use around children.  I also thought there would be some way to attach the numbers, days, etc. and there is not.  I guess you would need to laminate this and then attach something to the backs to make them stick to a board (which again is not included).  It is just a bunch of punch outs, including the calendar portion which is in two pieces.", "overall": 2.0, "summary": "very disappointed", "unixReviewTime": 1389744000, "reviewTime": "01 15, 2014"}
{"reviewerID": "A35UM9B38X7AYS", "asin": "0439394058", "reviewerName": "C. L. OLeary", "helpful": [0, 0], "reviewText": "I will take other reviewers suggestions and do a cheap laminating job with clear contact paper, but for the price if it doesn't last long it is not that big of a deal, you can replace it.  It is very complete in its contents.  I bought it for a gift for my daughter who homeschools her 4, 5, and 7 year old and know they will like it.  She has an entire wall that readily accepts push pins so probably will not velcro the items, but it is rather large so velcro and a large flannel board might be a good suggestion for some since the entire months should be displayed with the calendar for recitation every day.", "overall": 5.0, "summary": "A lot for the price.", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
{"reviewerID": "AM2U8KJROWYKR", "asin": "0439394058", "reviewerName": "EB227", "helpful": [11, 11], "reviewText": "Great calendar, my 3 year old loves it.  I bought a roll of contact laminating paper and laminated the pieces for about $5.  This will help a lot since the pieces are just thick paper (like notecard thickness).  I also glued the calendar on a large piece of foamboard.  Other than that- very nice.", "overall": 4.0, "summary": "Needs laminated", "unixReviewTime": 1346976000, "reviewTime": "09 7, 2012"}
{"reviewerID": "A1V1VJ3W1SYJU0", "asin": "0439394058", "reviewerName": "Erin Lee", "helpful": [1, 2], "reviewText": "I purchased this for my son, who is turning four this year. He loves everything about school and cannot wait until he gets to start Kindergarten. I decided to get this because I wanted a way to teach him how to use a calendar so he will be prepared for his first day. As a budding educator, I find this set to be educational and fun. My son loves the illustrations and enjoys changing the day and weather cards with me every morning. I would have been super awesome if these came pre-laminated but no one here is complaining. Thank you very much for making such a nice product.", "overall": 5.0, "summary": "Wonderful!", "unixReviewTime": 1374969600, "reviewTime": "07 28, 2013"}
{"reviewerID": "A2GLL6RNXXGBCM", "asin": "0439394058", "reviewerName": "grandmapat6", "helpful": [0, 0], "reviewText": "I bought this calendar for my granddaughter who is being homeschooled at home.  My daughter thought is would be excellent to use with her preschooler.", "overall": 5.0, "summary": "Great Purchase", "unixReviewTime": 1395014400, "reviewTime": "03 17, 2014"}
{"reviewerID": "A1I4RQ7F65L5VZ", "asin": "0439394058", "reviewerName": "Harmony29", "helpful": [0, 0], "reviewText": "Love it! I would've given it 5 starts if it came laminated. I bought a cheap roll of clear contact paper from Walmart. That did the trick. Took some time covering it with it and cutting it out, but def worth my time. Great buy! Highly Recommend!!!", "overall": 4.0, "summary": "Great!", "unixReviewTime": 1394841600, "reviewTime": "03 15, 2014"}
{"reviewerID": "A39L54MWP4C86L", "asin": "0439394058", "reviewerName": "HK2006", "helpful": [0, 0], "reviewText": "This calendar looks really nice, and it's definitely worth the money. It's going to be perfect for carpet time with my kindergarten class. This is exactly what I was looking for!", "overall": 5.0, "summary": "I love this calendar!", "unixReviewTime": 1349308800, "reviewTime": "10 4, 2012"}
{"reviewerID": "AYVV0R6U3HRIR", "asin": "0439394058", "reviewerName": "hm86", "helpful": [0, 0], "reviewText": "So I should have read reviews: I saw an overall high rating so I thought this would be great!THINK AGAIN!It's terrible; very flimsy and doesn't meet my standards of even decent. I bought a couple posters at the Dollar Store (2 for $1) that were of better paper quality than this item. It's very very flimsy and wouldn't last in my opinion. I homeschool and bough this thinking I would save $5 from buying this vs an actual pocket calendar... PAY THE EXTRA 5 bucks. Trust me!I ended up buying stuff to laminate this thing and ended up paying far more than the difference to laminate than to just get the actual pocket calendar. I would not buy this again, ever!It doesn't have a 'today' marker for the calendar and also doesn't include simple holidays like Mother's/Father's Day but does have grandparents day... very odd!I typically can see the good in most but this isn't something I am happy with. Also if you didn't laminate and didn't want to post with a million tacks it would fall to pieces with tape or sticky tack. It's not real big but too big to fit on a regular (big walmart size) cork board....too much work to keep this looking decent let alone expecting it to last. Buy the pocket calendar and be done with it with less headache.", "overall": 2.0, "summary": "Not Great!", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"}
{"reviewerID": "A2VBRY9MELAPYT", "asin": "0439394058", "reviewerName": "Jeanne Steelman", "helpful": [0, 0], "reviewText": "Great product- a lot of pieces to give you flexibility in your circle time and calendar time. Very complete set.", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
{"reviewerID": "A3340VCHPJTEC8", "asin": "0439394058", "reviewerName": "jnaomi", "helpful": [1, 2], "reviewText": "This calendar was everything I expected it to be.It has 2 sets of numbers for the date blue and yellow, holidays and birthday cards.Weather yesterday, today, and tomorrow, and Months.We are using this calendar for our homeschool room, It is exactly what i was looking for!", "overall": 5.0, "summary": "All in one Schoolhouse Calender!", "unixReviewTime": 1372118400, "reviewTime": "06 25, 2013"}
{"reviewerID": "A1U3WTFJZO6CJL", "asin": "0439394058", "reviewerName": "Julie Z", "helpful": [0, 0], "reviewText": "This is perfect for my homeschooled kiddos.  Ages 10, 4, and 2.  They all love taking a turn to put on the date and weather for the day.  I bought some Velcro for the backing.  I decided not to try to laminate it.  So far, we've been through several months and the pieces are holding up well!", "overall": 5.0, "summary": "Good quality.  Covers all the weather/date bases.", "unixReviewTime": 1386806400, "reviewTime": "12 12, 2013"}
{"reviewerID": "A1LSX9PO1Q2XF1", "asin": "0439394058", "reviewerName": "Karbear2678", "helpful": [0, 0], "reviewText": "Looking forward to laminating these and putting them up on our wall in our home.  Hopefully something I can use when I start teaching as well!", "overall": 5.0, "summary": "Great look!", "unixReviewTime": 1370390400, "reviewTime": "06 5, 2013"}
{"reviewerID": "A33X18AKYV9GBB", "asin": "0439394058", "reviewerName": "Kelly Cobb", "helpful": [0, 0], "reviewText": "My family started homeschooling in Oct. This calendar has been great to have, and my kids look forward to it everyday!", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}
{"reviewerID": "A3P87YRDFG8ELM", "asin": "0439394058", "reviewerName": "mandy", "helpful": [0, 0], "reviewText": "It was everything I expected. Very colorful and understanding for the children. I would recommend for someone who didn't want anything to complicated and was right to the point of your idea.", "overall": 5.0, "summary": "loved it!!", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A1QISIRLE3Y36E", "asin": "0439394058", "reviewerName": "Marla Molvin", "helpful": [3, 3], "reviewText": "I have used this calendar everyday of the school year.  It has held up well and is part of my morning routine. Quick delivery. Good product.", "overall": 5.0, "summary": "Calendar", "unixReviewTime": 1364774400, "reviewTime": "04 1, 2013"}
{"reviewerID": "A1KKPJG16SAY7P", "asin": "0439394058", "reviewerName": "Mcsb326", "helpful": [0, 0], "reviewText": "This calendar is great, it is exactly what I was looking for for my 3 year old. I just wish the pieces would come laminated and with velcro alredy.  I will laminate this so it will last longer as it will be used for 3 kids. overall I am very happy with this. I would reccommend this for Pre-K thru 1st grade.", "overall": 5.0, "summary": "What I was looking for", "unixReviewTime": 1380844800, "reviewTime": "10 4, 2013"}
{"reviewerID": "A13ROW5EFQWYBU", "asin": "0439394058", "reviewerName": "Megan", "helpful": [0, 0], "reviewText": "No, this is not the top quality calendar you will find.  I ended up laminating all the smaller pieces at home and putting velcro on them (nothing to stick them to the calendar with).  But it has been so useful and so much fun for my toddler to do date and weather with.  Aesthetically pleasing.  Lots of different holiday/special occasion fillers to use.  I'd say the material is probably card stock.  Not flimsy, but also probably easy to rip.  If you have access to a laminator, definitely consider this product.  We have loved it!", "overall": 5.0, "summary": "Cute, colorful, and fun!", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}
{"reviewerID": "A2J2JNUHJSJXEQ", "asin": "0439394058", "reviewerName": "millertym", "helpful": [0, 0], "reviewText": "This is a good little calendar set. I laminated the school house with contact paper to make it more durable. As well as the months, weather, etc. I did not laminate the days and special days squares, because there were so many, but I would recommend it if you can. The illustrations are cute and colorful, and it like the school house design as well.", "overall": 4.0, "summary": "Cute set, but definitely laminate.", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "AO2PNHQYG2WZ3", "asin": "0439394058", "reviewerName": "Monica", "helpful": [0, 0], "reviewText": "My only regret with getting this calendar is the durability. I ended spending an additional $40 to laminate it the entire calendar. My girls love it though.", "overall": 3.0, "summary": "Nice and colorful!", "unixReviewTime": 1398384000, "reviewTime": "04 25, 2014"}
{"reviewerID": "A2HLCD7CFFSGC9", "asin": "0439394058", "reviewerName": "RaeDawn Davis", "helpful": [0, 0], "reviewText": "I bought this for my 2 year old daughter to help with her development at home.She loves all of this. She knows the days of the week now and when we have a birthday. she also has learned about the weather so she knows how to get dressed in the morning.", "overall": 5.0, "summary": "My Daughter Loves This!", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A350B80NE4BCFJ", "asin": "0439394058", "reviewerName": "Rodney Davis", "helpful": [0, 0], "reviewText": "The calendar is perfect for your home school classroom.  It helps teach the little ones the days of the week, months, weather, etc..My only wish is that this was velcro/magnet. I have push pin holes everywhere.  One day in my &#34;spare time&#34;, I am going to put the little velcro on the back of each piece and on the calendar.", "overall": 4.0, "summary": "Great learning tool, colorful and fun!!!!", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
{"reviewerID": "A2K8AP8PANEWEY", "asin": "0439394058", "reviewerName": "Sam", "helpful": [0, 0], "reviewText": "This pack of multiple choices help children stay involved with our current conditions besides just the days of the week and other special calendar occasions. Unless you have been in the teaching industry, you would not even think of using this product. But honestly you don't need to wait for the children to go to school to help them! Home is where introduction such as this activity becomes more meaningful and fun!. In fact, it really helps keep the young ones more involved and observant as well as being proud of their accomplishments!If you have young ones at home, I would definitely recommend this product, be sure to laminate it, it will last longer...", "overall": 5.0, "summary": "Teacher helper...", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "AQ18S751UU7FV", "asin": "0439394058", "reviewerName": "Shantellia", "helpful": [0, 0], "reviewText": "I love the calendar and the students also.  They are better able to see the patterns in the numbers (colors).  They look forward to changing the weather, date, etc.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1382918400, "reviewTime": "10 28, 2013"}
{"reviewerID": "A371O5LP473MQY", "asin": "0439394058", "reviewerName": "Starla Holley", "helpful": [0, 0], "reviewText": "I really like the Schoolhouse Calendar Bulletin Board Set.  Because I plan to use these through the whole year, I went and got Velcro squares from Walmart and placed on the numbers, week days and weather descriptions.  We will use this well at our Children's Preschool Academy.", "overall": 5.0, "summary": "I would recommend this for any child care facility or school.", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "A26KIWWTFYTQFX", "asin": "0439394058", "reviewerName": "Teacher-mommy", "helpful": [1, 1], "reviewText": "We have enjoyed this calendar in our homeschool classroom this year. The kids love adding the new date each time and checking the weather to see whether it's cloudy, rainy, sunny, etc. The cards that came with this calendar are perfect for lower elementary students--as we add the cards for today, we are able to review the days of the week, observe the weather, and recognize which dates are weekends and weekdays or special holidays. I only wish I'd been able to get it laminated. The pieces are made of stiff cardstock, but they still bend and wrinkle a little bit as small hands manipulate them.", "overall": 5.0, "summary": "Excellent classroom calendar!", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A381GBV7P8SV8L", "asin": "0439394058", "reviewerName": "the mom \"momofboys\"", "helpful": [1, 20], "reviewText": "I can't believe this product is priced at over 170.00 who would pay that much it is more like ten dollars.", "overall": 1.0, "summary": "173.00 are you freaking kidding?", "unixReviewTime": 1263859200, "reviewTime": "01 19, 2010"}
{"reviewerID": "A1WFFITOYL1GC2", "asin": "0439394058", "reviewerName": "Thomas H. Meier", "helpful": [3, 3], "reviewText": "Great product and very helpful thanks it will look great and be a great addition to my classroom.", "overall": 4.0, "summary": "Calendar", "unixReviewTime": 1241136000, "reviewTime": "05 1, 2009"}
{"reviewerID": "A15WIV8DXXKNB0", "asin": "0439492092", "reviewerName": "RU girl", "helpful": [0, 0], "reviewText": "I have used this bulletin board set in a kindergarten classroom and my students loved it! I asked the students to tell me one thing they were thankful for and then wrote it on the leaves. This set is large, it will fill up an entire board. I would recommend this for any teacher to use during the holiday season.", "overall": 4.0, "summary": "Great bulletin board; Love for Thanksgiving", "unixReviewTime": 1313193600, "reviewTime": "08 13, 2011"}
{"reviewerID": "A2X1UTH0YUFP63", "asin": "0439492335", "reviewerName": "Tamia Pettus", "helpful": [0, 0], "reviewText": "This product was so special, it made our bulletin board so beautiful.  I would love to see what else this company that can be used in future activities.", "overall": 5.0, "summary": "It's April!!!", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"}
{"reviewerID": "AQCNMXQAMNTT3", "asin": "0439492602", "reviewerName": "Viviane Lima Coimbra", "helpful": [0, 0], "reviewText": "It is excellent to teach English here in Brazil. I can put them at the board and explain whatever I want.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1395792000, "reviewTime": "03 26, 2014"}
{"reviewerID": "A2D88D4I3F1DGT", "asin": "0439492831", "reviewerName": "Kenie", "helpful": [0, 0], "reviewText": "I love this product. They are colourful and attractive. I know that my children would love it and I can't wait to put it inside the classroom.The other thing that I love about is the different shapes that it has. It arrived on time like it was schedule to. The overall service was excellent.", "overall": 5.0, "summary": "Thumbs Up!", "unixReviewTime": 1325635200, "reviewTime": "01 4, 2012"}
{"reviewerID": "A2KVCCCR0CEBXH", "asin": "0439492831", "reviewerName": "Peggy A. Henninger", "helpful": [0, 0], "reviewText": "Wonderful. I love it. I am using for sped kids and writing prompts and love the colorful pictures. Thanks, it is fantastic.", "overall": 5.0, "summary": "great", "unixReviewTime": 1315094400, "reviewTime": "09 4, 2011"}
{"reviewerID": "A2MF5XKK0SS5Y7", "asin": "043949284X", "reviewerName": "Denie Riggs", "helpful": [0, 0], "reviewText": "We used these for our Christmas Around the World Celebration for our Preschool Program.  They were very authentic and beautiful.  We added sequins, beads, etc to make them 3D.  We will use them every year that we study international Christmas.", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A2NNUAO0EP2S4G", "asin": "043949284X", "reviewerName": "Marchmolly", "helpful": [0, 0], "reviewText": "I'm a children's librarian, and I try to keep the section bright and attractive.  I have these decorations on the wall along our staircase, and the parents like to point them out to the children on the way up or down.  Love that this includes the text telling what country each child represents.", "overall": 4.0, "summary": "Library Wall Decoration", "unixReviewTime": 1369526400, "reviewTime": "05 26, 2013"}
{"reviewerID": "A8BUMZSEK97TR", "asin": "043949284X", "reviewerName": "Mary Jane O'Marah", "helpful": [0, 2], "reviewText": "I have been looking for these for a long time.  I was so excited to get them - then bummed out because they were so much bigger than I wanted :(", "overall": 3.0, "summary": "Culture People", "unixReviewTime": 1315872000, "reviewTime": "09 13, 2011"}
{"reviewerID": "A3BJXIKQDM377W", "asin": "043949284X", "reviewerName": "Michelle Adleman-Walker \"nutmeg\"", "helpful": [0, 0], "reviewText": "I put this up in our cafeteria and added pictures of foods from the different countries and a red border. The response from the students and staff has been great. It is brightly colored and made from heavy duty materials which covered a 4 x 10 foot board easily.", "overall": 5.0, "summary": "Great Bulletin Board Decor", "unixReviewTime": 1392508800, "reviewTime": "02 16, 2014"}
{"reviewerID": "A9JRK9WB8FJ6H", "asin": "0439492874", "reviewerName": "Lisa Stanley", "helpful": [0, 0], "reviewText": "We ordered this bulletin board set to reinforce our district's character training.  Each week we pick a different character trait to discuss and exemplify.  This is a basic set that looks great when laminated.  However, after we ordered it and paid for shipping, we realized that every teachers' supply store carries that exact same set at the same price.  Our lesson learned is that we should look at local stores and save the shipping and delivery delay.", "overall": 4.0, "summary": "Great price, but available at every teachers' store in every town", "unixReviewTime": 1328400000, "reviewTime": "02 5, 2012"}
{"reviewerID": "A3FQXWP3D1VC4U", "asin": "0439492882", "reviewerName": "AGS", "helpful": [0, 0], "reviewText": "I purchased these for my 18 month old grandson. I was very pleased with the quality of the posters...I did cover them with clear contact paper to make them more indestructible. The illustrations are large and detailed enough to lead to &#34;discussions&#34; which help build vocabulary.One minor complaint...Since we are always looking for ways to teach toddlers the names of body parts, I did wonder why some of the characters were illustrated without noses! (I drew them in myself with a permanent marker.)", "overall": 5.0, "summary": "Grandma's friend", "unixReviewTime": 1375747200, "reviewTime": "08 6, 2013"}
{"reviewerID": "A2BSUKI379HFI0", "asin": "0439492882", "reviewerName": "Anna Orrino", "helpful": [0, 1], "reviewText": "I used this posters for a child care conference.  They were great for our nursery rhyme theme.  I was very pleased with them.  Thank you", "overall": 5.0, "summary": "I love it", "unixReviewTime": 1363305600, "reviewTime": "03 15, 2013"}
{"reviewerID": "A1IIODNNXBDB8V", "asin": "0439492882", "reviewerName": "April N \"April N\"", "helpful": [1, 1], "reviewText": "My Grandma had posters almost exactly like these in her playroom when I was little.  I love that they are classics.  We will probably laminate them though so that they last longer.", "overall": 5.0, "summary": "The classics I expected", "unixReviewTime": 1291766400, "reviewTime": "12 8, 2010"}
{"reviewerID": "A3DZCINWMIQUHI", "asin": "0439492882", "reviewerName": "ginger a herrmann", "helpful": [1, 1], "reviewText": "I teach Kindergarten music and I wanted to focus on the classic nursery rhyme songs and with the posters, it adds a visual along with the singing that encourages memorizing.", "overall": 5.0, "summary": "Scholastic Teachers' friend nursery rhymes posters", "unixReviewTime": 1356998400, "reviewTime": "01 1, 2013"}
{"reviewerID": "A3S6A6X8GU475V", "asin": "0439492882", "reviewerName": "Jacquelyn Hawthorne", "helpful": [0, 0], "reviewText": "They  meet my need.  I am using the posters as part of the decorations for a Nursery Rhymes Baby shower. I recommended these posters to educators I know.", "overall": 5.0, "summary": "I love the Nursery Rhymes posters!", "unixReviewTime": 1367020800, "reviewTime": "04 27, 2013"}
{"reviewerID": "A1C1V6U08CL0VU", "asin": "0439492904", "reviewerName": "D. Hasler", "helpful": [0, 0], "reviewText": "I like these jumbo numbers better than Lakeshore's version because they are more subtle in their coloring.  They are large so you can put them up high on the wall and the students will still see them easily and they are out of the way.  Glad I finally found them!", "overall": 5.0, "summary": "Good Sized", "unixReviewTime": 1287187200, "reviewTime": "10 16, 2010"}
{"reviewerID": "A3387PR4NBRJSD", "asin": "0439499488", "reviewerName": "Chester", "helpful": [0, 0], "reviewText": "I have many of the cheap charts and hang them around my house for the boys. Invest in some good blue painter's tape and your walls will not take a beating.  Love these charts!", "overall": 5.0, "summary": "Buy them all!", "unixReviewTime": 1348358400, "reviewTime": "09 23, 2012"}
{"reviewerID": "A30HNB881VCDKQ", "asin": "0439499488", "reviewerName": "Emmanuel Palermo \"Manny\"", "helpful": [1, 1], "reviewText": "Nice size, good chart, good price.  I think it will work!  All of your letters in one place! AND instructions on how to write each letter!", "overall": 5.0, "summary": "Alphabet Poster", "unixReviewTime": 1334793600, "reviewTime": "04 19, 2012"}
{"reviewerID": "A9DQ0G3201DVX", "asin": "0439499488", "reviewerName": "Katie", "helpful": [0, 0], "reviewText": "Chart is what I wanted, but came in a box that was too small and the chart was bent to fit in it.", "overall": 4.0, "summary": "Chart arrived bent", "unixReviewTime": 1351036800, "reviewTime": "10 24, 2012"}
{"reviewerID": "ARKUVRRCN5J68", "asin": "043949950X", "reviewerName": "A. Thornton", "helpful": [0, 0], "reviewText": "Other desk tags have so much information on them that they are overwhelming and soon get ignored. This has just the right amount for a young mind ready to learn.", "overall": 5.0, "summary": "Perfect for 1st Graders!", "unixReviewTime": 1349481600, "reviewTime": "10 6, 2012"}
{"reviewerID": "A2ESXBP8KVGXGE", "asin": "043949950X", "reviewerName": "FlyMary \"Mary\"", "helpful": [0, 0], "reviewText": "Clean and simple name plates.  Easy to write on with markers.  The matte finish laminated well-the plastic adhered and did not peel off.  Sized nicely for round group tables.", "overall": 5.0, "summary": "As described.", "unixReviewTime": 1392249600, "reviewTime": "02 13, 2014"}
{"reviewerID": "A2XI102L0ESGLT", "asin": "043949950X", "reviewerName": "smac", "helpful": [0, 0], "reviewText": "These nameplates are the best! My kindergarteners use them all the time s a resource at their seats and in small groups.", "overall": 5.0, "summary": "perfect for kindergarten!", "unixReviewTime": 1379808000, "reviewTime": "09 22, 2013"}
{"reviewerID": "A3Q8JMFYKG1FGZ", "asin": "0439499704", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I bought this because i homeschool and i thought this would help with telling time. my daughter loves it. the only thing i didn't like is that it is huge! i guess i should read the description a little better.", "overall": 4.0, "summary": "nice", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}
{"reviewerID": "A2R39QTMF3U6CD", "asin": "0439499704", "reviewerName": "Lucki", "helpful": [0, 0], "reviewText": "Great for our in home classroom. Please know that these posters contain printables on the back. Since the hands of the clock must be cut out, remember to print copies of the back before you cut!", "overall": 5.0, "summary": "Great Resource, Plan Ahead", "unixReviewTime": 1349654400, "reviewTime": "10 8, 2012"}
{"reviewerID": "ABWC5GPSPBBCV", "asin": "0439499704", "reviewerName": "MoneySaverMI", "helpful": [0, 0], "reviewText": "Does it's job, wish it was a sturdier product, had to past it onto a poster board for support, so the kids wouldn't wreck it!", "overall": 3.0, "summary": "It does it's job", "unixReviewTime": 1356134400, "reviewTime": "12 22, 2012"}
{"reviewerID": "A47EIP6T4RM9D", "asin": "0439499860", "reviewerName": "A. Powell", "helpful": [1, 1], "reviewText": "I homeschool my kids and bought this to apply to my youngest child's work area. After having my son write his name on it, I adhered the plate to the table using clear contact paper. I would recommend these plates for children 1st grade and under.", "overall": 5.0, "summary": "Very Handy!", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "AHITY2JCFM1EJ", "asin": "0439499860", "reviewerName": "Linda McFarland", "helpful": [1, 1], "reviewText": "The student name plates have a nice set up and has a lot of information available. My students are first graders and use the number line and alphabet as a reference frequently.", "overall": 5.0, "summary": "Student Name Plates", "unixReviewTime": 1349136000, "reviewTime": "10 2, 2012"}
{"reviewerID": "A9PMOZNZNCSMV", "asin": "043950015X", "reviewerName": "Sara Georgacopoulos", "helpful": [0, 0], "reviewText": "These are very colorful and bright and cheer up any classroom. My students had fun finding which bug they were going to be for Spring. Each bug comes in two different colors which I didn't expect. For example the butterfly with open wings comes with orange wings or purple wings, and the butterfly with closed wings comes with blue wings or pink wings. Best part of all is they are a laminated material so by writing on them with a dry-erase marker, I can reuse them next year!", "overall": 5.0, "summary": "Better than expected!", "unixReviewTime": 1332028800, "reviewTime": "03 18, 2012"}
{"reviewerID": "A3M8905GVZMTD", "asin": "0439500214", "reviewerName": "QTSYJ", "helpful": [0, 0], "reviewText": "I was very pleased with the Holiday accents.  My kids loved them.  They are very bright and cheerful.  Easy to punch out.  Loved it!!", "overall": 4.0, "summary": "Loved it!!", "unixReviewTime": 1328659200, "reviewTime": "02 8, 2012"}
{"reviewerID": "A3EPJB4ID3CQ1", "asin": "0439501873", "reviewerName": "Brenda R Stauffer", "helpful": [1, 1], "reviewText": "I chose 5 stars on this paper because the colors a nice and vivid and the weight of the paper is great for my projects.", "overall": 5.0, "summary": "Great paper", "unixReviewTime": 1357948800, "reviewTime": "01 12, 2013"}
{"reviewerID": "A3UFPTCIYPJ2CW", "asin": "0439501873", "reviewerName": "D-Child", "helpful": [0, 0], "reviewText": "Bought this paper the games for a safari themed baby shower. It was perfect, matched great with the decor - received so many compliments.", "overall": 5.0, "summary": "Great Buy!", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A1X478UKMDAXPL", "asin": "0439501873", "reviewerName": "Kelli  L. Fox", "helpful": [0, 0], "reviewText": "I have a hard time finding Valentine's Day stationery in the stores, so when I saw this, I had to buy it!  It's good quality paper, adorable and festive for the holiday!", "overall": 5.0, "summary": "Awesome!", "unixReviewTime": 1327536000, "reviewTime": "01 26, 2012"}
{"reviewerID": "A1MQ8Q59T2LRMK", "asin": "0439503426", "reviewerName": "lettym", "helpful": [1, 1], "reviewText": "I really like the punch out cards, they are sturdy and bright and fun for the students.  The only reason I did not give five stars is because it is a set of 24th, classroom sizes are growing and I wish!! I had classes of 24, but my numbers are 30.. I wish there was a complete set of 30 punch out cards....", "overall": 4.0, "summary": "Great Visual", "unixReviewTime": 1333497600, "reviewTime": "04 4, 2012"}
{"reviewerID": "ACE8KFU2X49WD", "asin": "0439503426", "reviewerName": "paolam", "helpful": [0, 0], "reviewText": "i bought this for my aunt, as a kindergarden english teacher she`s always looking for things that can keep the class entertained and help full with the program! these were amazing!!! she love them, even for christmas she ask me to buy them more!", "overall": 5.0, "summary": "management wonders", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "A3KXR8L3CJMWW6", "asin": "0439504147", "reviewerName": "A. Sullivan \"RedbugSullivan\"", "helpful": [0, 0], "reviewText": "This item was purchased because school was starting and the preferred nameplates were nowhere to be found. Following the description, I'd hoped the planets names were current. Nope. Pluto was last on the list. Poor old Pluto...White-out tape covered the inaccurate bit prior to lamination. Inches and centimeters are separated for clear and easy reading. Even the list of continents has been handy! Now if they would just kick Pluto to the curb prior to printing the next batch, then this product would be more in demand.", "overall": 3.0, "summary": "Pluto Must Go!", "unixReviewTime": 1347926400, "reviewTime": "09 18, 2012"}
{"reviewerID": "A2ORG35B3SYCJ4", "asin": "0439504147", "reviewerName": "Honeybear", "helpful": [0, 0], "reviewText": "Desk plates are quite large, so pay attention to the dimensions. I wish they were self adhesive but easily removable. They lasted about 8 weeks on my student's desks under a strip of clear contact paper", "overall": 3.0, "summary": "Ok for  a while", "unixReviewTime": 1357430400, "reviewTime": "01 6, 2013"}
{"reviewerID": "ACWIMQWY8KS4O", "asin": "0439504147", "reviewerName": "Veronica Chambers", "helpful": [0, 0], "reviewText": "this name plate is very versatile. The kids have at their fingertips many useful resources. I would definitely recommend this set of plates for upper grades.", "overall": 4.0, "summary": "Well designed name plate", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A1FGGZUBJX0BFF", "asin": "043950435X", "reviewerName": "Brooklyn", "helpful": [1, 1], "reviewText": "Not as sturdy as I would have liked. In the hands of six year olds they did not last long. But they are nice.", "overall": 3.0, "summary": "ok", "unixReviewTime": 1333152000, "reviewTime": "03 31, 2012"}
{"reviewerID": "A1ESIA0CT87I62", "asin": "0439504406", "reviewerName": "Betty Chow", "helpful": [2, 2], "reviewText": "This is a very sturdy pocket folder. There's a place inside for the child's name, the school name, and the teacher name. I'm using it for my 3 year old.", "overall": 5.0, "summary": "Sturdy folder", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "AODYPN5LTCYE9", "asin": "0439505372", "reviewerName": "April M. Blake \"Mommy of Twin Boys\"", "helpful": [0, 0], "reviewText": "We homeschool.  My son picked this incentive chart for himself because he loves apples.  When I opened the package the chart was all wrinkled up and ripped.  We ended up keeping it.  The poster is attractive and it serves it's purpose.  It was discouraging care wasn't taken when it was packaged.  I hope the sender didn't package a poster that was damaged.", "overall": 2.0, "summary": "Arrived Damaged", "unixReviewTime": 1314230400, "reviewTime": "08 25, 2011"}
{"reviewerID": "AKP9J2T0DP1X7", "asin": "0439505380", "reviewerName": "Igor Livshits", "helpful": [1, 1], "reviewText": "The product itself is fine, but Amazon seems to have a mental block about proper packaging for it. The first chart arrived pretty much mangled beyond salvation. I contacted Amazon and made packaging suggestions. They quickly sent me a replacement, but it also arrived damaged. Given the low cost of the chart and the fact I could remedy most of the damage on the second chart, I kept it.Rant: Amazon should either pack these in tubes or stop selling them. Hand rolling the chart and stuffing it in a box much too large for it invites trouble,", "overall": 3.0, "summary": "Packaging challenge", "unixReviewTime": 1371600000, "reviewTime": "06 19, 2013"}
{"reviewerID": "AI8BGVBHIKVYC", "asin": "0439505399", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "For $7 this product was very disappointing and flimsy. It didn't come with a clasp to attach the arrow and you had to photo copy the back before you could make use of the arrow. I would NOT recommend this product", "overall": 2.0, "summary": "Disappointing", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A20OBSG4UF7NVH", "asin": "0439505399", "reviewerName": "april dornsbach", "helpful": [0, 0], "reviewText": "I was under the impression this would come put together or at least have the required parts.  It requires a brad to attach the arrow.  Since these arent something I normally keep around I will have to purchase these.  Typically they do not come in packs of 1 so likely I will be purchasing a pack.  Just one more thing to do for an already busy parent.", "overall": 2.0, "summary": "Doesnt come with required brad to assemble.", "unixReviewTime": 1379376000, "reviewTime": "09 17, 2013"}
{"reviewerID": "A8TA5VXMUP3VQ", "asin": "0439505399", "reviewerName": "Dani", "helpful": [0, 0], "reviewText": "I have a 4yr old little boy that LOVES preschool, so I set up a little preschool in his room. Every morning before school he looks out his window to see the weather and makes sure his weather chart is set for the day. He loves it.....", "overall": 5.0, "summary": "Great for my son", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}
{"reviewerID": "A3NW34T3YSX5O", "asin": "0439505399", "reviewerName": "danty", "helpful": [0, 0], "reviewText": "I bought this for my son who I am home schooling. This isn't laminated & came with a small hole in it. It wasn't big enough to send back or noticeable from a few feet away. It's pretty cheap for $7, but that being said, my son LOVES it. He checked the weather all day & changed it accordingly. The package also didn't come with the gold clasp it recommends to hang the arrow, so we used a tack, which worked fine.", "overall": 3.0, "summary": "My son loves it.", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}
{"reviewerID": "A4NKPDE15WOFF", "asin": "0439505399", "reviewerName": "Eileen Luna", "helpful": [0, 0], "reviewText": "Thank you for providing my class with a bright, colorful, weather chart.  It's come really handy in our Air and Weather unit.", "overall": 5.0, "summary": "Big, bright, handy", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "A2833KG0D2LCZD", "asin": "0439505399", "reviewerName": "KimH", "helpful": [0, 0], "reviewText": "Super fast shipping. Brand new condition. Can't wait to use it in my classroom. It's going to make a great addition to my room.", "overall": 5.0, "summary": "Great weather product", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "A34CLLZZSO1N1O", "asin": "0439505399", "reviewerName": "Lisa Newlon", "helpful": [0, 0], "reviewText": "It has every weather condition I need to teach pre schoolers the weather, colors are good, quality of the chard it good as well, but.....I wish the arrow was a bit stronger for little hands to change repeatedly.", "overall": 3.0, "summary": "It's okay!", "unixReviewTime": 1381104000, "reviewTime": "10 7, 2013"}
{"reviewerID": "A1ORHXUMAZ9SDO", "asin": "0439505399", "reviewerName": "Meg \"usmc_wife\"", "helpful": [0, 0], "reviewText": "This chart is a great way to teach weather. My 3 year old and I go to the window every morning (or outside if it's nice enough) to see what the weather is. Then we go to the chart to match the day's weather to the picture and word. It's a great addition to our morning routine.", "overall": 5.0, "summary": "Very cute and educational", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}
{"reviewerID": "A2YOHSRRAF9EBZ", "asin": "0439505399", "reviewerName": "M. New \"speak easy\"", "helpful": [0, 0], "reviewText": "My 3 year old twins love this.  We use it in conjunction with preschool.  They love checking the weather every morning.", "overall": 5.0, "summary": "Kids love it", "unixReviewTime": 1365724800, "reviewTime": "04 12, 2013"}
{"reviewerID": "A3O389O1DUHM0W", "asin": "0439505399", "reviewerName": "Noel Jaco \"Noel\"", "helpful": [0, 1], "reviewText": "Bought these for my kids play room, they are a great size so they can see it, i thought they were going to be small buy i was wrong and they are on good laminated paper love them!", "overall": 5.0, "summary": "Kids play room", "unixReviewTime": 1383523200, "reviewTime": "11 4, 2013"}
{"reviewerID": "A2QUI7GRC3LCRE", "asin": "0439505399", "reviewerName": "Rebecca Johnson", "helpful": [0, 0], "reviewText": "If you're looking for something high quality don't get this. It's a piece of paper. It wasn't well wrapped in the packing and was just shoved in the box. The box was wet upon arrival and the paper was mostly ruined. I'm unable to use it in my classroom. Wish I had gone with something better quality. It looks better in the picture than it does in person, especially when wet and wrinkled and doesn't come with the necessary items to attach the arrow (that I have to cut out on my own). For what I paid for it I definitely expected more. My kids like it and like the look of it. It's just not sturdy enough for a classroom. I'm going to have to attach cardboard to the back and hope I can iron it flat now that it's dry. Not sure how long it will last. Also have to go shopping to get something to somehow attach the arrow so that it will turn when the kids change the weather each day. Ugggh. NOT my best buy. Don't recommend it. It looks great, just not high enough quality for a classroom, especially one with younger kids (K - 2nd grade).", "overall": 1.0, "summary": "Could have been better", "unixReviewTime": 1363392000, "reviewTime": "03 16, 2013"}
{"reviewerID": "A38UFQOSTE0AZO", "asin": "0439505399", "reviewerName": "steph", "helpful": [0, 0], "reviewText": "This is a good deal. It's bright and simple. There is more lessons and things to color on the back. My daughter can read all the words clearly. I just wished the arrow came already attached. Why do I need to assembly something this simple? So ridiculous.", "overall": 4.0, "summary": "Very Good", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
{"reviewerID": "A2NEI6T67GY0EO", "asin": "0439505399", "reviewerName": "vicki", "helpful": [0, 0], "reviewText": "Really great price and product.  It's really interactive the kids love using it.  Great chance to extend learning.  Fun to use.", "overall": 5.0, "summary": "Great weather chart", "unixReviewTime": 1359244800, "reviewTime": "01 27, 2013"}
{"reviewerID": "ANDBXMX67ZZ5N", "asin": "0439505453", "reviewerName": "Michelle Shiflet", "helpful": [0, 0], "reviewText": "I will be returning this item.  It is not as pictured - the states are labeled, and I was specifically hoping for a map as shown without state name labels.  A little word on packaging - it was placed in a large box with a set of dictionaries and another map.  It wasn't rolled up or protected in any way.  It arrived creased from the edge of the box, and with several holes in it from the heavy dictionary set.", "overall": 1.0, "summary": "Not as pictured", "unixReviewTime": 1316649600, "reviewTime": "09 22, 2011"}
{"reviewerID": "A1CBJD6L15X3FK", "asin": "0439505461", "reviewerName": "Dependant on GOD", "helpful": [0, 0], "reviewText": "photo shows BLANK world map - without writing - and supposed to be write on/wipe off surfacethe map that we received has the names of the continents - is not write on/wipe off surface", "overall": 1.0, "summary": "scholastic world map chart", "unixReviewTime": 1330387200, "reviewTime": "02 28, 2012"}
{"reviewerID": "A2IN68DW490G12", "asin": "0439505461", "reviewerName": "Jean C.", "helpful": [0, 0], "reviewText": "Nice map for little kids!  I did have it laminated so it will last longer. I am using it to introduce pre-school kids to &#34;Social Studies&#34; Thanks Amazon!", "overall": 5.0, "summary": "Nice Map for pre-school intro to &#34;Social Studies&#34;", "unixReviewTime": 1355529600, "reviewTime": "12 15, 2012"}
{"reviewerID": "AK0XVTPHY08UX", "asin": "0439505658", "reviewerName": "Ryan W. Schukei", "helpful": [0, 0], "reviewText": "This offers a simple way of identifying who my class helpers are.  I would have liked it to be a little larger.  It meets my needs very well.  It also came in a timely manner.", "overall": 4.0, "summary": "Helper chart", "unixReviewTime": 1380412800, "reviewTime": "09 29, 2013"}
{"reviewerID": "A2ILU8BBBXE903", "asin": "0439505658", "reviewerName": "Tracy", "helpful": [0, 0], "reviewText": "This is a very inexpensive way to post classroom helpers.  It is a very durable product. The squares are large enough to post multiple names for each job.", "overall": 5.0, "summary": "Classroom Helpers", "unixReviewTime": 1314316800, "reviewTime": "08 26, 2011"}
{"reviewerID": "A1Y6VA4ZK2XQIT", "asin": "0439505747", "reviewerName": "Alex", "helpful": [0, 0], "reviewText": "Nice large size. Using as chore chart with family of four so maybe a little too big. However colors are vibrant and I would purchase again", "overall": 5.0, "summary": "Good purchase", "unixReviewTime": 1357430400, "reviewTime": "01 6, 2013"}
{"reviewerID": "AODYPN5LTCYE9", "asin": "0439505747", "reviewerName": "April M. Blake \"Mommy of Twin Boys\"", "helpful": [0, 0], "reviewText": "We homeschool.  My son picked this incentive poster out because he loves sea life.  This poster looks better in person than the picture online.  It arrived in perfect condition.", "overall": 5.0, "summary": "Looks Even Cooler in Person", "unixReviewTime": 1314230400, "reviewTime": "08 25, 2011"}
{"reviewerID": "A2DBZ7WAX7OTDO", "asin": "0439505763", "reviewerName": "Janet", "helpful": [0, 0], "reviewText": "Exactly what I needed for my classroom.  My students love the  praise phrases  on the chart. I am very satisfied.", "overall": 4.0, "summary": "Satisfy", "unixReviewTime": 1353628800, "reviewTime": "11 23, 2012"}
{"reviewerID": "A3QXE8X11O4Y6C", "asin": "0439505763", "reviewerName": "kim1", "helpful": [0, 0], "reviewText": "I bought this to use as an attendance chart in my Sunday School class of 1st and 2nd graders.  It's perfect!  I can add names if someone new shows up or easily erase if someone moves away.  And, the best part is, it can re-used each year!", "overall": 5.0, "summary": "Great Attendance Chart!", "unixReviewTime": 1350432000, "reviewTime": "10 17, 2012"}
{"reviewerID": "A310OI0ZKUVB0X", "asin": "0439505763", "reviewerName": "Momof threeangels", "helpful": [0, 0], "reviewText": "My students love to see their names and stickers as they move through reading books! A wonderful incentive for those not so ambitious students! Thanks again Amazon!", "overall": 5.0, "summary": "Great incentive tool for elementary students!", "unixReviewTime": 1353715200, "reviewTime": "11 24, 2012"}
{"reviewerID": "A3PJTP7AMA9YJW", "asin": "0439505771", "reviewerName": "M. Pittman \"cowgirl85\"", "helpful": [0, 0], "reviewText": "The weeks go by so quickly! This is a great way to see, at a glance, who has turned in all homework. I reward those who do with a week off every fourth week. This keeps me organized. Buy two or three.", "overall": 5.0, "summary": "Organize yourself", "unixReviewTime": 1384646400, "reviewTime": "11 17, 2013"}
{"reviewerID": "A2VDBALTBKFZUV", "asin": "0439505771", "reviewerName": "mrsrobertson", "helpful": [0, 0], "reviewText": "My kids enjoyed finding their name and putting up their own stickers. Very good to use in lower grades. Thanks", "overall": 5.0, "summary": "Great chart", "unixReviewTime": 1346198400, "reviewTime": "08 29, 2012"}
