{"reviewerID": "A210NOCSTBT4OD", "asin": "0076144011", "reviewerName": "Sheila", "helpful": [0, 0], "reviewText": "Have you ever thought about how you met your best friend? Was it normal, or was it wacky - like how Elias met Shohei? Pulling a boa constrictor snake named Mathilda out of your backpack can make a remarkable first impression! This book is about three best friends Elias, Honoria, and Shohei, who are united against \"That Which Is The Peshtigo School\". Their goal is to make it through the annual school science fair, but things don't always go as planned.Elias is part of a family made up of science fanatics who would do anything to win a science fair. Elias isn't exactly what you'd call the ambitious type, especially when it comes to science fairs. So he becomes like Galileo and \"retests\" one of his sibling's past projects. Honoria loves to be ambitious, especially when it comes to being a legal counsel extraordinaire. But when she faces a bigger challenge than beating Goliath Reed or getting a piranha to become vegetarian, she doesn't know if she can make it. Shohei is an all around slacker who tries to mooch off Elias instead of creating something on his own. His adoptive parents are constantly encouraging him to start \"hearing\" his ancestors. His mom has even turned Shohei's room into what looks like a walk-in Japanese museum exhibit!This book is laugh out loud hilarious and the more you read, the more exciting and unexpected it gets. I love the title on this book because it really made me laugh and want to read the book. I also like how people so different from one another can be such close friends. There is not much excitement in the beginning, but it builds up very quickly. So if you like that type of story, then this is the book for you.", "overall": 4.0, "summary": "Lovely", "unixReviewTime": 1349308800, "reviewTime": "10 4, 2012"}
{"reviewerID": "A28ILV4TOG8BH2", "asin": "0130350591", "reviewerName": "ccjensen", "helpful": [0, 0], "reviewText": "The butter dish is serving us well, and keeping the butter fresh and healthy. Couldn't be happier with it, and the color is a pleasing green.", "overall": 5.0, "summary": "Nice looking, and keeps the butter fresh", "unixReviewTime": 1300752000, "reviewTime": "03 22, 2011"}
{"reviewerID": "A31B4D7URW4DNZ", "asin": "0307394530", "reviewerName": "3Gigi3", "helpful": [11, 16], "reviewText": "I anxiously waited for the book I had pre ordered.  Pics were beautiful, but...If you don't want a cake with fondant your pretty much out of luck. As most guests want something yummy to eat as well as pleasing to the eye, fondant just doesn't do it.  Sure it holds color better and makes a great presentation, it just isn't a pleaseing thing to eat.We did take away some ideas, we did use some fondant flowers on the lower layers (least likely to be eaten), and used butterccream for the really good and most enjoyed layers.Good Job Martha, maybe next time you could show how to make butter cream just as attractive as fondant.MOTB", "overall": 2.0, "summary": "Mother of the Bride", "unixReviewTime": 1214784000, "reviewTime": "06 30, 2008"}
{"reviewerID": "A2HU0RPDRZZOP1", "asin": "0307394530", "reviewerName": "Alexey Leontev", "helpful": [0, 0], "reviewText": "Fantastic book, a lot of good, original recipes. All very nicely decorated. This book will be the best gift for many.", "overall": 5.0, "summary": "amazing book", "unixReviewTime": 1277337600, "reviewTime": "06 24, 2010"}
{"reviewerID": "A7J0XOW7DYBBD", "asin": "0307394530", "reviewerName": "Allan Mar Cariaso", "helpful": [0, 0], "reviewText": "Can't wait to try all the amazing techniques. I just browsed and I can say that this is the book I am looking for.", "overall": 5.0, "summary": "Very helpful", "unixReviewTime": 1393113600, "reviewTime": "02 23, 2014"}
{"reviewerID": "A9QY9F2Y7KDFW", "asin": "0307394530", "reviewerName": "Amazon Customer \"Book Obsessed\"", "helpful": [0, 0], "reviewText": "I've been on the search for the perfect wedding cake recipe for over ten years.  You can call it an obsession as I personally love the way wedding cake tastes and I'm not even married!  I bought this book as soon as it was published and the recipes are incredible - as well as the photos.  For anyone who bakes wedding cakes this is one recipe book worth the investment.", "overall": 5.0, "summary": "One in a million", "unixReviewTime": 1218499200, "reviewTime": "08 12, 2008"}
{"reviewerID": "A2MGJ4CELCSG10", "asin": "0307394530", "reviewerName": "Amber Owens", "helpful": [0, 0], "reviewText": "I was so happy with my purchase, the book was in perfect condition and arrived promptly! Thanks!", "overall": 5.0, "summary": "Pleased beyond my expectations!", "unixReviewTime": 1234137600, "reviewTime": "02 9, 2009"}
{"reviewerID": "A1S0DWONNWB8NH", "asin": "0307394530", "reviewerName": "Amy L. Depree", "helpful": [0, 0], "reviewText": "I really like this book and the recipes are easy to calculate how much batter you will need.  The pictures are wonderful.", "overall": 5.0, "summary": "Martha Stewarts Wedding Cakes", "unixReviewTime": 1266278400, "reviewTime": "02 16, 2010"}
{"reviewerID": "A1FUE4TEATOQVV", "asin": "0307394530", "reviewerName": "Angela Mccarter \"Cake Baker\"", "helpful": [1, 1], "reviewText": "Nice book, but more of a coffee table book than a how-to.  It does have some great photos and good recipes.", "overall": 3.0, "summary": "Coffee Table Book", "unixReviewTime": 1220659200, "reviewTime": "09 6, 2008"}
{"reviewerID": "A399RHVLQVXMA1", "asin": "0307394530", "reviewerName": "Angela White", "helpful": [1, 1], "reviewText": "Just love this book!! I got some great ideas from it. It is well written, recipes easy to follow. I did wonder whether this would be just another wedding cake book when I first saw it. I am so glad I went with my gut feeling and bought it. I love Martha Stewart items, this delivered well.", "overall": 5.0, "summary": "beautiful wedding cakes", "unixReviewTime": 1312675200, "reviewTime": "08 7, 2011"}
{"reviewerID": "A1S0WZTK4QTY6O", "asin": "0307394530", "reviewerName": "A Reader", "helpful": [0, 0], "reviewText": "I got this for myself and when my sister saw it, she wanted one as well.For the avid cake decorator, this is a great reference book with wonderful photos and instructions. Not for the beginner or the faint-hearted.", "overall": 4.0, "summary": "A beautiful book", "unixReviewTime": 1306195200, "reviewTime": "05 24, 2011"}
{"reviewerID": "A3RTX03KHAQ8LP", "asin": "0307394530", "reviewerName": "Averel Theken", "helpful": [0, 0], "reviewText": "This book is very inspirational if you're looking for a cake that is unique or if you just don't know what your style is. The front portion of the book helps you choose your style and the back half features specs on the cakes they show. i.e. how many people they serve, recipes, ect.", "overall": 5.0, "summary": "Bride to be help!", "unixReviewTime": 1233792000, "reviewTime": "02 5, 2009"}
{"reviewerID": "A1WXIQ3NYLMC8C", "asin": "0307394530", "reviewerName": "Brenda Young", "helpful": [0, 0], "reviewText": "I make a real effort to not buy anything by Martha Stewartbecause none of her recipes work but this book are photographsOf cakes by other people!", "overall": 5.0, "summary": "I like the wedding cake pictures!", "unixReviewTime": 1391385600, "reviewTime": "02 3, 2014"}
{"reviewerID": "A2UCOPAEMGV3YP", "asin": "0307394530", "reviewerName": "brooklyncakes", "helpful": [3, 4], "reviewText": "This is a gorgeous collection of wedding cakes created by some amazing designers, and it provides hours of inspiration. Unfortunately, it doesn't walk you through even the most basic outline of how to make most of these cakes.There are some techniques covered in the back (intro to piping and working with fondant for example) but they are not very in-depth.  I think this book is more of a coffee table book, or one that a bride could take to a cake designer, but not very useful for cake decorators looking to expand their repertoire of techniques.I would gladly pay twice what I paid for this book if it had detailed instructions on how to make the cakes pictured.", "overall": 3.0, "summary": "Lots of inspiration but almost no practical instruction", "unixReviewTime": 1225152000, "reviewTime": "10 28, 2008"}
{"reviewerID": "A1TDYA2ZBU11NG", "asin": "0307394530", "reviewerName": "Carolyn A", "helpful": [1, 1], "reviewText": "A comprehensive guide to modern wedding cake design that is precise, valuable, and beautiful. I purchased this knowing I could use it both for reference and inspiration. This book has all the things you expect from Martha Stewart and Wendy Kromer- detail, originality, and outstanding content. There are glorious photographs that have captions peppered with ideas for the necessary architectural unpinnings of a multi tiered cake. The guides contained in the book are helpful and detailed. The section on partnering with a professional is especially good - as it  brings attention to some of those things the client should think about before meeting about \"the cake\". The creations contained in this book are spectacular and the creators of this book have been most generous with ideas, design guidelines, and recipes. I have already used this as a  guide and reference for two couples going through the process of deciding what to do about \"the cake\". This book would be a tremendous asset on any cake decorators bookshelf - professional or passionate amateur.", "overall": 5.0, "summary": "Martha Stewart's Wedding Cakes", "unixReviewTime": 1203206400, "reviewTime": "02 17, 2008"}
{"reviewerID": "A2SMPLW2BFKSHJ", "asin": "0307394530", "reviewerName": "C. Blackwell", "helpful": [0, 0], "reviewText": "I really like this book but practice will make perfect.  It tells you all the basic terminology and has recipes and ideas galore.  With this book, most enthusiastic bakers could make tasty well put together cakes but some of the decorating tips are so grand, you won't be able to achieve them overnight if you're starting with only a basic skill level.  I'd say this is a good book though for anyone serious about making cakes, the recipes alone make it worth the money and you can always mix and match the decorations to suit your skill level.", "overall": 4.0, "summary": "Great bible but be patient", "unixReviewTime": 1210550400, "reviewTime": "05 12, 2008"}
{"reviewerID": "A13YEQYHZ93RB9", "asin": "0307394530", "reviewerName": "Cheryl L. Clack", "helpful": [0, 0], "reviewText": "Always beautiful, &#34;it's a good thing&#34; Martha.  Pure eye candy inspiration AND so Martha with hints, tips and practical steps.", "overall": 5.0, "summary": "Pure eye candy inspiration AND so Martha with hints, tips and practical steps.", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A109L3WXD1SJFU", "asin": "0307394530", "reviewerName": "Cookbook Gal \"Cookbook Gal\"", "helpful": [18, 20], "reviewText": "I cannot add much to Toni \"the bookworm's review.\"  The book is gorgeous -coffee table quality.  It is loaded with full color photographs, including numerous examples of different piping patterns. The decorating style is very Martha Stewart:  classically elegant.  The book does not provide pictures of whimsical cakes - there are other books on the market for that.While I did not buy the book for cake recipes (so I can't judge the quality and flavor of the ones provided), I did buy the book to complement a wedding cake decorating class that I am taking.  If you are a baker who is very interested in cake decorating, or need instruction on how to prepare large, multi-layered cakes, \"Wedding Cakes\" is very helpful.  If you are willing to put the considerable amount of time needed to perfect these techniques, (and believe me, it takes a lot of practice), this book is a wonderful resource.  You will, however, have to be patient; your cakes will not look like Martha's the first dozen times you try!", "overall": 4.0, "summary": "A Decorating Resource", "unixReviewTime": 1200787200, "reviewTime": "01 20, 2008"}
{"reviewerID": "A2X7EHMFQ9FLXK", "asin": "0307394530", "reviewerName": "C. Struebing", "helpful": [1, 1], "reviewText": "Martha Stewart's Wedding Cakes book is exactly what I was searching for. The clear instructions and gorgeous photographs are just perfect. A true cake designer's favorite. This is the first book I will turn to for ideas.And I have over 50 cake books in my library. I couldn't be happier. :o)", "overall": 5.0, "summary": "Spectacular Book!", "unixReviewTime": 1224806400, "reviewTime": "10 24, 2008"}
{"reviewerID": "AU86XQ8V39W80", "asin": "0307394530", "reviewerName": "D. Singletary", "helpful": [0, 0], "reviewText": "Everyone that dreams of designing beautiful cakes, should have this on their night stand.  I don't know how many nights I have studied it pages before going to bed, what an absolute treasure this book is.  It's like the Holy Grail of cake books. You won't regret it.", "overall": 5.0, "summary": "Absolute Treasure", "unixReviewTime": 1216944000, "reviewTime": "07 25, 2008"}
{"reviewerID": "A1OJX5PFD3H3Z4", "asin": "0307394530", "reviewerName": "Emilie", "helpful": [0, 0], "reviewText": "I just multiplied the Chocolate Butter Cake recipe by five to get 30 cups and it turned out PERFECT!! I spent too much time in the past throwing away batter or cakes because they tasted terrible but this one was the absolute best cake I have ever tried. The batter tastes like chocolate pudding and the cake itself melts in your mouth. I will definitely be trying all of the other recipes :)", "overall": 5.0, "summary": "Chocolate Butter Cake", "unixReviewTime": 1287792000, "reviewTime": "10 23, 2010"}
{"reviewerID": "AGYRCJM85D2UN", "asin": "0307394530", "reviewerName": "E. Salter", "helpful": [1, 1], "reviewText": "This is a wonderful reference book for anyone with a wedding on the horizon; or anyone who just needs a beautiful cake. Fabulous pictures and recipes.", "overall": 5.0, "summary": "Martha Stewart's Wedding Cakes", "unixReviewTime": 1237593600, "reviewTime": "03 21, 2009"}
{"reviewerID": "A3SCAJKV9ZSM18", "asin": "0307394530", "reviewerName": "Eunice", "helpful": [0, 0], "reviewText": "I love this book, thank you so much Martha Stewart .... I made the marble cake and it was delicious cant wait to make more of the delicious recipes, yummy", "overall": 5.0, "summary": "Thanks", "unixReviewTime": 1363824000, "reviewTime": "03 21, 2013"}
{"reviewerID": "AX4T4NZ3LEPYM", "asin": "0307394530", "reviewerName": "GVC \"flowerfreak\"", "helpful": [1, 1], "reviewText": "Beautiful in every way ,well written , superb photography , and fantastic instructions.... make this book a \" must have\".......whether you use this book as a coffee table, or as a reference book, it is definatley \"Top Shelf\".......... I also gave one as a gift...... the receipient was overwhelmed....", "overall": 5.0, "summary": "Beautiful...", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
{"reviewerID": "A3K5KQMEFYC35G", "asin": "0307394530", "reviewerName": "Happy & Retired \"islandtime\"", "helpful": [22, 23], "reviewText": "As a caterer, I found this book to be a good guide for those who create cakes for special occasions. Many of the cakes in this book are ones that have previously been in \"Martha Stewart's Weddings\" magazine, and I have made several of them over the years, but it is nice to have the collection all in one source. For the inexperienced, some of the instructions may seem a bit vague, but that is the martha Stewart way, as mostly she assumes that everyone knows how to do the basics. If you've never done this type of baking/creating before, this book is not for you. I do recommend it for those who do this professionally or as an advanced hobby.", "overall": 3.0, "summary": "Great creative guide", "unixReviewTime": 1203292800, "reviewTime": "02 18, 2008"}
{"reviewerID": "A95HWAEXYDLAS", "asin": "0307394530", "reviewerName": "H. Cooling", "helpful": [0, 0], "reviewText": "I thought this book was quite expensive when I bought it. Now I have it, I would say it was worth every bit I spent.", "overall": 5.0, "summary": "wonderful coffee table book", "unixReviewTime": 1234051200, "reviewTime": "02 8, 2009"}
{"reviewerID": "A2WED5HMLXGF06", "asin": "0307394530", "reviewerName": "herawati liang", "helpful": [0, 0], "reviewText": "very good book, good book you should have it because will give inspire. it is worth it! and price is not bad!", "overall": 5.0, "summary": "beautifull", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "A29P9NU4QNFFZL", "asin": "0307394530", "reviewerName": "Hwang Seon Nyeo \"tastea\"", "helpful": [0, 0], "reviewText": "you can see the wedding cake trend and lots of fine designs.Good thing to have this all color nice quality book as a document.", "overall": 5.0, "summary": "Good for idea", "unixReviewTime": 1242518400, "reviewTime": "05 17, 2009"}
{"reviewerID": "A3SJ5A8WST9KRL", "asin": "0307394530", "reviewerName": "J. Cattanach", "helpful": [6, 8], "reviewText": "I have bought a lot of cake decorating books but if you are looking for a guide to decorating cakes I thouroughly recommend buying a collette peteres or peggy porschen. Even though this book has a lot of  photo's it provides some information not much and honestly for the price I would prefer to buy a wedding cake magazine. This book was a dissapointment not very helpful or useful really.", "overall": 2.0, "summary": "martha stewart's wedding cakes", "unixReviewTime": 1218153600, "reviewTime": "08 8, 2008"}
{"reviewerID": "A2P2LY99B6T1GQ", "asin": "0307394530", "reviewerName": "Jean", "helpful": [1, 1], "reviewText": "Saw this book in my local library.  Borrowed it and simply loved it.  Couldn't wait to get my own copy.  Just love all the beautiful pictures in here.  Finally got it from Amazon and it's mine!!  No need to borrow from the library anymore.", "overall": 5.0, "summary": "Beautiful informative book", "unixReviewTime": 1293062400, "reviewTime": "12 23, 2010"}
{"reviewerID": "A2HZMBW8029EKR", "asin": "0307394530", "reviewerName": "K. Hardy \"Renaissancewife\"", "helpful": [0, 0], "reviewText": "I LOVE THIS BOOK AND MARTHA STEWART!!. If I could give more than 5 stars I would. I love this book. It has some of the most beautiful cakes and I love the thorough instructions given thruout the book. I would love if their was a sequel because I can't get enough of Martha and these awesome cakes!!", "overall": 5.0, "summary": "THE BEST BOOK EVER!!!!", "unixReviewTime": 1258243200, "reviewTime": "11 15, 2009"}
{"reviewerID": "A1X1556BV3MB40", "asin": "0307394530", "reviewerName": "K. Peters \"twins mom\"", "helpful": [1, 10], "reviewText": "It's a beautiful book. Wish it weren't so pricy though. It is worth it I suppose.", "overall": 4.0, "summary": "Martha Money Maker", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
{"reviewerID": "A1DY42GJECXNJH", "asin": "0307394530", "reviewerName": "M. cyran", "helpful": [1, 3], "reviewText": "This is a great book for people doing cake decorating and planning a formal affair.  It has been a great help in planning my daughters wedding cake.", "overall": 3.0, "summary": "cake decorators", "unixReviewTime": 1203638400, "reviewTime": "02 22, 2008"}
{"reviewerID": "A4AUZR34UQAHA", "asin": "0307394530", "reviewerName": "M. Velasco \"onceuponacake\"", "helpful": [1, 1], "reviewText": "I gave it four stars because the cakes were ones that were in the magazine at one time or another.  I was hoping to see some new ones.  Great quality book and beautiful pictures!", "overall": 4.0, "summary": "Great book!", "unixReviewTime": 1217548800, "reviewTime": "08 1, 2008"}
{"reviewerID": "A1PPK1WHQXI0HU", "asin": "0307394530", "reviewerName": "Naturelover!", "helpful": [1, 2], "reviewText": "I love looking at this book.  It is a great coffee table addition but as an instructive guide, it is too 'light' on information to be effective.  Good for the collector, but don't expect to get too much except for ideas.", "overall": 3.0, "summary": "Very pretty - more info needed!", "unixReviewTime": 1238889600, "reviewTime": "04 5, 2009"}
{"reviewerID": "A3LDQM3GCURG92", "asin": "0307394530", "reviewerName": "NuJoi \"Create with me\"", "helpful": [0, 0], "reviewText": "As with anything Martha Stewart, this is a thorough how-to book.  I purchased the book to get more cake decorating ideas, but the book goes far beyond that.There are about 14 cake recipes and more than 15 recipes for frostings and fillings. The suggestions for frosting and filling flavors opened my mind. Pistachio buttercream?? I'm all over it.For decorating ideas, I don't think this book has an equal. There are 111 gerogeous cakes for ideas. There are sections on piping, working with fresh flowers, gum paste, marzipan, chocolateThis is a strong reference book -- 255 pages of solid information.  It is a worthy addition to anyone who bakes and decorates more porfessional cakes.", "overall": 5.0, "summary": "Inspirational In So Many Ways", "unixReviewTime": 1224979200, "reviewTime": "10 26, 2008"}
{"reviewerID": "AXFF3INBDGV4I", "asin": "0307394530", "reviewerName": "Paula Kaberline", "helpful": [0, 0], "reviewText": "Book in new condition.  Perfect gift for my daughter, the cake baker!  We have a family wedding cake to do !!!", "overall": 5.0, "summary": "Great Buy!!", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A3F8XJP8IKHEOZ", "asin": "0307394530", "reviewerName": "R. Reuter", "helpful": [3, 3], "reviewText": "I purchased this book because I was interested in learning how to make wedding cakes.  My first, which wasn't even a wedding cake, it was my neice's 3rd birthday cake, came out so beautifully.  I used the recipes for the Vanilla Bean Sponge Cake and the Chocolate Butter Cake...both were PHENOMENAL and I got rave reviews.  I even had three people inquire about me making cakes for them!!!  Although some of the recipes may seem a little tedious, I truly believe that it is the small things that you do that make these cakes wonderful.  They take time (LOTS of time...mine took about 15 hours from start to finish!!!) and cutting corners does not get you the best results.  I have already recommended this book to many people interesetd in learning to bake like myself!  BUY IT!!!  I know its expensive....but it will last you for a VERY long time!!!", "overall": 5.0, "summary": "Martha Stewart's Wedding Cakes...Awesome!", "unixReviewTime": 1221436800, "reviewTime": "09 15, 2008"}
{"reviewerID": "A1KFVXANRKY4N", "asin": "0307394530", "reviewerName": "R. Thompson", "helpful": [0, 2], "reviewText": "My book was delivered in a timely manner.  Condition of the book was excellent.", "overall": 5.0, "summary": "Martha Stewart's Wedding Cakes", "unixReviewTime": 1220918400, "reviewTime": "09 9, 2008"}
{"reviewerID": "A3SZAQITH1TN2S", "asin": "0307394530", "reviewerName": "sally", "helpful": [0, 0], "reviewText": "perfect for the future bride or any cake lover. Stunning pictures and a large range of recipes. Very inspiring to look through. Keep it by the bed and look at the large lush pages as you fall asleep and dream of these amazing cakes..", "overall": 5.0, "summary": "cake lovers dream", "unixReviewTime": 1308441600, "reviewTime": "06 19, 2011"}
{"reviewerID": "A32TTBSUEZB371", "asin": "0307394530", "reviewerName": "Serrena Jacobs", "helpful": [0, 0], "reviewText": "If you actually want to make and decorate a cake, this book isn't much use. The book is mainly composed of images of wedding cakes, most of which weren't remotely close to something I would consider. Even if they had been something I liked, only a handful of them included instructions, which means I wouldn't have been able to make most of them anyway. The book did have a few good tips and a few cake and icing recipes.", "overall": 2.0, "summary": "A few good tips, but that's about it", "unixReviewTime": 1354147200, "reviewTime": "11 29, 2012"}
{"reviewerID": "A12WDDPOER44K4", "asin": "0307394530", "reviewerName": "Soccer Mom", "helpful": [1, 1], "reviewText": "This book is simply beautiful. There are so many photos of gorgeous cakes lending itself to be a wonderful source of ideas. I keep this book stored in a safe spot and enjoy spending time slowly taking in each delightful photo. There are a lot of recipes as well, but I have yet to try any. This book is a must for those who want a keepsake book for ideas and one to treasure for years to come. This is one of my favorites for browsing through pictures.", "overall": 5.0, "summary": "Simply Beautiful", "unixReviewTime": 1236124800, "reviewTime": "03 4, 2009"}
{"reviewerID": "A2VRFN4DCHZEZ3", "asin": "0307394530", "reviewerName": "T. Blishak", "helpful": [0, 0], "reviewText": "This book has awesome cakes, some you will have seen but always a pleasure to look at again. The recipes are good and the techniques first class. Any bride will love and every decorator will be inspired.", "overall": 4.0, "summary": "marthas wedding cakes book", "unixReviewTime": 1215820800, "reviewTime": "07 12, 2008"}
{"reviewerID": "A3ML9OYHCLAE8N", "asin": "0307394530", "reviewerName": "The Sugary \"Crystal H.\"", "helpful": [0, 0], "reviewText": "This book is everything I have ever hoped for in a wedding cake book.  I have just started my own wedding cake business and this book is solid gold!  I'm a HUGE Martha Stewart fan!! I love her amazing photos in everything she publishes! This book has some awesome recipes and oh, so many ideas for all of those who want to take their cake decorating to the next level, this book is for you!", "overall": 5.0, "summary": "wow", "unixReviewTime": 1208736000, "reviewTime": "04 21, 2008"}
{"reviewerID": "ABX3704SXNU5F", "asin": "0307394530", "reviewerName": "Toni \"the bookworm\"", "helpful": [102, 110], "reviewText": "I just couldn't wait to get this book! If you love to create cakes, and not just bake them, this will feed your appetite for cake baking and decorating, and you will place this alongside your other prized tomes of cake education. It's a wonderful journey of the wedding cake, aka \"a good thing\". If you purchased Martha's \"WEDDINGS\" book, this is the expanded and transformed chapter on cakes into this book.Martha has outdone herself once more in her passion to give us every possible idea, and instruction, to create the wedding cake of our dreams for the day of our dreams. And to join her in this quest is Wendy Kromer, master baker, who worked for Martha for many years, on both Martha's former TV show and for Martha Stewarts \"Weddings\" magazine; she now owns and operates her own bakery.While this book was made to help engaged couples decide on what type of cake they would like for their wedding, it also gives instructions should you wish to bake your own wedding cake. For those established bakers and caterers that are looking for ideas and concepts, this will be certainly be a well-referenced tool. The \"Album of Cakes\" section offers 111 official photographs of cakes, but if you add all photo's of cakes from other parts of this book, you will have well over 135 delectable wedding delights in which to choose.Martha and Wendy do not hold back on any instruction and it begins with the incredible photography of each cake, frosting, filling, and detail of these stunning cakes. These cakes come from both Martha's former TV show, Martha's \"Weddings\" magazines, as well as some new ones from collaboration with other cake artists.A hallmark of the Martha brand is that she is quite detailed in everything that she wishes to teach, and that is never more seen than here. There are some techniques that will require a professional to do such as the \"bubbles\" or \"pulled sugar ribbon\" for some of these cakes, and rightfully, she has not included those instructions in this book because they are labor and equipment intensive, as well as for safety reasons (you are working with intense heat with one, and need specific equipment for the other, let alone the need for specific training).If at all possible, try to obtain of copy of Martha's VHS tape called \"Cake Decorating\". It is the visual form of instruction on making some fabulous cakes, from simple 2-layer party cakes to actually assembling a 4-tier wedding cake. They were segments taken from her former TV show in which she, and guests, demonstrated this art of cake decorating. I am hoping that she will consider bringing that out again in DVD form. It is an excellent teaching tool and my copy has been well-worn out!This is a very big book, coffee table size, so along with excellent photography, the photos are large and show detail such as brush strokes of hand-painted fondant or delicate designs of rubber stamps used to imprint fondant. The use of gumpaste flowers and marzipan helps to complete certain dimensional and visual appearances desired.The journey begins:MARTHA AND WENDY'S INTRODUCTIONCHOOSING YOUR CAKE:Finding Inspiration: What style are you looking for? (modern, rustic, etc). What season? Location? Motif? (fabric, fruit, flowers, etc).A Cake's Components: Superb index with 14 cake flavors and 18 fillings and frostings along with recipes for each one.Icings and More: There are all types of ways to cover your cake and here are all of them, along with \"special considerations\" due to season, temperature, etc.Presenting the Cake: How do you want th cake to be displayed? Formal, relaxed? What type of bride and groom cake topper? Which cake board in which to rest the cake?Partnering with a Professional: This section is THE key for any bride and groom to read regarding choosing a qualified baker, along with sidebars  of other cake details to keep in mind.ALBUM OF CAKES: prepare your eyes!  :)Lemon Grove CakeDaisy Garden Cake7-Tier Classic CakePink Lusterware Cake Creamware CakeBahama Orchid CakeSweeping Monograms CakeMatelasse CakeButtoned-Up Cake7-Tier Coconut CakeCherry CheesecakeRose basket CakeLadyfinger Charlotte CakeDrifting Petals cakePink Macaroon CakePetty Piped Bows CakeTowers of Truffles CakeBeehive CakeApplesauce CakeIronstone CakeCitrus Celebration CakeFlower Hat CakePretty Pleats CakePearl and Shell CakePrimrose Cake (simply stunning)French Confectionary Box CakeApplique CakeHomespun Cupcake TowerCorinthian CakeRobin's Egg CakeMeringue Monogram CakeDotted Petals CakeCrewelwork CakePetite Piped CakesWhite Chocolate Tower CakeTuscan Grapes CakeChocolate Mint Cake (colorfully stunning)Woodland Nut CakeTransferware CakeHandcrafted Hellebore CakeMeringue Mushrooms CakeColorful Hydrangea CakePerfect Pear CakeGarlands and Wreaths CakePicket Fence CakeBubble Cake (the \"bubbles\" need to be made by sugar professionals)Pulled-Sugar Ribbon Cake (sugar ribbons are labor intensive)Eyelet CakeSugar Hydrangea CakeBeribboned Bouquet CakePink Cherry Blossom CakeBeaded Bouquet CakeTrio of Shells CakeChocolate Chestnut CakeRoyal Icing Reliefs CakeMegeve Chocolate CakeTreasures of the Woods CakeBlushing Dogwood CakeFaux Bois Cake (chocolate bands made to look like wood grain)Wedgewood CakeShimmering Candy CakeSilk-Cord Accents CakePaper Ornament CakeMeringue Chrysantheum CakePatterned Nonpareil Cake (remember those candies as a kid? Wow!)Darcy and Andy's Cake (the editoral director of \"Weddings\" magazine)Button-Topped Boxes CakeTrio of Freesia Cakes (so, so pretty)Chocolate Petal CakeCandy Sampler CakePlayful Paper Flower CakeMini Cupcake TowerStately Springerle CakeChocolate and Geranium CakeCharming Calico Cake (the joy of gumpaste)Devil's Food Finale CakeRose Garden CakeGarden of Sweet Delights CakeLemon and Latticework CakeDelightful Daisies CakeCandy Straw CakePink Madeleine CakeWedding Band CakeRustic Roses CakeSweets and Sentiments Cake (small cakes w/ tuille cookie messages)Strawberry ShortcakeFarmstand Fruit and Buttercream CakeIvory Dots CakeParrot-Tulip Quartet of CakesBlooming Branches Cake (so very delicate)Cascading Orchid's CakeChocolate Charlotte CakeLily-of-the-Valley CakeRuffly Rose-Petal Garland CakeLovely Licorice CakeChocolate Kumquat CakeCitrus Basket Cake (beautiful basic basket weave example)Cherry Almond CakeRibbons and Bows CakeRed Velvet CcakeDamask Cake (the scrollwork is not as hard as it seems)Vintage Monogram CakePin Tucks and Ruffles CakeSnow-Flecked Pinecones CakeShowered in White CakeBamboo Wave CakeTower of Roses CakeRustic Basketweave CakeScalloped Bands and Bows CakeRich Brownie Cakes (individual brownie wedding cakes)Marbelized CakeMAKING A WEDDING CAKE:Planning TipsBaking the Cake LayersDecorating and Assembling the CakeTransporting the CakeEquipment GlossaryCake 101Working with FondantPiping 101: monograms, glossary, piping tips w/ photo's and examples, piping a rose, piping basketweave patterns, piping scrollwork w/ examplesWorking with Fresh FlowersCrystalized FlowersEdible FlowersWorking with Gumpaste: flowers, blossomsWorking with MarzipanWorking with Chocolate: transfer sheets, chocolate bands, dark & white chocolate leaves, wood grain (faux bois)Additional Techniques: mushrooms, icing damask, monogramsRecipes: every flavor and taste for batters, icings, fillings, croquembouche, tuilles, spun sugarBakers Guidleines: An EXCELLENT guide to determine the amount of batter needed to fill specific size pans as well as the time needed to bake each one PLUS the amount of frostings and fillings needed for each size panSourcesAcknowledgementsIndexI realize that I am a Martha-groupie but even so, just perusing through this book, a novice can see that every aspect of wedding cake (or any party cake creation) has been thoughtfully considered and explained. You will be placing this along side a very few select cake books that are as complete, well-presented, and detailed as this one. Thank you Martha and Wendy!", "overall": 5.0, "summary": "Spectacular!", "unixReviewTime": 1199318400, "reviewTime": "01 3, 2008"}
{"reviewerID": "A22YB17RKOMXDE", "asin": "0307394530", "reviewerName": "Trudy E. Brassfield", "helpful": [0, 0], "reviewText": "Martha Stewart's Wedding CakesThis is an amazing book!  Beautiful photos and some of the cakes have recipies and decorating techniques.  I found the perfect cake for my wedding.  I highly recommend this book.", "overall": 5.0, "summary": "wonderful book", "unixReviewTime": 1224633600, "reviewTime": "10 22, 2008"}
{"reviewerID": "A3R2WD4YOFMSRU", "asin": "0307394530", "reviewerName": "Tyra Baginski", "helpful": [0, 0], "reviewText": "Definitely superb in precision of recipes, therefore a reliable reference. A lovely and clean presentation. Photograph quality excellent as is always the case with Martha's books. Would rate higher if possible.", "overall": 5.0, "summary": "Martha Stewart Reigns!", "unixReviewTime": 1352160000, "reviewTime": "11 6, 2012"}
{"reviewerID": "A3GFBHP59903HP", "asin": "0307394530", "reviewerName": "V. Jones \"pounds6\"", "helpful": [11, 11], "reviewText": "Im an intermediate cake decorator. I bought this book for inspiration and hoping for a few tips here and there. This is a great book. There are lots of really nice pictures, there are quite a few recipes and also quite a few \"how to's\".  If you are a beginner and are looking for a book to learn from, this is probably not the book for you, as it's not very instructional in my opinion. The authors do not show decorating processes from start to finish but assume you have some previous knowledge. I would recommend this book to anyone interested in it. Also the price on Amazon beats the bookstore price . I almost bought it in a big retail bookstore but decided to look here first. I saved more than $20.00", "overall": 5.0, "summary": "Intermediate Cake Decorators", "unixReviewTime": 1202428800, "reviewTime": "02 8, 2008"}
{"reviewerID": "A30247RSIH7FQ1", "asin": "0307394530", "reviewerName": "Wendy", "helpful": [0, 0], "reviewText": "This book provides a huge variety of professional wedding cake patterns. It also contains the basic information of popular cakes and their finishing ingredient, how you should choose the style or colour of cakes etc. It is not a full recipe book but rather an inspirational guide of how to select a perfect wedding cake for an event. Most recommended for amateur bakers and bride to be!", "overall": 4.0, "summary": "An eye candy", "unixReviewTime": 1348617600, "reviewTime": "09 26, 2012"}
{"reviewerID": "A3T9HN4VDEX13U", "asin": "0307394530", "reviewerName": "Whitney", "helpful": [0, 0], "reviewText": "I recieved this book for Christmas.  I found the pictures in this book to be absolutely gorgeous and inspiring.I also made a wedding cake for my brother-in-law's wedding.  I tested out two cake recipes from this book; white butter cake, and yellow cake.  They were both absolutely delicious and not at all too sweet or dry.I also made the Swiss merengue buttercream which also turned out delicious was was a perfect complement to the cakes I made.  Not too sweet, and a nice smooth texture.I will definitely be referring to this book again and again and again when making any cakes.", "overall": 5.0, "summary": "Beautiful, organized, and delicious recipes1", "unixReviewTime": 1265587200, "reviewTime": "02 8, 2010"}
{"reviewerID": "A12BQ5HKDRY6H1", "asin": "0439903491", "reviewerName": "debbie mailhes", "helpful": [0, 0], "reviewText": "this item is a good buy for me for my daughter, it was delivered fast.it a educational item that give a child fun as she learns.", "overall": 5.0, "summary": "good item", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A1HI0CH2CS8EJT", "asin": "0578060604", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "This is a great deal.  The bundle will help most woodworkers make their dream chairs.  The instruction is detailed enough to build the chair while enjoying the process.", "overall": 5.0, "summary": "Great Plan Bundle", "unixReviewTime": 1286582400, "reviewTime": "10 9, 2010"}
{"reviewerID": "A129DYT9HJ0W1S", "asin": "0578060604", "reviewerName": "R. McLaughlin \"Stinkyonion\"", "helpful": [0, 0], "reviewText": "Price was less than others producing the same type of demo.  Book is outstanding, DVD is outstanding, patterns are perfect.  Really nice job!!  Even sent the author a question and he answered same day.  All I can say is WOW.", "overall": 5.0, "summary": "Wow !  Better than I expected", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "A18DBH3A4D8NDA", "asin": "0587010584", "reviewerName": "Brant W. Jones", "helpful": [0, 0], "reviewText": "The poster itself measures about 26\" x 34\". If you want your poster to fit inside a 20\" x 30\" frame (like I did), you'll have to trim off the white border to get it down to size.Other than that, good color, nice paper stock, carefully packaged.", "overall": 4.0, "summary": "The image is 20x30 but the poster itself is larger.", "unixReviewTime": 1337212800, "reviewTime": "05 17, 2012"}
{"reviewerID": "A2EKX87HLHZLIW", "asin": "0587168978", "reviewerName": "ampm247 \"AnnMarie\"", "helpful": [0, 0], "reviewText": "this is  a simple poster and not a print so if yoru buying it to frame and keep as something you really want to focus on looking at for a while, you may want to check into a higher quality of print.", "overall": 3.0, "summary": "its a poster", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
{"reviewerID": "A3KH70C9V5EDSW", "asin": "0587217189", "reviewerName": "Suzi", "helpful": [0, 0], "reviewText": "Great customer service and very prompt shipping. A high quality poster at a very good price. Would purchase more posters in the future.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "A3HDWFSOHMW0GW", "asin": "0587218959", "reviewerName": "Lady from the Mountain", "helpful": [0, 0], "reviewText": "I love, love, love this poster. It's adorable and pretty large.  There are several Fashion Frocks posters available, but I liked this one because of the style of the dress and because it's got some pink in the poster.  It's really vintage looking and just really cute.  I bought a white frame mat and a black wooden frame for it, both purchased on Amazon, and it's a really nice piece of art that I didn't pay very much for.", "overall": 5.0, "summary": "SO cute.", "unixReviewTime": 1372118400, "reviewTime": "06 25, 2013"}
{"reviewerID": "A3NXOCXORJNJ52", "asin": "0587234792", "reviewerName": "Larry Mcnutt", "helpful": [0, 0], "reviewText": "Nice piece.  Turn of the century photo of Cape Arago lighthouse being built.  Looks the same as it does today, so if you've been to Coos Bay, you'll recognize it. Good quality canvas.", "overall": 5.0, "summary": "Turn of the century Coos Bay", "unixReviewTime": 1292112000, "reviewTime": "12 12, 2010"}
{"reviewerID": "A1YW4ZXEIEEROG", "asin": "0594006112", "reviewerName": "Ned W. Nichols", "helpful": [0, 0], "reviewText": "The kids received an Elf On The Shelf for Christmas; and this is the perfect compliment for a mid-year reminder.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1371340800, "reviewTime": "06 16, 2013"}
{"reviewerID": "A1JXX17HZR7754", "asin": "0594519624", "reviewerName": "Suburban Mom", "helpful": [0, 0], "reviewText": "My little girl loves this blanket. She took it to a sleepover as her &#34;special blanket&#34; and said it was very soft and warm. It's cute, and for the price it was just right.", "overall": 4.0, "summary": "Bought for child", "unixReviewTime": 1388880000, "reviewTime": "01 5, 2014"}
{"reviewerID": "A1KF4W3IBDDN0C", "asin": "061533301X", "reviewerName": "Amazon Customer", "helpful": [0, 1], "reviewText": "I enjoy reading about dive trips and advanced diving. These were great stories that educated me. If you want to read something that will educate you on diving but not bore you with facts and figures try this book.", "overall": 4.0, "summary": "Fun Read", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
{"reviewerID": "AIIH6T9TA13O7", "asin": "061533301X", "reviewerName": "Arlene Rudy", "helpful": [3, 4], "reviewText": "I thoroughly enjoyed reading this book; it is well written and hard to put down.The book is a compilation of short stories, vignettes and even limericks sure to capture the imagination of divers and non-divers alike. The reader benefits from the writers access to over 35 years of contributions from the diving community all over the world.This is a great \"arm chair traveler\" book for anyone on your gift list, but first sit down and treat yourself to this wonderful and delightful book of scuba diving tales. I very much look forward to the next book..............!", "overall": 5.0, "summary": "True and exciting underwater diving tales.....", "unixReviewTime": 1291334400, "reviewTime": "12 3, 2010"}
{"reviewerID": "A29PHIUMRLJGPR", "asin": "061533301X", "reviewerName": "burksy", "helpful": [1, 1], "reviewText": "I am sure this book was assembled the best that could be done. Its just that it is only a collection of short articles that are random in subject matter and timeline. Some of them are not that interesting. I liked maybe ten percent a lot. Undercurrent seems to think they really have something here, but it probably should have only been posted on their website.", "overall": 3.0, "summary": "Very disorganized.", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
{"reviewerID": "A2QAFS5FYWY5B6", "asin": "061533301X", "reviewerName": "Carla Pollard", "helpful": [2, 3], "reviewText": "I couldn't disagree more with the first reviewer.  I sometimes wonder why people think it's necessary to make such unkind and disparaging remarks.I know nothing about diving, nor have I ever participated; and I never subscribed to the magazine.  So I found the compilation of articles positively mesmerizing; this book was a real page-turner for me.  It's easy to read; the quality of writing is top-notch.  To have so many enthralling stories in one place is a jewel.  Captivating, funny, sad, scary, riveting and informative.  I am in full support of, and will be looking forward to, the second book.", "overall": 5.0, "summary": "Fascinating collection of stories/articles", "unixReviewTime": 1282348800, "reviewTime": "08 21, 2010"}
{"reviewerID": "A1SEQSKV6RSUFZ", "asin": "061533301X", "reviewerName": "Old Diver", "helpful": [1, 4], "reviewText": "I was most disappointed in this highly touted (by Ben Davison, et al), supposedly humorous anecdotal collection of diving experiences.  Instead, it was a rehash of articles written in the clinical, unfunny style of the originals.  I did not need another primer on the hazards of getting bent, or the psychology of why we dive.  The articles, by and large, were written in quite a humorless, clinical style, reminiscent of the DAN publication \"Alert Diver\", which I expect to be clinical and fraught with medical terminology (although the latest iteration of this publication is a significant improvement).  I've gone over \"Cockroach\" several times looking for the wild humor and crazy anecdotes hyped for it, but could find none.  Shame on Ben D., et al!", "overall": 2.0, "summary": "Rehash of Undercurrent Articles", "unixReviewTime": 1282089600, "reviewTime": "08 18, 2010"}
{"reviewerID": "A3AO72YEJ1FE23", "asin": "0615391206", "reviewerName": "Allison \"Alli\"", "helpful": [0, 0], "reviewText": "I've only tried on recipe but these pops take some time, exact measurements and lots of love. Mine didn't freeze right away, even though I left the base in the freezer for 24 hrs. I poured the mix and had to put back in freezer for a little bit. Be prepared to use exact measurements and don't sub out ingredients.", "overall": 5.0, "summary": "great book with beautiful pictures!", "unixReviewTime": 1401926400, "reviewTime": "06 5, 2014"}
{"reviewerID": "A1IYLZ10Q7ZWDD", "asin": "0615391206", "reviewerName": "Andrea Hale", "helpful": [0, 0], "reviewText": "I got this for my 10 year old who loves making healthy pops. We had to modify recipes a bit as we do not eat dairy, but its still a great book with many ideas and choices.", "overall": 4.0, "summary": "Good creative book", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"}
{"reviewerID": "AO6AKW7LEAC0U", "asin": "0615391206", "reviewerName": "anjolwhud \"If I can read it I do\"", "helpful": [0, 0], "reviewText": "The pages wipe off easy and it has a lot of yummy ideas really fun to enjoy. I recommend this to anyone", "overall": 4.0, "summary": "Tasty", "unixReviewTime": 1377302400, "reviewTime": "08 24, 2013"}
{"reviewerID": "AZ0S39X9YOLXE", "asin": "0615391206", "reviewerName": "Anna Daskopoulou", "helpful": [0, 0], "reviewText": "It has a lot of recipes but because my daughter has multiple allergies,I was expectinig it to have more fruit options with not dairy ingredients!", "overall": 4.0, "summary": "Good!", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"}
{"reviewerID": "A372SLLYLUYOQB", "asin": "0615391206", "reviewerName": "Brennan Stein", "helpful": [10, 11], "reviewText": "I have made about 4 recipes from the book so far.  They work if you follow the measurements precisely!  Also, as with any recipe book, I make notes after making the recipe to adjust for our personal tastes.  Like the Mint Chip Pop - the peppermint extract measurement was too much - it tasted almost like mouth wash.  The ideas are all very nice and the pictures are beautiful to look at!", "overall": 4.0, "summary": "yummy pops", "unixReviewTime": 1310688000, "reviewTime": "07 15, 2011"}
{"reviewerID": "A388T8QB30Y6U1", "asin": "0615391206", "reviewerName": "Britches'Stiches", "helpful": [6, 9], "reviewText": "Making such small pops requires precise measurements, while you can be creative and make your own, it's good to have a base measurement or recipe to start from. I like the recipes in this book and the tips take the guesswork out of making bad pops. I deviate from the recipes often, but glad I have them on hand to use as references and inspirations for what I actually have in the fridge. I love my Zoku! So does my toddler!", "overall": 5.0, "summary": "Need this for accurate measurements!", "unixReviewTime": 1323475200, "reviewTime": "12 10, 2011"}
{"reviewerID": "A3CRZWG4SAPQND", "asin": "0615391206", "reviewerName": "Carol B.", "helpful": [0, 0], "reviewText": "Very amazing zoku pop cookbook, just love it, very easy to follow.  Would recommend to anyone to make fun pops.", "overall": 5.0, "summary": "Zoku cookbook", "unixReviewTime": 1373500800, "reviewTime": "07 11, 2013"}
{"reviewerID": "A1PD5FDCS1J4F8", "asin": "0615391206", "reviewerName": "C. Lawson \"Chris in Virginia\"", "helpful": [0, 0], "reviewText": "I got this for my daughter-in-law for Christmas so that she could make stuff with my grandson so I am looking forward to hearing how it goes!  Recipes looked interesting!", "overall": 5.0, "summary": "Nice book!", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "AGBB5TC7F7PDV", "asin": "0615391206", "reviewerName": "CuteEverything", "helpful": [8, 10], "reviewText": "The Zoku Recipe Book starts with an introduction to their company and why they decided to make the Zoku Quick Pop Maker. They mention that \"the process of making ice pops at home hadn't changed since the first pop molds were invented back in the early 1900's\", even though almost every other technology had advanced significantly in that same amount of time. Zoku is an innovative company that was able to figure out how to make ice pops, not only quickly, but beautifully as well. Some of the stunning effects that can be achieved with the Zoku Quick Pop Maker include layers, marbling, angles, and waves. You can even add extras, like sprinkles, chocolate chips, cookie pieces, nuts, marshmallows and more. The pops can be made striped and cream filled, with fruit slices or chocolate covered and the Zoku Recipe Book tells all the details of how to create them.There are tips, tools and ingredients that work best in the Zoku Quick Pop Maker, all detailed in Zoku Recipe Book. Artificial sweeters (not enough sugar content) and melted ice cream (too soft when frozen) are a couple of the things that don't work well in the Zoku. The Fresh & Fruity chapter has sweet, fruit flavors, like Caramelized Banana Coconut, while the I Scream for Quick Pops section has milk based icy treats, Cookies and Cream, for instance. The Bake Shop area has bakery goodies transformed into frozen delights, my favorite is the Carrot Cake Pop, it even has a cream cheese frosting layer! And, of course, there's the ever popular Coco Loco area, I can't wait to make the Nutty Chocolate Pretzel flavor. I loved the clean, modern style of Zoku Recipe Book and I really enjoyed all the brightly colored and delicious pops!", "overall": 5.0, "summary": "Loved the look and the recipes!", "unixReviewTime": 1323648000, "reviewTime": "12 12, 2011"}
{"reviewerID": "A2TOLOXNDL6SKR", "asin": "0615391206", "reviewerName": "Doodles", "helpful": [0, 1], "reviewText": "The recipes in this book are kid friendly and parent acceptable for the most part.  It's possible to create pretty healthy popsicles with fresh fruit and other ingredients without too much sugar.", "overall": 5.0, "summary": "Kids recipes that a", "unixReviewTime": 1359676800, "reviewTime": "02 1, 2013"}
{"reviewerID": "A1SMVFN1Y9DZXW", "asin": "0615391206", "reviewerName": "Drydius", "helpful": [30, 33], "reviewText": "Really, it's impossible to live without this book anymore. If you bought a ZOKU, YOU NEED to have this book. It is complete, detailled, well explained. Everything is inside from all the techniques to all the great idea for making your own pops. BOTTOM LINE: Absolutely no pops in this book can freeze in 7 minutes. you have to wait AT LEAST 20 minutes for the creamy pops. The trick that we found playing with the ZOKU is to keep it in the freezer while the pops freeze. It helps a lot and work well.", "overall": 5.0, "summary": "a MUST if you own the ZOKU", "unixReviewTime": 1330992000, "reviewTime": "03 6, 2012"}
{"reviewerID": "A6DRPOE6Y6FV3", "asin": "0615391206", "reviewerName": "Eileen", "helpful": [3, 5], "reviewText": "The recipes were good, but had too many ingredients sometimes for me to make.  It was very hellpful in showing what would freeze well in the popsicle maker.  I would highly recommend it as it has the directions on how to remove the popsicles from the maker with the tool that comes with the maker.  Without it I would have not have had the directions to remove the popsicles as the freezer pack seemed not to have enough directions to use properly.", "overall": 4.0, "summary": "Zoku Quick Pops Recipe Book", "unixReviewTime": 1354838400, "reviewTime": "12 7, 2012"}
{"reviewerID": "A31YO7MJDBHHFD", "asin": "0615391206", "reviewerName": "J. Meckley", "helpful": [1, 2], "reviewText": "I loved having the book for more tastes and ideas..gets your mind thinking to also help create your own. Definitely was worth it to me! Great ideas and yummy recipes!", "overall": 5.0, "summary": "Definately worth having!", "unixReviewTime": 1320969600, "reviewTime": "11 11, 2011"}
{"reviewerID": "A31Q287KOFF0QZ", "asin": "0615391206", "reviewerName": "KayKay", "helpful": [0, 3], "reviewText": "These Popsicles look awesome. I have not tried any yet, but can't wait to, especially now that spring is here.", "overall": 4.0, "summary": "Like it", "unixReviewTime": 1366588800, "reviewTime": "04 22, 2013"}
{"reviewerID": "A4NTXABSJVIZ4", "asin": "0615391206", "reviewerName": "Kelly Calame", "helpful": [0, 0], "reviewText": "Have made a recipe out of it and they are delicious .  Like knowing what is going in my food rather than buying at the store and having to weed through the labels.....", "overall": 5.0, "summary": "Love this", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"}
{"reviewerID": "A1C86ZYUXDPQDB", "asin": "0615391206", "reviewerName": "Logan1", "helpful": [5, 5], "reviewText": "I got this as a gift fori wife. She recently got  Zoku Popsicle maker and we LOVE it. We have two kids and we can give them Popsicles that are actually good for them for a fracton of the cost of buying them at the store, and they are 100% natural ( no preservitaves). I would recommend this book and the Popsicle maker to anyone who has kids.", "overall": 5.0, "summary": "Great book", "unixReviewTime": 1339113600, "reviewTime": "06 8, 2012"}
{"reviewerID": "APYOBQE6M18AA", "asin": "0615391206", "reviewerName": "Martin Schwartz", "helpful": [0, 0], "reviewText": "My daughter wanted this book and the price on Amazon was the best.  She has already tried one recipe a day after receiving the book.  She seems happy with it.", "overall": 5.0, "summary": "Best Price", "unixReviewTime": 1382140800, "reviewTime": "10 19, 2013"}
{"reviewerID": "A229AW600QKCKR", "asin": "0615391206", "reviewerName": "Michael", "helpful": [0, 0], "reviewText": "Purchased to accompany the Duo Quick Pop Maker. Great guidelines for successful pop making, as well as lots of recipe ideas.", "overall": 5.0, "summary": "Great ideas for Zoku", "unixReviewTime": 1379894400, "reviewTime": "09 23, 2013"}
{"reviewerID": "A1JVQTAGHYOL7F", "asin": "0615391206", "reviewerName": "Michelle Dinh", "helpful": [0, 0], "reviewText": "I bought this zoku quick pop for my daughterr with her zoku quick maker. She loves it and have fun to make her own ice cream.", "overall": 5.0, "summary": "zoku", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}
{"reviewerID": "A2WR26H6Q2IVDF", "asin": "0615391206", "reviewerName": "MiMi", "helpful": [1, 2], "reviewText": "I really enjoyed having this recipe book for our Zuku frozen pop maker. There were not many recipes that were included in the manuel. The ones in the recipe book are awesome, can't wait to try more.", "overall": 5.0, "summary": "Great recipes for frozen pops", "unixReviewTime": 1345248000, "reviewTime": "08 18, 2012"}
{"reviewerID": "A3UPYGJKZ0XTU4", "asin": "0615391206", "reviewerName": "mirasreviews", "helpful": [26, 27], "reviewText": "There is no shortage of pop recipes available for free on the web, but I purchased the \"Zoku Quick Pops\" book, because Zoku has some good recipes for fruit pops on its blog. I was hoping there were more where those came from. This book emphasizes very sweet dessert pops, however. There are 41 recipes in total, only 13 of which are fruit pops. There is a \"Fresh and Fruity\" chapter, followed by three chapters of dessert pops entitled \"I Scream for Quick Pops!\", \"Bake Shop\", and  \"Coco Loco\". As you might guess from the last one, there are 15 pop recipes that contain chocolate.Chapters on \"Tips\" and \"Techniques\" are useful. There is more detailed information about ingredients that don't freeze well in the Zoku than is found in the instruction manual. The book lists options for dairy products and sweeteners, tells you how to do different types of layers, how to add decorative fruit slices, how to do a quick shell, and how to make core pops. The pages about core pops are especially helpful, as they include recipes for pink, purple, and orange outer layers for brightly-colored core pops. The book recommends using Zoku accessory kits, but you can do without.The pop recipes tend to go out of their way to be as sweet as possible. Many, including the recipe for a vanilla base, call for vanilla pudding, where vanilla Greek yogurt would do just as well. I've substituted it with no ill effect. On the bright side, many of these recipes may appeal to children, whereas most pop books that I have seen are geared more to adults. There are flavors like \"Cookie Dough\", \"That's a S'more\", chocolate peanut butter, and peanut butter and jelly. All 9 recipes in \"Bake Shop\" are inspired by cake and cookie recipes.As a resource for light, fresh-tasting fruit pop recipes, \"Zoku Quick Pops\" is very limited. Most of the fruit recipes are gimmicky and contain too many ingredients. The recipe for Lemonade pops contains orange juice, which is fine, but the addition of vanilla extract kills the fresh fruit flavor. The recipe for mango pops includes orange, apple, banana and lemon, which are too many competing flavors. Mango and orange together make a terrific pop. The book is great for chocolate lovers and those looking for dessert pop recipes. Tips and techniques are also useful. For fruit pop recipes, \"Top Pops\" by Emily Zaiden is far better.", "overall": 4.0, "summary": "Excels at Sweet Dessert Pops, but Falls Short on the Fruit Pops.", "unixReviewTime": 1367712000, "reviewTime": "05 5, 2013"}
{"reviewerID": "A2MHCTX43MIMDZ", "asin": "0615391206", "reviewerName": "M. Johnson \"Tea Lover\"", "helpful": [14, 18], "reviewText": "This book is a must have if you get a Zoku (which I also highly recommend). There is a large variety of recipes from simple, to fancy. The flavor combos are creative, and it gives you ideas for decorating the pops too. They turn out as beautiful as they are tasty. After reading it you will be inspired to create your own recipes too.", "overall": 5.0, "summary": "Creative Combos", "unixReviewTime": 1312416000, "reviewTime": "08 4, 2011"}
{"reviewerID": "A2HI31BVVZ9HEG", "asin": "0615391206", "reviewerName": "P. SORIANO \"tunadragon\"", "helpful": [4, 4], "reviewText": "This book is not absolutely necessary for creating interesting and tasty popsicles, but it does provide inspiration. It makes an excellent companion gift to the pop maker.", "overall": 4.0, "summary": "Cool ideas...", "unixReviewTime": 1314403200, "reviewTime": "08 27, 2011"}
{"reviewerID": "AHAI85T5C2DH3", "asin": "0615391206", "reviewerName": "PugLover", "helpful": [0, 0], "reviewText": "This cookbook is great.  I have really enjoyed reviewing all of the recipes.  Sure - some are more difficult than others, but there is a nice variety in this book.  For me it was totally worth it just to get the quick shell recipes alone.  We have only tried the chocolate so far, but it is so tasty.  A few of my favorite recipes in this book are the banana from the strawberry banana one, and the raspberry/blackberry ones (but I used mixed berries).  Also, it has great instructions for tips on using the Zoku.  Definitely recommended.", "overall": 4.0, "summary": "A must own if you own the Zoku maker...", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
{"reviewerID": "AIH4A40STEAE0", "asin": "0615391206", "reviewerName": "Ray T. Vanderpool", "helpful": [0, 0], "reviewText": "My granddaughter and I had fun making Ice Cream and pop sticks. We go very creative and she loves doing things with here grandpa", "overall": 5.0, "summary": "Fun to do", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
{"reviewerID": "A2I7P754OS8VT0", "asin": "0615391206", "reviewerName": "Rita M. Roberts", "helpful": [0, 1], "reviewText": "I did not realize that recipes needed so many ingredients to make Popsicles.  I am still undecided about this item so I will give ok rating", "overall": 3.0, "summary": "Recipes should be easier.", "unixReviewTime": 1377820800, "reviewTime": "08 30, 2013"}
{"reviewerID": "A30DK18BD9IRGM", "asin": "0615391206", "reviewerName": "RJ", "helpful": [24, 24], "reviewText": "My first thought was that I don't need a cookbook to tell me how to make pudding.  However, after making several batches of pops I now realize the cookbook is worth it.  Had I just dumped pudding in the pop maker I would have been very disappointed with the results. Additionally, it has some very interesting recipes that I wouldn't have thought of on my own.", "overall": 4.0, "summary": "Worth it.", "unixReviewTime": 1313280000, "reviewTime": "08 14, 2011"}
{"reviewerID": "A99HD6A9LPKZY", "asin": "0615391206", "reviewerName": "R. Maschek", "helpful": [8, 8], "reviewText": "Though you don't have to buy the Quick Pops book to make great ZOKUs, you'll find some of the best-tasting frozen recipes in this book.  Since they were tested out specifically for the ZOKU Quck Pop Maker, I've had no trouble with over or under frozen pops.  The Key Lime Pie and Marble Cheesecake are creamy and full of flavor.  After making a few of the recipes, you will want to try combining various recipes to come up with your own favorites.  I plan on making a strawberry swirl cheesecake pop using parts of two recipes from the book.There are plenty of recipes that you can search for on the Web, so you don't have to buy this book, but it has been worth every penny to me.  So much fun, so much flavor.  And by the way, if you have any difficulty with your ZOKU maker, their customer service is very helpful.", "overall": 5.0, "summary": "Frozen heaven on a stick", "unixReviewTime": 1330473600, "reviewTime": "02 29, 2012"}
{"reviewerID": "AXA9EVY6IJIZ5", "asin": "0615391206", "reviewerName": "Robin Cline \"Solarobby\"", "helpful": [0, 0], "reviewText": "If you have a Zoku Quick Pop maker (or two....I have the original one-slot and then I bought the double-slot here at Amazon), I recommend you get this creative little book, which will inspire you.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
{"reviewerID": "A1SW2D234X11MS", "asin": "0615391206", "reviewerName": "savinggrace \"savinggrace\"", "helpful": [2, 3], "reviewText": "This book is so beautifully illustrated and easy to follow. It helps you to understand the Zoku better. It might have been even better if they made the recipe units for different sized molds. These recipes produce too much for a single mold unit. It would have been nice if they used a matrix for the ingredients like on a box of rice. I am just math lazy and bought a single mold Zoku. Dividing 3/4 of a cup, 3 tablespoons or 3 1/2 tablespoons is kind of dicey in my kitchen.", "overall": 5.0, "summary": "Beautifully illustrated recipe and instruction book for Zoku pops", "unixReviewTime": 1341187200, "reviewTime": "07 2, 2012"}
{"reviewerID": "A1ZH5ULI4SBO48", "asin": "0615391206", "reviewerName": "S. G. \"s.g.\"", "helpful": [32, 39], "reviewText": "I bought this when I bought the pop maker. I think the recipes are fine, but there really isn't much in the book I wouldn't have figured out myself.A couple of good creamy recipes that are now available for free on recipe websites. As for \"pop embellishing\" well, that wasn't too hard to figure out, either. I'd save the money and spend it instead on extra pop sticks, which seem to disappear the way socks do....", "overall": 2.0, "summary": "Okay but you can figure it out yourself without the book", "unixReviewTime": 1323302400, "reviewTime": "12 8, 2011"}
{"reviewerID": "A37TC6Y9ND20QK", "asin": "0615391206", "reviewerName": "S. P.", "helpful": [0, 0], "reviewText": "There are some really good recipes in here.  This is definitely a must have for current or future Zoku owners.", "overall": 5.0, "summary": "Yum!", "unixReviewTime": 1385078400, "reviewTime": "11 22, 2013"}
{"reviewerID": "A1V13XAWO98C1J", "asin": "0615391206", "reviewerName": "Stan \"Stan\"", "helpful": [13, 13], "reviewText": "The Zoku accessories are pricey, but the recipes have the exact amount you need to make the pops.  I have made it through 15 varieties so far, and I like them all.", "overall": 5.0, "summary": "If you have the Zoku maker, buy this!", "unixReviewTime": 1316649600, "reviewTime": "09 22, 2011"}
{"reviewerID": "A3842PXNQ1QRM9", "asin": "0615391206", "reviewerName": "Stephen Brem", "helpful": [0, 0], "reviewText": "High quality book. Clear and helpful information, and then some superb recipe suggestions clearly outlined. I can highly recommend this product.", "overall": 5.0, "summary": "Satisfaction opinion", "unixReviewTime": 1401580800, "reviewTime": "06 1, 2014"}
{"reviewerID": "A2BVT5QJSEEQI8", "asin": "0615391206", "reviewerName": "Steven Griffis", "helpful": [3, 3], "reviewText": "The recipes in this books are tedious to make. I found that easier and simpler recipes can be found online. I had no problem with the recipes online working in the Zoku maker.", "overall": 4.0, "summary": "I liked this book, but........", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
