{"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143502", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This has some great tips as always and is helping me to complete my Good Eats collection.  I haven't tried any of the recipes yet, but I will soon.  Sometimes it's just lovely to let Alton entertain us.", "overall": 5.0, "summary": "Alton... nough said", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "A3R5OBKS7OM2IR", "asin": "0000143529", "reviewerName": "Rebecca L. Johnson", "helpful": [0, 0], "reviewText": "This is a great pastry guide.  I love how Alton's collections can break it down so baking isn't so mystical and scary.  I might even try some of these recipes some day.", "overall": 5.0, "summary": "Ah Alton...", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "AH3QC2PC1VTGP", "asin": "0000143561", "reviewerName": "Great Home Cook", "helpful": [2, 4], "reviewText": "I have to admit that I am a fan of Giada's cooking and I had great expectations when I ordered this set. They were however, crushed. While I still love Giada's cooking, this set is just a way for Food Network to make money. They really cheated with these DVD's. All they have are the video from the show, no text recipes, no link to the on line shows and no computer support. They play in Windows media player but the set does not contain the recipes. You can get more by taping the shows and then going to the web to download recipes. Another disappointment is the so so transfer quality to DVD. Perhaps I've been spoiled by HD and Tivo but the older shows I've recorded have had better playback quality than the episodes on the DVD's. It is in the old 480p but the quality of the transfer to DVD is dark and about the same quality as your average old VHS tape, not DVD quality. I get the impression Food Network got cheap and subbed out the DVD transfer to the lowest bidder (China?) and it shows.I could watch Giada read the dictionary and her cooking is really first rate. But, that's all you get is watching Giada. Thank god she is easy to understand and her recipes are easy to follow. But to get consistent results on some of the dishes, you should search the web and find the hard copies.  While Giada herself is great, this set is a waste of money. You're better off recording the shows and going to the web to get the recipes you want or, better yet, just stick with her cookbooks which are all first rate and worlds above this cheap presentation.", "overall": 2.0, "summary": "Don't waste your money", "unixReviewTime": 1216252800, "reviewTime": "07 17, 2008"}
{"reviewerID": "A3LKP6WPMP9UKX", "asin": "0000143588", "reviewerName": "Anna V. Carroll", "helpful": [9, 9], "reviewText": "I bought these two volumes new and spent over $50 doing so.  You get two DVDs with three discs in each. Why would I buy DVDs if I have the cookbooks? I find watching Ina Garten cook in her kitchen very relaxing after a hectic day.  SHE is doing the cooking, not me.  SHE is having to clean up, not me.  Of course we all know she has a team to do all the prep work and clean up, but we can pretend, can't we? Lots of her earlier episodes with lots of food and friends. Lemon cakes, shrimp dishes, brownies, salads, entrees. I recently made her Szechuan Noodles and the first bowl cost me $40! That's 'cause I didn't have any of the ingredients you need to make it! But once you splurge on all the condiments, you're home free.  I have eaten Szechuan Noodles all week! I can't get enough of her recipe. Hot, cold, warm. They are SO good! That recipe is on the DVD as well. She isn't cutesy like a lot of the Food Network people.  I really dislike that.  Cute doesn't work for me.  I want someone with substance who knows what she's doing. Ina Garten is that gal. You can buy them new, like I did, or used.  Just get them both! You will find yourself in your kitchen at odd hours of the night cooking something! They're addictive. Hope she comes out with Volumes 3, 4 and on.", "overall": 5.0, "summary": "VOLUME 1 & VOLUME 2-BETTER THAN THERAPY", "unixReviewTime": 1236902400, "reviewTime": "03 13, 2009"}
{"reviewerID": "AVIY68KEPQ5ZD", "asin": "0000143588", "reviewerName": "Rebecca Millington", "helpful": [1, 4], "reviewText": "I am very pleased with the dvd only wish i could get the only volume but unfortunately it cannot be shipped to australia.", "overall": 5.0, "summary": "Barefoot Contesst Vol 2", "unixReviewTime": 1232236800, "reviewTime": "01 18, 2009"}
{"reviewerID": "A1CV1WROP5KTTW", "asin": "0000589012", "reviewerName": "Alberta M. Worth \"BertieMWorth\"", "helpful": [2, 2], "reviewText": "I have read many books and literature written on addiction and recovery, and the ones I find the most informative and helpful to those seeking knowledge and understanding are the ones written from individuals who have been there themselves. The school of hard knocks is I believe to be the best education and insights into how and what an addict thinks and acts comes from those who have been there from traditional education. I believe Joe Herzank's personal knowledge and insights. I recommend this DVD to anyone struggling with addiction. Thank God for those like Joe Herzank.", "overall": 5.0, "summary": "\"Why Don't They Just Qiut\" DVD Roundtable Discussion", "unixReviewTime": 1309651200, "reviewTime": "07 3, 2011"}
{"reviewerID": "AP57WZ2X4G0AA", "asin": "0000589012", "reviewerName": "Amy Arnett-German", "helpful": [0, 1], "reviewText": "The information is good, but the presentation is very dry.  I fast-forwarded through a lot of it and wouldn't use it to show to a group as I had intended.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1366675200, "reviewTime": "04 23, 2013"}
{"reviewerID": "A3NMBJ2LCRCATT", "asin": "0000589012", "reviewerName": "Carole J. Hopkins", "helpful": [1, 1], "reviewText": "I have read the original Why Don't They Just Quit and have reviewed the DVD roundtable. I appreciate the talk being so frank and uncomplicated for anyone who is just beginning the &#34;Addiction walk&#34; most specifically as a heartbroken family member. This is a difficult time for everyone. Even if the entire book/DVD doesn't address all of the readers/viewers needs it is well worth the financial investment to buy this product. I was so impressed with its contents, I contributed my own money to the Herzaneks so extra books could be purchased and distributed to those who couldn't afford them.  Heartbroken Gramma Carole", "overall": 5.0, "summary": "Very helpful", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "A5Y15SAOMX6XA", "asin": "0000589012", "reviewerName": "Catherine E. Wetzler", "helpful": [12, 16], "reviewText": "I, too, purchased this to use with my patients in early recovery, an ethnically mixed urban/suburban population who complain that their families, friends,s.o.'s \"don't get it\".  If you are purchasing this to INFORM for the first time about substance abuse and why it is difficult to \"just quit\", please choose another way.  This is overly long, meanders, imparts very little useful information, and lacks energy (I'm a therapist and it put ME to sleep). I don't think it would find a connection with an audience that is hungry for \"ah-hah\" moments and some insights into their loved one's problem.  It is basically four people (all middle aged Caucasians) sitting in a darkened room around a table asking each other what they think about a range of topics.  It could have been great--personal stories, professional insights, some science, etc., but kind of comes across as a sleepy, low budget afternoon interview show.  I will keep looking.", "overall": 2.0, "summary": "C+ At Best", "unixReviewTime": 1307404800, "reviewTime": "06 7, 2011"}
{"reviewerID": "A3P671HJ32TCSF", "asin": "0000589012", "reviewerName": "Diane Buxton", "helpful": [1, 1], "reviewText": ":Why Don't They Just Quit&#34; is a must see for those who have loved ones suffering from the disease of Addiction. Joe answers questions for us that are on this journey of being educated about this terrible disease. We show this DVD at our support group meetings on an ongoing basis.", "overall": 5.0, "summary": "A Must See", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"}
{"reviewerID": "A3VCKTRD24BG7K", "asin": "0000589012", "reviewerName": "Eric M. Bell \"Deacon\"", "helpful": [1, 1], "reviewText": "I really enjoy watching this dvd series about drug addictions. I am intrigued as to why people feel that they need to get high and risk healh, relationship, finaces, etc", "overall": 5.0, "summary": "Great DVD", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
{"reviewerID": "ANF0AGIV0JCH2", "asin": "0000589012", "reviewerName": "GrammaCarole", "helpful": [13, 13], "reviewText": "My 18 year old grandson has been addicted to drugs and running amok for the past 4 years. The heartaches are huge. I feel it was divine guidance for me to \"happen upon\" Joe's book and Video discussion of Why Don't They Just Quit?  The book and discussion was not only informative but so filled with hope that eventually anyone can quit if that is the choice they make. I gave the book to my grandson and he was inspired by the book. It brought comfort to me, Adam's Mom and others in the family who are struggling. It isn't over yet so this book provides us with a good roadmap from others who have travelled this road and have struggled with this issue before us.", "overall": 5.0, "summary": "Most Helpful Input I've received for my family", "unixReviewTime": 1308182400, "reviewTime": "06 16, 2011"}
{"reviewerID": "A3LDEBLV6MVUBE", "asin": "0000589012", "reviewerName": "Jami Hyde \"Jami\"", "helpful": [10, 11], "reviewText": "The best book ever to help addicts and their friends and families. It really can help you understand the insanity of it all.  Addiction maybe one of the hardest things to wrap your mind around.  This book helps in so many ways to clear up fact from fiction!!", "overall": 5.0, "summary": "Why don't They Just Quit", "unixReviewTime": 1208995200, "reviewTime": "04 24, 2008"}
{"reviewerID": "A1R2XZWQ6NM5M1", "asin": "0000589012", "reviewerName": "Janis G. Parker", "helpful": [3, 4], "reviewText": "Mr. Herzanek imparts heartfelt experience and knowledge in this DVD which brings strength, courage and hope in a straight forward, easy to understand manner to anyone caught in the painful web of addiction, whether it be the addict or the addict's loved one. Who better to listen to, then one who has lived through addiction to find a healthy, sane and satisfying life in continued recovery?  I contribute much of my son's recovery and my healing to Mr. Herzanek's efforts to help those of us who are desperately in need of answers and understanding with tried and true methods of overcoming this insidious disease and beginning on a rewarding road to recovery.", "overall": 5.0, "summary": "Extremely Useful Tool", "unixReviewTime": 1224979200, "reviewTime": "10 26, 2008"}
{"reviewerID": "A36L1XGA5AQIJY", "asin": "0000589012", "reviewerName": "Jonathan Ballard \"Beauty Expert\"", "helpful": [0, 1], "reviewText": "Don't waste your money. This is a short DVD and the host is boring and offers information that is common sense to any idiot. Pass on this and buy something else. Very generic", "overall": 1.0, "summary": "Don't Waste Your Money", "unixReviewTime": 1393113600, "reviewTime": "02 23, 2014"}
{"reviewerID": "A2HWI21H23GDS4", "asin": "0000589012", "reviewerName": "Jude R. Montarsi", "helpful": [1, 1], "reviewText": "The film contains a set of roundtable discussions with various people in the field of addiction, some of whom are former alcoholics/addicts. It's a good introduction for people who have a loved one who suffers from an addiction disorder.", "overall": 4.0, "summary": "Very good set of discussions", "unixReviewTime": 1338681600, "reviewTime": "06 3, 2012"}
{"reviewerID": "A1DNYFL3RSXRMO", "asin": "0000589012", "reviewerName": "Judy Herzanek \". . . a Colorado Mom\"", "helpful": [10, 12], "reviewText": "", "overall": 5.0, "summary": "90 Minute DVD offers hope to families and friends", "unixReviewTime": 1208908800, "reviewTime": "04 23, 2008"}
{"reviewerID": "A39VF226GBM1JH", "asin": "0000589012", "reviewerName": "Kathleen M. Gomes", "helpful": [8, 19], "reviewText": "I purchased this DVD with the plan that it might be useful with families of individuals in treatment. Well, it is all talk, and so shallow as to be not useful at all with this population. I am not sure what I would use it for at all. Don't waste your money.", "overall": 1.0, "summary": "If you are a professional, don't bother!", "unixReviewTime": 1218412800, "reviewTime": "08 11, 2008"}
{"reviewerID": "ASB0E2O2FLNA7", "asin": "0000589012", "reviewerName": "Kindle Customer jmn", "helpful": [2, 2], "reviewText": "Book Review: Joe Herzanek,\"Why Don't They Just Quit\"?\"Addicts and Alcoholic's aren't crazy and they can quit.\" Joe HerzanekAs the single mother of a heroin addict, I believed addiction was a complex and confusing conundrum.  Being a control freak, I struggled to understand even the delicate changes occurring in my son.  I spent hours, days, months researching addiction, recovery and relapse, hoping to find the magic cure.  And then I was handed, \"Why Don't They Just Quit\", the award winning self-help book written by Joe and Judy Herzanek.Joe writes a powerful and honest account of his own struggle with addiction and subsequent successful recovery, thirty years strong.  He provides valuable and often misunderstood insights from the addict's point of view, offering amazingly simple reasons for why the addict does not quit.\"Consequences became a reason for using, not a deterrent\" Joe explains as he explores reasons addicts just don't quit.  Drugs dull the senses, numb the pain and fade the situations, allowing the addict an escape from their problems. \"People use drugs to increase pleasure and decrease pain,\" writes  Joe.\"Families and friends always try to help the addict see the problem. It doesn't happen over night. They do not see the problem as it unfolds; this person typically is in denial. They will typically put this off rather than confront.\" Joe HerzanekDespite mounting pressures, whether financial, social, legal or emotional, the addict cannot see the problem for what it has become; rather the mounting pressures become the reason to continue using, in order to NOT deal with them. It seems so obvious when Joe describes the stress and the inability to deal with it that creates the vicious cycle I helplessly watched my son spiral through.Joe recounts personal failures and near tragic family circumstances as a result of addictions, but also provides a road map of sorts to navigate through the cause and progression of addiction, the treatment options as well as common sense answers to not so simple questions.In \"Why Don't They Just Quit\" Joe aptly dispels the myth of hitting rock bottom:\"This whole idea of \"hitting bottom\" is out of date. Some people with wait years-even decades- for their friends to reach thus mythical point in their alcohol and drug use. But why wait for them to \"hit bottom\"? Why not help them by raising their bottom? There are ways to encourage someone to reach their bottom much earlier. In doing so. We can avoid a lot of unnecessary pain and heartache- and maybe even save their life. For some people, hitting bottom will be six feet underground\". Joe HerzanekAs I struggled to `tough love' it with my son, I never thought of it as raising his bottom. I only looked at as a way to preserve my sanity, and then only after I attempted to help my son, which really meant enabling the behavior to continue.\"So does everyone have to hit rock bottom? I would say no. Tough love can prevent a substance abuser from prolonging their usage. There are loving ways to refuse to rescue someone that in the long run will help them to choose recovery.\"Loving means doing the right thing to help.\" Joe HerzanekJoe leaves no stone unturned when it comes to addiction and its far-reaching consequences. Addiction affects the entire family, from spouses, to parents, to siblings.Full of useful quotes and quips from both famous and not so famous, as well as personal adages from his family and friends, Joe Herzanek takes a very messy, complex and taboo subject, and twists it into a story of hope, courage and healing \"Quitting is a moment in time. It is not recovery\" Joe warns the reader.  He provides treatment options and despite being a chaplain, he tempers his own faith with the 12-step `higher power\".\"The last thing I want to do in this section is to get too preachy. Spiritual growth is very personal. What I am saying is that spirituality is a big part of recovery and is too important to ignore.\" Joe HerzanekI highly recommend this read to any person living with or loving an addict. A toolbox of helpful insights, answers to seemingly impossible questions, and road map through the struggles of addiction; this book is the ultimate idiots guide to addiction, recovery and relapse, and a must to all struggling in this realm.", "overall": 5.0, "summary": "Why Don't THEY Just Quit?", "unixReviewTime": 1322956800, "reviewTime": "12 4, 2011"}
{"reviewerID": "A19E15Y9V09CVJ", "asin": "0000589012", "reviewerName": "Mari L. Nelson", "helpful": [7, 9], "reviewText": "I recently purchased the DVD and book on \"Why Don't They Just Quit\" by Joe Herzanek.  Having a son with a severe alcohol/drug abuse problem, who has been through more than one treatment program, I was desperately looking for answers, not hype or glitter. I found the \"roundtable\" format on the DVD to be easy to follow. I consider \"Why Don't They Just Quit\" to be my \"Bible\" on drug abuse issues affecting the addict and the families. Mr. Herzanek lays it out in a straightforward way, using his and other's personal experiences to clarify the how and why of addiction and recovery.  This is a must have tool for anyone that is impacted by a loved one's addiction.", "overall": 5.0, "summary": "A Must Have Tool", "unixReviewTime": 1224806400, "reviewTime": "10 24, 2008"}
{"reviewerID": "A3K979KQ7K0S5K", "asin": "0000589012", "reviewerName": "Michael Z www.TheWisdomoftheRooms.com", "helpful": [3, 4], "reviewText": "If you've ever wondered why a loved one or friend continues to destroy their lives (and/or others), and wished you knew what you can and cannot do, then watch this video over and over again - the answers are there if you're willing to hear them.  Joe, and the round table members, do an excellent job at tackling the tough questions - and answers - on addiction.  You'll get no dramatic enhancements here, just straight questions and REAL answers on what addiction is, why people don't stop, and what you can do to help them.  There are many books, TV programs, and videos out there, but none that match the straightforward truth you'll find here. If you need help, then watch this video with your family - and then follow its suggestions.  You'll be happy you did.", "overall": 5.0, "summary": "At last, the REAL answers on Addiction", "unixReviewTime": 1251158400, "reviewTime": "08 25, 2009"}
{"reviewerID": "A39ZX6X5H2N4TS", "asin": "0000589012", "reviewerName": "Mom of Two", "helpful": [8, 8], "reviewText": "Through this outstanding book and accompanying dvd, our family was able to begin the healing process and move away from he horrors of living with an addict among us.  The video discussions were meant to be catalysts, we felt, catalysts toward the process of opening a dialogue within our family, and our minds individually.  When one family member falls ill from the disease of addiction, everything is seen through a shattered mirror from everyone.  Joe Herzanek's exceptional book, his wisdom, and plethora of real life experiences were, for us, such a positive resource, along with the dvd roundtable discussions --- active and accurate learning tools and examples of the whats and how tos that parents and siblings need.  His advice put us on the path to really help our son.  Dealing with and recognizing the fact that one has this disease is a slow, and evolving process that calls for intense work, introspection, commitment, and more.  It also requires that a family make a paradigm shift away from accusations to the addict and past unworkable behaviors, toward taking baby steps to forgiveness, a return to love, health and focus on one day at a time.  We found it to be an invaluable reference, and have gone back to visit it many times.  Keeping an open mind is vital to dealing with addiction. Reading, learning, listening, discovering, all are a part of the process. And, there is a need for a sense of reality and the inherent value of the Twelve Step Program for parents and siblings as well.", "overall": 5.0, "summary": "Food for Thought and Action:What Can Change Our Lives", "unixReviewTime": 1308182400, "reviewTime": "06 16, 2011"}
{"reviewerID": "A2Z3ZHQI6YXKHH", "asin": "0000589012", "reviewerName": "Nancy Kinney", "helpful": [2, 2], "reviewText": "Our church's addictions ministry is using this DVD for training and at their support group sessions. Highly recommended for personal or professional use.", "overall": 5.0, "summary": "Good Resource DVD", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
{"reviewerID": "A2RNKU9KJHQ2BV", "asin": "0000589012", "reviewerName": "Nancy Price (flags@pld.com)", "helpful": [2, 2], "reviewText": "Excellent discussion of alcohol and the recovery process.  I would highly recommend this video to treatment centers and the aftercare programs.  It is a bit long for classroom settings, but could be broken into different sessions to showing to the younger students.  I highly recommend this video for the information presented", "overall": 5.0, "summary": "Why don't they just quit", "unixReviewTime": 1363219200, "reviewTime": "03 14, 2013"}
{"reviewerID": "A30WLYNJA3B17H", "asin": "0000589012", "reviewerName": "Ned Wicker", "helpful": [8, 11], "reviewText": "There is a tug-of-war going on in the recovery community between those with academic letters behind their names and those who have walked through the tunnel of addiction. For example there are those who believe AA is a positive road to walk on, while others scorn AA for any number of reasons. Joe Herzanek writes and talks about addiction with a warmth and depth of understanding that so many others lack. \"Why Don't They Just Quit\" is superbly written, a straight-talking, no frills guide for people to follow. It's a great resource. Herzanek has walked through the tunnel of addiction and can relate to those who struggle. He understands families and what they go through. The book and DVD make a human connection, beyond the facts of addiction.", "overall": 5.0, "summary": "Human Connection and Compassion", "unixReviewTime": 1224720000, "reviewTime": "10 23, 2008"}
{"reviewerID": "A3LI15T4YR5WD6", "asin": "0000589012", "reviewerName": "R. Burgie", "helpful": [1, 3], "reviewText": "Why Don't They Just QUIT? DVD Roundtable Discussion: What families and friends need to know about addiction and recovery.This DVD, along with the book, are about the only tools available to us loved ones on the outside, who want to help a substance abuser begin the spiritual journey to healing, peace, and rest.  It is perfect to start one's own education about this insidious disease, and then to share it with the rest of the family and friends, who may not have the time to read a new book, but will take a few hours to watch a DVD.  That open door is all it will take.  Before I found these resources, I felt alone in my search, finding nothing but professional enablers (those in the counseling and legal professions) whose expensive and poor advice only allows the cycle to continue.  May God bless you with courage in your quest to find answers.", "overall": 5.0, "summary": "Opening the door", "unixReviewTime": 1226102400, "reviewTime": "11 8, 2008"}
{"reviewerID": "AV3UWBH6K0ETD", "asin": "0000589012", "reviewerName": "Ronald E. Miller", "helpful": [2, 3], "reviewText": "Was a bit slow.  Did have some good information but still very dry I thought.  I do use if for educational services.", "overall": 2.0, "summary": "Why Don't They Just QUIT?", "unixReviewTime": 1334966400, "reviewTime": "04 21, 2012"}
{"reviewerID": "A312A70K5UUL1N", "asin": "0000589012", "reviewerName": "Russ", "helpful": [0, 1], "reviewText": "this has to be one of the most dry and boring dvd i have bought, i think it was a waste of money. i showed it to my clients and they asked if we had to watch it after 10 minutes..", "overall": 1.0, "summary": "boring", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A23PSBNOBPLCOM", "asin": "0000589012", "reviewerName": "russtacean", "helpful": [1, 1], "reviewText": "This is a truly important work... one that anyone affected by substance abuse either directly or indirectly should see.When i was in art school years ago, one day a friend of mine who was also a classmate didn't show up for class. It was very unusual as he was always first there and one of the most talented and prolific artists - not only in the freshman class, but in the whole college. He was always drawing and, although very reclusive in his personal life, was well liked and admired. i learned quickly that he had overdosed. Sadness and deep grief do not even begin to describe the loss of Gary. i still feel empty when i think of him like when the wind blows, i feel like it can go right through me.The reason i was so glad to have learned of this great book and of Joe's having been there realism, is that it has given me some closure on some level about my friend. No other work has come close and for that i am eternally grateful.It's an honor for me to have a chance to write this.respectfully and with deep regard and thanks,russ", "overall": 5.0, "summary": "An insightful, provocative tool... very powerful and overwhelmingly real.", "unixReviewTime": 1309910400, "reviewTime": "07 6, 2011"}
{"reviewerID": "ATEOWCA0EHRQR", "asin": "0000589012", "reviewerName": "S. Chism", "helpful": [4, 6], "reviewText": "I purchased this DVD and was very excited to find some answers that you don't get anywhere else.  This book gives you an insight from the addict himself to understand the distorted thinking that comes with addiction.  It will help you better understand and relate to the addict in your life.  I actually bought several books and gave one to a Psychiatrist and he loved it and is reccomending the book to family of alcoholics as well as addiction.  Thank you so much for creating this helpful book and DVD!!!!!  We love them!  And we are happy that you are wanting to help people and families who are affected from a disease that is beyond their control!", "overall": 5.0, "summary": "Awesome!!!", "unixReviewTime": 1225670400, "reviewTime": "11 3, 2008"}
{"reviewerID": "A2T8A34ZSAXGHA", "asin": "0000589012", "reviewerName": "SharonLong", "helpful": [2, 3], "reviewText": "\"Why Don't They Just Quit\" could not hold my attention that I wouldn't even dare to bore my adult substance addiction therapy group with it. To show this to a population of substance abusers would put them to sleep. The kind of addiction films that stimulate my clients are the ones that explain how they got addicted, why they are addicted, and what can be done about it from a psychological, biological, and physiology perspective. Psychological, biological, and physiological films make them feel as if they are a person first with some issues, instead of making them feel they are labeled as a problem with the identity of an alcoholic or addict (a person second) in which this DVD takes that position. Good addiction films today move fast, scene to scene, with music in background and people talking scene to scene with speed. This DVD has the same two or four people sitting around a table talking about \"the alcoholic or drug user\" with the same monotone voices. The background is black and has a bowl of fruit to look at on the table but doesn't even have something to look at in the background such as cars going by in a window or pictures or a bookshelf. This DVD definitely isn't for substance user/abuser audience or a therapist that already has knowledge about addictions. It is more suited for those that don't know anything about addictions and who doesn't have substance-using issues. I would recommend this DVD for family members experiencing a love one with using issues or a student first learning about addictions for their studies in the mental health or medical field because the DVD pretty much covers all the basics A to Z about understanding a person with alcohol or drug issues. I also recommend, to really get to know what a substance user is experiencing is to attend a few AA and/or NA speaker night meetings to hear how they journeyed through their recovery process.", "overall": 2.0, "summary": "Not for substance user audiences", "unixReviewTime": 1364083200, "reviewTime": "03 24, 2013"}
{"reviewerID": "A3G3WG4UMDSF8M", "asin": "0000589012", "reviewerName": "Tammy Kinsey", "helpful": [3, 3], "reviewText": "\"Why Don't They Just Quit\" is a must have book, and DVD round table discussion combo. I know from experience watching a love one suffer from addiction, how painful this is for the addict and the family. Most of the times the family does not know much about addiction or what it looks like exactly, all they know is their family structure is in jeopardy. The roundtable opens up many avenues of discussion of what addiction looks like, how it affects the family, and there are solutions. Yes, there are solutions!!! The round table givens valuable advice on many other questions you may have. Questions dealing with relapse, intervention techniques, in addition to what works, and what does not work for addicts, and their families. Joe and the round table members do an excellent job at discussing all the issues of addiction and recovery. Did you notice I said \"recovery?\" There is hope and this book along with round table discussion will help you on the path to recovery. If you are having addiction issues, or you are a family member watching someone with addiction issues this is a must have. Very insightful and positive...", "overall": 5.0, "summary": "A must have for someone suffering from addiction", "unixReviewTime": 1308700800, "reviewTime": "06 22, 2011"}
{"reviewerID": "A3LHVMF6OJXJNM", "asin": "0000589012", "reviewerName": "The Specialist Publishing Company", "helpful": [1, 1], "reviewText": "Very interesting and informative.  Helps one understand the complicated disease of alcoholism and other addictions.  I highly recommend it for everyone.", "overall": 4.0, "summary": "Alcoholism Explained", "unixReviewTime": 1401408000, "reviewTime": "05 30, 2014"}
{"reviewerID": "A35ZSFP89PWC5B", "asin": "0000589012", "reviewerName": "Wallet", "helpful": [1, 1], "reviewText": "This is a great family movie to watch for those who have substance addiction. It helps everyone understand the addiction stage better.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "ALQGU53I8TCU6", "asin": "0000695009", "reviewerName": "Brian Craven", "helpful": [0, 0], "reviewText": "It help peoples to understand about Epilepsy It is one of the main one if you can buy it buy it it can be very hard to buy from", "overall": 4.0, "summary": "It is another good one is very short", "unixReviewTime": 1365724800, "reviewTime": "04 12, 2013"}
{"reviewerID": "A1XU4NX76WRGZM", "asin": "0000791156", "reviewerName": "Maria \"wishfulone\"", "helpful": [0, 0], "reviewText": "I am extremely satisfied with this purchase and wish I could have more resources by Pstr Prince.I have yet to know a lot about the gospel of Grace...but i am so glad to have started the journey. Thank you Jesus.", "overall": 5.0, "summary": "Exceedingly glad", "unixReviewTime": 1398297600, "reviewTime": "04 24, 2014"}
{"reviewerID": "A1Z6CDRFVIHES5", "asin": "000107461X", "reviewerName": "garland kimble", "helpful": [0, 0], "reviewText": "the music was everything that I wanted. Would order again because the service was quick and very satisfactory. Looking to order more", "overall": 5.0, "summary": "Excellent!,,,", "unixReviewTime": 1359849600, "reviewTime": "02 3, 2013"}
{"reviewerID": "AR6RBE9S8XZ8C", "asin": "0001485423", "reviewerName": "Happy Customer", "helpful": [0, 0], "reviewText": "Very good information on the Divine Mercy. Learned much about Sister Faustina and appreciate her example and what she has done for her Catholic faith.", "overall": 5.0, "summary": "Inspiring movie", "unixReviewTime": 1363219200, "reviewTime": "03 14, 2013"}
{"reviewerID": "A2X0GJ1KR9B8U0", "asin": "0001516035", "reviewerName": "GW \"GW\"", "helpful": [0, 0], "reviewText": "I was pleasantly surprised with this one. Really nice to see happy, smiling, Don Moen singing upbeat songs and even dancing early on in the video. Very cool!", "overall": 5.0, "summary": "Worship with Don Moen", "unixReviewTime": 1335830400, "reviewTime": "05 1, 2012"}
{"reviewerID": "A1Z1NDXGCNMEST", "asin": "0001517791", "reviewerName": "Kathy S Korn", "helpful": [0, 0], "reviewText": "I purchased a used video because mine was ruined. I love this tape. No matter how often I use it, I get a great workout and the music lifts my spirit every time.", "overall": 5.0, "summary": "Great Workout", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"}
{"reviewerID": "A2GWNIH0RTOM67", "asin": "0001517791", "reviewerName": "Seysme", "helpful": [0, 0], "reviewText": "I went to a church aerobics class in the early 90's where they used this workout. I loved it so much I decided to buy one for myself. I have used this workout off and on over the years and have never stopped loving it. It is not only a well balanced workout, but the outstanding and timeless (scripture memory) music is good for lifting your spirit and getting you exciting about serving God. It features low, med and high intensity for all levels of ability. It is a pretty easy workout; however, the steps are a little hard to learn at first, but once you learn then it feels like flying...lot of fun!", "overall": 5.0, "summary": "Fun workout and a good time with the Lord!", "unixReviewTime": 1294790400, "reviewTime": "01 12, 2011"}
{"reviewerID": "A2DZ09ET7S7ISG", "asin": "0001526863", "reviewerName": "Amy", "helpful": [3, 3], "reviewText": "My children love these videos, and I love hearing them sing the Scripture songs over and over and over again . . .", "overall": 5.0, "summary": "GREAT!", "unixReviewTime": 1184716800, "reviewTime": "07 18, 2007"}
{"reviewerID": "A1PRCGRSAJMIFW", "asin": "0001526863", "reviewerName": "denise", "helpful": [1, 1], "reviewText": "I love this video and so does my little girl.Is there anything better than hearing my 3 year old going around singing \"Christ who strengthens me\" or \"Overcome evil with good\"?Tunes are so catchy---I sing them myself!", "overall": 5.0, "summary": "Couldn't be happier!", "unixReviewTime": 1301529600, "reviewTime": "03 31, 2011"}
{"reviewerID": "A1TN0V94A3ECSH", "asin": "0001526863", "reviewerName": "Karilyn S. Eastvold", "helpful": [0, 0], "reviewText": "Attractive, memorable video featuring songs that are catchy and easy to learn.  Great way to write the Word of God on young hearts.  Works for parents too--they like the songs and learn the verses with little effort.  Children love these videos.", "overall": 5.0, "summary": "Hide 'Em in Your Heart", "unixReviewTime": 1254009600, "reviewTime": "09 27, 2009"}
{"reviewerID": "A3W3EB24TA5BSI", "asin": "0001526863", "reviewerName": "Mommyof8", "helpful": [0, 0], "reviewText": "It really works! The children love watching it and before I knew it we were all singing scripture! Do not be overcome with evil, but overcome evil with good! The songs really do get stuck in your head. Very sweet video.", "overall": 5.0, "summary": "Sweet!", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}
{"reviewerID": "A2647CKYEBQE7N", "asin": "0001526863", "reviewerName": "Patricia Fredrick", "helpful": [0, 0], "reviewText": "This video was the one I had been looking for.  Video was shipped quickly and worked fine.  Video provides songs to help kids learn Bible verses.", "overall": 5.0, "summary": "Item just as described", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
{"reviewerID": "A3478QRKQDOPQ2", "asin": "0001527665", "reviewerName": "jacki \"jacki\"", "helpful": [0, 0], "reviewText": "really happy they got evangelised .. spoiler alert==happy ending liked that..since started bit worrisome... but yeah great stories these missionary movies, really short only half hour but still great", "overall": 5.0, "summary": "great", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
{"reviewerID": "A3KROYMQ61M7A", "asin": "0005004101", "reviewerName": "Rich The Reviewer", "helpful": [2, 3], "reviewText": "See also: Jehovah's Witnesses: A Non-'Prophet' Organization. Started by 33rd degree Masonic Pyramidologist Chas.Taze Russell, in 1874 as the 'Russel-ites'. These poor people are badly bam-boozled. They need our prayers and th-is video / book (if you can still findit) are a step in the right direction!", "overall": 4.0, "summary": "Very Fine Jeremiah Films production of this pernicious cult...", "unixReviewTime": 1151798400, "reviewTime": "07 2, 2006"}
{"reviewerID": "A1FDW1SPYKB354", "asin": "0005019222", "reviewerName": "David Von Pein", "helpful": [1, 1], "reviewText": "\"The Homecoming -- A Christmas Story\"(full on-screen title) was made in 1971, and was the start of CBS-TV's very successful series, \"The Waltons\". And what a great way to start! Patricia Neal gives a powerful performance as Olivia Walton, the head of the very large Walton clan.This entire cast, in fact, seems ideally suited for his/her role in this film. The true feeling and spirit of the holiday shines through in every single scene of \"The Homecoming\", with the producers re-creating a very realistic feeling that it is indeed Christmas 1933, during the height of The Great Depression. The writing, acting, and the atmosphere are all first-rate.This is one of those programs that begs to be watched every Christmas Eve, just like clockwork.Who could forget the great scene at the end of the movie, when John (Daddy Walton, played by Andrew Duggan) tells the family of his encounter with Santa Claus. Watching him tell the kids of how Santa's sleigh \"...went flying across the sky and landed right on top of this house!!\", to me, is one of the best scenes in television history.When viewing that realistic scene, you'd swear those children were not actors at all -- but just wide-eyed excited kids hanging on their father's every word.In addition to the \"Santa's Sleigh\" scene I just mentioned, there are so many other memorable moments in this made-for-TV movie as well. Such as:>> The kids hearing the sleigh bells when they're supposed to be asleep...thinking it's Santa Claus.>> \"We've got to have some gas.\" :)>> The sleigh ride through the woods late on Christmas Eve, with the \"Baldwin Ladies\", John-Boy, and Hawthorne Dooley.>> The tree decorating scene, punctuated by Mary Ellen calling her siblings \"a bunch of piss ants\". (I was always a little surprised that \"piss ants\" got past the CBS censors.) ;)>> \"Are you smoking cigarettes up here, John-Boy??\" ~LOL~>> Mary Ellen and John-Boy's private talk in the barn while John-Boy is milking the cow. ... \"They'll grow.\" :)>> John-Boy telling a Christmas story to his brothers and sisters on the stairs just before their daddy returns home.>> When John-Boy finally confides in his mother, and reveals to her what his secret ambition is.Every moment in this movie is to be treasured. Always.---------------------------\"The Homecoming -- A Christmas Story\" will forever be one of the very best Christmas movies ever made, in my opinion.Thank you, Earl Hamner Jr., for this timeless holiday staple.", "overall": 5.0, "summary": "\"THE HOMECOMING\" -- A Timeless Holiday Treasure!", "unixReviewTime": 1175817600, "reviewTime": "04 6, 2007"}
{"reviewerID": "A8DEM9HR8QORQ", "asin": "0005019281", "reviewerName": "Alfred Santa Cruz", "helpful": [0, 0], "reviewText": "my family really enjoyed this movie. hoping to find the dvd in stores someday. might have to order on line. thanks for the choice of classic shows.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "ADZPIG9QOCDG5", "asin": "0005019281", "reviewerName": "Alice L. Larson \"alice-loves-books\"", "helpful": [0, 0], "reviewText": "This is a charming version of the classic Dicken's tale.  Henry Winkler makes a good showing as the \"Scrooge\" character.  Even though you know what will happen this version has enough of a change to make it better that average.  If you love A Christmas Carol in any version, then you will love this.", "overall": 4.0, "summary": "good version of a classic", "unixReviewTime": 1203984000, "reviewTime": "02 26, 2008"}
{"reviewerID": "A35947ZP82G7JH", "asin": "0005019281", "reviewerName": "Amarah Strack", "helpful": [0, 0], "reviewText": "It was good but not as emotionally moving as the the Christmas Carol by Dickens  I like Christmas movies that make me sigh", "overall": 3.0, "summary": "Good but not as moving", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "A3UORV8A9D5L2E", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Don't get me wrong, Winkler is a wonderful character actor and I would rate 95% of his performances as B+ or A, however, he was not very convincing in the starring role of &#34;An American Christmas Carol.&#34;  I'd give it a C or C+ at best.  Ayyyyy!", "overall": 3.0, "summary": "Winkler's Performance was ok at best!", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "A32MMXBE8TZEHO", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Henry Winkler as Slade was great. Good cast and I enjoyed the movie very much.  I am adding it to my list of favorite holiday movies.", "overall": 5.0, "summary": "Great twist on the classic", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "A2S8D0QSJZ07DJ", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "i have always liked this movie it was suppose to be based in my home town which made it more interesting.  It still follows the story line of Charles Dickens with the ghosts and all but still a very good story.", "overall": 5.0, "summary": "great show", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "A12PD8MX7BQW45", "asin": "0005019281", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I remember seeing this when it was first broadcast on TV. I loved it then and loved being able to watch it on DVD for the first time in almost 30 years. Other reviewers have provided story details, so I'll just say that this is a sweet movie that has aged well. If you are already considering this purchase then you are bound to like it.", "overall": 5.0, "summary": "Great retelling in an Amercan Setting", "unixReviewTime": 1212192000, "reviewTime": "05 31, 2008"}
{"reviewerID": "A1RZSB9J891SCK", "asin": "0005019281", "reviewerName": "Amazon Customer \"I'm a book lover, what can I...", "helpful": [2, 2], "reviewText": "This is one of my two favorite adaptations of this classic. Henry Winkler plays an outstanding Scrooge character and this is my favorite role of his, cheesy moustache notwithstanding.You will also find many great lines about life (look for the comment about \"the larger state\", \"records\" & \"if\").Buy this movie, you won't regret it.", "overall": 5.0, "summary": "Henry Winkler's best", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
{"reviewerID": "A1VKW06X1O2X7V", "asin": "0005019281", "reviewerName": "Amazon Customer \"Softmill\"", "helpful": [0, 0], "reviewText": "Henry Winkler is very good in this twist on the classic story. Not a conventional remake, but a version of the story set in early America. Give it a try.", "overall": 5.0, "summary": "It's an enjoyable twist on the classic story", "unixReviewTime": 1202860800, "reviewTime": "02 13, 2008"}
{"reviewerID": "A3M1I3T6RCU13B", "asin": "0005019281", "reviewerName": "Angela L. Patrick", "helpful": [0, 0], "reviewText": "I have always loved the Christmas Carol, and this version doesn't disappoint. Henry Winkler plays a great &#34;Scrooge&#34;. I loved it!", "overall": 5.0, "summary": "Lovely version", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
{"reviewerID": "A9ET89HFL6H5V", "asin": "0005019281", "reviewerName": "Anna Koglin", "helpful": [0, 0], "reviewText": "Doesn't matter the time or the place we are in life, we should always look at ourselves and reflect on how we can make a difference in our world.", "overall": 5.0, "summary": "One of the best!", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A655QKT9RZE22", "asin": "0005019281", "reviewerName": "Anthony Dipoalo", "helpful": [0, 0], "reviewText": "I remember watching this as a kid on prime time television.  I love this unique version of a Christmas Carol.", "overall": 4.0, "summary": "I love this unique version of a Christmas Carol", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
{"reviewerID": "A204IS3LM0G5WR", "asin": "0005019281", "reviewerName": "atmjinc", "helpful": [0, 0], "reviewText": "I thought the movie was great when it came out in 1979 and still think it's great today. This is a good movie for the whole family to watch; however, not sure if the kids of today would appreciate it.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
{"reviewerID": "A2EKHROPDGU1XE", "asin": "0005019281", "reviewerName": "babear \"babear54\"", "helpful": [0, 0], "reviewText": "I was so excited to get a dvd of \"an american christmas carol\".the quality is great and the service was excellent. this is one of our favorite christmas movies.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1229040000, "reviewTime": "12 12, 2008"}
{"reviewerID": "A3R27T4HADWFFJ", "asin": "0005019281", "reviewerName": "BABE", "helpful": [0, 0], "reviewText": "This is one of the best Scrooge movies out.  Henry Winkler outdoes himself.  The casting is excellent and the music and theme old but very relevant.", "overall": 4.0, "summary": "Best Scrooge yet", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
{"reviewerID": "A2L0G56BNOTX6S", "asin": "0005019281", "reviewerName": "barbara whapeles", "helpful": [0, 0], "reviewText": "This has been a favorite movie of mine for a long time.  Henry winkler is great as a modern day Scrooge.  There are many movies giving a new twist to Dickens, but this one is true to the original story.  It is set during the depression.", "overall": 5.0, "summary": "Dickens updated.", "unixReviewTime": 1383696000, "reviewTime": "11 6, 2013"}
{"reviewerID": "A5NYUBEKXFLX5", "asin": "0005019281", "reviewerName": "B. Babb \"kites0852\"", "helpful": [1, 1], "reviewText": "This is the American adaptation of the Charles Dickens' classic.  It is interesting that in the movie the main character is seen ripping the pages out of a collector's item book of \"A Christmas Carol.\"Henry Winkler gives an outstanding performance as Benedict Slade, a loan officer who reclaims valued possessions of those unable to make late payments on Christmas Eve.His visit by the spirits, the life in the orphanage and how one man helped him, leads to a very sentimental ending.It would have been good if the images could be enhanced for better viewing.  This originally was a 'made-for-TV' program and is presented complete with the fade-outs for the commercial breaks.David Wayne gives a great performance as the book owner as well as Christmases past.", "overall": 5.0, "summary": "A MUST-HAVE FOR ANY VIDEO CHRISTMAS COLLECTION!!", "unixReviewTime": 1230595200, "reviewTime": "12 30, 2008"}
{"reviewerID": "A2WT7U5CFGZZZ4", "asin": "0005019281", "reviewerName": "Beak", "helpful": [0, 0], "reviewText": "This is an excellent movie.  I had not seen it for many years.  It used to be on television every Christmas, but not in the last several years.  I checked Amazon and there it was.  I watched with my daughter the other night - she had never seen it before.  She enjoyed it.  Well worth watching.", "overall": 5.0, "summary": "Excellent Movie", "unixReviewTime": 1323043200, "reviewTime": "12 5, 2011"}
{"reviewerID": "APC04EXUKDQJ6", "asin": "0005019281", "reviewerName": "Beansisme", "helpful": [0, 0], "reviewText": "I really can't complain about the shopping experience; that was great.  I loved this movie when I originally saw it but like so many things in life it wasn't so good the second time.", "overall": 3.0, "summary": "Very fast delivery", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"}
{"reviewerID": "A2DJ8B8GE4V2VD", "asin": "0005019281", "reviewerName": "Berl S. Meyer", "helpful": [0, 0], "reviewText": "Glad that this american classic came out on dvd.  I have been waiting for it for a long time.  I haven't seen this production since it came out years ago.  Plus it's better than some Hallmark holiday movies.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1260835200, "reviewTime": "12 15, 2009"}
{"reviewerID": "AWF2S3UNW9UA0", "asin": "0005019281", "reviewerName": "beth holman", "helpful": [0, 0], "reviewText": "A good Christmas carol dhenry winkler one during the depression. Henry winkler does a good job.a classic film I recommend for all ages.", "overall": 5.0, "summary": "an american christmas carol", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
{"reviewerID": "A3OOCXQFN0GPH1", "asin": "0005019281", "reviewerName": "Betterat50", "helpful": [0, 0], "reviewText": "My brother loves this Henry Winkler version of A Christmas Carol called \"An American Christmas Carol\" and wanted it for his DVD Christmas collection. Its not in the stores and my brother was too cheap to purchase a DVD over $20, so it was the perfect gift!  I also purchased the suggested \"Most Wonderful Time of the Year\" with Henry Winkler, my brother hasn't watched it yet but said he has never seen it before, so I was happy Amazon suggested it also.  They arrived quickly and securely, overall 5 stars of happiness with Amazon.", "overall": 5.0, "summary": "Great gift!", "unixReviewTime": 1325548800, "reviewTime": "01 3, 2012"}
{"reviewerID": "A3O4UUT83DG3OU", "asin": "0005019281", "reviewerName": "Bettylou Sperling", "helpful": [0, 0], "reviewText": "How a bitter old man comes to know the true meaning of Christmas. Realizing to late his lost love and life.", "overall": 5.0, "summary": "Fantastic!", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}
{"reviewerID": "A3TK5Q142X5Q8A", "asin": "0005019281", "reviewerName": "BluegrassGirl \"Mother Nature\"", "helpful": [0, 0], "reviewText": "The small historic Canadian town of Elora, with its many century-old buildings, is the perfect setting for this story, set in the early 1900's.  Bringing the story to 20th century America allows the story to incorporate situations Americans can more easily with.  Henry Winkler does a great job of recreating the Scrooge character, and the supporting cast are no less admirable.  This is an annual &#34;must watch&#34; story for me.", "overall": 5.0, "summary": "Outstanding Concept, and Performances", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A384DLXD0474VH", "asin": "0005019281", "reviewerName": "Bob S. \"Classical Music Fanatic\"", "helpful": [0, 0], "reviewText": "We'd taped this from TV years ago and I was delighted to find this version on Amazon.  Winkler is fantastic as the Scrooge character.  While the story-line has been modified to be early 20th century New England the elements of the original Dickens story are preserved in this version.  I'm a \"Christmas Carol\" fanatic and this is a super addition to my collection.  Buy it- you won't be disappointed!", "overall": 5.0, "summary": "A WONDERFUL VARIANT OF THE DICKENS 'CHRISTMAS CAROL' STORY", "unixReviewTime": 1204156800, "reviewTime": "02 28, 2008"}
{"reviewerID": "A18OILI6QL3F6D", "asin": "0005019281", "reviewerName": "brianbomber123", "helpful": [0, 0], "reviewText": "Good fun movie for the holidays nice different version of A Christmas Carol like the characters but it could have been longer", "overall": 5.0, "summary": "fun Christmas movie", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "A3EWY61AK57EIW", "asin": "0005019281", "reviewerName": "briceynanny", "helpful": [0, 0], "reviewText": "This arrived in good time. It was in good condition. I haven't had a chance to watch it yet. I am happy with this purchase so far.", "overall": 4.0, "summary": "American CC DVD", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
{"reviewerID": "A33EWPXESP9GQH", "asin": "0005019281", "reviewerName": "Buckaroo \"Dead Dog\"", "helpful": [0, 0], "reviewText": "Even though i don't care for Henry Winklers  acting i liked this movie it fit him real good ThanksDale", "overall": 5.0, "summary": "Good Version", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "AG8D804FUG5Y4", "asin": "0005019281", "reviewerName": "Bud Harris \"Bud 101\"", "helpful": [0, 1], "reviewText": "My wife told me of this movie in which Henry Winkler stars & shows he can act in this different version of a Chrismas Carol.", "overall": 3.0, "summary": "Christmas", "unixReviewTime": 1199836800, "reviewTime": "01 9, 2008"}
{"reviewerID": "A1GHUN5HXMHZ89", "asin": "0005019281", "reviewerName": "C. A. Luster \"The Rook\"", "helpful": [0, 0], "reviewText": "The first time I saw &#34;An American Christmas Carol&#34; I immediately fell in love with it.  I didn't grow up during the Great Depression but my father did and he told stories that made it real for me.  This re-imagination of an Americanized Scrooge during the Depression is wonderful.  The story, acting, directing, camera work, costumes, sets, locations, music, and all production values are great.  I have always enjoyed Henry Winkler as an actor, but I think this is by far one of his best if not the best performance of his career to date.  I highly recommend it for the whole family.CA Luster", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
{"reviewerID": "A1SA1Z504112YI", "asin": "0005019281", "reviewerName": "Carfo \"Station Guy\"", "helpful": [0, 0], "reviewText": "I worked for an ABC station in the 70's and early 80's so I knew and watched when this movie first aired.  I wasn't expecting a great show, just one of those expositions of ABC stars like \"Love American Style\" was in that error.  I was very surprised and my wife even cried.  This is a well written, well directed and edited movie.  Not corny but as the title denotes, with a script that moves away from the original script.  In this era of NAFTA and trade treaties this message is as timely as it was in the period of the movie.  Also Henry Winkler, who obviously plays the character in several ages, does a great job.", "overall": 5.0, "summary": "The Fonz delivers a \"carol with a twist\"", "unixReviewTime": 1324512000, "reviewTime": "12 22, 2011"}
{"reviewerID": "AQD623IKMVSGL", "asin": "0005019281", "reviewerName": "Carin Misterly", "helpful": [0, 1], "reviewText": "Horrible movie.  Why Henry Winkler.........why?  The make up was terrible the sets were subpar.....I get it was '80s made for TV, but it brought our evening down fast.  Love the Winkler....no likely this movie..", "overall": 1.0, "summary": "Noooooooooo!!!!!!!!", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "AV1K4IVQVAZFK", "asin": "0005019281", "reviewerName": "Carol", "helpful": [0, 0], "reviewText": "Saw this movie many years ago, and checked for it to be on TV for several years, to no avail.  So happy to find this version.  Henry Winkler did a wonderful job.", "overall": 4.0, "summary": "Good movie", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
{"reviewerID": "A3KBZ7NI16537Y", "asin": "0005019281", "reviewerName": "Carol T.", "helpful": [0, 0], "reviewText": "This has always been one of my favorites.I saw it when it first aired and was excited to see it again.", "overall": 5.0, "summary": "An American favorite.", "unixReviewTime": 1386201600, "reviewTime": "12 5, 2013"}
{"reviewerID": "A3VT62AP8KEK3V", "asin": "0005019281", "reviewerName": "Carolyn N.", "helpful": [1, 1], "reviewText": "Set in the USA about the time of the depression it is an update of that old familiar story of redemption.  The story is classic and this one is as good as all the rest.  Henry Winkler is good in this role.", "overall": 4.0, "summary": "It's a Christmas Carol", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A137B3F44TDVIX", "asin": "0005019281", "reviewerName": "Cat Sighs \"Never Say Never\"", "helpful": [3, 4], "reviewText": "This version of the classic \"A Christmas Carol\" is one of the best.Henry Winkler is brillant as Benedict Slade and in my opinion this is his most outstanding performance. I watched this movie when it was first released on TV during his Fonzie heyday, and I never once saw that 50's character. He is immersed in his character and is a completely convincing \"Scrooge.\"I'm disappointed that this isn't shown on TV, and I have purchased it so I can enjoy it again and again along with my husband and little girl.My top three \"A Christmas Carol\" versions star \"A Christmas Carol\" with Alistair Sim, \"Scrooge\" with Albert Finney, and \"An American Christmas Carol\" with Henry Winkler. I won't bother with the others.", "overall": 5.0, "summary": "One of the Best Scrooge versions", "unixReviewTime": 1164067200, "reviewTime": "11 21, 2006"}
{"reviewerID": "AAM67Y93KTIOL", "asin": "0005019281", "reviewerName": "CFS", "helpful": [0, 0], "reviewText": "I really enjoy all the &#34;Christmas Carol-Scrooge&#34; movies. I own all the ones I know about and watch them each year. I want to add this one to my collection as it is a different take on the traditional ones.", "overall": 5.0, "summary": "A FAMILIAR CLASSIC IN A DIFFERENT WAY", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A37UOTDP2USAK8", "asin": "0005019281", "reviewerName": "cftiffany", "helpful": [0, 0], "reviewText": "A good example of American history and an interesting interpretation of the Dicken's story. Well told, I enjoyed it immensely.", "overall": 4.0, "summary": "Whimsical warm movie", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A8RICSNM5RJLW", "asin": "0005019281", "reviewerName": "Chad Parlett", "helpful": [0, 0], "reviewText": "I always loved this version of a Christmas Carol. It's quite well done and original. A nice diversion from the standard fare. Winkler is wonderful.", "overall": 5.0, "summary": "The Fonz By Way of Dickens", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "A1GQF4JDJXBRLH", "asin": "0005019281", "reviewerName": "Charles A. Hickson \"Chas\"", "helpful": [0, 0], "reviewText": "This is a wonderful movie. It stay faithful to A Christmas Carol, but it very American. A fun movie for one and all.", "overall": 5.0, "summary": "Great Christmas movie for the family", "unixReviewTime": 1173312000, "reviewTime": "03 8, 2007"}
{"reviewerID": "A13KAQO9F5X0FN", "asin": "0005019281", "reviewerName": "chaz", "helpful": [0, 0], "reviewText": "Anorher good movie for holiday watchers..a little twist from the ordinary scrooge movie. Enjoyable. What couldn't you like from the fons.", "overall": 4.0, "summary": "the fonz does scrooge", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A3ECX7DUREGJ7G", "asin": "0005019281", "reviewerName": "Cheryl A. Zimmemann", "helpful": [2, 2], "reviewText": "This is my favorite rendition of the classic Dickens story \"A Christmas Carol.\"  Although the versions with George C. Scott and Patrick McNee are also very good, and I watch them at least once every holiday season, they emphasize the British and Victorian aspects of the story.  I am fond of \"An American Christmas Carol\" because it is set during the Depression and shows aspects of American society during that period.  The primary element missing from this version of the story is that Scrooge's sister and, hence, her son (Scrooge's nephew) are missing from this version, presumably in order to fit the original version within a specific time frame.  As a result the story element where the nephew's friends ridicule Scrooge's miserliness, and the corresponding redemptive element after the visitations are missing.  I felt that Henry Winkler performed the role of Scrooge admirably, even though he was only 34 at the time.  Usually the role is performed by an actor of mature years.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1168819200, "reviewTime": "01 15, 2007"}
{"reviewerID": "A3UEOL981G9TXY", "asin": "0005019281", "reviewerName": "ChihuahuaMom", "helpful": [0, 0], "reviewText": "Henry Winkler played a great part as Scrooge.  It gave yet another twist to all the Christmas Carols of the past.", "overall": 5.0, "summary": "An American Christmas Carol", "unixReviewTime": 1328227200, "reviewTime": "02 3, 2012"}
{"reviewerID": "AZBWH4HLG3JWV", "asin": "0005019281", "reviewerName": "Chris Crossont", "helpful": [0, 1], "reviewText": "Ignore some of the more negative reviews on here. This made for TV movie really touches me every time I watch it; which is every Christmas.The acting is splendid and the story is well written. It is suitable for the entire family and it gives a good picture of the depression era of our country.", "overall": 5.0, "summary": "One of my favorite Christmas movies!", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "A2219H7HY0F9V8", "asin": "0005019281", "reviewerName": "Christina England", "helpful": [0, 0], "reviewText": "We have been looking for this movie for over 15 years and were delighted to finally find it available on dvd!  Love love love it!", "overall": 5.0, "summary": "American Christmas Carol", "unixReviewTime": 1363046400, "reviewTime": "03 12, 2013"}
{"reviewerID": "A1A9WDWEVC5AC0", "asin": "0005019281", "reviewerName": "christopher", "helpful": [9, 11], "reviewText": "First time i saw this movie was 1985 on television. Henry Winkler was excellent! Actually, the whole cast was great. I spent 17 years trying to locate this movie. You won't find it in a video store, at least where i live. And they don't show it on regular t.v. anymore. It is a MUST HAVE if you collect christmas movies.", "overall": 5.0, "summary": "A heart gripper", "unixReviewTime": 1036800000, "reviewTime": "11 9, 2002"}
{"reviewerID": "A19THR3ZXSIK49", "asin": "0005019281", "reviewerName": "CJShopper", "helpful": [0, 0], "reviewText": "It's so funny to me that this was made at the height of Henry's Fonz days. It was surprisingly charming and brought me back to the days of my childhood Christmas TV shows.", "overall": 4.0, "summary": "The Fonz!", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A17DHMBDJMYVU1", "asin": "0005019281", "reviewerName": "Clayton Tschirn", "helpful": [0, 1], "reviewText": "Since I was a child many years past I have been interested in Dickens Christmas Carol. When I saw this version it stood out amoung the many other versions out there. Henry Winkler plays a good scrooge charactor. The story itself is based on Charles Dickens A Christmas Carol and the story sticks very close to the original with a 1920s depiction of the American depression.", "overall": 4.0, "summary": "An American Christmas Carol", "unixReviewTime": 1233273600, "reviewTime": "01 30, 2009"}
{"reviewerID": "A2Q8O413HJZ55E", "asin": "0005019281", "reviewerName": "Clifford J. Carroll", "helpful": [0, 2], "reviewText": "We began watching this video, but stopped it a short way into it when we realized this was not what we had hoped for.  It was too contrived and predictable.", "overall": 2.0, "summary": "An American Christmas Carol", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "A2ZCGDI772NVQI", "asin": "0005019281", "reviewerName": "CLKindle", "helpful": [0, 0], "reviewText": "I wasn't expecting too much from this film, but was pleasantly surprised by the quality of the production and acting!  Henry Winkler (famous for playing &#34;the Fonz&#34; on Happy Days) proves his acting abilities and range of emotions in this satisfying film.  Some unexpected twists and just enough grit to make it evocative of Depression Era America make this a nice take on the Christmas classic.  (P.S.  Just wait for the Ghost of Christmas Future&#8230;so wouldn't think that would work out well, but it did!!!  That's all I'm saying. Love it.)", "overall": 5.0, "summary": "Interesting twist on a classic", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
{"reviewerID": "A1L45FLKBI9K0H", "asin": "0005019281", "reviewerName": "Cody", "helpful": [0, 0], "reviewText": "This movie was made in 1979, when Henry Winkler was in his heyday of playing \"The Fonz\" on \"Happy Days\".  It was exciting back then to see what else he could do, and he came through admirably.This movie hasn't played on TV in at least a decade that I remember, and it should be, for it's a fresh take on the old Dickens tale.The setting is Concord, NH in 1933, and miserly Benedict Slade goes about repossessing people's furniture, stoves, radios - and even a piano from a children's orphanage! - on Christmas Eve.Then come the visitations and, well, we know the rest of the story.Pick it up for a treat for next Christmas.", "overall": 4.0, "summary": "Wonderful Variation of an Old Classic", "unixReviewTime": 1198627200, "reviewTime": "12 26, 2007"}
