{"reviewerID": "AH2L9G3DQHHAJ", "asin": "0000000116", "reviewerName": "chris", "helpful": [5, 5], "reviewText": "Interesting Grisham tale of a lawyer that takes millions of dollars from his firm after faking his own death. Grisham usually is able to hook his readers early and ,in this case, doesn't play his hand to soon. The usually reliable Frank Mueller makes this story even an even better bet on Audiobook.", "overall": 4.0, "summary": "Show me the money!", "unixReviewTime": 1019865600, "reviewTime": "04 27, 2002"}
{"reviewerID": "A2IIIDRK3PRRZY", "asin": "0000000116", "reviewerName": "Helene", "helpful": [0, 0], "reviewText": "The thumbnail is a shirt.  The product shown is a shoe.  The description is a book.This reviewer is confused.", "overall": 1.0, "summary": "Listing is all screwed up", "unixReviewTime": 1395619200, "reviewTime": "03 24, 2014"}
{"reviewerID": "A1TADCM7YWPQ8M", "asin": "0000000868", "reviewerName": "Joel@AWS", "helpful": [10, 10], "reviewText": "I'll be honest. I work for a large online retailer named after a South American river, and ordered this because the ASIN (0000000868) is so ... distinctive ... and, frankly, I wondered what the hell a &quot;reader turntable&quot; was, particularly one with both an editor and an illustrator.A friend suggested that the title was really the result of a very poor translation; that &quot;Reader&quot; was supposed to be &quot;Tales&quot;, &quot;Turntable&quot; was supposed to be &quot;Lyrics&quot; and this was really a book entitled &quot;Korea's Favorite Tales and Lyrics&quot;. Oddly enough, there is such a book, apparently edited by Mr. Hyun and illustrated by Mr. Park.Well, as it turns out, &quot;Reader Turntable SE-14&quot; is not a book. It is, well, a reader turntable: a black rectangular piece of 1/2&quot; particleboard, about 13x16 inches, mounted on a bearing so it can rotate easily. It's a lot like a &quot;Lazy Susan&quot;.It's useful for reading rooms, libraries, etc. Place it on table, put a dictionary or other big heavy reference book on it, and now folks sitting on either side of the table can share the reference, simply turning it towards them when they need to look something up.Construction is sturdy. I (175 lbs) stood on it and it rotated: a bit roughly but it didn't collapse. Bearing quality is modest but serviceable. Black matte finish is tasteful.", "overall": 4.0, "summary": "Not a Bad Translation", "unixReviewTime": 1031702400, "reviewTime": "09 11, 2002"}
{"reviewerID": "AWGH7V0BDOJKB", "asin": "0000013714", "reviewerName": "Barbara Marshall", "helpful": [0, 0], "reviewText": "It had all the songs I wanted but I had ordered the large print version and received the regular version. This was the only thing I did not like.", "overall": 4.0, "summary": "Not the large print", "unixReviewTime": 1383177600, "reviewTime": "10 31, 2013"}
{"reviewerID": "A3UTQPQPM4TQO0", "asin": "0000013714", "reviewerName": "betty burnett", "helpful": [0, 0], "reviewText": "We have many of the old, old issue. But the number had depleted. There were not  enough books to allow us to use them regularly. With the additional supply the books will be used more often.  They arre a good old standby for gospel singing.", "overall": 5.0, "summary": "I was disappointed that you would only allow me to purchase 4 when your inventory showed that you had 14 available.", "unixReviewTime": 1374883200, "reviewTime": "07 27, 2013"}
{"reviewerID": "A8ZS0I5L5V31B", "asin": "0000013714", "reviewerName": "Ephraim O. Nwabuokei", "helpful": [0, 0], "reviewText": "I love this book. I love hymns and love to sing and run my fingers over piano/organ.This book is helpful.", "overall": 5.0, "summary": "GREAT HYMN BOOK!", "unixReviewTime": 1393632000, "reviewTime": "03 1, 2014"}
{"reviewerID": "ACNGUPJ3A3TM9", "asin": "0000013714", "reviewerName": "GCM", "helpful": [0, 0], "reviewText": "We use this type of hymnal at church.  I was looking for the same one; however, this wasn't it. It is a good hymnal, but there isn't enough information to find the version I need.", "overall": 4.0, "summary": "Nice Hymnal", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}
{"reviewerID": "A3BED5QFJWK88M", "asin": "0000013714", "reviewerName": "jimedd", "helpful": [0, 0], "reviewText": "Heavenly Highway HymnsI ordered this hymnal because I learned to read shaped note music when I was a teenager. I play piano but do not sing. I am 85 years old. This hymnal has mostof the songs I have learned over the years. It was exactly what I wanted and needed.It was in good condition and the price was right. I purchased this book from Amazon.", "overall": 4.0, "summary": "Heavenly Highway Hymns", "unixReviewTime": 1350345600, "reviewTime": "10 16, 2012"}
{"reviewerID": "A2SUAM1J3GNN3B", "asin": "0000013714", "reviewerName": "J. McDonald", "helpful": [2, 3], "reviewText": "I bought this for my husband who plays the piano.  He is having a wonderful time playing these old hymns.  The music  is at times hard to read because we think the book was published for singing from more than playing from.  Great purchase though!", "overall": 5.0, "summary": "Heavenly Highway Hymns", "unixReviewTime": 1252800000, "reviewTime": "09 13, 2009"}
{"reviewerID": "APOZ15IEYQRRR", "asin": "0000013714", "reviewerName": "maewest64", "helpful": [0, 0], "reviewText": "This is a large size hymn book which is great to be able to see the songs, notes, etc.  Quality was great, item was new!", "overall": 5.0, "summary": "Awesome Hymn Book", "unixReviewTime": 1362787200, "reviewTime": "03 9, 2013"}
{"reviewerID": "AYEDW3BFK53XK", "asin": "0000013714", "reviewerName": "Missb", "helpful": [0, 0], "reviewText": "We use this hymn book at the mission.  It has most of the well-loved oldies from a time gone by.  Songs like: \"I'll Fly Away\" and \"Closer Walk With Thee\".  If you like a good singalong, you will really enjoy the \"Heavenly Hiway Hymns.\"  Be blessed.", "overall": 5.0, "summary": "Hand Clapping Toe Tapping Oldies", "unixReviewTime": 1325462400, "reviewTime": "01 2, 2012"}
{"reviewerID": "A1KLCGLCXYP1U1", "asin": "0000013714", "reviewerName": "Paul L \"Paul Lytle\"", "helpful": [0, 0], "reviewText": "One review advised this book was large print, however it isn't and I had to return it. I'm sure the contents of the hymnal are very nice, just not what I needed.", "overall": 3.0, "summary": "Misleading", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A37W6POFWIVG13", "asin": "0000013714", "reviewerName": "Prisley", "helpful": [3, 3], "reviewText": "Heavenly Highway Hymns contains great hymns.  These songs are filled with the love for Jesus and of the grace He gives to us.  A blessing in every song.", "overall": 5.0, "summary": "Wonderful Hymn Book", "unixReviewTime": 1316131200, "reviewTime": "09 16, 2011"}
{"reviewerID": "A2EIPZNHAEXZHJ", "asin": "0000013714", "reviewerName": "readingfan", "helpful": [2, 2], "reviewText": "The hymn selection in this edition is very fine, but the paper quality leaves something to be desired.  For a book in which singers are going to be thumbing through, using the index, turning pages as directed, the paper quality does not look like it will stand up to long term use.", "overall": 4.0, "summary": "Great hymn selection", "unixReviewTime": 1325030400, "reviewTime": "12 28, 2011"}
{"reviewerID": "A1VAFVJFT58YI3", "asin": "0000013714", "reviewerName": "Sandi Dobbins", "helpful": [0, 0], "reviewText": "As a child we sang out of these books. The two books I got are very clean and in very good shape. I  am very happy with mine and my sister likes her too.", "overall": 5.0, "summary": "Books", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A9KTKY6BUR8U6", "asin": "0000013714", "reviewerName": "Timothy Royer", "helpful": [1, 1], "reviewText": "This is a very cheaply made product.  I would not pay 1$ for this.  The paper is cheap and flimsy--the book will not even stay open (with fear of ripping the binding) so that I can open up to put on piano stand to play.Don't buy this version.", "overall": 1.0, "summary": "Not worth the $$", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}
{"reviewerID": "A2742OG8PK8KU6", "asin": "0000013714", "reviewerName": "TRYINTIMES", "helpful": [0, 0], "reviewText": "COMPILED OF SOME REALLY OLD GOSPELS, BEAUTIFUL LITTLE HARDCOVER BOOK, AND MY MOTHER LOVED THE SET I PURCHASED SEPERATELY ( HEAVENLY HIGHWAY HYMNS + FAVORITE SONGS AND HYMNS) SHE FOUND SONGS IN THEM FROM HER CHILDHOOD, JUST WHAT SHE WANTED!!", "overall": 5.0, "summary": "WONDERFUL PURCHASE FOR MY MOM @ CHRISTMAS", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "A38AAPXSJN4C5G", "asin": "0000015393", "reviewerName": "Edward J. Barton", "helpful": [1, 1], "reviewText": "It is amazing that this book is nearly 15 years old, and further that Bill Gates was so spot on with the current technology that we see today.  It is a good read to see both the vision of this truly amazing entrepreneur, as well as to get an idea of how to think about technology enabling daily life.  Listen to what Bill gates says about the future of technology in your life - the past would indicate he knows what he's talking about.", "overall": 4.0, "summary": "Dated but Valuable Reading", "unixReviewTime": 1239494400, "reviewTime": "04 12, 2009"}
{"reviewerID": "A14A5Q8VJK5NLR", "asin": "0000029831", "reviewerName": "Auros", "helpful": [3, 3], "reviewText": "This work bears deep connections to themes first explored in Tad Williams' original breakout novel, about a brave young cat who travels to an underground netherworld to face an ancient evil.  As the owner of two cats myself, after the second read-through, I realized that this novel has much to teach about the critical importance of dealing with fur and dust.I could only give four stars, though, because the cats do not agree, and indeed wish I had not made this purchase.", "overall": 4.0, "summary": "Logical follow-up to Tailchaser's Song", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A3W2PX96K1BA3M", "asin": "0000029831", "reviewerName": "Flav Josephus \"Online buyer\"", "helpful": [4, 4], "reviewText": "You may laugh, but I have found that Otherland volumes 1-4 are poor at picking up debris around the house.  I once spilled some cornflakes on the floor, and foolishly thought that I could clean it up by dropping &#34;City of Golden Shadows&#34; on it.  Not only did it not clean, it managed to make things worse by fragmenting the cornflakes into smaller and smaller pieces.  I did what any normal person would do: I stacked the other books on top, hoping that the combined power would whisk the cornflakes away to the technological wonderland that is Otherland.  No such results.Bin Otherland Empty, on the other hand, works like magic.  If you hook it up to a powerful enough motor, you can banish those cornflakes to the land of wind and ghosts.  The downside is that it's pretty light reading, but given the young adult trend these days it's following the light reading trend that literature is headed for these days.It's recommended that you get through the previous volume though (&#34;Hoover Electrical Vaccum Unit&#34;).  I mean, Bin Otherland Empty does work as a stand-alone, but it's not quite as absorbing when not paired up with the prequel.  Some people think you can skip the previous volume and lust stick your mouth in at one end and suck, but, c'mon, that's just gross.Spoiler alert!  Cornflakes vaccumed up.", "overall": 5.0, "summary": "The superior cleanser", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A2GKR2Q7MD8DG4", "asin": "0000029831", "reviewerName": "Jill Randall", "helpful": [3, 3], "reviewText": "Do not try and vacuum the dust. That's impossible. Instead... only try to realize the truth. There is no dust. Then you'll see, that it is not the vacuum that sucks, it is only yourself.", "overall": 5.0, "summary": "Very deep and thought provoking.", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A1MC4E00RO5E9T", "asin": "0000029831", "reviewerName": "Johan Klovsj", "helpful": [3, 3], "reviewText": "What if Dread had come out victorious and left Otherland well and truly CLEANED?What if the river that connected the worlds in Otherland had instead worked like a Vacuum hose?This ESSENTIAL companion to the Otherland quartet puts these uncomfortable questions in black and white.The MIND-BOGGLING new adventure starts HERE.Your imagination sets the boundaries...", "overall": 5.0, "summary": "WHAT IF....?", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A23PISU0ZLW71C", "asin": "0000029831", "reviewerName": "Ron H", "helpful": [5, 5], "reviewText": "I thought this book was great before buying it, but now I'm having some buyer's remorse. I really liked most of the author's previous books, but I found this one difficult reading, despite the fact that the chapters were quite short.The book just wasn't very good. In fact, it really sucked.The only reason I'm giving the book five stars is because I like the fact that the author is willing to try new things. I really respect an author who's willing to stretch his limits, exploring hard-to-reach areas, and start with a clean slate.", "overall": 5.0, "summary": "Review", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A1KP12IVP6LAGL", "asin": "0000038504", "reviewerName": "Chris Cudnoski \"infowars.com\"", "helpful": [1, 1], "reviewText": "Doublespeak is truly a language unto itself.  A fair comparison would be the similarities between British English and American English.  Both use the same words which would lead some people to think they were the same language.  That is until one hears that drivers in England keep their jacks in the boot, and take a lift up to their flat.So does Doublespeak use words from English but with a distinct accent that tells you the speaker is not from around here.Some people may not like the tone of the book.  However when you realize that the author also wrote the Cambridge Thesaurus of American English, you'll understand why after several decades studying deception in language he used such a sarcastic tone in presenting examples of such.This book is essential reading for anyone who wants to understand how scam artists use innocent words for nefarious ends.  Perhaps people like Bernie Madoff would have been less successful in running their scams if more people were aware of and watchful for doublespeak.", "overall": 5.0, "summary": "Learn to speak Doublespeak in under 15 minutes a day!", "unixReviewTime": 1232755200, "reviewTime": "01 24, 2009"}
{"reviewerID": "AG7R3MMF8QLDT", "asin": "0000038504", "reviewerName": "TW", "helpful": [1, 1], "reviewText": "Double Speak presents an interesting collection of countless issues of semantics; some comical, some downright shocking.When words are used with the intention of implying one meaning yet are open to completely different connotations, this usage can be exploited to convince, misrepresent, or simply to provide one a convenient means of retraction.Lutz provides examples of Double Speak in politics, business, world events, sports, law, and many others areas of interest.  I found many of the revelations intriguing and entertaining and would recommend this book for light reading or for anyone researching deliberate misusage of the English language for benefit.", "overall": 4.0, "summary": "A Wonderful Collection of the Manipulation of Semantics", "unixReviewTime": 1215820800, "reviewTime": "07 12, 2008"}
{"reviewerID": "ACZSAC9BNB1YA", "asin": "0000041696", "reviewerName": "Deborah Castaneda \"teacher2\"", "helpful": [0, 0], "reviewText": "Send promptly in good condition, however more was filled out than expected - and in ink!  Impossible to erase.", "overall": 3.0, "summary": "Abeka Math Workook", "unixReviewTime": 1254182400, "reviewTime": "09 29, 2009"}
{"reviewerID": "A2OLC4Z84N4P1E", "asin": "0000041696", "reviewerName": "quark", "helpful": [3, 3], "reviewText": "i love this book,its colorful and very fun to use,nevermind people who say this book should be tossed in a bonfire,the abeka math series is truely wonderful", "overall": 5.0, "summary": "great", "unixReviewTime": 1151452800, "reviewTime": "06 28, 2006"}
{"reviewerID": "A1UP8HIPMV08LP", "asin": "0000041696", "reviewerName": "Sarah Sanchez", "helpful": [2, 2], "reviewText": "This product was brand new and perfectly suited for our needs.  I love to work with Abeka products and this math curriculum is just great!  God bless you!", "overall": 5.0, "summary": "Brand new!", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "A224LQF2AFU0H8", "asin": "0000041696", "reviewerName": "Vizio", "helpful": [0, 0], "reviewText": "My children have been using it for extra homework.  LOTS of arithmetic problems.  I had to eliminate some.  Only wish there're more word problems.", "overall": 4.0, "summary": "Love it!", "unixReviewTime": 1342742400, "reviewTime": "07 20, 2012"}
{"reviewerID": "A1QHY69FQH9F5R", "asin": "0000095699", "reviewerName": "L. Misty", "helpful": [0, 0], "reviewText": "-The delivery time was good and came soon after I had bought the book.-The book itself was in ok shape but it works for what I need it for.", "overall": 3.0, "summary": "College Book Review", "unixReviewTime": 1254700800, "reviewTime": "10 5, 2009"}
{"reviewerID": "A339QIWV4489UG", "asin": "0000174076", "reviewerName": "Maria T. Perez", "helpful": [0, 0], "reviewText": "Valuable resource for anyone needing tips on writing research articles or papers, with lots ways to do it correctly and succeed.", "overall": 5.0, "summary": "UNM Course", "unixReviewTime": 1358985600, "reviewTime": "01 24, 2013"}
{"reviewerID": "A2SSZYR6P60UWF", "asin": "0000202010", "reviewerName": "Mike Irving", "helpful": [0, 0], "reviewText": "Long time L & H fan. I tend to buy anything about these two heros. Is small but not disappointing", "overall": 5.0, "summary": "Another fine book", "unixReviewTime": 1367625600, "reviewTime": "05 4, 2013"}
{"reviewerID": "A2WE6C7MXY3W8E", "asin": "0000230022", "reviewerName": "Ann Snelling", "helpful": [0, 0], "reviewText": "The story of Johnny the Bagger is a must-read! It has been months since I first read the book but regularly think about the principle of customer service conveyed by Johnny. The story clearly demonstrates that anyone, regardless of physical limitation, can do something memorable and creative to provide  great customer service. What a fabulous example in this story.", "overall": 5.0, "summary": "Simple Truths of Service: Inspired by Johnny the Bagger", "unixReviewTime": 1296259200, "reviewTime": "01 29, 2011"}
{"reviewerID": "A17E59HH7IE1GE", "asin": "0000230022", "reviewerName": "Bruce A. Burnett", "helpful": [6, 7], "reviewText": "THIS IS A SIMPLE VERY POWERFUL BOOK. ANYONE WHO IS IN CUSTOMER SERVICE NEEDS TO READ THIS BOOK !!! SHOULD BE #1 ON THE BEST SELLERS LIST!!!!", "overall": 5.0, "summary": "the simple truths of service", "unixReviewTime": 1181260800, "reviewTime": "06 8, 2007"}
{"reviewerID": "ATK5NG3C5X2II", "asin": "0000230022", "reviewerName": "Christopher Kim", "helpful": [0, 0], "reviewText": "This book is so worth the price! It may look small and short but it contains a lot of information. It takes about 30-90 minutes to read (depends on reading speed), and it doesn't matter whether you work in retail or corporate office. Everyone needs to read this for a simple, easy to understand method of what service means. I purchased multiple copies for my businesses so everyone can read.", "overall": 5.0, "summary": "Necessary for Everyone", "unixReviewTime": 1367971200, "reviewTime": "05 8, 2013"}
{"reviewerID": "A3OOEN7PVHCKLJ", "asin": "0000230022", "reviewerName": "Donie Wiley", "helpful": [0, 0], "reviewText": "Shows the real possibility and potential within all of us to make a difference to the customers we serve - if that is important to us and our business.  Based on a true story, make sure you get the version with the DVD.", "overall": 5.0, "summary": "Excellent Customer Service Parable/Didactic", "unixReviewTime": 1358812800, "reviewTime": "01 22, 2013"}
{"reviewerID": "AYQGXWZP7S2G", "asin": "0000230022", "reviewerName": "Douglas N. Petersen", "helpful": [2, 3], "reviewText": "How soon we forget that our purpose on earth is to serve others. In serving others, we in turn will be served. We all need to practice Johnny's dedication to others. Read this book and you will see the world differently.", "overall": 5.0, "summary": "Inspiring!!", "unixReviewTime": 1296259200, "reviewTime": "01 29, 2011"}
{"reviewerID": "A38AAPXSJN4C5G", "asin": "0000230022", "reviewerName": "Edward J. Barton", "helpful": [0, 0], "reviewText": "This is an inspiring little book. The premise of giving great service includes the emotional component to lead with the heart - to personalize the service experience in such a way as to make it both extraordinary and impossible to duplicate.  Out your personal signature on every job, make your customer remember you, and do it in such a way that it is truly from the heart.  Inspired and inspiring!", "overall": 5.0, "summary": "Inspired and Inspiring", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}
{"reviewerID": "A120FP8P2BV153", "asin": "0000230022", "reviewerName": "Sandie", "helpful": [0, 0], "reviewText": "Simple Truths of Service is awesome! Very informative about doing service with some suggestions. The DVD Jonny the Bagger just made me cry. I would hope everyone would read this book and view the DVD about customer service.", "overall": 5.0, "summary": "Simple Truths of Service: Inspirted by Jonny the Bagger", "unixReviewTime": 1335312000, "reviewTime": "04 25, 2012"}
{"reviewerID": "A2XFM8PN6G0B02", "asin": "0000230022", "reviewerName": "S. J Parker", "helpful": [0, 0], "reviewText": "Practical, common sense book on service in business.  To bad so many of us don't have common sense, in business & focus only on the bottom line.\"These stories of extraordinary service provide a tool kit for success, no matter what one's position in life may be.\"  Bob Danzig, former CEO, Hearst Newspapers\"This book offers practical, usable and critical advice for all organizations through real life stories about how tyhe power of service can impact customer loyalty.\"  C. Manly Molpus, President and CEO, Grocery Manufacturers of AmericaWant a healthy bottom line?  Give your customers great service.  Want to know how?  Read this book.\"  Harvey Makay, Author of Swim with the Sharks without being eaten alive.", "overall": 5.0, "summary": "Book includes a DVD", "unixReviewTime": 1252540800, "reviewTime": "09 10, 2009"}
{"reviewerID": "AFQUVVVDRNXEJ", "asin": "0000230022", "reviewerName": "Steven Byrd", "helpful": [0, 0], "reviewText": "This is a short read, it took me at most an hour. It has valuable nuggets of wisdom and a very touching story about Jonny the Bagger. Simple truth: go the extra mile and it will pay off.", "overall": 5.0, "summary": "Insightful Book", "unixReviewTime": 1332892800, "reviewTime": "03 28, 2012"}
{"reviewerID": "ATYD7UJKRFEFU", "asin": "0000230022", "reviewerName": "Tutu", "helpful": [0, 1], "reviewText": "Received the book very promptly and, although used, it was in great condition.  Thank you.", "overall": 5.0, "summary": "Excellent service.  Good product.", "unixReviewTime": 1283212800, "reviewTime": "08 31, 2010"}
{"reviewerID": "A913X3CZ55YAA", "asin": "0000401048", "reviewerName": "Jack Of Alltrades \"Just another soul\"", "helpful": [0, 0], "reviewText": "GREAT BOOK BY THE BLACK SHEEP OF THE PUBLISHING CLAN. AS A SMALL PUBLISHER MYSELF I FOUND IT FASCINATING READING ABOUT THE EXPERIENCES OF A MAN IN MY BUSINESS HALF A CENTURY EARLIER. A CANDID LOOK AT A SEAMY BUSINESS.", "overall": 5.0, "summary": "VANITY PUBLISHER SPEAKS", "unixReviewTime": 1132963200, "reviewTime": "11 26, 2005"}
{"reviewerID": "A35OP02LIXZ84E", "asin": "0000477141", "reviewerName": "renaldoc39 \"AKK\"", "helpful": [0, 0], "reviewText": "Waste of money on this! Did not work! MP3 should normally work but may have been used prior. I would not buy unless it is sealed!", "overall": 1.0, "summary": "Did not work!", "unixReviewTime": 1399939200, "reviewTime": "05 13, 2014"}
{"reviewerID": "A2LI5026JCXQBA", "asin": "000047715X", "reviewerName": "ABDUL J. KIRBIT", "helpful": [0, 0], "reviewText": "If you are like me, a person who understand more by listening , this is a good resource for you . The faculty that are giving the didactic sessions are phenomenal .", "overall": 4.0, "summary": "Knowladge is power", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "A2CAVTNQA2Y3IJ", "asin": "000047715X", "reviewerName": "Joseph S. Pina", "helpful": [2, 2], "reviewText": "Very thorough review of MKSAP and a great companion to the text (book or online), especially if you like to review material in different formats.  There are a lot references to the tables and figures that require you to go back to the book or the online version, so it is definitely not complete. But I like the discussion. Too many bad jokes, some are borderline and probably inappropriate, but a few are harmless and amusing. A classmate of mine does a great job with one of the sessions.", "overall": 5.0, "summary": "Very thorough review of MKSAP and a great companion to the text (book or online)", "unixReviewTime": 1384560000, "reviewTime": "11 16, 2013"}
{"reviewerID": "A2685NTFXLJJ1T", "asin": "000047715X", "reviewerName": "Neena Chaturvedi", "helpful": [2, 3], "reviewText": "This is a great product; I can listen to it anytime I want: during walks, exercises, driving. Good speakers. Love it", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1377475200, "reviewTime": "08 26, 2013"}
{"reviewerID": "A17TBLPM7H401J", "asin": "000047715X", "reviewerName": "Pen", "helpful": [3, 3], "reviewText": "Awesome videos by MKSAP. Content is covered comprehensively and is very well organized. Really enjoyed them and would recommend them strongly.", "overall": 4.0, "summary": "Awesome videos by MKSAP", "unixReviewTime": 1374364800, "reviewTime": "07 21, 2013"}
{"reviewerID": "A3NMH1KTLG7CWX", "asin": "000047715X", "reviewerName": "Rochelle Hammett", "helpful": [0, 0], "reviewText": "My items arrived expeditiously. I was so excited when I saw that the seller included extras.  I love the practice tests and the videos.  I haven't taken the boards yet but this is a good prep so far.", "overall": 5.0, "summary": "Excellent Seller", "unixReviewTime": 1398816000, "reviewTime": "04 30, 2014"}
{"reviewerID": "AHNMXYVRDN1R9", "asin": "000047715X", "reviewerName": "thettl1984", "helpful": [1, 1], "reviewText": "CDs have no scratch. The product is exactly what is being said. 100% satisfied with purchase.Truly recommend it for those who want to learn during commute.", "overall": 5.0, "summary": "Totally love it!!!", "unixReviewTime": 1394323200, "reviewTime": "03 9, 2014"}
{"reviewerID": "A3CWYYP3IITCDP", "asin": "0000619574", "reviewerName": "Biblereader \"Romans 10:9-13\"", "helpful": [0, 0], "reviewText": "Cute reading.  A lot of old-timey types of situations, and some politically incorrect stories, too.  (which is ok by me)", "overall": 3.0, "summary": "Ladie's Old Fashioned stories", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "A22RY8N8CNDF3A", "asin": "000077135X", "reviewerName": "Loyd E. Eskildson \"Pragmatist\"", "helpful": [1, 2], "reviewText": "'Why Abundant Oil Hasn't Cut Gasoline Prices' tells us that for the first time since 1995, the U.S. will likely produce more oil than it imports; meanwhile, fuel consumption has fallen 16% below its 2007 peak. Most of the new product comes from places like North Dakota, Wyoming, and Oklahoma - far from refining hubs. Limited pipeline capacity forces moving the product on barges and trains, adding up to $17/barrel. The Jones Act further complicates transport within the U.S. Thus, it is often cheaper for Gulf Coast refiners to send gas to Brazil instead of N.Y.C. At the same time, refiners are required to blend 13.8 billion gallons of ethanol into fuel sold domestically - about 400 million gallons more than needed, thereby requiring the purchase of credits (now 66 cents/gallon) that also add costs.'What Good Are Low Prices if the Shelves Are Empty' says Wal-Mart has added 455 stores (13%) in the last five years, while the number of employees in the U.S. is down 1.4%. Wal-Mart has been last in the American Customer Satisfaction Index for department and discount stores for six years running.'Think Colossal' reports Samsung accounts for 17% of South Korea's GDP, while employing 370,000 worldwide. Electronics is the largest Samsung component, others range from insurance, shipbuilding, construction, appliances, and textiles. The first step in moving into new categories is to start small - eg. making a key component for the industry, ideally something costly to manufacture (less competition). This also gives Samsung managers insight into the target industry. Samsung spent $21.5 billion in capital expenditures last year for its electronics division, double that of Apple. The company was founded in 1938 by the father of its current CEO. Sansung produced 400 million cell phones in 2012; assembly takes place in cells (not using assembly lines) and is completed by an individual. In 2011 Samsung announced its intent to spend $20 billion by 2020 to develop proficiencies in medical devices, solar panels, LED lighting, biotech, and electric car batteries.", "overall": 5.0, "summary": "Well Worth Reading -", "unixReviewTime": 1365033600, "reviewTime": "04 4, 2013"}
{"reviewerID": "A3S1YQA5N7DWGD", "asin": "0000913154", "reviewerName": "Bay Bridge Sue \"junior executive troublemaker\"", "helpful": [0, 0], "reviewText": "I received this as a gift from my parents when I was 8 (and the book was new).  It literally changed my entire way of thinking about things, my thought processes, and made such a huge difference in my life path I cannot explain it.  MANY nights with a flashlight under the covers were spent with this fascinating book...  It really needs to be republished.", "overall": 5.0, "summary": "This will change the life of a child!", "unixReviewTime": 1389398400, "reviewTime": "01 11, 2014"}
{"reviewerID": "A916XU83L54V6", "asin": "0000913154", "reviewerName": "Daniel D Uniatowski", "helpful": [0, 0], "reviewText": "Product was just as described.  No issues.  Quick shipment.  Not much more to say. A+ + + + + +", "overall": 5.0, "summary": "Product was just as described.  No issues.  Quick shipment.  Not much more to say. A+ + + + + +", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
{"reviewerID": "A3IKTM9D8RVWKU", "asin": "0000913154", "reviewerName": "Darrin Rice \"HKMk23\"", "helpful": [10, 12], "reviewText": "A classic!My Father bought this book new and, as a boy, I spent hours poring over the process diagrams, reading the text and connecting one with the other, the wheels turning in my mind, gradually unlocking the mysteries of technology.  I found that having one process explained often spurred curiosity in another up- or down-stream process that was, in turn, explained in the book.  Thus, a caveat:  DO NOT pick up this book intending to &quot;just take a quick look at something&quot;.  That isn't going to happen; at least not until you know enough to have written it yourself.Whether you are a working professional or student seeking an overview, a technically-minded child or adult broadening your knowledge, or simply a curious but casual reader, this book is highly recommended.  Much of it remains valid, despite it's age.", "overall": 5.0, "summary": "A Primer on Processes", "unixReviewTime": 1026259200, "reviewTime": "07 10, 2002"}
{"reviewerID": "AP25VUIFDC582", "asin": "0000913154", "reviewerName": "Litsios James", "helpful": [1, 1], "reviewText": "These were my favorite books when I was about ten years old. I read them and reread them until \"I knew\" how all those \"things\" worked! They are worn and a little dirty now but I still cherish them. Sadly they are showing their age: the focus of the text and the drawing slowly diverges from what is now relevant. Nevertheless, their crisp industrial focus still shines through, and still gives these books their beauty.", "overall": 5.0, "summary": "Showing their age but still beautiful books", "unixReviewTime": 1219449600, "reviewTime": "08 23, 2008"}
{"reviewerID": "A22B03O2LPMJVU", "asin": "0000913154", "reviewerName": "mckoyk@trmnj.com", "helpful": [6, 6], "reviewText": "The Way Things Work is an illustrated volume that is essential for a well-stocked reference library.  From the juke box to the diesel engine, the easy-to-understand descriptions and drawings explain to everyone exactly how and why things work the way they do.  Hundreds of items are included allowing quick checks of whatever subject happens to come up at home or the office.", "overall": 5.0, "summary": "Required reference book for the layman", "unixReviewTime": 876182400, "reviewTime": "10 7, 1997"}
{"reviewerID": "A2SLVVXPRB60JC", "asin": "0000913154", "reviewerName": "\"mymantra\"", "helpful": [12, 12], "reviewText": "One of a kind book that still has not been duplicated.The use of 2-color drawings only forces a precision and clarity of communication that tends to get lost in the hype of our multimedia world.  Perhaps the Germanic minimalism in the Bauhaus tradition.I still refer to it even though most of the &quot;state of the art&quot; in this book was mid-1960s.  This book fills in alot of the &quot;technology infrastructure&quot; and supply chain networks that are essential to end products people actually see.I would love to see this book brought back to print with new updated information.  Keep exactly the same style: left page of text, right page of 2-color diagrams, one thought per page pair. The format is thoroughly modern in the sense that the content is perfectly suited to internet-centered presentation.  You can enter the book at any page and pick up a self-contained piece of knowledge.  Very web-like.", "overall": 5.0, "summary": "A classic book on technology", "unixReviewTime": 974592000, "reviewTime": "11 19, 2000"}
{"reviewerID": "A18F3K8ZJR2VD0", "asin": "0000913154", "reviewerName": "Rhalellan", "helpful": [1, 1], "reviewText": "My father had this set of books and any time I had a question he would direct me to them. Now I have my own set and can look up any question I may have!!", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1266969600, "reviewTime": "02 24, 2010"}
{"reviewerID": "A28X5I7TL8BAOH", "asin": "0000913154", "reviewerName": "Roscoe Joiner", "helpful": [2, 3], "reviewText": "This book, along with Volume 2, provides a clearly understandable explanation of industrial processes that pre-digital 20th century western civilization depended upon. Every entry carries a modestly detailed text explaining the process and at least one full page of step-by-step graphical illustrations. If we ever needed to rebuild society, this would be a starting point reference book. Also, if you're a high school student in need of an understanding of Industry-Commerce-Law, then time spent with the two volumes of the set will be well invested. Impress your guidance counselor and college interviewers along the way!", "overall": 5.0, "summary": "A Primer on Basic Industry", "unixReviewTime": 1319328000, "reviewTime": "10 23, 2011"}
{"reviewerID": "A1CP960DFEHZ5H", "asin": "000100039X", "reviewerName": "Adahae Guadagni \"Yogi Bear\"", "helpful": [0, 0], "reviewText": "The Prophet is a timeless piece, and it speaks for itself.  The profound messages are written so poetically and gracefully they resonate much deeper than dry philosophy.  Once you read it, you'll never want to lose this book.", "overall": 5.0, "summary": "Classic", "unixReviewTime": 1400198400, "reviewTime": "05 16, 2014"}
{"reviewerID": "A10000012B7CGYKOMPQ4L", "asin": "000100039X", "reviewerName": "Adam", "helpful": [0, 0], "reviewText": "Spiritually and mentally inspiring! A book that allows you to question your morals and will help you discover who you really are!", "overall": 5.0, "summary": "Wonderful!", "unixReviewTime": 1355616000, "reviewTime": "12 16, 2012"}
{"reviewerID": "A2S166WSCFIFP5", "asin": "000100039X", "reviewerName": "adead_poet@hotmail.com \"adead_poet@hotmail.com\"", "helpful": [0, 2], "reviewText": "This is one my must have books. It is a masterpiece of spirituality. I'll be the first to admit, its literary quality isn't much. It is rather simplistically written, but the message behind it is so powerful that you have to read it. It will take you to enlightenment.", "overall": 5.0, "summary": "close to god", "unixReviewTime": 1071100800, "reviewTime": "12 11, 2003"}
{"reviewerID": "A1BM81XB4QHOA3", "asin": "000100039X", "reviewerName": "Ahoro Blethends \"Seriously\"", "helpful": [0, 0], "reviewText": "This book provides a reflection that you can apply to your own life.And, a way for you to try and assess whether you are truly doing the right thing and making the most of your short time on this plane.", "overall": 5.0, "summary": "Must Read for Life Afficianados", "unixReviewTime": 1390003200, "reviewTime": "01 18, 2014"}
{"reviewerID": "A2MKF9WWPC181T", "asin": "000100039X", "reviewerName": "A. Jones", "helpful": [0, 0], "reviewText": "...might not agree with every idea, but the writing is hauntingly beautiful and nostalgic. Read it outdoors under a tree in the fall or spring. Read it aloud. Enjoy.", "overall": 5.0, "summary": "Beautiful", "unixReviewTime": 1345939200, "reviewTime": "08 26, 2012"}
{"reviewerID": "A1MOSTXNIO5MPJ", "asin": "000100039X", "reviewerName": "Alan Krug", "helpful": [0, 0], "reviewText": "I first read THE PROPHET in college back in the 60's. The book had a revival as did anything metaphysical in the turbulent 60's. It had a profound effect on me and became a book I always took with me. After graduation I joined the Peace Corps and during stressful training in country (Liberia) at times of illness and the night before I left, this book gave me great comfort. I read it before I married, just before and again after my children were born and again after two near fatal illnesses. I am always amazed that there is a chapter that reaches out to you, grabs you and offers both comfort and hope for the future.Gibran offers timeless insights and love with each word. I think that we as a nation should read AND learn the lessons here. It is definitely a time for thought and reflection this book could guide us through.", "overall": 5.0, "summary": "Timeless for every good and bad time in your life.", "unixReviewTime": 1317081600, "reviewTime": "09 27, 2011"}
{"reviewerID": "A2XQ5LZHTD4AFT", "asin": "000100039X", "reviewerName": "Alaturka", "helpful": [7, 9], "reviewText": "A timeless classic.  It is a very demanding and assuming title, but Gibran backs it up with some excellent style and content.  If he had the means to publish it a century or two earlier, he could have inspired a new religion.From the mouth of an old man about to sail away to a far away destination, we hear the wisdom of life and all important aspects of it.  It is a messege.  A guide book.  A Sufi sermon. Much is put in perspective without any hint of a dogma.  There is much that hints at his birth place, Lebanon where many of the old prophets walked the Earth and where this book project first germinated most likely.Probably becuase it was written in English originally, the writing flows, it is pleasant to read, and the charcoal drawings of the author decorating the pages is a plus.  I loved the cover.", "overall": 5.0, "summary": "A Modern Rumi", "unixReviewTime": 1033948800, "reviewTime": "10 7, 2002"}
{"reviewerID": "A1K0SULL2SYD4S", "asin": "000100039X", "reviewerName": "Alese E. Brandt", "helpful": [2, 4], "reviewText": "The book itself is good - but unhappy as I paid for a new copy of the book and as I was looking through it I had been written in and I see it is a used copy so???? I am glad I did not send it as gift to someone.", "overall": 4.0, "summary": "the prophet by kahlil gibran", "unixReviewTime": 1267142400, "reviewTime": "02 26, 2010"}
{"reviewerID": "A3PRJTA493R8ZW", "asin": "000100039X", "reviewerName": "Alexander J Hakim", "helpful": [1, 1], "reviewText": "Terrific and very deep and meaningful. Fabulous reading. Gibran ya Gibran Lebanon honors you and the Lebanese love you Habibi", "overall": 5.0, "summary": "There is only one Gibran Khalil Gibran", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A3V1MKC2BVWY48", "asin": "000100039X", "reviewerName": "Alex Dawson", "helpful": [0, 0], "reviewText": "Reading this made my mind feel like a still pool of water, cool and quiet in a mossy grotto.  It's direct and simple wisdom has a depth of complexity that takes a quiet day to sink in, leaving you at peace.  It is best to set time aside for it, relax, absorb, and let it softly clear your mind.", "overall": 5.0, "summary": "This book will bring you peace", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A12387207U8U24", "asin": "000100039X", "reviewerName": "Alex", "helpful": [0, 0], "reviewText": "As you read, Gibran's poetry brings spiritual and visual beauty to life within you. Gibran is justly famous for rich metaphors that brilliantly highlight the pursuit of Truth and Goodness amidst all the darkness and light of human nature.", "overall": 5.0, "summary": "Graet Work", "unixReviewTime": 1206662400, "reviewTime": "03 28, 2008"}
{"reviewerID": "A1SGX7ZTFNRY59", "asin": "000100039X", "reviewerName": "Alfredo Reyes", "helpful": [2, 2], "reviewText": "\"The Prophet\" is a powerful book of topical wisdom by Lebanese author and poet Khalil Ghibran. The book begins when a fictional prophet arrives mysteriously by ship and is taken in by a group of people who he remains among for several years. Before he leaves, he wants to thank them for their kindness but has nothing to give, so he gathers the people together and answers their questions with his wisdom on various aspects of life. The premise is similar to that of the Tao Te Ching and Lao Tzu imparting his wisdom to a guard. Every chapter is beautifully written in simple yet profound prose. Balance and the oneness of life are big themes. Ghibran is so artful in his use of metaphors and doesn't waste a single word. If ever there were a great gift book, this is one. I think it's a classic that everyone should read once but most will find themselves returning to many times over the years.", "overall": 5.0, "summary": "Ghibran's Masterpiece...", "unixReviewTime": 1298764800, "reviewTime": "02 27, 2011"}
{"reviewerID": "AL91K8JCKOXDT", "asin": "000100039X", "reviewerName": "Alice \"Barn Goddess\"", "helpful": [1, 1], "reviewText": "I have been reading and re-reading Kahlil Gibran for 34 years now. The Prophet is my favorite book of all time. It touches a piece of the spirit within all of us that is not connected to any particular religion yet speaks from - and to - all of them. The Prophet is masterfully insightful, poignant, and timeless. I gave a copy to each of my grown sons and hope they find as much insight in it as I have all these years. In fact, I chose the essay on children to read during the Unity Candle ceremony at my son's wedding. It was a beautiful, perfect passage for such a powerful moment! The essays in this book speak to every facet of life as a human being, ever inspiring the reader to remember his or her connection to the infinite. The artwork is exquisite! Give a copy to someone you love - then read it with them!", "overall": 5.0, "summary": "Touches the spirit within", "unixReviewTime": 1201564800, "reviewTime": "01 29, 2008"}
{"reviewerID": "A2E2F4MLVYDGEQ", "asin": "000100039X", "reviewerName": "Allie", "helpful": [2, 2], "reviewText": "This is riddled with glaring typos. Very disappointing, because I really enjoyed this book in paper form before. I found this version unacceptable.", "overall": 1.0, "summary": "Great book, but ebook has errors", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A29TRDMK51GKZR", "asin": "000100039X", "reviewerName": "Alpine Plume", "helpful": [0, 0], "reviewText": "Deep, moving dramatic verses of the heart and soul.Truths of  ancient wisdom from a true and romantic poet.Relevant for all eternity.", "overall": 5.0, "summary": "Such Beauty", "unixReviewTime": 1383436800, "reviewTime": "11 3, 2013"}
{"reviewerID": "A3FI0744PG1WYG", "asin": "000100039X", "reviewerName": "Always Reading \"tkm\"", "helpful": [0, 0], "reviewText": "This is a timeless classic.  Over the years I've given it as a gift more times than I can count, and will continue to do so.  Addresses real life issues in a beautiful way and makes us reexamine our own attitude about how we see what happens in our lives.  So easy to read over and over.", "overall": 5.0, "summary": "The Prophet", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A1ESQ3ZLSD5WJQ", "asin": "000100039X", "reviewerName": "Amazon Customer \"big computer geek\"", "helpful": [1, 4], "reviewText": "I've always loved The Prophet and I've read it many times. I gave away my last copy and was looking for a replacement. I purchased this copy only to find that it was a tiny novelty version of the book. If you're looking for something tiny to keep in your purse then this is for you. If you're looking for a \"real book\" then this is a joke.", "overall": 2.0, "summary": "If you're looking for a tiny printed novelty you'll love this", "unixReviewTime": 1314144000, "reviewTime": "08 24, 2011"}
{"reviewerID": "A873MY9QLQLJR", "asin": "000100039X", "reviewerName": "Amazon Customer \"Creative Being\"", "helpful": [2, 2], "reviewText": "I was introduced to Gibran by my husband on my birthday years ago.  Since that time, Gibran has helped me in many of lifes trying times.  My favorite passage is by and far his writings on Children.  How many times during the 'teenage' years of raising my son, did I turn to his reminders on how to be a good 'bow' I don't know, but it was invaluable help.  I give this book to graduates, friends who have everything, friends who have nothing after a trauma in their lives, there really isn't any opporunity that I pass up to give this book as a gift with a message included that I hope that they can find as much in this book as I have.  Don't try to read it as a 'book',it's able to be read from any point and any topic that strikes your fancy.  And by all means go back and re-read.  You will find new and fuller meanings with every reading.", "overall": 5.0, "summary": "Gibran Rox!", "unixReviewTime": 1213747200, "reviewTime": "06 18, 2008"}
{"reviewerID": "A2LBBQHYLEHM7P", "asin": "000100039X", "reviewerName": "Amazon Customer \"Full Frontal Nerdity\"", "helpful": [0, 0], "reviewText": "An amazing work. Realizing extensive use of Biblical imagery and sentence structure, &#34;The Prophet&#34; by Khalil Gibran is a literary classic. Influencing the Free Love movement of the 1960's, Gibran's master work explores themes of love, longing and loss.", "overall": 5.0, "summary": "A Modern Classic", "unixReviewTime": 1379808000, "reviewTime": "09 22, 2013"}
{"reviewerID": "A1340OFLZBW5NG", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I LOVE this book... his writing seems to just flow from page to page. I get something different from this book each time I read it..", "overall": 5.0, "summary": "Perhaps the greatest book that I have ever read", "unixReviewTime": 1231977600, "reviewTime": "01 15, 2009"}
{"reviewerID": "A3W2IVR69VGG6U", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "The product came in good quality, on time, and just a described.  Kahlil Gibran is a great author and The prophet is one of my favorite reads.", "overall": 4.0, "summary": "Good quality", "unixReviewTime": 1372636800, "reviewTime": "07 1, 2013"}
{"reviewerID": "A2KU9IU07LOJS1", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "This book has been a classic for many years. It has so much wisdom in it that it can be read numerous times and new things will come out each time. My favorite chapter is the one on children.", "overall": 5.0, "summary": "Great classic that everyone should read", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A2WVHIRDMLM82E", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "This book has so much you can take out of it to use in your real life. Amazing, and one of my favorite reads of all time.", "overall": 5.0, "summary": "Amazing", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"}
{"reviewerID": "A2I35JB67U20C0", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "When I was in college in the 70's this book had a revival and I did not read it then.  Recently a friend (who is 90) and I were talking about work and she said: &quot;work is love made visible,&quot; and told me it was from the Prophet.  I though that was so beautiful I got the book and was not disappointed.You see, if you have ideas and you do not realize them, then they are nothing, and if your ideas do not come from love and joy, then they are bitter and what they produce will be bitter, but if they flow from love and joy, then their realization will be love and joy, thus work is love made visible.He says it WAY better that I do and says much more in just a few paragraphs.  But as you can see from the example, what he says is not religious, but positive ways of looking at things.  Since I rediscoverd the book I have given away many copies and everyone I have given it to sincerly thanked me.", "overall": 5.0, "summary": "Everyone should have this book", "unixReviewTime": 983318400, "reviewTime": "02 28, 2001"}
{"reviewerID": "A27X0K0PTU3W7R", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [0, 1], "reviewText": "I read The Prophet years ago as a freshman college student & wished I'd read it in high school.The lessons in this book can really positively impact the life of a teen or young person.I've found another book that is geared towards young people that also gets this same message across, in an epic adventure way that teens like.The Prophetic Tales of No Child Left Behind[...]I stumbled across this book & decided to buy it for a niece that's a senior in high school. Its very rough, with some errors but the impact it had on her life, was similar to the impact The Prophet had on mine. If you like Kahlil Gibran, I think you could appreciate this also.", "overall": 5.0, "summary": "Excellent for teens & Young adults", "unixReviewTime": 1301616000, "reviewTime": "04 1, 2011"}
{"reviewerID": "A19N3FCQCLJYUA", "asin": "000100039X", "reviewerName": "Amazon Customer", "helpful": [1, 1], "reviewText": "I discovered The Prophet fifty years ago in college and have read it dozens of times since then.  Now, in addition to my beat up hard copy, I have a portable e-copy.  If you were looking for an example of an intelligently designed (pun intended) book of spiritual guidance, this would be it.  It doesn't care how you picture, name or define &#34;God&#34; or whether you give him a gender and a personality.  It just cuts to the heart of how to live and how to relate to others.  If Jesus and the Buddha teamed up to write a book, it might come out like this.When I first read it, I found some passages difficult to grasp.  Looking back, I now think that it was not because they were hard to understand, but because I did not want to hear gently spoken, intelligently phrased ideas that contradicted my own.  Now, if I could have only one book, this would probably be it.", "overall": 5.0, "summary": "A book everyone &#34;should&#34; read", "unixReviewTime": 1358899200, "reviewTime": "01 23, 2013"}
{"reviewerID": "A3079HWOKNBQR8", "asin": "000100039X", "reviewerName": "Amazon Customer \"sewing club\"", "helpful": [0, 4], "reviewText": "the excellent condition and speedy receipt of this product will always encourage me to purchase items from Amazon and their providers.WONDERFUL!!!!!!!", "overall": 5.0, "summary": "excellent service", "unixReviewTime": 1236902400, "reviewTime": "03 13, 2009"}
{"reviewerID": "A1G67VMMUNDWRH", "asin": "000100039X", "reviewerName": "Amira Ahmed", "helpful": [2, 4], "reviewText": "It was my mistake to assume the book would come with a book jacket, which it didn't despite the picture of it. However, pages are intact and came in decent condition.", "overall": 4.0, "summary": "The Prophet", "unixReviewTime": 1246665600, "reviewTime": "07 4, 2009"}
{"reviewerID": "A3FFNE1DR5SI1W", "asin": "000100039X", "reviewerName": "A. Morelli", "helpful": [1, 1], "reviewText": "Can't say enough about Kahlil Gibran's work among this piece. Everybody in the whole world should read this! There is almost too much to take in, really appreciate and put towards our daily lives. In my opinion, it is just one of the most beautiful literature pieces ever written. Would recommend to as a gift for anyone spiritual/poetic/philosophy/educational piece or just something to enjoy here and there. 5 stars for sure!", "overall": 5.0, "summary": "phenomenal piece of literature!", "unixReviewTime": 1340755200, "reviewTime": "06 27, 2012"}
{"reviewerID": "AK0FI0VIKMXH9", "asin": "000100039X", "reviewerName": "Andrew K", "helpful": [0, 0], "reviewText": "I don't usually read for pleasure, in fact this book took me a month to finish because i read it so sporadically, but it was an easy read and a rather short book, very rich and quite honestly an example of getting more enlightenment from less text than most other books.", "overall": 5.0, "summary": "Great book", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A1JO576QRW9E0G", "asin": "000100039X", "reviewerName": "angelady", "helpful": [0, 0], "reviewText": "I have always loved this book and had misplaced my original copy so I was happy to get it again.", "overall": 5.0, "summary": "Well received", "unixReviewTime": 1393545600, "reviewTime": "02 28, 2014"}
{"reviewerID": "A1BQ7T9J84GDOJ", "asin": "000100039X", "reviewerName": "Anna B. Conley", "helpful": [0, 0], "reviewText": "i like everything Kahill writes.  it touches me and i feel it is so out of this world and yet apart of it as well", "overall": 5.0, "summary": "he is the best", "unixReviewTime": 1353283200, "reviewTime": "11 19, 2012"}
{"reviewerID": "A5JX4FNFLFJUP", "asin": "000100039X", "reviewerName": "Anna Davidson", "helpful": [1, 1], "reviewText": "This version of Khalil Gibran's book is a beautiful work and one I often give as a gift. The complementary artwork is fantastic. One of the most moving books I've read", "overall": 5.0, "summary": "Classic & Beautiful Work of Literature", "unixReviewTime": 1335744000, "reviewTime": "04 30, 2012"}
{"reviewerID": "A3A3NZIAJX30TU", "asin": "000100039X", "reviewerName": "Annie Laurie Haris", "helpful": [1, 1], "reviewText": "In my opinion, this is a Classic worth reading again and again!  Comfort and life's important lessons can be learned again and again.  I've read this book many times and  will continue  to do so.", "overall": 5.0, "summary": "An Old Favorite", "unixReviewTime": 1393891200, "reviewTime": "03 4, 2014"}
{"reviewerID": "A1TT4CY55WLHAR", "asin": "000100039X", "reviewerName": "anonymous", "helpful": [0, 0], "reviewText": "I have the 1972 version, bought in 1974. The 1972 version originally had a dust jacket but my dust jacket is long gone. This particular rendition has had many re-printings, for a reason: it's very popular. The textured paper, old-style typography, and leather cover are better than a plain-old paperback. The size is diminutive, which is perfect for this book.", "overall": 5.0, "summary": "textured paper, old-style typography, and leather cover", "unixReviewTime": 1342396800, "reviewTime": "07 16, 2012"}
{"reviewerID": "A2ANKX9F6UAOZB", "asin": "000100039X", "reviewerName": "A. Novak", "helpful": [0, 0], "reviewText": "My friend recommended this book, she said she had read it as a young girl and it made an impression. So I bought it for my son.  I read it and loved it.  The way the book is written is so sweet and beautiful. The explanation to lives basic spiritual rules are poetry.I loved it!!", "overall": 5.0, "summary": "I love this little book!", "unixReviewTime": 1314921600, "reviewTime": "09 2, 2011"}
{"reviewerID": "A1TA5SEXDFJRGK", "asin": "000100039X", "reviewerName": "Anthony J. Sciolino", "helpful": [1, 16], "reviewText": "i ordered only one book, to be sent to my \"giftee's\" address, but was sent two books, one as a gift, and one to my residence.  When I tried to stop it, it was too late, as it was already into shipping mode.", "overall": 5.0, "summary": "The Prophet", "unixReviewTime": 1127433600, "reviewTime": "09 23, 2005"}
{"reviewerID": "A2TVM0ZZZWRK11", "asin": "000100039X", "reviewerName": "Anthony Lanzano (alanzano@na2.us.ml.com", "helpful": [0, 0], "reviewText": "Gibran releases himself in this amazing, driven insight to the human  experience.  A definite must for those who enjoy life!!", "overall": 5.0, "summary": "Do you really know about the mind and soul?", "unixReviewTime": 905299200, "reviewTime": "09 9, 1998"}
{"reviewerID": "A3NAWI4L7ZBPJO", "asin": "000100039X", "reviewerName": "anti-jihad texan", "helpful": [0, 1], "reviewText": "Since I absolutely loved this book while in high school, I gave copies to each of my daughters.  The beauty of these written words is difficult to describe and a must read.", "overall": 4.0, "summary": "A gift to both my children", "unixReviewTime": 1243728000, "reviewTime": "05 31, 2009"}
{"reviewerID": "A2X4HE21JTAL98", "asin": "000100039X", "reviewerName": "Antiquarian", "helpful": [3, 5], "reviewText": "Anything I've read by Gibran is, in my mind, flawless. This, the most famous of his works, is no exception. It is simple, yet deep; honest and profound; moving and inspirational. Gibran's work is one of a kind, and can be far more encouraging and moving than any self-help program or therapy or anything like that. The poetic style, the aphorisms, the parables, the almost biblical feel, are all just what over-worked, over-stressed, modern and spiritually starved worldly people need.", "overall": 5.0, "summary": "Flawless", "unixReviewTime": 1132099200, "reviewTime": "11 16, 2005"}
