{"overall": 5.0, "verified": true, "reviewTime": "03 11, 2013", "reviewerID": "A3478QRKQDOPQ2", "asin": "0001527665", "style": {"Format:": " VHS Tape"}, "reviewerName": "jacki", "reviewText": "really happy they got evangelised .. spoiler alert==happy ending liked that..since started bit worrisome... but yeah great stories these missionary movies, really short only half hour but still great", "summary": "great", "unixReviewTime": 1362960000}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "02 18, 2013", "reviewerID": "A2VHSG6TZHU1OB", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Ken P", "reviewText": "Having lived in West New Guinea (Papua) during the time period covered in this video, it is realistic, accurate, and conveys well the entrance of light and truth into a culture that was for centuries dead to and alienated from God.", "summary": "Realistic and Accurate", "unixReviewTime": 1361145600}
{"overall": 5.0, "verified": false, "reviewTime": "01 17, 2013", "reviewerID": "A23EJWOW1TLENE", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Reina Berumen", "reviewText": "Excellent look into contextualizing the Gospel and God's sovereignty over cultural barriers. The book and movie are both captivating. I would definitely recommend to both Christians and non-believers.", "summary": "Peace Child", "unixReviewTime": 1358380800}
{"overall": 5.0, "verified": true, "reviewTime": "01 10, 2013", "reviewerID": "A1KM9FNEJ8Q171", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "N Coyle", "reviewText": "More than anything, I've been challenged to find ways to share Christ is a culturally relevant way to those around me.  Peace child is a cherished \"how to\" for me to do that.", "summary": "Culturally relevant ways to share the love of Christ is a message for us all.", "unixReviewTime": 1357776000}
{"overall": 4.0, "verified": true, "reviewTime": "12 26, 2012", "reviewerID": "A38LY2SSHVHRYB", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Jodie Vesely", "reviewText": "This is a great movie for a missionary going into a foreign country, especially one that is not used to foreign presence. But, it was a little on the short side.", "summary": "Good Movie! Great for cross-cultural missionaries!", "unixReviewTime": 1356480000}
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "11 16, 2012", "reviewerID": "AHTYUW2H1276L", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "lilsistah21", "reviewText": "This movie was in ENGLISH....it was a great summary of the book and the experience of the Richardsons while in New Guinea.", "summary": "Great....", "unixReviewTime": 1353024000}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "07 15, 2012", "reviewerID": "A3M3HCZLXW0YLF", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Carla", "reviewText": "This is a fascinating true story, well acted by many of the actual characters.  Watch this and see just one of countless examples of how faithfully God works out ways for all of mankind to find Him, in every culture.", "summary": "A remarkable true story, told in English (contrary to reports from earlier reviews)", "unixReviewTime": 1342310400}
{"overall": 1.0, "verified": true, "reviewTime": "09 3, 2010", "reviewerID": "A1OMHX76O2NC6V", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Richard Ellis", "reviewText": "This DVD appears to be in German. It is not in english. I do not speak German.  This needs to be corrected. I want my $1.99 back.", "summary": "Peace Child DVD", "unixReviewTime": 1283472000}
{"overall": 1.0, "verified": true, "reviewTime": "05 7, 2010", "reviewerID": "A3OBOZ41IK6O1M", "asin": "0001527665", "style": {"Format:": " Amazon Video"}, "reviewerName": "Adam", "reviewText": "This movie is not in English although the title of the movie is as is the book. There is no forewarning anywhere that the movie is not in English. Sounds like it might be Russian?", "summary": "Not in English", "unixReviewTime": 1273190400}
{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2012", "reviewerID": "A2M1CU2IRZG0K9", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "Terri", "reviewText": "So sorry I didn't purchase this years ago when it first came out!!  This is very good and entertaining!  We absolutely loved it and anticipate seeing it repeatedly.  We actually wore out the cassette years back, so we also purchased this same product on cd.  Best purchase we made out of all!  Would purchase on dvd if we could find one.", "summary": "Amazing!", "unixReviewTime": 1352419200}
{"overall": 5.0, "verified": true, "reviewTime": "09 11, 2012", "reviewerID": "A1XIXLXK9B4DAJ", "asin": "0005089549", "style": {"Format:": " Audio CD"}, "reviewerName": "MMnMM", "reviewText": "Product received quickly from seller. Product was in great condition as stated. People who enjoy southern gospel music will be thrilled with this offering by the various Cathedral performers, with the exception of Payne and Younce, down through the years. Also quite happy with service. Would use seller again.", "summary": "A Reunion by Cathedral Quartet", "unixReviewTime": 1347321600}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2011", "reviewerID": "AFTUJYISOFHY6", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "Melissa D. Abercrombie", "reviewText": "Believe me when I tell you that you will receive a blessing watching this video of the Cathedral Quartet.  They bring back most of the singers that were ever in their group and it is a really great VHS.", "summary": "Great Gospel VHS of the Cathedrals!", "unixReviewTime": 1325203200}
{"overall": 5.0, "verified": true, "reviewTime": "04 2, 2011", "reviewerID": "AEIAQFCWNRUSE", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "pastorgreg", "reviewText": "This video arrived in perfect shape to the far away country of New Zealand It is a really blessing to see all the different members of the quartet over the years. Great singing! Pastor Greg", "summary": "Reunion The Cathedral Quartet", "unixReviewTime": 1301702400}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "06 27, 2010", "reviewerID": "A16WO8T4YXGVWP", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "teacherdan", "reviewText": "The Reunion of the Cathedral Quartet in 1995 was an effort to salute the men who had contributed to this great Southern Gospel quartet.  The driving force behind the quartet was Glen Payne and George Younce, who remained with the group through several personnel changes.  This video is full of moments of laughter and sentiment, and the music is outstanding.", "summary": "Reunion - A Video for All Time", "unixReviewTime": 1277596800}
{"overall": 5.0, "vote": "6", "verified": false, "reviewTime": "04 21, 2009", "reviewerID": "AX7ANRP31Q7YA", "asin": "0005089549", "style": {"Format:": " Audio CD"}, "reviewerName": "Jupiter Child", "reviewText": "Wedding Music (3:22) Get 25 FREE MP3s! Choose from over 2.8 Million songs!\nWorks on any MP3 player, including the iPod!\n2  O Come Along (3:04)\n3  Hide Thou Me (3:45)\n4  I Want To Walk Just As Close As I Can (2:47)\n5  The Unclouded Day (4:17)\n6  Sunshine and Roses (5:06)\n7  Cleanse Me (3:43)\n8  Yesterday (5:20)\n9  I'm Gonna Shout All Over Heaven (2:51)\n10  I'll Be List'ing (2:08)\n11  He Loves Me (5:27)\n12  Sin Will Take You Farther (3:21)\n13  I've Just Started Living (4:50)\n14  Champion Of Love (5:24)\n15  Goodbye World, Goodbye (1:57)\n16  The Master Builder (3:40)\n17  Somebody Touched Me (5:06)\n18  Step Into The Water (3:21)\n19  Moving Up To Gloryland (2:53)\n20  I Know A Man Who Can (4:16)", "summary": "Track Listings!!!", "unixReviewTime": 1240272000}
{"overall": 5.0, "vote": "20", "verified": false, "reviewTime": "08 7, 1999", "reviewerID": "AIPN1XFK37ZWI", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "bcriner@ozarkmountains.com", "reviewText": "This is truly a moving video to watch if you like great southern gospel quartets. It has some of the greatest singers that have made up the greatest gospel quartet of all time and even the ones that have not been  with the Cathedrals for 30 years still sound fantastic. It is a blessing to  watch.", "summary": "Great video-Super songs and great singers.", "unixReviewTime": 933984000}
{"overall": 4.0, "vote": "10", "verified": false, "reviewTime": "08 13, 2005", "reviewerID": "A7H20K09VIXXT", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "hairy back guy", "reviewText": "It is an excellent experience to watch this DVD after all these years of being an X fan.  It was also very cool to watch this right after a repeated viewing of the DVD X--The Unheard Music (1985).  X still has every ounce of energy and connection it had back then. The only reason I gave it four stars is that John Doe's Bass is overshadowed in the mix.  But having said that, it is a DVD I will treasure for years to come.", "summary": "That Billy Zoom Smile ;)", "unixReviewTime": 1123891200}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "08 6, 2005", "reviewerID": "A2LGI22B6XRZVA", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "E. H. Lose", "reviewText": "I have a thing against purchasing live DVDs. After all, how many times do you want to sit and watch a gig that you probably weren't even there for in the first place?\n\nBut as a dedicated X fan, I couldn't resist checking this out, and I'm thrilled that I did. This is the band in top-notch form.\n\nIt's encouraging that people who weren't around L.A. during X's heyday are finally clueing in to how historically important they were, and still are. And this DVD proves they're still as vital and viable as ever.\n\nDo yourself a favor. If you've wandered to this page, there must be a reason. Don't leave without purchasing this DVD. You'll be glad you did, whether you're a diehard fan like myself, or a fan of music who is simply curious. All hail X, and may they continue to make music together for years to come.", "summary": "Couldn't be better", "unixReviewTime": 1123286400}
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "05 18, 2005", "reviewerID": "A2A4GWAEM3VOW0", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "N. Poulos", "reviewText": "This DVD is unbelievable!  If you are a fan of punk rock, you have to own this DVD.  They play all of their classic songs and the bonus footage is amazing.  I think my favorite part is when they play \"White Girl.\"  X has been around for a long time and this is their first live concert DVD, so it makes it even more awesome.  And the liner notes by Flea of The Red Hot Chili Peppers are really cool too.  Definitely buy this DVD!  It's worth every penny!", "summary": "Worth Every Penny", "unixReviewTime": 1116374400}
{"overall": 5.0, "vote": "9", "verified": true, "reviewTime": "05 13, 2005", "reviewerID": "A226BMXAQAJVOQ", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "D. Nixon", "reviewText": "Just brought this DVD home, and it rocks.  Those uninitiated to this great band don't know, but the fans understand, that this is a band that never disappoints live, and I can vouch for this having seen them 25+ times with and without Billy Zoom, solo, and in their Knitters incarnation.  The cool thing about this DVD is that it does not feel nostalgic - unlike the recent Blasters DVD (also by the good folks at Shout!).  The Blasters were and are a fine band, but one look at the audience on that DVD shows that the thrill is, if not gone, definitely waning.  No so with X.  Fans are still passionate, the playing and singing are still passionate, like the band still totally believes in what they are doing, and it shows.  So, fans will love it, but can this win over some new fans?  That's the question.  If you love the band, this DVD is a must buy.  For those of you with tangential interest, or who love other great bands like The Ramones, The Clash etc., or all of you on the east coast not too familiar with the band, take the plunge.  This DVD rocks.  Dare I ask....rock and roll hall of fame anyone????", "summary": "X hasn't lost a step", "unixReviewTime": 1115942400}
{"overall": 5.0, "vote": "39", "verified": false, "reviewTime": "05 13, 2005", "reviewerID": "AIL0Y2OUE1680", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Hamilton Stoneypoint", "reviewText": "This is exactly how a concert DVD should be done. Tons of cudos to the editors and director of \"X Live in Los Angeles\". Thank you for just showing this amazing live performace, of one of Los Angeles greatests bands. Not .5 seconds rapid fire editing that would make someone sick to their stomach, just simple edits that emphises the music. When Billy Zoom does a solo the camera is actually on......Billy Zoom. Now to the performance. Basically, X still has it, in spades. The song selection is good, John Doe sounds as great as ever and the band is smoking.\n\nI have seen X do faster paced sets in my day but this one is very good. Although the DVD is excellent, the best way to experience this show is to get as many people as you can into your living room, turn the heater onto around 100 degrees and blast this sucker. Now we're living.", "summary": "A blistering live set", "unixReviewTime": 1115942400}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "04 21, 2005", "reviewerID": "A3JVF9Y53BEOGC", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Anthony Thompson", "reviewText": "I have seen X live many times, both in the early days and their more recent reunion shows. Trust me when I say this: they never disappoint as a live band! This DVD document of a show on their home turf of LA is a dream come true. Can't wait.", "summary": "A great document of a great band", "unixReviewTime": 1114041600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "04 6, 2005", "reviewerID": "A12VPEOEZS1KTC", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "JadeRain", "reviewText": "I was so excited for this!  Finally, a live concert video from X!  I've seen them twice, both times with Tony G. on guitar (he was superb by the way).  But we all know you HAVE to have Billy Zoom in the band. I haven't been able to see them, but this DVD will do the trick.  This DVD is AMAZING!! One listen/viewing makes me instantly forget all the \"power pop\" \"punk\" bands that are around now.  Their sound is fantastic, full, fast, heavy, thrilling!  All the members sound excellent, period.  I'm hopeful that there will be a tour, come on X!  Us old fogeys would like to see you old fogeys play your beautiful music for us!! UPDATE:  I've been so lucky to catch X a couple of times with Billy on guitar since I wrote this, it was just incredible seeing them, this DVD does give an accurate view of what it is like to have X RIPPING it up in concert!  cheers.", "summary": "YES!!  X LIVE!!", "unixReviewTime": 1112745600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 3, 2010", "reviewerID": "ATLZNVLYKP9AZ", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "T. Fisher", "reviewText": "X is one of the best punk bands ever. I don't even like calling them a punk band, but that's what they call themselves so I guess it's OK. This is musically complex punk with a lot of influences and a lot of tight playing and gripping tunes.\n\nThis is an awesome concert. The only two problems are that 1) it is just 67 minutes long and 2) John Doe's bass is buried too deep in the mix.\n\nEvery X fan should get this. More importantly, anyone who doesn't know about X should get this.\n\nWhy X? Did you know, for example, that:\n- X has a different sound based on the unique harmonies between co-lead singers Exene Cervenka and John Doe that really sets them apart from anything else out there?\n- Doe, Cervenka and drummer DJ Bonebrake also play in the country punk band The Knitters?\n- Billy Zoom, the guitarist who originally formed the band, used to play rockabilly guitar for Gene Vincent and other big stars, and has been voted one of the greatest guitar players ever by Guitar Player magazine?\n- X were playing Leadbelly tunes way before Kurt Cobain?\n- Ray Manzarek, keyboard player of The Doors, produced X's first four albums? This is one of the big reasons why the band covered and generally closed its concerts with \"Soul Kitchen\" from the album&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/The-Doors/dp/B000MCIBE8/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Doors</a>\n- Cervenka and Doe used to be married, before Exene later married Viggo Mortensen -- Aragorn from the Lord of the Rings movies?\n- Billy Zoom left the band from the mid-1980s to the mid-1990s, but during this time the band still managed to record&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/X-Live-at-the-Whisky-a-Go-Go/dp/B000005IRW/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">X Live at the Whisky a Go-Go</a>, one of the greatest live rock albums ever, with guitarist Tony Gilkyson?\n\nAs this DVD proves, X is still as good as ever. Billy Zoom still plays standing in his trademark splayed-leg stance with a broad grin on his face. Did I say he is awesome? Awesome.\n\nI waited way too long before getting this one, thinking I could do without an X DVD. And I could have. But why should I? This really is worth it, and I'm sure I'll be putting this one in the player more often than a lot of my other music DVDs. Really, really good.", "summary": "X have still got it", "unixReviewTime": 1291334400}
{"overall": 5.0, "verified": true, "reviewTime": "08 28, 2010", "reviewerID": "AE377LB31FT8E", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "marie", "reviewText": "This is a fantastic video for anyone that is a fan of X or punk music. They sound as great as ever.\nThe DVD contains all the great songs. I look back fondly on the days when music was raw and real.", "summary": "A great band !", "unixReviewTime": 1282953600}
{"overall": 5.0, "verified": true, "reviewTime": "06 3, 2009", "reviewerID": "A13H2MDQBI60SE", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Tamara Varrichio", "reviewText": "For all you X fans out there-you will love this DVD -X are a great band live, and if they aren't coming to your town on their tour-this may be the next best thing to seeing them live!", "summary": "X Rocks", "unixReviewTime": 1243987200}
{"overall": 5.0, "verified": false, "reviewTime": "05 15, 2009", "reviewerID": "A37J1JXBFXI0YM", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Jeff Hirsch", "reviewText": "I got this DVD as an Xmas gift. I was very hesitant as I did not want to ruin the greatness I had in my vivid memory of X on the Sunset Strip back in the day. Needless to say my trepidation was unwarranted.\n\nThis DVD is awesome. It is edited well and they sound great. Billy Zoom has not lost anything and  Bonebrake is as good as ever. John Doe still can sing and has the great bass line, Exene sounds good as well, all though the years have not treated her well.\n\nA must buy for any X fan. Now if the UCLA bruins football can return to the 1979-1984 form as well as X -all would be good.", "summary": "Outstanding X", "unixReviewTime": 1242345600}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2007", "reviewerID": "A3TNYNA2360NPA", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Stanley  C. Sargent", "reviewText": "I've loved X since I first saw them here in San Francisco with, I believe, Devo and Romeo Void.  Romeo Void was a disaster due to the tiny outfit Deborah squeezed her huge body into; the audience couldn't stand to look at her even when the music was good. Devo was quite good. Then X came on stage and it was like hearing a great music system play compared to a tinny radio's sound. Man, they were great and they, unlike 99% of the other \"new wave/punk\" bands of the era were pros.  They had it down and played it up. I loved them! Watching this excellent reunion video (yes, Billy Zoom still has that same perpetual, inane smile on his face while playing), I was surprised to see very much the same show I saw all those years ago, with some extra songs that came out later, that is. The band's still electrifying. I'd like to see them \"live\" again, but until then, this video is the next best thing. It's well filmed and has a great selection of their best songs. Sure, they aren't as \"pretty\" as they used to be, but before you say too much, check your rearview mirror to see how you look now compared to 20 some odd years ago. Then, once humbled, go buy this CD. You will love it!", "summary": "A Revival to match the early shows by a great band", "unixReviewTime": 1192579200}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 6, 2007", "reviewerID": "ACZSAM5ZA37SP", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "David Trafford", "reviewText": "I think I saw X about 20 - 25 times from 1985 - 1995. They were always great and this brings back a lot of memories for me. They are a tight band that always sound great. I wish this had all of thier songs from that concert that is on the CD.", "summary": "Great for anyone who has seen them, or missed seeing them!", "unixReviewTime": 1186358400}
{"overall": 5.0, "verified": true, "reviewTime": "05 20, 2007", "reviewerID": "A3G77LSZPLZ74U", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Joseph V. Certeza", "reviewText": "Being born in 1960 really ticked me off...Not old enough to really enjoy or not enjoy those carefree rock/roll, Dylanesque  years and awaiting my young adult years was the end of disco or the beginning of something in music called punk....Being a \"Stranger in a Strange Land\" landed me in the punk scene in the Bay Area...\"Dead Kennedy's\" \"The Replacements\" and others were just either playing local clubs or being thrown into jail. Jello Biafra got married in a cemetary..Anywho, I was just shedding my Beatlemania and visiting nightclubs like DV8, One Step Beyond,181, Club X, Das Club, The Edge/Vortex, Face to Face, and Gotham City...I had seen \"X\" on New Year's night 1990 and being I was 30 decided this was my last year for dancing and clubbing...All the new wave/punk places were being torn down or remodeled for the next generation....That night I was blown away! Everyone in X had aged but still retained that youthful spirit and I tell ya it revitalized me! I danced all night long just like the old days....This DVD strangely enough revitilizes me again and had me tapping my feet, bobbing my head or singing along to \"We're Desperate\", \"White Girl\", \"Johnny Hit and Run Pauline\"....It's definitely not a Beatles concert but the spirit and energy of the times will affect those of us growing up in those times and listening to that loud music....Geez, whatever happened to Dot Little? She's the one who asked me to be a punk with her! If you see her tell her I still love her!", "summary": "Definitely NOT your father's Beatle-x....", "unixReviewTime": 1179619200}
{"overall": 5.0, "verified": false, "reviewTime": "03 2, 2007", "reviewerID": "A15IOUVEB2MXFY", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Steven Draa", "reviewText": "It just so happens that I was at this very show at the HOB in hollywood.  As a matter of fact, I can be seen in many of the shots of the crowd.  This show was nothing short of amazing.  After the show I was permitted to socialize with the band in the upstairs room.  Pretty cool for an old dude like myself.\n\nIf you know X, this is a must.  If you are young and new, it's a great place to get a taste of music history.\n\nDr. Draa", "summary": "I Lived it......and lived to tell about it!", "unixReviewTime": 1172793600}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "02 23, 2006", "reviewerID": "A3LBSW72JBMA7V", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Derek Turner", "reviewText": "I recently saw X live in Atlanta, Georgia and was blown away with thier amazing performance, this DVD displays how they still have a passion for playing punk rock music. Good picture and sound, if you like X, buy this testament of punk history!!!", "summary": "X in top form", "unixReviewTime": 1140652800}
{"overall": 5.0, "vote": "17", "verified": true, "reviewTime": "11 8, 2005", "reviewerID": "A2LUL6PRTXE7SE", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "PSM/Bokor", "reviewText": "I must admit I was hesitant to purchase this DVD. A classic punk band performing twenty plus years later, what could one expect? Apparently, one can expect a hell of a lot. These guys and gal can still tear their songs apart.\n\nIt's well filmed; there isn't that MTV, rapid editing that can cause seizures. The audio is excellent; you can actually understand the lyrics. It's well mixed. It's far superior to a lot of live performance DVD's currently released by some bands. X released a product that is worthy of ones money.\n\nIf you like X; you'll love this DVD. If you just appreciate a good rock/punk concert, you won't be disappointed.", "summary": "Old punks still rule...", "unixReviewTime": 1131408000}
{"overall": 5.0, "verified": false, "reviewTime": "03 6, 2009", "reviewerID": "A1BA7NXY7E8XP", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "KONeal", "reviewText": "WE have \"Hide 'Em In your Heart\" the first volume, and I cant say anything but great things about it. All my children love them ranging in age from 12 months to 11. They sing verses directly out of the bible. I find myself singing the verses throughout the day. It is a great tool to put a song in your heart that is in fact God's word. Also a great tool for scripture memorization.", "summary": "We have Volume 1", "unixReviewTime": 1236297600}
{"overall": 5.0, "vote": "10", "verified": false, "reviewTime": "02 27, 2009", "reviewerID": "A3BG881LH6Z8YU", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Shannon Herring", "reviewText": "My husband and I have had Steve Green's Hide Em In Your Heart Vol's 1 and 2 playing in our home and cars for over 10 years as we have been raising our 7 children.  (We started with cassette tapes!) The quality is great, and the lyrics are simply Bible verses.  The best part is that you will not \"grow weary\" of listening to these as you do with some other children's music.  I recommend them to anyone with small children that is interested in teaching them Bible verses.  They will learn all of these wonderful verses in no time and fill your home with sweet music!", "summary": "You won't get tired of listening to this children's music", "unixReviewTime": 1235692800}
{"overall": 5.0, "verified": true, "reviewTime": "01 18, 2009", "reviewerID": "A2IRI8XED17X6G", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Nathan", "reviewText": "We have been playing this album to our 1-year old almost ever since she was born.  She loves the songs so much that sometime she likes to dance along, and sometimes the songs amazingly can calm her down.  All the songs are very pleasant to listen to for the baby and even for us, and we believe it is a great way to teach our daughter bible verses.  We would not need the DVD though if we were to buy it again.", "summary": "Great songs to teach kids Bible songs", "unixReviewTime": 1232236800}
{"overall": 5.0, "verified": false, "reviewTime": "09 3, 2008", "reviewerID": "AUMT3TLMM4G9K", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "V. Najacht", "reviewText": "I heard about this cd/dvd on the radio and after reading the reviews here I bought it for my 2 year old son.  It is great, the songs are not long, very clever, and I don't mind listening to them over and over either.  My son loves watching the dvd and already knows some of the words, which is awesome because the words are straight from the bible.", "summary": "Great CD/DVD - My 2 year old already memorizing words", "unixReviewTime": 1220400000}
{"overall": 5.0, "verified": true, "reviewTime": "02 16, 2008", "reviewerID": "A3B7MNC1SHIAHG", "asin": "0005419263", "style": {"Format:": " VHS Tape"}, "reviewerName": "Martha A.", "reviewText": "We all enjoy this video, the clothing is a bit outdated, but the verses and songs are timeless! My youngest children even are saying the  verses along with the narrator the first week!", "summary": "Loved it!", "unixReviewTime": 1203120000}
{"overall": 5.0, "vote": "20", "verified": false, "reviewTime": "07 30, 2007", "reviewerID": "A3RMOGWQLBMI0T", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Jaysgal", "reviewText": "We got this CD/DVD set for our 2 year old, and I can't say enough about the quality of the music and lyrics.  This is clean, healthy, happy music!  The music is beautifully arranged and doesn't sound like a low budget synthesizer.  This is actually well orchestrated and professionally recorded.  The lyrics are straight out of the Bible, and a terrific way to memorize scripture!  Our son has thoroughly enjoyed the music, and begs for us to play it for him over and over.  We have listened to the CD so many times I'm amazed it hasn't gotten worn out, and even more amazingly my husband and I are not sick of it...on the contrary, we are sincerely uplifted by it.  It hasn't gotten on our nerves, the way so many other kid's CD's do.  The DVD is definitely outdated, as far as the outfits go, but the content and the music are delightful!  Don't hesitate on this purchase...you won't be disappointed!", "summary": "Best children's christian music EVER!", "unixReviewTime": 1185753600}
{"overall": 5.0, "verified": false, "reviewTime": "02 10, 2007", "reviewerID": "A3603DM2201OZP", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "K. Schott", "reviewText": "Excellent dvd, lots of fun and great songs!  Steve Green is a wonderful artist.", "summary": "You won't want to hide this dvd from your kids!!!", "unixReviewTime": 1171065600}
{"overall": 5.0, "vote": "16", "verified": false, "reviewTime": "12 6, 2006", "reviewerID": "A1BAQRDRPL067", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "strollernut@yahoo.com", "reviewText": "The clothing is dated, but the music and words are timeless.  My son has learned so much from watching this DVD.  We don't watch much television, but this is a great DVD for young children.  The music is catchy (but not irritating as a lot of childrens music is), and the words are straight out of scripture.  There is a nice variety of upbeat songs and quieter songs.  My son is almost 2, and he asks for his \"Bible Kids\" ALL the time.  Our copy is several years old and scratched, I came looking on Amazon to buy a replacement, but it is unavailable.  I hope if it is out of production that it will be remade in the future, I wish there were more DVD's like this on the market for kids.  I give this a five star rating for content and quality.  If you are going to be annoyed by the very 80's style clothing, I'll give it a four ;)", "summary": "This is my sons favorite DVD!", "unixReviewTime": 1165363200}
{"overall": 5.0, "verified": true, "reviewTime": "08 6, 2016", "reviewerID": "A3HE4QW1655VB9", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "bethany robinson", "reviewText": "My grandkids loved this and it made it easy for them to learn scripture verses I a fun way. The DVD was a great bonus.", "summary": "Loved it!", "unixReviewTime": 1470441600}
{"overall": 4.0, "verified": true, "reviewTime": "07 16, 2016", "reviewerID": "A354TA2P6BN3HN", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Sunnyphxgirl", "reviewText": "Just like volume 1, this is an excellent collection of Scripture songs with short explanations in between. Once you get past the late 80s/early 90s clothing and hair styles, the DVD is fun. I purchased this for my 3 year old as the whole family loves volume 1. Some observations:\n1. Compared to Volume 1, the verse selection is a little weak but still profitable. Volume 1 verses are readily applicable to a young child and understood. Volume 2 verses are best understood with a little more context, so perhaps a slightly older child who already knows some Bible.\n2. Vocal ranges: As a former music teacher, I tend to be very picky about vocal ranges for children. In general, D to D is best. This volume has multiple songs that go lower briefly. Still, it's not nearly as low as a lot of the children's music I hear coming out now.\n3. Pitch: Several of the songs feature children who aren't quite on pitch. In the video, you see the child in context and it's cute. But on the CD, it jarring to my ears. If it were just at the end of a song as a cute touch, it wouldn't be bad, but having an out-of-tune singer lead a song is just painful. Now, this probably would not drive the average non-musician crazy at all, so take this comment with a grain of salt.\n4. Song complexity: In volume 1, the song was first presented in its simplest form and then repeated with added complexity. In volume 2, the complexity is sometimes brought in at the beginning. This is just fine for a slightly older child.\n\nEven with these critiques, I am pleased with this CD/DVD. My daughter loves it, and I love that she's getting God's truth engrained into her heart. If I didn't have volume 1 to compare it with, I probably would have given it 5 stars.", "summary": "High quality CD/DVD with minor critiques", "unixReviewTime": 1468627200}
{"overall": 4.0, "verified": true, "reviewTime": "06 19, 2016", "reviewerID": "A1CLLD4H7TYKKJ", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "I'm happy with my purchase", "summary": "Four Stars", "unixReviewTime": 1466294400}
{"overall": 5.0, "verified": true, "reviewTime": "04 12, 2016", "reviewerID": "A2CFV9UPFTTM10", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "SuzieQ", "reviewText": "The little ones love this", "summary": "Love it", "unixReviewTime": 1460419200}
{"overall": 5.0, "verified": true, "reviewTime": "09 8, 2015", "reviewerID": "A2CG9NG50SXR9F", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "mediacatracha", "reviewText": "We LOVE this at our house!!! My 4 year old knows all of the songs and I catch her singing them constantly. Our toddler loooooves watching the DVD and dances to the CD whenever we put it in. She even hums along and chimes in a word here and there where she can!", "summary": "A Favorite at Our House!!!", "unixReviewTime": 1441670400}
{"overall": 5.0, "verified": true, "reviewTime": "05 18, 2015", "reviewerID": "A3J84USGWMGUHS", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Cindy Powell", "reviewText": "Love it!!  Great way to teach children the Bible in a fun way.  (Side bonus--adults are reminded of the Biblical truths again.)", "summary": "Love it!", "unixReviewTime": 1431907200}
{"overall": 5.0, "verified": true, "reviewTime": "04 14, 2015", "reviewerID": "A2MM0696TZ4AIL", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "MomE.", "reviewText": "One of our family's favorites!  Still singing the songs 15 years later :)", "summary": "Great way to memorize Bible verses with your kids!", "unixReviewTime": 1428969600}
{"overall": 3.0, "verified": true, "reviewTime": "07 28, 2014", "reviewerID": "A3139J3877Y61F", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "SingingButterfly", "reviewText": "Good songs. The DVD is a little boring.", "summary": "Three Stars", "unixReviewTime": 1406505600}
{"overall": 4.0, "verified": true, "reviewTime": "07 11, 2014", "reviewerID": "A1AQ26YCP4ZC9T", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Maureen", "reviewText": "Not as memorable as Volume 1, but delightful all the same, and helpful for little ones to learn important scripture passages to guide them through life!", "summary": "Pleasant, heart-warming, and memorable", "unixReviewTime": 1405036800}
{"overall": 5.0, "verified": true, "reviewTime": "04 29, 2014", "reviewerID": "A3YX36D6RB2BV", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Lori J Bouwman", "reviewText": "Loved volume 1, and now there's another volume to learn songs to scripture and life lessons.  This is a great way to get scripture in our hearts!", "summary": "Great addition", "unixReviewTime": 1398729600}
{"overall": 5.0, "verified": true, "reviewTime": "04 17, 2014", "reviewerID": "A2BIXV1ED5XAST", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "Jane C.", "reviewText": "Fun for kids ~ inside and out.\nBest way to get God's Word in their hearts and on their minds.", "summary": "Two Thumbs Up", "unixReviewTime": 1397692800}
{"overall": 5.0, "verified": true, "reviewTime": "04 12, 2014", "reviewerID": "AKG5QV1UWUIJ2", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Karla", "reviewText": "This video may be dated, but my grandchildren listen and watch is almost daily.  Even I find myself singing along at randomly times when it isn't even playing.", "summary": "Best scripture songs for children", "unixReviewTime": 1397260800}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2014", "reviewerID": "A30Z25ZYLRUQYT", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Jen", "reviewText": "The CD Is great and teaching kids the Word of God through song! The DVD is 80s and you can tell but still great and clear!", "summary": "Amazing!", "unixReviewTime": 1388880000}
{"overall": 5.0, "verified": true, "reviewTime": "11 22, 2013", "reviewerID": "A3ORT5XVYXE1N3", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "carol", "reviewText": "My granddaughter loves it! This is her bedtime music; she walks around the house singing SCRIPTURE.Steve Green's voice is that strong tender that brings respect for the WORD of GOD.", "summary": "My granddaughter loves it!", "unixReviewTime": 1385078400}
{"overall": 3.0, "verified": true, "reviewTime": "08 10, 2013", "reviewerID": "A3LNAPLZ5JO0VO", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Bev.", "reviewText": "I have the VHS.  I bought the DVD in order to be able to jump to different tracks.  This feature is not present on the DVD.", "summary": "DVD not as anticipated", "unixReviewTime": 1376092800}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 6, 2013", "reviewerID": "A1MT0T3QJKTFIA", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Erin F", "reviewText": "When I was a little girl, my parents had both the VHS tapes and the cassettes for both Hide 'Em In Your Heart volumes. We also saw Steve Green do these live a time or two.  My siblings and I knew every song by heart, and we loved them.\n\nNow, I have children of my own.  My daughter, barely two years old now, was given this DVD/CD combo pack by her Nonni and Poppop.  She knows all the songs.  Just yesterday she ran around singing \"My Father's House . . . Mickey Mansions . . . Prepare a place for YOU, for YOU!\"  I almost cried with joy.\n\nHaving my children learn the Bible through these songs is priceless, especially since this was (and often still is) how I learned and remembered Scripture growing up.  The songs are short enough to hold interest and are easily learned by even the youngest child. My son is seven months old and, while he is too young to sing them, he recognizes them to the point that he will stop screaming and begin giggling and smiling when he hears the music begin.\n\nEach song is introduced by the corresponding Bible verse and often a brief, simple explanation to help little ones understand what is being taught.\n\nI cannot recommend this highly enough.  Get this music for your children and grandchildren and watch in wonder as they sing Bible verses all day long.  Hide 'Em In Your Heart got five stars from me as a child, and it has ten stars from me as a parent!", "summary": "Two Generations", "unixReviewTime": 1375747200}
{"overall": 5.0, "verified": true, "reviewTime": "06 11, 2013", "reviewerID": "A1Z4040VKCTXAO", "asin": "0005419263", "style": {"Format:": " VHS Tape"}, "reviewerName": "Anna", "reviewText": "My son loves this video!  It came in perfect condition and in a very timely manner.  I would recommend this for parents with young children.", "summary": "Perfect condition", "unixReviewTime": 1370908800}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "06 3, 2013", "reviewerID": "A1EYELB9VFYC1B", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Daniel Dillard", "reviewText": "I usually don't like giving negative reviews, but I ordered the CD/DVD combo and just got the DVD. It was in good condition, but not the complete order.", "summary": "I did not get what I ordered.", "unixReviewTime": 1370217600}
{"overall": 5.0, "verified": true, "reviewTime": "05 28, 2013", "reviewerID": "ADEL7KHJ5VJ7X", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Jenny", "reviewText": "I grew up with this on VHS, thats why I bought it for my boys. Loved that it was a DVD/CD combo. One in the house ,other in the car. My boys are entranced by this movie. I get so much done without them underfoot when its running", "summary": "great purchase", "unixReviewTime": 1369699200}
{"overall": 5.0, "verified": true, "reviewTime": "02 19, 2013", "reviewerID": "A1Y7P8IDQHU2IQ", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "J. Muth", "reviewText": "I have three small children, one doesn't even watch tv yet.  The three and four year old will sit and watch the video.  It's great because as they go about singing the songs they are learning scripture.  No they don't understand everything, but it's hiding in their hearts for when they will need it later.  OK, a little silly, but they seem to like it.", "summary": "Using every teachable moment.", "unixReviewTime": 1361232000}
{"overall": 5.0, "verified": true, "reviewTime": "02 18, 2013", "reviewerID": "A10DSAZBKJC0WG", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Sophia", "reviewText": "We enjoyed the original VHS, so I was already impressed with the content.\nWhat a great treat to purchase the CD and the DVD together.  My whole\nfamily loves it: my toddler enjoys the music and interaction; my teen feels\nnostalgic about it; my husband and I are pleased with the content and\npresentation.", "summary": "Great deal", "unixReviewTime": 1361145600}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2013", "reviewerID": "A3OFILCH8S2DUC", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Kathy Glasco", "reviewText": "Arrived quickly, in great shape, and exactly as I requested.  It is a great CD for helping to learn the Scriptures.", "summary": "Hide em in your Heart II", "unixReviewTime": 1358035200}
{"overall": 5.0, "verified": true, "reviewTime": "01 9, 2013", "reviewerID": "A28CD9IB14CT8K", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Anne Cook", "reviewText": "The video is terribly dated, but the singing is so nice.  My daughter loves both the DVD and the cd.", "summary": "dated, but a favorite", "unixReviewTime": 1357689600}
{"overall": 5.0, "verified": true, "reviewTime": "04 18, 2012", "reviewerID": "AK8H90LGY3GIU", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "Melanie", "reviewText": "I have enjoyed this video for many years with my nephew and nieces.  As soon as my daughter was old enought to enjoy it, I purchased it.  She loves to watch other kids and she loves to sing and dance.  All of that along with a very good way to remember age appropriate scripture makes this video a must have for my family!", "summary": "love it!", "unixReviewTime": 1334707200}
{"overall": 5.0, "verified": true, "reviewTime": "07 26, 2011", "reviewerID": "A2TLHQXTR4ZF8E", "asin": "0005419263", "style": {"Format:": " VHS Tape"}, "reviewerName": "Bonny", "reviewText": "I loved this video and want to order 2 more for my grandchildren.  It gives a simple, easy to understand explanation of the Bible verse and then the verse set to appropriate muusic!", "summary": "Great video!", "unixReviewTime": 1311638400}
{"overall": 5.0, "verified": true, "reviewTime": "06 1, 2011", "reviewerID": "AZVD4U74OR64V", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "B. Delgado", "reviewText": "Finally! Scripture songs that are geared towards kids that are so nice to listen to! Steve Green has my kids memorizing scripture, and me too! Everyone loves these songs!", "summary": "LOVE IT!", "unixReviewTime": 1306886400}
{"overall": 5.0, "verified": true, "reviewTime": "04 28, 2011", "reviewerID": "A2ZUYAN2VBN0RK", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "texas iris", "reviewText": "The C.D. / DVD is wonderful, the music is great...but there are no performance tracks for our 3 & 4 year old choir.  And there is no sheet music available either.\n\nThe music is really great, but it needs to be supported for children's choirs.", "summary": "no performance tracks", "unixReviewTime": 1303948800}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2010", "reviewerID": "A2PANT8U0OJNT4", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "Cutegirlmomma", "reviewText": "The DVD came in great condition and provided lots of entertaining minutes of reliving the past.  Definitely worth the money.", "summary": "Blast from the past", "unixReviewTime": 1292889600}
{"overall": 5.0, "verified": true, "reviewTime": "07 12, 2010", "reviewerID": "A3VRMOMIPDNS72", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "SR2403", "reviewText": "What a great way to instill the Word of God in your child's heart. It has been a treasure to hear my 4 year old sing these songs out of the blue. The music is well done and encouraging. I find it is so good for my heart too.", "summary": "so good", "unixReviewTime": 1278892800}
{"overall": 5.0, "verified": true, "reviewTime": "09 27, 2009", "reviewerID": "A1TN0V94A3ECSH", "asin": "0005419263", "style": {"Format:": " VHS Tape"}, "reviewerName": "Karilyn S. Eastvold", "reviewText": "Wonderful, fun way to teach truths to children.  Every child I know loves these videos and songs.  Good for parents too.", "summary": "Hide 'Em in Your Heart", "unixReviewTime": 1254009600}
{"overall": 5.0, "vote": "7", "verified": true, "reviewTime": "11 23, 2008", "reviewerID": "A3TS9EQCNLU0SM", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Watch this and learn how we ended up in the state we are in as a dying country.", "summary": "Excellent Viewing", "unixReviewTime": 1227398400}
{"overall": 5.0, "vote": "21", "verified": false, "reviewTime": "07 4, 2007", "reviewerID": "AXSPOMD9G3MH0", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Every American should see this, especially if they are of the liberal persuasion! The only thing I would change is to have the words of the various quotes on the screen as they were being spoken. That would make a greater impact, and make it easier to pause the video and copy the quotes down.\n\nThe video may seem somewhat disjointed and not cover some of the events very deeply, but there is a reason for this. It is organized chronologically, rather than topically, which causes it to appear disjointed. As far as the depth of the coverage, if everything was covered in depth, it would have to be a 12-CD set! At least!\n\nThe video does a very good job of covering the highlights of what brought us from a godly nation to where we are today. Other than the David Barton videos, this is the best one I have seen on the topic so far.", "summary": "Must see!", "unixReviewTime": 1183507200}
{"overall": 5.0, "vote": "10", "verified": true, "reviewTime": "01 29, 2007", "reviewerID": "AKEHF7IT6FZX8", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "J. Gunderson", "reviewText": "Every evangelical Christian should be familiar with the information provided in this video.", "summary": "Provocative and challenging.  A must view", "unixReviewTime": 1170028800}
{"overall": 3.0, "vote": "7", "verified": true, "reviewTime": "10 23, 2006", "reviewerID": "A2FKOWVAK1NB03", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Richard Barr", "reviewText": "After reading other users' reviews and WND promotion, I was looking forward to an exciting, uplifting story about the U.S. With a few exceptions (ACLU and PP backgrounders), the presentation was tedious and the storyline disjointed. Example: a short segment on the Crusades; now let's talk about Christopher Columbus. Five minutes later you learn the connection. Now let's talk about something else! The quotations selected from our founding fathers are appropriate, but their vocabularly and writing style---while more advanced than most people's today---get in the way of the points being made.\n\nMaybe it gets better towards the end. I started to fall asleep around 1920, so have not finished the DVD. Sorry. I wanted to like it but...", "summary": "I wanted to like it, but...", "unixReviewTime": 1161561600}
{"overall": 5.0, "vote": "22", "verified": true, "reviewTime": "08 8, 2006", "reviewerID": "A1LEX7PWSSB5NK", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "GMT", "reviewText": "This was an amazing DVD that I definitely recommend.  What I found interesting was the background and beginning of both, Planned Parenthood and the ACLU!  It actually turned my stomach a couple times.  Hopefully you enjoy it as well.", "summary": "Great historical account!", "unixReviewTime": 1154995200}
{"overall": 5.0, "vote": "39", "verified": false, "reviewTime": "05 19, 2006", "reviewerID": "A20G9YZ9L7NVU1", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Carl", "reviewText": "I enjoyed the Gospel focused presentation of the history of our nation, but one section regarding the trial of a soldier for homosexuality is inappropriate for younger children. Also, later in the movie there are some clips of violence against a church by homosexual activists covered by news reports that would be too strong from young children.  Lastly, open displays of affection by homosexuals is covered by news reports at the end of the movie as well.  My advice is to view the movie yourself first and then determine what sections you can allow your children to view.  If you are not a Christian, you'll hate this movie.", "summary": "Great History...not for very young children", "unixReviewTime": 1147996800}
{"overall": 5.0, "vote": "19", "verified": true, "reviewTime": "10 11, 2005", "reviewerID": "A35PMPEBHXAQ2T", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "J. C. Frazee", "reviewText": "A great video that should be shown in schools, churches,etc. Provides an interesting historical perspective. Very well done and presented.", "summary": "Nation Adrift", "unixReviewTime": 1128988800}
{"overall": 5.0, "vote": "11", "verified": false, "reviewTime": "08 26, 2001", "reviewerID": "A28KVB8JWTG8MS", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Brian Barkley, producer A NATION ADRIFT", "reviewText": "This documentay takes you on a journey...from Christopher Columbus to Jamestown...from Valley Forge to the Constitutional Convention...from the Civil War to the Industrial Revolution...from World War I to the Stock Market Crash...from FDR to the present. Our journey will give a basic grasp of God's sovereign hand behind the history of our nation, which our forefathers so clearly understood. The result of this journey will give us a better understanding of where America is today, how she arrived here, and where she must turn at this critical hour. For as Thomas Jefferson once asked, \"Can the liberties of a nation be secure, when we have removed the conviction that these liberties are the gift of God?\" \"Should be viewed by everyone across the nation\" Don Wildmon, President, American Family Association \"an excellent video for anyone wanting to know the truth about the history and heritage of this nation\" Jim Woodall, V.P., Concerned Women For America \"I expect it to have a major impact on audiences wherever it is shown\" D. James Kennedy, pastor, Coral Ridge Ministries \"an excellent video presentation of the moral and spiritual crisis in America and the urgent necessity of recovering the truth about America's Christian heritage\" Peter Marshall, author and historian \"A NATION ADRIFT is an excellent history lesson concerning the religious roots of America. Every person in this country, young and old, should enjoy viewing it\"\nBill Dannemeyer, U.S. Congressman \"I am confident that, if every American took the time to view A NATION ADRIFT, it would have a history-changing impact on our nation's course\" Howard Phillips, Chairman, U.S. Taxpayers Alliance \"I'm always looking for videos to use to help tell Americans what it truth or fact in this country and A NATION ADRIFT is on of the finest that's ever been produced...the finest in content and the finest in technical quality\" Marlin Maddoux, Point of View, radio talk show host \"in only 90 minutes, a viewer can see and hear enough new and significant information to all but obviate the need to even take a U.S. history class. This video should be seen by every American\" Dale Mason, V.P., Gospel Films \"an upbeat, unforgettable evening of entertainment. Feel good about America again\" Dan Faddis, Impact Resources", "summary": "The best American Heritage video", "unixReviewTime": 998784000}
{"overall": 5.0, "vote": "9", "verified": false, "reviewTime": "03 8, 2001", "reviewerID": "A20M1Y21WJSA0N", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Dave Cook", "reviewText": "I grew up in Independence, Missouri the \"show me state\".  When I was in Junior high and we were studing about World War II and the atom bomb, from my history class I looked out the window to see Harry S. Truman walking to city hall to vote with a secrete serviceman by his side.  But I learned more American History from NATION ADRIFT than I did in high school and college.  Plus, I saw things that are rarely mentioned now, perhaps because we are all trying to be so politically correct that we left a few things out that really happened.  Seeing is believing.", "summary": "Understanding Our National Roots", "unixReviewTime": 984009600}
{"overall": 5.0, "vote": "13", "verified": false, "reviewTime": "12 25, 2000", "reviewerID": "A1M1OITWW4LXAE", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Robert J. Anglin", "reviewText": "This is a real eye opener. You will feel outraged and saddened by what has slowly happened to this country. You will feel inspired to fight the good fight in order to not lose any more ground to the liberals in our country. You will get an insight to the US Court sytems and how their controversial decisions have slowly eroded our freedoms and challenge the very fabric that this great nation was founded upon.", "summary": "A Must see for any and all Americans", "unixReviewTime": 977702400}
{"overall": 3.0, "verified": true, "reviewTime": "09 28, 2017", "reviewerID": "A2AZ7CE08CWK4F", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Robert C Riehl", "reviewText": "Less than I expected, but OK film", "summary": "Three Stars", "unixReviewTime": 1506556800}
{"overall": 5.0, "verified": true, "reviewTime": "07 24, 2017", "reviewerID": "A12B2K6X03UA6Z", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Allie B.", "reviewText": "It is a great book about History!", "summary": "Five Stars", "unixReviewTime": 1500854400}
{"overall": 4.0, "verified": true, "reviewTime": "11 24, 2016", "reviewerID": "A2QWTVQ90KYZZP", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "FASTEDDY", "reviewText": "REALLY ENJOYED", "summary": "Four Stars", "unixReviewTime": 1479945600}
{"overall": 5.0, "verified": true, "reviewTime": "11 1, 2016", "reviewerID": "A2P9HCN2JM55DS", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Excellent timeline of our nation's history. I would highly recommend.", "summary": "Five Stars", "unixReviewTime": 1477958400}
{"overall": 5.0, "verified": true, "reviewTime": "09 4, 2016", "reviewerID": "AK1BZVQ7X9EJR", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "GCK", "reviewText": "excellent as usual", "summary": "Five Stars", "unixReviewTime": 1472947200}
{"overall": 5.0, "verified": true, "reviewTime": "08 10, 2016", "reviewerID": "ADUN41PCA098H", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Dagny Dibona", "reviewText": "A great read.  So much historical info.\n\nThank you,", "summary": "A great read. So much historical info", "unixReviewTime": 1470787200}
{"overall": 5.0, "verified": true, "reviewTime": "12 7, 2014", "reviewerID": "A15UN81O3NDPE3", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Robert S. Mason", "reviewText": "Worthwhile for the whole family to see andvtoncirculaye among friends.  Very well done!", "summary": "Five Stars", "unixReviewTime": 1417910400}
{"overall": 5.0, "verified": true, "reviewTime": "11 20, 2014", "reviewerID": "A1R6FXSZVCIJKK", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Kindle Customer", "reviewText": "Should be a must read", "summary": "Five Stars", "unixReviewTime": 1416441600}
{"overall": 5.0, "verified": true, "reviewTime": "11 19, 2014", "reviewerID": "A3JUFDBFDX0A0J", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Stan Laurel", "reviewText": "Well done video with important information that Americans should know.", "summary": "Americans should see this.", "unixReviewTime": 1416355200}
{"overall": 5.0, "verified": true, "reviewTime": "10 20, 2014", "reviewerID": "A2JS4XEZCZVJSQ", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "riarl", "reviewText": "This is a great movie if you love the USA", "summary": "Five Stars", "unixReviewTime": 1413763200}
{"overall": 5.0, "verified": true, "reviewTime": "10 15, 2014", "reviewerID": "A3UI4K5IZKSNYW", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Jon E. Nissen", "reviewText": "A must see for everyone. The ones who get it will understand. The blind will pass it off.", "summary": "Five Stars", "unixReviewTime": 1413331200}
{"overall": 5.0, "verified": true, "reviewTime": "08 11, 2014", "reviewerID": "A1VNYYUC24CGKF", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Ron Fortner", "reviewText": "really good help me understand a few things must see", "summary": "Five Stars", "unixReviewTime": 1407715200}
{"overall": 5.0, "verified": true, "reviewTime": "08 11, 2014", "reviewerID": "A1VNYYUC24CGKF", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Ron Fortner", "reviewText": "This is a must see very informative", "summary": "Five Stars", "unixReviewTime": 1407715200}
{"overall": 4.0, "verified": true, "reviewTime": "08 5, 2014", "reviewerID": "A3R9UEJKGS2419", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Robert E Keyes", "reviewText": "This hits our situation on the spot.", "summary": "Four Stars", "unixReviewTime": 1407196800}
{"overall": 5.0, "verified": true, "reviewTime": "06 20, 2014", "reviewerID": "A2E95VSDA88WNL", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "JWK", "reviewText": "Show the decline of courage, honor and moral character by showing America like it is in 2014 today - a must see!!!!!!!!!!!!!!!", "summary": "Excellent", "unixReviewTime": 1403222400}
{"overall": 5.0, "verified": true, "reviewTime": "05 16, 2014", "reviewerID": "A2HJXKX134QC9", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Dale", "reviewText": "I had watched parts of this film before.  Man I'm glad I got to watch it all.  The historical background on Planned Parenthood and the ACLU is information everyone should have.  I will be recommending this to everyone.", "summary": "History everyone should be aware of", "unixReviewTime": 1400198400}
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "05 2, 2014", "reviewerID": "A38KRRY00H5TEY", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Trish", "reviewText": "While there was a lot of information in this piece (some of it coming at your faster than a freight train, another down side of the video), there is no doubt that it was produced as right-wing propaganda, which means I'm not able to use it as I hoped (for my children's home schooling). One large section of the video is a series of quotes from historical U. S. leaders, mentioning God and/or the Bible -- the quotes are simply inserted without any background or even a common-ground to relate each of them.", "summary": "Lots of Info. But Mostly a Right-Wing Agenda Pusher", "unixReviewTime": 1398988800}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2014", "reviewerID": "APBJQBITFEC", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "moses", "reviewText": "If you love God and Country, this exposes another layer of the attack against both. well work the time watching ans sharing with your friends", "summary": "Great Info for those searching truth", "unixReviewTime": 1389484800}
{"overall": 5.0, "verified": false, "reviewTime": "01 3, 2014", "reviewerID": "A3PTHV9RUWNLU2", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "David Christhilf", "reviewText": "There is an essential message here that is not being told in society today.  People claim that this nation was not founded on Christianity, and that the writers of the Constitution were actually Deists rather than Christians.  There is a preponderance of evidence over centuries of time presented here, including the wording of documents such as the Mayflower Compact, that establish the Christian heritage of this nation unapologetically beyond refute, as a matter of history.\n\nThe other story that is not being told is the origins and destructive objectives of organizations such as Planned Parenthood and the American Civil Liberties Union (ACLU).  The founder of Planned Parenthood was interested in eugenics, and specifically in reducing the number of Blacks to survive being born in this country.  Efforts by the ACLU to remove prayer and the Bible from school are shown to be in direct conflict with the statements by the founding fathers about what they considered to be essential for a proper education that would equip the youth of this country for effective citizenship.  The redefinition of marriage to include homosexual relationships is shown to be tearing at the fabric of the traditional family, and of the stability of our society.\n\nWe HAVE become A Nation Adrift, and much of that comes from ignorance of how this country was founded, and of the sacrifices that were made along the way.  This DVD would be beneficial for viewing in every home, school, and church in this country.", "summary": "This should be esential reading for everyone in the USA.", "unixReviewTime": 1388707200}
{"overall": 5.0, "verified": false, "reviewTime": "11 6, 2013", "reviewerID": "AA2F97CWV8EU8", "asin": "0005092663", "style": {"Format:": " VHS Tape"}, "reviewerName": "Stanley Hall", "reviewText": "This movie should be seen by everyone. It chronicles how this country started and quickly became the greatest, freest, and most prosperous country in the world through faith in God and freedom. And how and why we are losing that greatness, freedom and prosperity.", "summary": "Must-see Movie!", "unixReviewTime": 1383696000}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "10 23, 2013", "reviewerID": "A22E627EBTSX4T", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Jennifer McCoy", "reviewText": "Haters will say this is biased, that the founding fathers were not christians, or that they were deists...and maybe that's true for some of the ff. But this documentary is very informative. Our nation started as something it is most certainly not anymore. And we are falling. This movie gives insight as to why.", "summary": "Haters gonna hate", "unixReviewTime": 1382486400}
{"overall": 5.0, "verified": true, "reviewTime": "10 11, 2013", "reviewerID": "A1SJ5KDJF2BQAT", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "L. Bridges", "reviewText": "What a great video that gives the early history of our great country!  I'd highly recommend this to everyone - especially for school children that are not learning the history of our country.", "summary": "Interesting and educational video about our great country!", "unixReviewTime": 1381449600}
{"overall": 4.0, "vote": "2", "verified": true, "reviewTime": "05 14, 2013", "reviewerID": "ACKXVXZPO0XZF", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "T. Halley Newman", "reviewText": "This video presents a very good capsular History of our country and its founding principles.  It the progresses on through the history of america and how the fabric of what once made her an unusual nation began to deteriorate.  America was founded through a war that broke the shackles of a tyrant King George and on the basis of religious freedom. Many were still not free and so a second war would ensue .  Family, Faith, personal responsibility, generosity, work, morality, integrity and freedom are all part of that legacy.  Oven the decades those have been eroded.  This is the story of how and when it happened.", "summary": "A Nation Adrift purchased fro Amazon", "unixReviewTime": 1368489600}
{"overall": 5.0, "verified": true, "reviewTime": "02 14, 2013", "reviewerID": "A393FE9USJGVLU", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Cakraft", "reviewText": "I found this dvd put together with historical facts and visuals that kept my interest in the issues discussed. would recommend 6-12 grade classes watching this.", "summary": "better than expected", "unixReviewTime": 1360800000}
{"overall": 5.0, "vote": "6", "verified": true, "reviewTime": "06 14, 2012", "reviewerID": "ASDTPYYN9SMLU", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Earl", "reviewText": "Well done!  I will definitely be showing this to my children when they get a little older.  This is the documentary you will never see in our public school system these days.  Ironically, it is the one documentary that you should have to see before you graduate.  It is amazing how far our country has fallen from the original intentions of our Founding Fathers.  This is a great reminder of what liberalism and political correctness has done to the United States of America.", "summary": "A must see for all Americans", "unixReviewTime": 1339632000}
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 17, 2010", "reviewerID": "A2D77RTO2BC8VJ", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Barbara O. Cassel", "reviewText": "This is the history we need to be teaching in our schools. Everyone should see this!", "summary": "Wow!", "unixReviewTime": 1282003200}
{"overall": 4.0, "verified": true, "reviewTime": "08 3, 2010", "reviewerID": "A3V1BXUGMM6F63", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Calvin M. Endo", "reviewText": "I like the purchase of this video because the price was great and the shipping was fast.", "summary": "Great Video", "unixReviewTime": 1280793600}
{"overall": 1.0, "vote": "8", "verified": true, "reviewTime": "06 27, 2010", "reviewerID": "ADYFKBJ5BFKC9", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Steve Williams", "reviewText": "The video has a half truth view, The view of Woodrow Wilson is very liberal and does not tell of the Socialistic agenda he was forcing on our country. I actually threw this dvd in the garbage after I watched it. Any false history is not history but should be considered fiction.", "summary": "Partial Truth", "unixReviewTime": 1277596800}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "01 30, 2010", "reviewerID": "A3J8URP2630NRJ", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "L. Williams", "reviewText": "A Nation Adrift is a must see documentary.  It tells you what your history books didn't or tells your children what they don't hear in school.  This true American history needs to be shown in every church across the United States.  We as Christians have failed to guard what God has given us.  God have mercy on us.  LW", "summary": "A Nation Adrift", "unixReviewTime": 1264809600}
{"overall": 5.0, "verified": true, "reviewTime": "10 24, 2009", "reviewerID": "A1E7VTRDMI4XMV", "asin": "0005092663", "style": {"Format:": " DVD"}, "reviewerName": "Harold", "reviewText": "Really excellent piece of work showing the beliefs of the founding fathers and what is happening now to our nation.", "summary": "Freedom and Religon under attack", "unixReviewTime": 1256342400}
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "11 2, 2002", "reviewerID": "A1HP3B92A3JDQ1", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "OmegaWolf747", "reviewText": "Of course it's impossible to separate Henry Winkler from his famous Fonzie persona, but he actually does a great job as a Scrooge-character in this movie.  His performance is quiet and subdued, not overdone as we might expect from such an intense actor.  I thought Winkler did a great job chaning out of his Fonzie image and taking on the roll of an embittered and lonely miser.\nActually the characters Winkler plays aren't all that different from each other.  Slade felt abandoned and betrayed by those he'd loved, and Fonzie was also abandoned by his parents.  Winkler's parents turned their backs on him when he was a young man because he wanted to be an actor instead of following the family business.  I believe that's why he does rolls like this so well.\nI was quite surprised to find this movie available on DVD and have gladly purchased it to add to my collection of Christmas movies.", "summary": "The Fonz as Scrooge", "unixReviewTime": 1036195200}
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 28, 2002", "reviewerID": "AZB4CQ9JZSUQB", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Eric Pregosin", "reviewText": "When this first aired in 1979, I enjoyed it so much I clean forgot it was \"A Christmas Carol\".  I wanted to see it over and over again thoughout the year.  When I finally got a copy on VHS, I got that wish.  Now I finally got the DVD copy and am I glad.  To see Henry Winkler as the best Scrooge or variation on him since Alistair Sim in the 1951 version now on DVD is a treat for the gods.  Although I have both the 1984 and 1999 made for television films made with George Scott and Patrick Stewart on DVD, this version was the first attempt to bring the classic Dickens tale to the small screen. It is as just as enjoyable today as it was 20 plus years ago, and this way it will live forever.  Get it now and on disc before it gets away.", "summary": "A Christmas Carol to be remembered", "unixReviewTime": 1012176000}
{"overall": 5.0, "vote": "2", "verified": false, "reviewTime": "12 12, 2001", "reviewerID": "A1PXS5N63PS6WR", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Dan Willis", "reviewText": "I must confess to being a bit of a coinsure of Dickens' classic tale.  I have many versions of it and always love seeing the various interpretations offered.  This one, however, continues to be one of my all time favorites.  The change of setting forces the film to explain elements of the book that most films overlook because they assume you're already familiar with the story.  Examples of this include how Scrooge (Slade in the film) could be so mean and yet think himself a just man, also the reason the ghost of his dead partner is miserable (not understanding the need to do good until he has lost the power).  Add to this the wonderful performances by Winkler et al and you've got an absolutely classic film.\nIn my opinion, this version of Dickens' story is closer to the original spirit of his work than many less derivative versions.  The material is handled with reverence and respect and it shows, the settings and characters are well conceived, and the look of the film is faithful to the period.  All in  all an excellent holiday piece well worth the money.", "summary": "Change can be good", "unixReviewTime": 1008115200}
{"overall": 3.0, "vote": "31", "verified": false, "reviewTime": "12 11, 2001", "reviewerID": "A17TPT3FWAE5T1", "asin": "0005019281", "style": {"Format:": " VHS Tape"}, "reviewerName": "Matthew Spady", "reviewText": "If you already have (and love) the Alistair Sim version (Scrooge, 1951), the Reginald Owen version (1938) and Mr. Magoo's Christmas Carol (no, I'm not kidding, it's beautifully done), this will be an interesting film for comparison.\nTwo good points stand out for this version of Dicken's classic Christmas story:\n1) Since it is an adaptation, set in a different time and place from the original (Depression-era New England), deviations from the text and basic plot-line, are not as bothersome as they are in the films that adapt the story in \"Dickensian\" England.\n2) Henry Winkler, who, at the time, was playing against his well-known Fonz character, gives an excellent characterization to the Scrooge-like Benedict Slade.\nGeorge C. Scott and Albert Finney give detailed performances as Scrooge in their version, and the films that feature them have good production values -- and, in the case of the Finney version a couple of good songs -- but the deviations in text in the Scott version and the added material in the Finney version (Scrooge in hell -- what?) are both unnecessary and more than a little annoying.", "summary": "An interesting contrast to more traditional versions", "unixReviewTime": 1008028800}
{"overall": 4.0, "vote": "62", "verified": false, "reviewTime": "10 19, 2001", "reviewerID": "A3P98J5DZ00A75", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Ken Roberts", "reviewText": "Henry Winkler proves his acting ability in this American version of the Dickens classic. One will actually forget that he was 'The FONZ' and will be amazed at his transformation from nice guy to mean guy back to nice guy. The general feel of this movie, though, is grey. That's the best way to describe it. But then, it was a bleak grey time in American history, with the Great Depression and all. When Dickens originally wrote the book, it was a grey time in England's history as well, so the subdued feeling one gets while watching this 'modern' version fits in well with the spirit of the original story.\nA nice twist (sorry, Oliver!) to a true classic.\nBy the way, for my money, the finest original version out there is the George C. Scott version followed closely by Alistair Sim.", "summary": "grey", "unixReviewTime": 1003449600}
{"overall": 5.0, "verified": false, "reviewTime": "12 31, 2000", "reviewerID": "A3JDW8YT5N55Y7", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "dawn stinson", "reviewText": "i thought that actor dorian harewood was fantastic in this role.", "summary": "the ghost of xmas future", "unixReviewTime": 978220800}
{"overall": 4.0, "vote": "2", "verified": false, "reviewTime": "09 12, 2000", "reviewerID": "A3S1YI6MC7832G", "asin": "0005019281", "style": {"Format:": " VHS Tape"}, "reviewerName": "Reviewer", "reviewText": "Being a huge fan of this classic, I own dozens of versions and this one  adds a nice variety.  The twists and changes to this timeless story truly  do justice to the original and the performances, for the most part, are  stellar.  If you're looking for the same feel good movie but in a new  setting, this one's for you.", "summary": "A Great New Version of a Wonderful Old Story", "unixReviewTime": 968716800}
{"overall": 5.0, "verified": true, "reviewTime": "01 30, 2018", "reviewerID": "ANEKVYF88H156", "asin": "0005019281", "style": {"Format:": " Blu-ray"}, "reviewerName": "Patricia B.", "reviewText": "One of my family's favorite Christmas movies ever. Henry Winkler is wonderful!", "summary": "Five Stars", "unixReviewTime": 1517270400}
{"overall": 5.0, "verified": true, "reviewTime": "01 30, 2018", "reviewerID": "A131408USYVUN5", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Conrad R. Naugle", "reviewText": "as described", "summary": "Five Stars", "unixReviewTime": 1517270400}
{"overall": 5.0, "verified": true, "reviewTime": "01 26, 2018", "reviewerID": "A1AYN8825GNXSP", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Mark C Bodanza", "reviewText": "Nice movie", "summary": "Five Stars", "unixReviewTime": 1516924800}
{"overall": 5.0, "verified": true, "reviewTime": "01 25, 2018", "reviewerID": "A2U7DG83EXUSFP", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Donald R. Brandeberry", "reviewText": "A good movie with morals", "summary": "Family movie", "unixReviewTime": 1516838400}
{"overall": 5.0, "verified": true, "reviewTime": "01 17, 2018", "reviewerID": "A2EFK8RB157JSE", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "R. S.", "reviewText": "My favorite \" Christmas Carol\".", "summary": "Five Stars", "unixReviewTime": 1516147200}
{"overall": 5.0, "verified": true, "reviewTime": "01 12, 2018", "reviewerID": "AD8CFJUEVV8BQ", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Mary", "reviewText": "Love the twist on this classic!", "summary": "Nice addition to holiday movie collection!", "unixReviewTime": 1515715200}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2018", "reviewerID": "A1NMYH2IITNOC4", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Karen Ridge", "reviewText": "Love the movie.", "summary": "Great movie.", "unixReviewTime": 1515628800}
{"overall": 5.0, "verified": false, "reviewTime": "01 11, 2018", "reviewerID": "A2YAP2BVW3MVUW", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Emily Reichard", "reviewText": "An inspirational version of the Christmas Carol, enjoyable and upbeat", "summary": "Five Stars", "unixReviewTime": 1515628800}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2018", "reviewerID": "A1DCI4344E1O3P", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Bob", "reviewText": "This TV movie brought back fond memories of the first time my wife and I watched it in the late 70's. Henry Winkler did a great job with the character of an American Scrooge. It was radical change from the Fonz.", "summary": "Henry Winkler did a great job with the character of an American Scrooge", "unixReviewTime": 1515110400}
{"overall": 5.0, "verified": false, "reviewTime": "01 5, 2018", "reviewerID": "A1XQVED2NX33TN", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "In my opinion...", "reviewText": "More of a 'modern' version of the classic.  I didn't think I'd be impressed when my parents took this out but I gave it a try and have to say...what a great adaptation.  The cast was great, Winkler was exceptional.  I was very happy to see this on Amazon and happened to catch it when the price went way down so I snapped it up.  Great timeless classic...and Winkler really surprised me with his portrayal.", "summary": "Was happily surprised...great version, esp for a TV rendition.", "unixReviewTime": 1515110400}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2017", "reviewerID": "A29HHWJB3JYPX7", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Joanne M. Jackson", "reviewText": "Perfect!", "summary": "Five Stars", "unixReviewTime": 1514592000}
{"overall": 5.0, "verified": true, "reviewTime": "12 27, 2017", "reviewerID": "A60CX7BRJSWSR", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Vicki V", "reviewText": "Our previous dvd of An American Christmas Carol was lost and as this is one of my husband's favorite Christmas movies I bought it for him.  The quality of this new version is much, much better than what we had before.  I would highly recommend it !", "summary": "... lost and as this is one of my husband's favorite Christmas movies I bought it for him", "unixReviewTime": 1514332800}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2017", "reviewerID": "AZPHVD6XM61V", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Ronald Dickens", "reviewText": "A rare classic,  a good movie.", "summary": "a good movie.", "unixReviewTime": 1513814400}
{"overall": 5.0, "verified": false, "reviewTime": "12 6, 2017", "reviewerID": "A1ESD4B4JK95ZG", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Pamela Kellogg", "reviewText": "I've always loved this version of a Christmas Carol.  Henry Winkler does a great job portraying a 1930's American version of Scrooge.  The video quality is decent too!", "summary": "I've always loved this version of a Christmas Carol", "unixReviewTime": 1512518400}
{"overall": 2.0, "verified": false, "reviewTime": "11 25, 2017", "reviewerID": "A19H3CR53ME00T", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Bob R", "reviewText": "Terrible soulless version of the classic Dickens tale", "summary": "Two Stars", "unixReviewTime": 1511568000}
{"overall": 5.0, "verified": true, "reviewTime": "11 3, 2017", "reviewerID": "AC3DZD4IJUUKP", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "David G.", "reviewText": "Saw this as a kid/teenager and really liked it. Even though it was set in the Depression era, I found it a more  contemporary and relatable version of the story. Who knew the Fonz could be something other than the Fonz? Good story and enjoyable.", "summary": "Great and Way Under-rated Movie", "unixReviewTime": 1509667200}
{"overall": 5.0, "verified": true, "reviewTime": "10 29, 2017", "reviewerID": "A2P4Q313GTW4CN", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Northern USA", "reviewText": "One of our favorite renditions of The Christmas Carol!  Of course, any movie with Henry Winkler is bound to be good.  We also ordered a DVD (Hallmark movie) he starred in, \"The Most Wonderful Time of the Year\", which will not dissapoint Henry Winkler fans!", "summary": "If you haven't seen this version of The Christmas Carol, watch it!", "unixReviewTime": 1509235200}
{"overall": 5.0, "verified": true, "reviewTime": "10 18, 2017", "reviewerID": "ARSGS4RQUVL1O", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "M. Smith", "reviewText": "The Christmas Carol is my all time favorite story.  I haven't found a version that I haven't disliked yet.  This one was no exception.  Henry Winkler did an awesome joy portraying the Scrooge like character.", "summary": "The Christmas Carol is my all time favorite story. I haven't found a version that I ...", "unixReviewTime": 1508284800}
{"overall": 5.0, "verified": true, "reviewTime": "10 9, 2017", "reviewerID": "A21A5AK06GGXRT", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Julie Hemenway", "reviewText": "Heard about this movie saw it years ago. Husband wanted to see it, I just added it to my christmas movie collection.", "summary": "Heard about this movie saw it years ago. Husband ...", "unixReviewTime": 1507507200}
{"overall": 5.0, "verified": true, "reviewTime": "08 13, 2017", "reviewerID": "A3TPZM4CU8KLVI", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "amazon user 08", "reviewText": "Me and my husband love this movie", "summary": "Really impressed", "unixReviewTime": 1502582400}
{"overall": 5.0, "verified": true, "reviewTime": "06 19, 2017", "reviewerID": "A3Q7WXBOTKP05H", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "robert leib", "reviewText": "Great movie thank you !!!", "summary": "Five Stars", "unixReviewTime": 1497830400}
{"overall": 3.0, "verified": true, "reviewTime": "06 15, 2017", "reviewerID": "A101IGU6UDKW3X", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "DorothyZ", "reviewText": "Well made Christmas movie. It's a little slow but sweet natured.", "summary": "It's a little slow but sweet natured.", "unixReviewTime": 1497484800}
{"overall": 5.0, "verified": true, "reviewTime": "05 12, 2017", "reviewerID": "A2BY5BZZ5UAV9B", "asin": "0005019281", "style": {"Format:": " Blu-ray"}, "reviewerName": "Charles J. Mercik", "reviewText": "Great spin on the Classic Christmas Story by the master C. Dickens...", "summary": "Five Stars", "unixReviewTime": 1494547200}
{"overall": 5.0, "verified": true, "reviewTime": "04 30, 2017", "reviewerID": "AN61PQENFFEUR", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Great product, fast shipping", "summary": "Five Stars", "unixReviewTime": 1493510400}
{"overall": 5.0, "verified": true, "reviewTime": "04 13, 2017", "reviewerID": "A3W4LWZ37M9VZC", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "tk", "reviewText": "I love  this movie.  Bought for myself", "summary": "Great movie ", "unixReviewTime": 1492041600}
{"overall": 5.0, "verified": true, "reviewTime": "03 28, 2017", "reviewerID": "A1PLBB1E7VMZPK", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "racerswife", "reviewText": "Perfect family tradition movie!!", "summary": "So glad I found it!!", "unixReviewTime": 1490659200}
{"overall": 5.0, "verified": true, "reviewTime": "03 23, 2017", "reviewerID": "A14OJJGL4LIDIG", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Dorothy E. Morris", "reviewText": "great movie", "summary": "Five Stars", "unixReviewTime": 1490227200}
{"overall": 5.0, "verified": true, "reviewTime": "03 13, 2017", "reviewerID": "A1RAPP3YN10O53", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "We loved it. Henry Winkler is a great actor and we missed it not being on TV this year, so we had to buy it for our collection.  Thanks", "summary": "Henry Winkler A Christmas Carol", "unixReviewTime": 1489363200}
{"overall": 4.0, "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A2L3Y17SPNJ918", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "DLAllen", "reviewText": "This movie is better than it ought to be. Authentic settings and costuming for America 1930's Depression Era. The Scrooge character really does a good changeover. In old TV 4:5 ratio.", "summary": "Fronz does us proud!", "unixReviewTime": 1488844800}
{"overall": 5.0, "verified": true, "reviewTime": "03 7, 2017", "reviewerID": "A0160612BLIWRHROHLLE", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "BKelley56", "reviewText": "Good movie", "summary": "Five Stars", "unixReviewTime": 1488844800}
{"overall": 3.0, "verified": true, "reviewTime": "03 2, 2017", "reviewerID": "A340KTL9KUGYB7", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Mike Donnelly", "reviewText": "OK", "summary": "Three Stars", "unixReviewTime": 1488412800}
{"overall": 4.0, "verified": true, "reviewTime": "02 22, 2017", "reviewerID": "AM87PNTXTKLOI", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Frank  Mottis", "reviewText": "Love this movie it is a twist from the Original!", "summary": "Four Stars", "unixReviewTime": 1487721600}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2017", "reviewerID": "A3I6UVX7UWDYJM", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "great adaptation of dickens classic Henry winkler is a gifted actor", "summary": "Five Stars", "unixReviewTime": 1487635200}
{"overall": 5.0, "verified": true, "reviewTime": "02 21, 2017", "reviewerID": "A65UCXN2TPSGC", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Frank Annis", "reviewText": "I have been looking for this dvd for a long time. Love Henry Winkler in the movie", "summary": "Love Henry Winkler in the", "unixReviewTime": 1487635200}
{"overall": 5.0, "verified": true, "reviewTime": "02 16, 2017", "reviewerID": "A1S0IJ7JP3XQA6", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "John A Skiba", "reviewText": "There are MANY versions of \"A Christmas Carol\" out there. In my humble opinion, this feature length story, set in America during the Great Depression, starring Henry Winkler in the \"Scrooge\" role, is BY FAR the finest interpretation of the classic story. It's as Dickens would have written if he had lived in America in the 1930's. The human drama is REAL, and the joyful ending brings Dickens' ending into the American culture. BIG smile !", "summary": "The FINEST interpretation of Dickens' classic short story !", "unixReviewTime": 1487203200}
{"overall": 5.0, "verified": true, "reviewTime": "02 15, 2017", "reviewerID": "A3PIZ5GFM99EHB", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Anna holloway", "reviewText": "Henry Winkler puts his talent of playing the scrooge very well. I'm very glad to own it.", "summary": "I'm very glad to own it", "unixReviewTime": 1487116800}
{"overall": 5.0, "verified": true, "reviewTime": "02 11, 2017", "reviewerID": "A12782QUWY1AFE", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "drapelady", "reviewText": "One of the movies I watch every Christmas season. Replaced VHS with DVD", "summary": "Five Stars", "unixReviewTime": 1486771200}
{"overall": 5.0, "verified": true, "reviewTime": "02 10, 2017", "reviewerID": "A1NDUHALVFRJTB", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Phitch", "reviewText": "A classic", "summary": "Five Stars", "unixReviewTime": 1486684800}
{"overall": 5.0, "verified": true, "reviewTime": "02 2, 2017", "reviewerID": "A14Q3K4ZWJEKV6", "asin": "0005019281", "style": {"Format:": " Blu-ray"}, "reviewerName": "Jon Buxton", "reviewText": "Awesome show.", "summary": "Five Stars", "unixReviewTime": 1485993600}
{"overall": 5.0, "verified": true, "reviewTime": "01 31, 2017", "reviewerID": "AFOSVGL2LYWIF", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "ponygirl357", "reviewText": "I've watching this movie for several Christmas seasons and I just love it!", "summary": "A favorite of mine!", "unixReviewTime": 1485820800}
{"overall": 5.0, "verified": true, "reviewTime": "01 31, 2017", "reviewerID": "A1R1XADMBREFWQ", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "JM", "reviewText": "I've always liked the Scrooge movies and this one was a nice twist.", "summary": "great adaption", "unixReviewTime": 1485820800}
{"overall": 5.0, "verified": true, "reviewTime": "01 22, 2017", "reviewerID": "ADMM2Y62J94LF", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Caz Bowyer", "reviewText": "this is my all time fav christmas movie.  if you haven't seen this version you need to check it out at least once in your life.", "summary": "this is my all time fav christmas movie. if ...", "unixReviewTime": 1485043200}
{"overall": 4.0, "verified": true, "reviewTime": "01 18, 2017", "reviewerID": "A35OBW84S3ZNHC", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "ktvdpv", "reviewText": "Certainly not the best or my favorite but still very enjoyable!", "summary": "Four Stars", "unixReviewTime": 1484697600}
{"overall": 5.0, "verified": true, "reviewTime": "01 15, 2017", "reviewerID": "A2XO8WMP380UL", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "mary martin", "reviewText": "Always loved this version of a Christmas Carol.", "summary": "one of my favorite Christmas movies", "unixReviewTime": 1484438400}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2017", "reviewerID": "A1X0LEXETI5G46", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Amazon Customer", "reviewText": "Henry Winkler, cute as ever.  This movie is a nice addition to my Christmas Carol collection.", "summary": "This movie is a nice addition to my Christmas Carol collection", "unixReviewTime": 1484265600}
{"overall": 5.0, "verified": true, "reviewTime": "01 13, 2017", "reviewerID": "A20EIO8ZPG3ISM", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Amazon Customer8apalmer", "reviewText": "I bought this because I love the movie and i watch it every year", "summary": "Five Stars", "unixReviewTime": 1484265600}
{"overall": 5.0, "verified": true, "reviewTime": "01 11, 2017", "reviewerID": "ADRU3A5DLUE3E", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Rhonda Jackson", "reviewText": "Good movie. Good buy.", "summary": "Five Stars", "unixReviewTime": 1484092800}
{"overall": 5.0, "verified": true, "reviewTime": "01 9, 2017", "reviewerID": "A3V4288VUHAVZC", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "lesdeek", "reviewText": "My husband likes to watch and compare all of the Christmas Carol movies at the holiday. We were glad to be able to find this version.", "summary": "Good movie and good service...", "unixReviewTime": 1483920000}
{"overall": 4.0, "verified": true, "reviewTime": "01 6, 2017", "reviewerID": "A3PYWQ75W98M50", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "liz brennan", "reviewText": "good", "summary": "Four Stars", "unixReviewTime": 1483660800}
{"overall": 5.0, "verified": true, "reviewTime": "01 6, 2017", "reviewerID": "A1TFX38W8OW40N", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "AFC", "reviewText": "Well Done! Enjoyed it ! Will put on my list to watch every holiday season", "summary": "Enjoyed it! Will put on my list to watch ...", "unixReviewTime": 1483660800}
{"overall": 2.0, "verified": true, "reviewTime": "01 6, 2017", "reviewerID": "A2XAPJ7HD8IPOG", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Micro Manager", "reviewText": "We got bored and didn't finish the film.", "summary": "We got bored.", "unixReviewTime": 1483660800}
{"overall": 4.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "A3AKTNMH6TMCQA", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Norman A", "reviewText": "Found \"An American Christmas Carol\" to be enjoyable. In my opinion, it didn't rise to the level of the film versions of the Dickens Christmas Carol, but it was worth watching.", "summary": "Found \"An American Christmas Carol\" to be enjoyable. In ...", "unixReviewTime": 1483574400}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "A1OZ1K62Q42V2J", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Paul U Marin", "reviewText": "We have always loved the Christmas Carol. This American version was thoroughly enjoyed.", "summary": "Five Stars", "unixReviewTime": 1483574400}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "A1OY1ZCHFXOW2N", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Tiger5678", "reviewText": "An excellent Christmas movie", "summary": "Great Movie", "unixReviewTime": 1483574400}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "A21MCRS08G3EFP", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "southgate", "reviewText": "Excellent movie. Must watch for all c.e.o.'s", "summary": "Five Stars", "unixReviewTime": 1483574400}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "AXB3W1HWA2HBR", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Joseph Oliveira", "reviewText": "Will surely be a classic.", "summary": "Five Stars", "unixReviewTime": 1483574400}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2017", "reviewerID": "APDQEBD3PCDNG", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "diane", "reviewText": "Fantastic movie", "summary": "Five Stars", "unixReviewTime": 1483574400}
{"overall": 4.0, "verified": true, "reviewTime": "01 4, 2017", "reviewerID": "A1HSTN0YLV0KX8", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "S Libby", "reviewText": "Henry Winkler was great in this.", "summary": "Kind of like A Christmas Carol, Scrooge.", "unixReviewTime": 1483488000}
{"overall": 3.0, "verified": true, "reviewTime": "01 4, 2017", "reviewerID": "A3AV0IRT0TO3ZD", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Alma T. in Baltimore", "reviewText": "Is among my favorite updated versions of A Christmas Carol.", "summary": "Three Stars", "unixReviewTime": 1483488000}
{"overall": 2.0, "verified": false, "reviewTime": "01 3, 2017", "reviewerID": "A2O8XGRZ6REAVI", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "AFA_Prof", "reviewText": "Very slow start. The old grouch was not too believable since he was such a terrible jerk! Acting is sub-par", "summary": "Acting sub-par", "unixReviewTime": 1483401600}
{"overall": 4.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "AGUYCW0QAFPRQ", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Vitagirl", "reviewText": "A new twist on the classic Christmas Carol but still good. The setting is New Hampshire where I grew up.", "summary": "... new twist on the classic Christmas Carol but still good. The setting is New Hampshire where I grew ...", "unixReviewTime": 1483401600}
{"overall": 3.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "AO7OWLX3C1TRU", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Richard Seaberg", "reviewText": "Pleasant story, predictable outcome, but holds your attention.", "summary": "Three Stars", "unixReviewTime": 1483401600}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "A2UJMS0F97FTEV", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "mike", "reviewText": "I've seen ACC several times over the years and it has really grown on me as a homey American rendition of Dickens' classic work. It has it's own charm and message while maintaining inspiration of the original. One of the reasons I bought ACC from Amazon is that television has overlooked it, which is unfortunate.", "summary": "I've seen ACC several times over the years and it ...", "unixReviewTime": 1483401600}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "AU9OC23QEUJ9O", "asin": "0005019281", "style": {"Format:": " Blu-ray"}, "reviewerName": "RB", "reviewText": "Excellent DVD!  Thanks Amazon.", "summary": "Perfect!", "unixReviewTime": 1483401600}
{"overall": 5.0, "verified": true, "reviewTime": "01 3, 2017", "reviewerID": "A18Q89LTGSF1NA", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Juicysparks", "reviewText": "I'm a total fan of the story always nice to see different versions", "summary": "Five Stars", "unixReviewTime": 1483401600}
{"overall": 5.0, "verified": true, "reviewTime": "01 2, 2017", "reviewerID": "A1B4RZ1OFSLYQW", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Daniel B. Luber", "reviewText": "I've always loved watching \"American Christmas Carol\". Tradition in our family.", "summary": "Five Stars", "unixReviewTime": 1483315200}
{"overall": 5.0, "verified": true, "reviewTime": "01 2, 2017", "reviewerID": "AJ2K0TOX7XW01", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "S. WELLFORD", "reviewText": "This movie is really good,I loved it", "summary": "An American Christmas Carol", "unixReviewTime": 1483315200}
{"overall": 3.0, "verified": true, "reviewTime": "01 2, 2017", "reviewerID": "A6OJ6F0GXCJ90", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "M", "reviewText": "Didn't have the impact that the older versions had", "summary": "Three Stars", "unixReviewTime": 1483315200}
{"overall": 5.0, "verified": false, "reviewTime": "01 2, 2017", "reviewerID": "A5QCIMSUKG8M6", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "David Stewart Brooks", "reviewText": "If your a true believer of A Christmas Carol, then the FONZ is right there on top.", "summary": "Five Stars", "unixReviewTime": 1483315200}
{"overall": 3.0, "verified": true, "reviewTime": "01 2, 2017", "reviewerID": "AVSLEL5LAY67Q", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "OP", "reviewText": "It was OK but not the best.", "summary": "OK but not great.", "unixReviewTime": 1483315200}
{"overall": 4.0, "verified": true, "reviewTime": "01 1, 2017", "reviewerID": "A1IVRHBFSBRRVL", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Lucia", "reviewText": "It is classic Dickens with an American twist- timeless!", "summary": "Four Stars", "unixReviewTime": 1483228800}
{"overall": 5.0, "verified": true, "reviewTime": "12 31, 2016", "reviewerID": "A2DVSU8ZZ93H3Y", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "Mary L. Govoni", "reviewText": "Wonderful movie. Well made and Henry Winkler was amazing in this roll.", "summary": "Five Stars", "unixReviewTime": 1483142400}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2016", "reviewerID": "A1POQZF83AY4QB", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "sharon m sulzner", "reviewText": "Classic", "summary": "Five Stars", "unixReviewTime": 1483056000}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2016", "reviewerID": "A1QEPHG1V9D0RX", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Dawnette Skemp", "reviewText": "This has been a favorite of ours for many years.", "summary": "Five Stars", "unixReviewTime": 1483056000}
{"overall": 4.0, "verified": true, "reviewTime": "12 30, 2016", "reviewerID": "A1A0O4ZP39W2TW", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "kandersen", "reviewText": "My husband and I were looking for a Christmas movie to watch and stumbled across this one randomly. We chose it because of Henry Winkler. We were both pleasanly surprised at how much we liked it. It was a nice update on the classic story, even though it's \"old\" now. We both recommend it.", "summary": "A nice surprise", "unixReviewTime": 1483056000}
{"overall": 5.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A30U3TA6Q9GREF", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Sandra J.", "reviewText": "Like", "summary": "Five Stars", "unixReviewTime": 1482969600}
{"overall": 5.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A26MVQVZY0EBHF", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Bee Savi", "reviewText": "Great movie.", "summary": "Five Stars", "unixReviewTime": 1482969600}
{"overall": 4.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "AUWYDVC4X4Y0H", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Tab C.", "reviewText": "I like Henry Winkler playing Scrooge. Plus it was sent what different than the original.", "summary": "Four Stars", "unixReviewTime": 1482969600}
{"overall": 5.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A20ILGIRTI1A3J", "asin": "0005019281", "style": {"Format:": " DVD"}, "reviewerName": "michael rute", "reviewText": "Great", "summary": "Five Stars", "unixReviewTime": 1482969600}
{"overall": 5.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "AVIKFXS6MT2YV", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Joisey", "reviewText": "I've seen this one before and I loved it.  I thought Henry Winkler was awesome, as was the rest of the cast.", "summary": "Loved this one...", "unixReviewTime": 1482969600}
{"overall": 2.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A3BPS2OLX3B2TO", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "SabinaDeMartini", "reviewText": "Hate to say it, but this is an example of a re-make falling short of the mark.", "summary": "Stick with the classic version", "unixReviewTime": 1482969600}
{"overall": 4.0, "verified": true, "reviewTime": "12 29, 2016", "reviewerID": "A2LPFBAOMC749J", "asin": "0005019281", "style": {"Format:": " Amazon Video"}, "reviewerName": "Toots", "reviewText": "A great contemporary perspective of A Christmas Carol!", "summary": "Great!", "unixReviewTime": 1482969600}
