{"reviewerID": "A15I9QV4OG22A6", "asin": "001212835X", "reviewerName": "cc.gar", "helpful": [0, 0], "reviewText": "This was a christmas gift for my mother for she has been wanting on for several months and she was &#34;extremely&#34; pleased with the beauty of this lamp. She said its a lot prettier in person than in the picture,JUST BEAUTIFUL. Thanks for having it here amazon", "overall": 5.0, "summary": "AWESOME LAMP", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A1BNZ90HN39TYR", "asin": "0205062040", "reviewerName": "Anne M Johnson", "helpful": [0, 0], "reviewText": "This made quick work or putting down decking. Decking was evenly spaced and no ugly screw heads. Only thing that could make it better is a stronger handle.", "overall": 5.0, "summary": "Awesome tool", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "A9DUCBTL8K3E4", "asin": "0205062040", "reviewerName": "Bob J \"tarheelinva\"", "helpful": [1, 1], "reviewText": "I had to tear off a small bedroom deck in order to have the shingles below it replaced, so I decided to test this out to see if, when I replace the rest of the decking, it really does work well before committing to it.  WELL, IT DOES!  Even when we had to face screw the board up against the siding, the holes were so small that you really could not see them, looked like a divet and after a couple of rains, all but disappeared.  The screws that are used would even work without the CAMO DECK TOOL for most situations but of course using the tool puts them on the edges where you really cannot see them at all.  Even my deck guy, who was resistant to even use this 'system' was impressed.  And that wasn't easy to do given he wanted to use nails!One word of caution: there are several different models - this one is the 1/16\" inch spacing model for pressure treated decking.  The spacing barely exists and appears almost solid but eventually the lumber will shrink a little and the spacing should be more like 1/8\" inch, after it dries out some.", "overall": 5.0, "summary": "IN A WORD:  EXCELLENT COOL TOOL!", "unixReviewTime": 1382659200, "reviewTime": "10 25, 2013"}
{"reviewerID": "AA8O583KRYINX", "asin": "0205062040", "reviewerName": "Brian Taylor", "helpful": [0, 0], "reviewText": "The tool works great, as advertised.The narrow gap is perfect for our wet lumber.Would recommend this to a friend.", "overall": 5.0, "summary": "Delivery was on time.  Tool works great", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}
{"reviewerID": "A16CR5RCPXFMMA", "asin": "0205062040", "reviewerName": "canyncarvr", "helpful": [4, 4], "reviewText": "If you want to side-screw decking, this tool works.  I'm installing pressure treated Doug Fir.  PT wood is hard on the surface, it doesn't generally start nails or screws as easy as untreated wood does.  Using Camo screws (NOT split-tipped trim-head screws), an installed deck board finishes well.The tool does NOT orient itself 90 to the run of the board without careful placement.  Until you get used to it, DO make sure it is placed square to the board before starting the screws.I think it unfortunate that one cannot configure BOTH ends of the tool to a specific gap.  With the 1/16&#34; spacing of only the adjustable width edge (at the 'back' of the tool) and 3/16&#34; in the front you cannot use the tool but on the leading board.  That makes the replacement of a board that has been narrowly spaced impossible with the use of the tool.  You can start the screws BEFORE placing the board..that would work.  I'd prefer the same spacing front and back.Spacing:  Why not a 1/8&#34; spacer?  I asked National Nail if they were considering that option, was told, 'No.'  My opinion, but 3/16&#34; is too wide, 1/16&#34; is too narrow.  Using a nail as a spacer is a method that has been used for about ever..and a nail is real close to 1/8&#34;.I'm only about 1/2 done on my current deck job, the first with this tool (homeowner, but I've put in 4-5 decks) and it has worked well so far.  The guides are not degrading with use.  The handle does flex a good bit, but as the instructions indicate, don't use it to do the job a board clamp or other placement tool should be used to do.I had looked into several 'side screw' or hidden fastener methods, having used only face-placed screws in the past.  No slot-type, biscuit cut system interested me.  I know folks that used DeckMaster and wouldn't touch that setup.The lack of spacing options is about the only issue that keeps this from a 5-star rating.  There is NO way I could use a bore-type tip (like the camo screws) without this guide...and a split tip would do exactly that:  Split.", "overall": 4.0, "summary": "Good tool!", "unixReviewTime": 1364256000, "reviewTime": "03 26, 2013"}
{"reviewerID": "A398X3UMHLCM93", "asin": "0205062040", "reviewerName": "JF", "helpful": [0, 0], "reviewText": "Easy to use and produces a clean deck board appearance. Used the camo jig on ptp, so time will tell if shrinkage and cupping becomes an issue. Overall I think this is a great tool.", "overall": 5.0, "summary": "Camo jig", "unixReviewTime": 1368403200, "reviewTime": "05 13, 2013"}
{"reviewerID": "A14JYXSTIUTXP", "asin": "0205062040", "reviewerName": "Kelly Huffman", "helpful": [0, 0], "reviewText": "I used the Camo Pro-X1 to install a fence using 1x6 boards installed horizontally.  It worked really well.  I used the 1/16th gap which is installed in the back of the product.  I couldn't figure out how to swap the front 3/16th with the back 1/16th and I don't think it can be done.  So in order to use the 1/16th I just put the tool down backward on each board.  A lot of my fence goes up a hill and connecting to the verticals was easy as you simply move the tool after the top screw is in to install the bottom screw.  In some areas I couldn't use the tool I predrilled the boards and used the camo fastners without it and that worked well too.", "overall": 5.0, "summary": "Great tool", "unixReviewTime": 1366070400, "reviewTime": "04 16, 2013"}
{"reviewerID": "A1PJ3XCSKTWWWG", "asin": "0205062040", "reviewerName": "L. McCool", "helpful": [0, 0], "reviewText": "This tool is awesome. It works great. It's super easy to use. Love it. Would not do a deck without one. My daughter and I did her 16ft x 16 ft deck with ease. We used 2 drills with the two bits included with the 2 3/8 screws pack we bought and finished the deck with the same two bits. Her deck boards are 2 x 6 x 16. My husband did shoot some screws next to house with out the tool and that worked great too. My daughter never used a drill before and myself rarely, and we had no problems. We had no problems with the tool lining up to the studs either. The screws pulled themselves easily into the wood. And the look of the deck is fantastic. I'll post pics too. It was a fun project for us all around. We used this one so we could have the 1/16 in gap as opposed to the less expensive one. Sure it took longer then an air gun nailer, but we never split a board or had the screw sticking out of the stud. underneath. And we did back some screws out and that worked easily also.", "overall": 5.0, "summary": "This tool is awesome. It works great", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A1Q4SCKKL5FRQF", "asin": "0205062040", "reviewerName": "T. Culbertson", "helpful": [1, 1], "reviewText": "I just finished an 800 sqft deck using this tool.  It is simple to use and durable but here are a few tips/tricks I learned along the way.-The tools spacing ability is good but not sufficient.  If you are laying a 10ft board and you just use this tool to space it then the board will probably be crooked.  How much will depend a lot on the materials.  I bought two of these and would use one at each end which helped a lot but many of the boards were still not straight.  I would recommend using additional spacers to help keep the boards aligned.-Don't push down on the handle.  Sure, it's tempting, but I can guarantee you'll break it off.  I was very careful and it did not happen to me but I could see how easy it would be to break.  If you are trying to squeeze the tool into a tight space, place your palm on the flat area below both handles and gently rock the tool a little.-If you are really in a tight spot, remove the spacer (the 1/16th spacer removes completely) and use it by itself.Why only 4 stars?-The tool is a tad expensive.  It is of good design but there really isn't much to it.  Materials wise, it probably should only be $25-$30.-The screws are decent but I did break a few and they are pretty expensive.  For the same price you would get a much higher quality deck screw.-The star bits are only ok quality.  A couple of mine bent and rusted.  On top of that they are well overpriced compared to regular star bits.-Boards are not very easy to remove.  I had to pull up a couple of boards for various reasons and it wasn't easy.  It wasn't super complicated, but it was definitely more complicated than face screws would have been.", "overall": 4.0, "summary": "Very good tool but a little overpriced.", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A24ROB2LAIF4O9", "asin": "0615247881", "reviewerName": "Christine R. Oertel", "helpful": [0, 0], "reviewText": "I have seen him at a wood show and decided to see if his DVD would present more information.  I found a good amount of information and I like his style of turning", "overall": 5.0, "summary": "Good show", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A2RVOCG9HV376V", "asin": "0955793505", "reviewerName": "Bob Eddy", "helpful": [0, 0], "reviewText": "This is a good reference for someone like myself who is just getting started in woodworking. It has good explanations for terms used and names and uses of various bits. Recommended.", "overall": 5.0, "summary": "Good reference volume", "unixReviewTime": 1251331200, "reviewTime": "08 27, 2009"}
{"reviewerID": "A3PU3EDJ2FG1AW", "asin": "0955793505", "reviewerName": "JUST-JIM", "helpful": [0, 0], "reviewText": "Item description doesnt let you know that this book and Author are UK and not USA. The equipment illustrated is \"Trend\" which is UK routers and accessories. Nothing wrong with that but I want a book that shows USA routers and accessories. A lot of the items shown are not available in the US. Excellent paper and razor sharp illustrations. Does seem to gloss over some of the techniques used. Need to return it and look for something else. Too high priced for what it is.", "overall": 2.0, "summary": "Geared To The UK Market", "unixReviewTime": 1291852800, "reviewTime": "12 9, 2010"}
{"reviewerID": "A1VBM19O3QFVO8", "asin": "0963469142", "reviewerName": "acole", "helpful": [0, 0], "reviewText": "i used to play this game with my family, but then i moved away for college, so i bought it for myself and friends to play. i was a little sad about how long it took for me to receive it but the game is well worth it.", "overall": 5.0, "summary": "the best game ever", "unixReviewTime": 1363132800, "reviewTime": "03 13, 2013"}
{"reviewerID": "A2EIUF0KYW6KN1", "asin": "0963469142", "reviewerName": "bevm", "helpful": [3, 3], "reviewText": "This is an awesome card game. I purchased a deck for my sister a few years back and we play it quite frequently. We had to purchase a new deck due to using the old one so much the cards started to stick together when you tried to deal. It is a game similar to Rummy, you start with dealing 3 cards and then increase the number of cards each hand until 13. The number of cards dealt is the value of the Wild card. It is similar to Gin Rummy, in which a player lays down his hand of all 3 of a kind (or higher) and straights when he has a handful. The twist to the game is that each other person gets one more turn and then get to lay down their 3 of a kinds and straights. The remaining cards are points for each player.", "overall": 5.0, "summary": "Great card game", "unixReviewTime": 1289952000, "reviewTime": "11 17, 2010"}
{"reviewerID": "A1CNEIDVNZJ8RU", "asin": "0963469142", "reviewerName": "Daria Wheeler", "helpful": [0, 0], "reviewText": "This game is Fun for entire family!  I would reccommend to purchase if you are looking for a new game.", "overall": 5.0, "summary": "Great Game!", "unixReviewTime": 1392940800, "reviewTime": "02 21, 2014"}
{"reviewerID": "A3A9LIBBMKDB7N", "asin": "0963469142", "reviewerName": "Diane Holland", "helpful": [0, 0], "reviewText": "We have played this game with both adults and kids.  We all love the game.  I purchased one for each of my kids for Christmas so that we can play with them when we go for the holidays.", "overall": 5.0, "summary": "Great game!", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "A2WZOR5K90SA05", "asin": "0963469142", "reviewerName": "jUDY kNEPP", "helpful": [0, 0], "reviewText": "It was easy to order and there was alittle mixup with the mailing-got it 2 days after expected but we've played quite a few times and are really enjoying it", "overall": 5.0, "summary": "great service", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "A2AGNKN11N5RVT", "asin": "0963469142", "reviewerName": "Mary", "helpful": [0, 0], "reviewText": "It is a stimulating card game enjoyed by all ages...........this is our seventh card game purchased as we give it out for gifts to our friends.Mary, Iowa", "overall": 5.0, "summary": "Five Crown", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "A39K7WXUS6149R", "asin": "0963469142", "reviewerName": "Patricia nk", "helpful": [0, 0], "reviewText": "My card friends played Five Crowns for the first time Friday.  And, it was a big hit!  They now want to include it in our Friday games.", "overall": 5.0, "summary": "Big Success!", "unixReviewTime": 1398470400, "reviewTime": "04 26, 2014"}
{"reviewerID": "A2H4DYPDENQ45X", "asin": "0963469142", "reviewerName": "Peg", "helpful": [0, 0], "reviewText": "Love this game. My husband and I play this every night since we received it by mail.  It's more fun with 3 or 4 playing but it's enjoyable even with just the two of us.", "overall": 5.0, "summary": "An Exciting Card Game", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A1Y32SA4NDUGHZ", "asin": "0963469142", "reviewerName": "Rita Beasley", "helpful": [0, 0], "reviewText": "this is worth every penny  we have bought several sets for friends and family. do not go camping or travel without it being packed.", "overall": 5.0, "summary": "great game", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}
{"reviewerID": "A27DTS23LMO6BV", "asin": "0963469142", "reviewerName": "Texas", "helpful": [0, 0], "reviewText": "This is a fun, fast moving game even for adults.  It is one of our favorites and we always enjoy playing it.", "overall": 5.0, "summary": "Fun game", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A26WHG8F960C8N", "asin": "0980966043", "reviewerName": "D. Thompson", "helpful": [0, 0], "reviewText": "Making Shaker oval boxes is easy after viewing this CD.  There are clear instructions from a man who makes his living making these boxes and then it is transfered to the shop of Rob Cosman who then shows how to do it in the more usual shop.  Nicely done and a big help.", "overall": 5.0, "summary": "Box Making", "unixReviewTime": 1340323200, "reviewTime": "06 22, 2012"}
{"reviewerID": "A1ANA3WGU5R7NA", "asin": "0980966078", "reviewerName": "Joseph D. Snare \"woody\"", "helpful": [0, 0], "reviewText": "Rob does a great job of educating and encouraging newbies and seasoned woodworkers to improve their skills. He is knowledgeable and easy to understand.", "overall": 4.0, "summary": "good instruction", "unixReviewTime": 1375142400, "reviewTime": "07 30, 2013"}
{"reviewerID": "AQVZ7XKV1YYSI", "asin": "100100003X", "reviewerName": "AndiBanana", "helpful": [3, 3], "reviewText": "these are exactly what I needed for my resin magnet crafts.  I have glued some on with zap-a-gap and have imbedded some in the resin.  I like super strong magnets for my fridge and whiteboards in my classroom and these fit the bill.  They came 2 days earlier than estimated as well.  I havent had any of the chipping/cracking problems that others have described, but I have been really careful to not let them snap together.  Once glued to the plastic resin they have dropped onto the steel board I've been using and have not chipped/broken either.  I was worried that the 1/16th in height would not be strong enough for me, but they are great!  Easily holds 3-4 pieces of cardstock to my fridge.  WIll be ordering again soon as I have already found uses for all 24!", "overall": 5.0, "summary": "SUPER Strong!!", "unixReviewTime": 1361145600, "reviewTime": "02 18, 2013"}
{"reviewerID": "A28LXIZQOEQ6KY", "asin": "100100003X", "reviewerName": "A. Rabun \"A. Rabun\"", "helpful": [2, 2], "reviewText": "Not much to say except they are as strong as they promise to be. NOTHING falls of of the cabinet when attached with one of these.", "overall": 5.0, "summary": "I use these to hold photos to a steel file cabinet...perfect", "unixReviewTime": 1362096000, "reviewTime": "03 1, 2013"}
{"reviewerID": "AKMV5HZGR833S", "asin": "100100003X", "reviewerName": "B.H.", "helpful": [0, 0], "reviewText": "These magnets are the real deal.  We get tons of Christmas cards, baby announcements, wedding photos, etc and the refrigerator literally gets covered.  We ran out of magnets and I was never a fan of the big &#34;travel&#34; magnets my wife had.  So I bought these and loved them so much I bought another pack of them.  They're very strong.  One magnet can hold up a photo calendar on the refrigerator (I would recommend using two, but one will hold it). They're quite small and you really don't notice them.  I haven't had any issues with them being fragile yet and I've had the first set about a year now.  The only negative is they're strong.  If two of them get stuck together, given they're so small they can be hard to get apart....but you'll figure it out.", "overall": 5.0, "summary": "These are awesome!", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}
{"reviewerID": "A3RDBZOP8WIPRW", "asin": "100100003X", "reviewerName": "Calin Day \"fellow reader\"", "helpful": [1, 1], "reviewText": "These little magnets are so strong I can put one on the inside of my thumb and the other on my thumnail and they will hold. Amazing. They're so strong you'll have to &#34;slide&#34; them apart, (pulling is too difficult as they are very little.) I glued them to my metal spice canisters with super-glue to make a magnetic spice rack, and would definitely purchase them again if I need more.", "overall": 5.0, "summary": "These little magnets really are incredible!", "unixReviewTime": 1371513600, "reviewTime": "06 18, 2013"}
{"reviewerID": "A11CA7RI6BJ9XF", "asin": "100100003X", "reviewerName": "Debbie Ann", "helpful": [2, 2], "reviewText": "HIGHLY RECOMMEND.  Incredibly strong. A fit difficult to separate, and they do break, so be careful with them. All in all, they are impressive.", "overall": 5.0, "summary": "INCREDIBLY STRONG !", "unixReviewTime": 1367107200, "reviewTime": "04 28, 2013"}
{"reviewerID": "AUX43KFPU8RXM", "asin": "100100003X", "reviewerName": "D Warren", "helpful": [1, 1], "reviewText": "These magnets are super strong. I have them in the four corners of some pictures, which is really over kill for these magnets. Once the pictures stay hanging and stop rolling up I'll just use one. The magnets are tough to seperate, trust me!! Even more they attracted to the wall almost out of my hand. If I ever need to hang anything such as a calendar, picture or card with a magnet, best believe I'll use one of these.", "overall": 5.0, "summary": "Awesome Magnets", "unixReviewTime": 1325721600, "reviewTime": "01 5, 2012"}
{"reviewerID": "AG1WIYDWYJK2A", "asin": "100100003X", "reviewerName": "FriendOfGod", "helpful": [0, 0], "reviewText": "I used these to hold my music to my music stand during an outdoor band concert, and they worked really well.  They are strong and will hold almost anything!  If you want strong magnets, these are for you!", "overall": 5.0, "summary": "Perfect!", "unixReviewTime": 1373241600, "reviewTime": "07 8, 2013"}
{"reviewerID": "A2W19IAPS7ZSDK", "asin": "100100003X", "reviewerName": "Ian Mazursky", "helpful": [0, 0], "reviewText": "The MAGCREDIBLE Magnets - 1/2&#34; x 1/16&#34; Rare Earth Disc, Package of 24 are great for attaching those cheap stickable 3 LED push button lamps to a metal surface.I tape the magnet on the inside of the LED lamp with some vinyl tape and remove the foam tape that came with it (that foam tape is horrible long term).The LED lamp now sticks to any ferrous metal surface, pretty neat!  Tons of other uses like holding screwdrivers, tools, papers...As others have mentioned, these are thin and prone to fracturing.  True, broke one when i wasn&#8217;t paying enough attention and they slammed together.Thicker ones are a little more able to withstand the shock but can still fracture.  So be careful to not let them hit each other or hit a surface hard.  Some tape around on the magnet or surface would help cushion them a bit.", "overall": 5.0, "summary": "Great magnets!", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A28LVHOJP8PMCN", "asin": "100100003X", "reviewerName": "kathyo", "helpful": [0, 0], "reviewText": "I love them because they are very strong. Be very careful. They are hazardous to separate. I had to use a wood ruler to remove the top magnet from the stack. It would jump over the ruler and stick to the ruler.", "overall": 5.0, "summary": "Very strong; be very careful when handling", "unixReviewTime": 1385337600, "reviewTime": "11 25, 2013"}
{"reviewerID": "AEKUW2YNK4W16", "asin": "100100003X", "reviewerName": "Moxynika", "helpful": [3, 3], "reviewText": "If you let the magnets snap back together with too much force they will shatter (broke three this way - even being careful). And if you don't have fingernails, they're pretty hard to separate. Watch your little ones because magnets can pinch, too. If you want strong, they deliver.", "overall": 3.0, "summary": "too strong?", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A51AJSMDS8O5V", "asin": "100100003X", "reviewerName": "Paul J. Meisel", "helpful": [2, 2], "reviewText": "Pro:I can put half the stack on either side of my hand and I keep feel them pulling.  It is hard to separate the magnets from each other.Con:The down side is that since the magnets are so strong and thin, when I split the stack in half, the pull of the two halves caused the magnets to slam into each other so hard/fast that one of the center magnets broke in half.", "overall": 4.0, "summary": "Very powerful but fragile", "unixReviewTime": 1360627200, "reviewTime": "02 12, 2013"}
{"reviewerID": "A1NIWMCPYTGG1Q", "asin": "100100003X", "reviewerName": "Samantha Mathews", "helpful": [0, 0], "reviewText": "Every single one of these broke while I tried to take it off the others. They all broke junk. Don't waist your money", "overall": 1.0, "summary": "Crap", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "A2W1IR4W3AF23J", "asin": "100100003X", "reviewerName": "tony s", "helpful": [2, 2], "reviewText": "Magnets are super strong. Using them for self closing doors and they work great. Great magnets in a small size.", "overall": 5.0, "summary": "Rare Earth Magnets", "unixReviewTime": 1360972800, "reviewTime": "02 16, 2013"}
{"reviewerID": "A8G4U7AM7QLUN", "asin": "100100003X", "reviewerName": "Vince Rock", "helpful": [1, 1], "reviewText": "They are strong little magnets. They stick to metal. What more could you ask for? They are a little difficult to pry apart from one another but again they are magnets.", "overall": 5.0, "summary": "Magnets", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}
{"reviewerID": "A3A5OD0Z874X9A", "asin": "104800001X", "reviewerName": "Alex", "helpful": [0, 0], "reviewText": "I use these extensively for magnetizing weapon load-outs for minis. Just get the appropriate drill bit and with a bit of practice you can magnetize those different weapons!", "overall": 5.0, "summary": "Perfect for magnetizing miniatures", "unixReviewTime": 1401753600, "reviewTime": "06 3, 2014"}
{"reviewerID": "A228NVPTR3AJUP", "asin": "104800001X", "reviewerName": "Alfredo Sp.", "helpful": [1, 2], "reviewText": "I have the magnets on my hand, excellent delivering time, very powerful to its size, i just have to say... Thanks MagnetMan", "overall": 5.0, "summary": "Excellent Delivering Time", "unixReviewTime": 1330560000, "reviewTime": "03 1, 2012"}
{"reviewerID": "A3UD4HSTTIMYDC", "asin": "104800001X", "reviewerName": "Alynn Brodine", "helpful": [0, 0], "reviewText": "These magnets worked great for the project I wanted them for.  They arrived well packaged, they are kind of fun to play with but most of all they hold things together like I needed them to.", "overall": 5.0, "summary": "Great little magnets.", "unixReviewTime": 1391817600, "reviewTime": "02 8, 2014"}
{"reviewerID": "ABT97IY2WZJM5", "asin": "104800001X", "reviewerName": "Amazon Customer \"Breuks\"", "helpful": [13, 14], "reviewText": "These magnets are very small, but powerful!  We bought them for our child's room which we had used magnetic paint on a wall.  These are much more powerful than regular magnets and worked great on this magnetic paint. Highly recommend!", "overall": 5.0, "summary": "Super powerful small magnets", "unixReviewTime": 1316131200, "reviewTime": "09 16, 2011"}
{"reviewerID": "A1CLUTPJSPLLPN", "asin": "104800001X", "reviewerName": "Amazon Customer \"eaglesong3\"", "helpful": [3, 3], "reviewText": "The only bad reviews I recall seeing for this product were from people who didn't anticipate the size.  Go grab your ruler and look at those tiny marks along the side of it. No, not those, the even smaller ones!  These are exactly what they claim to be.  They are 1/8\" diameter by 1/16\" thick wafer magnets.  The holding force is GREAT for such a small magnet.  These are exactly what I needed for a project I'm working on.-= Edit =-Had these at a group meeting where we were playing around with them to test their strength.  Just one of these magnets was able to hold up a horse shoe.  It wouldn't hold up to any sort of vibration but the magnet DID hold up the weight.  Can't make any guarantee as to the consistency of this holding power but they do seem to perform over the 0.8 pound rating.", "overall": 5.0, "summary": "Very strong for such a tiny (Yes people, TINY) magnet", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}
{"reviewerID": "A1TNXXT9B5PCGT", "asin": "104800001X", "reviewerName": "Amazon Customer \"Eric\"", "helpful": [0, 6], "reviewText": "Returned.  Magnets were much smaller than seemed by picture and I didn't receive 100 magnets.  Be sure to count the magnets if order.  Product was also over priced for what received.", "overall": 1.0, "summary": "Microscopically tiny... count your magnets.", "unixReviewTime": 1384992000, "reviewTime": "11 21, 2013"}
{"reviewerID": "A3JM1BAVF27KUH", "asin": "104800001X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I got these to use for geocache hides and am very happy with the super strength these little magnets have.", "overall": 5.0, "summary": "Very strong ...", "unixReviewTime": 1390348800, "reviewTime": "01 22, 2014"}
{"reviewerID": "A3QZUG1RLZX5SH", "asin": "104800001X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I was amazed at how small these were. My fault for not looking at the size. I needed about three for the application intended.", "overall": 3.0, "summary": "Smaller than expected. My fault for not realizing though", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"}
{"reviewerID": "ACHBGIKTTW6EJ", "asin": "104800001X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "These were exactly what was needed for minature studio work!  So helpful to see scale and understand polarity of choices.", "overall": 5.0, "summary": "stron and tiny", "unixReviewTime": 1379203200, "reviewTime": "09 15, 2013"}
{"reviewerID": "A2RCXP3G7DGU1H", "asin": "104800001X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "These worked just right for the project I had.  I made some chore charts for the kids where they flipped a cover up when they are done with the chore.  It worked just right!  I hot glued them to the laminated papers and they close together with a satisfying snap!  Work great!  Warning tho - they are SUPER small!!  I had to use my nails to get them apart and be really careful that they didn't fall or it would be really hard to find them.", "overall": 5.0, "summary": "Love them!", "unixReviewTime": 1383868800, "reviewTime": "11 8, 2013"}
{"reviewerID": "A15PEICO9X46LM", "asin": "104800001X", "reviewerName": "Angeltrumpetlover", "helpful": [0, 0], "reviewText": "These are very small magnets.  My wife bought them for me for Christmas, but did not see that penny for scale.  For how small they are, they make great little refrigerator magnets.", "overall": 3.0, "summary": "great for their size.", "unixReviewTime": 1390608000, "reviewTime": "01 25, 2014"}
{"reviewerID": "AL6QT34U6P7ZV", "asin": "104800001X", "reviewerName": "Anita Timmons", "helpful": [0, 0], "reviewText": "These are great for all kinds of projects. I use mine in making jewelry, and they're great.", "overall": 5.0, "summary": "Good magnets.", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
{"reviewerID": "ATABCIO9CN4DG", "asin": "104800001X", "reviewerName": "BabyGrl", "helpful": [0, 0], "reviewText": "Tiny, get very powerful. My cabinets wouldn't stay closed so I bought these to des terry hold them shut and I was worried they wouldn't work because how tiny the are, I only had to use one set and they worked like a charm", "overall": 5.0, "summary": "Verly strong", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"}
{"reviewerID": "AGA8MLV5MZMN0", "asin": "104800001X", "reviewerName": "Bamazon", "helpful": [0, 1], "reviewText": "These are awesome!I used them on my Baby shower invitations which were made out of cardstock. Two were fine for each for me.These also doubled as entertainment allowing really cool shapes by twisting and turning the rods here and there.I have a few left and will definitely be using them in the future.I would absolutely order them again from this company.", "overall": 5.0, "summary": "Small and strong! PERFECT!", "unixReviewTime": 1389139200, "reviewTime": "01 8, 2014"}
{"reviewerID": "A3A9R7J4BDRUZO", "asin": "104800001X", "reviewerName": "Becky Moder \"Becky Capps Moder\"", "helpful": [0, 0], "reviewText": "I was very skeptical but bought some anyway and love them! I have not one complaint and have already ordered more for an art project I am working on.", "overall": 5.0, "summary": "Super Strong", "unixReviewTime": 1396051200, "reviewTime": "03 29, 2014"}
{"reviewerID": "A1ZIRRYQ2OGZ9", "asin": "104800001X", "reviewerName": "Brewce", "helpful": [0, 1], "reviewText": "I bought these for my wife's crafts and thought they would be strong enough. Not these. I have had some this small that you could almost not get off. Those were the rare earth or neodymium as we'll and were super strong.", "overall": 2.0, "summary": "Too small for much of anything.", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "A2OKVB9KHK0UJO", "asin": "104800001X", "reviewerName": "Casey V. Roberts", "helpful": [20, 20], "reviewText": "I wanted some magnets to increase the flexibilty of several units in my Tau army and picked these up. At first I was a little nervous because they were so small, I thought \"There's no way these will work, I should have bought the 3/16\" sized ones.\" But I gave them a shot and low and behold they work perfectly!They are even strong enough that you can get away with only putting a magnet on one side of the model and just cutting up some paper clip or nails and embedding them on the other side. This is particularly useful since if you start cramming magnets on both sides and in several places on a miniature magnets can flip polarity. This has nothing to do with brand or manufacturing quality (both of which are top notch) it's just a matter of physics.Shipping from the company was surprisingly fast and arrived in good shape. The even came in a nice clear plastic sealable container so I don't need to worry about losing any of them!", "overall": 5.0, "summary": "Good for Miniature Wargamers", "unixReviewTime": 1323216000, "reviewTime": "12 7, 2011"}
{"reviewerID": "A1WYUW7GT419J5", "asin": "104800001X", "reviewerName": "Dan G Riley", "helpful": [0, 0], "reviewText": "They are magnets!", "overall": 4.0, "summary": "I like it", "unixReviewTime": 1397952000, "reviewTime": "04 20, 2014"}
{"reviewerID": "A3SQEZEIR67VWR", "asin": "104800001X", "reviewerName": "Danny", "helpful": [0, 1], "reviewText": "these things are small, like, really small - note the picture in the description with the penny - I didn't see that photo when I bought these things; however, now that I have them, I'm happy with how strong they are!  hope this helps.", "overall": 5.0, "summary": "smaller than I thought...but extremely strong", "unixReviewTime": 1370822400, "reviewTime": "06 10, 2013"}
{"reviewerID": "A2TJAZUPWNIPI4", "asin": "104800001X", "reviewerName": "Daryl Keller", "helpful": [2, 4], "reviewText": "Much smaller than anticipated and not strong enough for my purposes - fridge magnets - although I'm sure they have many uses in this size. This time I'm trying 1/2&#34; or 1/4&#34;.", "overall": 3.0, "summary": "Much smaller than anticipated and not strong enough for my purposes...", "unixReviewTime": 1378598400, "reviewTime": "09 8, 2013"}
{"reviewerID": "A4IL0CLL27Q33", "asin": "104800001X", "reviewerName": "D. Brennan", "helpful": [0, 1], "reviewText": "I hate it when my shirt collars, not otherwise secured in place by buttons, end up in weird places throughout the day. I purchased some steel collar stays to use with these magnets but they were only vaguely magnetic. I ended up using 2 of these magnets - one in the collar with the stay and the other inside my shirt, to lock my collar in place. They work flawlessly. They are the perfect size, and there are plenty of magnets in case you forget to remove them at the end of the day.", "overall": 5.0, "summary": "Perfect for collar stay management", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
{"reviewerID": "A28JT0QSMISTA2", "asin": "104800001X", "reviewerName": "DCVs", "helpful": [0, 0], "reviewText": "These magnets are strong and tiny. They work perfectly for putting photos up on the fridge! Would definitely recommend these.", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}
{"reviewerID": "A2FSQO914K0BH1", "asin": "104800001X", "reviewerName": "Diaz52", "helpful": [0, 0], "reviewText": "These magnets have the power of Magneto, the arch villain of the X-men! LOL. Seriously tho, these are strong little suckers. Now using them takes some getting used to because 1.) they are so small and 2.) they are so strong. Did I mention these suckers are small? Yes they are, but that's right there in the description. I use them for miniatures and boy it can be frustrating but they do work well once you get the hang of it. Good product.", "overall": 5.0, "summary": "Very strong magnets", "unixReviewTime": 1379289600, "reviewTime": "09 16, 2013"}
{"reviewerID": "A39YYFT66INXKA", "asin": "104800001X", "reviewerName": "DmUra91", "helpful": [0, 0], "reviewText": "I play Warhammer 40k, and use Space Marines.  That group loves to adapt as the situation demands, so no one weapon is perfect.  With that in mind, I wanted some small magnets I could hide on a model to be able to switch between loadout options.  These magnets are beautiful for that; Want a weapon mount on the side instead of a door? Remove the unglued door, stick a magnet on (or in with a good enough drill) one side of the plastic and a magnet or two on the mounting and presto.  Want a decorated trooper to ride a bike on occasion instead of walking?  Put a magnet in the torso, a pin in the legs and there you go.The downside is they love to pull towards each other, even through your hand or the plastic;  I've learned to use this trait to my advantage by applying glue to a magnet and letting it &#34;fly&#34; to the very spot I wanted by loosely placing a magnet on the other side and letting it sit.Overall:  4.75.  Don't always cooperate but works wonders when they do.  Have recommended and would recommend again.", "overall": 5.0, "summary": "Handy little pests.", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}
{"reviewerID": "AEK026X4KYVZF", "asin": "104800001X", "reviewerName": "Dona E. Russell \"donarussell\"", "helpful": [1, 1], "reviewText": "These magnets have great power, but realize that they are not much bigger than a pin head when you are sizing for your needs.  Good magnet, tiny size.", "overall": 5.0, "summary": "tiny mighty magnets", "unixReviewTime": 1329177600, "reviewTime": "02 14, 2012"}
{"reviewerID": "A2E8TG1L6HXGLC", "asin": "104800001X", "reviewerName": "Douglas \"Heavy Metal!\"", "helpful": [0, 0], "reviewText": "These little suckers are small but strong. I use them for my hobbys or other crafting things.Keep em away from kids, and be very careful that you don't lose them. They have great putt for their size and the price is pretty fair, I feel.", "overall": 5.0, "summary": "Tiny and strong", "unixReviewTime": 1391385600, "reviewTime": "02 3, 2014"}
{"reviewerID": "A1H2T5ZD7E1MXE", "asin": "104800001X", "reviewerName": "Elisa", "helpful": [0, 0], "reviewText": "Very strong, used to hold a print to the back of a sheet of plexiglass. Held right through the plexi!", "overall": 5.0, "summary": "Used with plexiglass", "unixReviewTime": 1365811200, "reviewTime": "04 13, 2013"}
{"reviewerID": "ALJ0AEZJH3FXW", "asin": "104800001X", "reviewerName": "Emily S. Whitten", "helpful": [0, 0], "reviewText": "VERY tiny (which is what I wanted) and VERY strong magnets. They will work well for crafting I'm planning to do.", "overall": 5.0, "summary": "Tiny and strong!", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "ANXJGPQTT2I1M", "asin": "104800001X", "reviewerName": "Erica Li", "helpful": [0, 1], "reviewText": "These neodymium magnets are the best value - tiny (only ~3 millimeters in diameter) yet incredibly strong. I use them for attaching to the back of wooden art pieces ranging from 2-5 inches in size and only need 2 magnets at most per piece. Will definitely purchase again once I run out!", "overall": 5.0, "summary": "Amazing & Strong Magnets", "unixReviewTime": 1388188800, "reviewTime": "12 28, 2013"}
{"reviewerID": "A34ZXCPU2EWGKM", "asin": "104800001X", "reviewerName": "Eric W. Vollrath", "helpful": [0, 1], "reviewText": "These magnets are perfectly sized for my purpose, which is to magnetize the options on my Warhammer 40k mini's. While you may need one size larger for bigger items, like tank turrets, they work acceptably well for arms and guns. Will definitely purchase again.", "overall": 5.0, "summary": "Good for magnetizing miniatures.", "unixReviewTime": 1332547200, "reviewTime": "03 24, 2012"}
{"reviewerID": "A17KBIYUKGR3OG", "asin": "104800001X", "reviewerName": "E-RiQ", "helpful": [0, 0], "reviewText": "They are tiny and strong, just as advertised. Very useful for many different applications. I can hang things on my magnetic board very easily and not have to worry about things falling.", "overall": 5.0, "summary": "Great magnets", "unixReviewTime": 1392854400, "reviewTime": "02 20, 2014"}
{"reviewerID": "A1H4NFXAJQRQ2K", "asin": "104800001X", "reviewerName": "Fred", "helpful": [0, 0], "reviewText": "These are great little magnets but I chose a size too small for my intended usage... I still might be able to use them though.", "overall": 5.0, "summary": "great but think about size before choosing", "unixReviewTime": 1400112000, "reviewTime": "05 15, 2014"}
{"reviewerID": "A3Q5W5E7TDVLJF", "asin": "104800001X", "reviewerName": "funnyc130", "helpful": [0, 0], "reviewText": "These little magnets are really powerful for there size. I am using them to make secret compartments in custom made boxes. Each one hols about .8 of a pound.", "overall": 5.0, "summary": "Neat", "unixReviewTime": 1369958400, "reviewTime": "05 31, 2013"}
{"reviewerID": "A19QASMQQACJ9N", "asin": "104800001X", "reviewerName": "Gigi", "helpful": [0, 0], "reviewText": "Ok these magnets r shook tiny that it's not worth $8 plus shipping. They are heavy duty but you have to use three tiny magnets together to hold something g urge fridge. I like how well it holds stuff up on the fridge. I just don't like the price. They need to sell it for  a whole lot less.", "overall": 3.0, "summary": "a little too pricy for the amount u get", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"}
{"reviewerID": "A2GTW2HME1I8AI", "asin": "104800001X", "reviewerName": "great magnet", "helpful": [0, 0], "reviewText": "Strong and just as described. They are right on size and very consistent. These are being pressed into an aluminum housing and so far they have all fit perfectly.", "overall": 5.0, "summary": "MAGNETIC!", "unixReviewTime": 1386374400, "reviewTime": "12 7, 2013"}
{"reviewerID": "ALFMPGNGKSJF9", "asin": "104800001X", "reviewerName": "Hank Strom", "helpful": [0, 0], "reviewText": "Cheap and strong.  Best deal I have found so far.  I am using these Mag's to attach different options to small battle models.", "overall": 5.0, "summary": "Just what I needed to magnetize some 28mm models", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}
{"reviewerID": "ATXIPFBSR29GS", "asin": "104800001X", "reviewerName": "Howard V. Tayler", "helpful": [0, 0], "reviewText": "I use these for giving 30mm scale models interchangeable parts, and they work brilliantly. It's difficult to get them in place because they're small, smooth, and want to grab the nearest metal thing and stick, but once they're glued down they're perfect.", "overall": 5.0, "summary": "Exactly what I needed", "unixReviewTime": 1393545600, "reviewTime": "02 28, 2014"}
{"reviewerID": "A20I5KJEZU8T7G", "asin": "104800001X", "reviewerName": "Hyperion", "helpful": [1, 1], "reviewText": "I thought that the magnets would have a stronger pull but it has a bit of neodymium. If you need a stronger magnet chose something else.", "overall": 1.0, "summary": "More Iron than Neodymium", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"}
{"reviewerID": "AW69Y2CBQB1TT", "asin": "104800001X", "reviewerName": "Jimmy", "helpful": [0, 0], "reviewText": "I needed small magnets that I could use in a tight space. These were just the right size for me. They are tiny so don't buy them thinking they are big. And as a side note they came in a small clear ziplock bag. I had another order in my box and almost missed these in the box. I had to go back and look again to find them.", "overall": 4.0, "summary": "Just the right size for my project", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"}
{"reviewerID": "A37KNOJXE2FU6", "asin": "104800001X", "reviewerName": "Joseph Yonke II", "helpful": [0, 0], "reviewText": "I wanted something this small to mount on the back of filagree wood piece I cut. They could then be mounted on refrigerators. Works well. Should be able to remove the pieces from the refrig without breaking yet will hold well.", "overall": 5.0, "summary": "Very small and thin", "unixReviewTime": 1363132800, "reviewTime": "03 13, 2013"}
{"reviewerID": "A3TC86FP1PQD61", "asin": "104800001X", "reviewerName": "Judy Folkman", "helpful": [0, 0], "reviewText": "I use these tiny magnets to make gourd purse closures. They are tiny enough to be almost invisible but have great magnetic strength.  I would recommed them to any one who wants to use small but strong magnets.", "overall": 5.0, "summary": "Powerful magnets", "unixReviewTime": 1372464000, "reviewTime": "06 29, 2013"}
{"reviewerID": "A19VPNGSJK19PE", "asin": "104800001X", "reviewerName": "Justino", "helpful": [0, 0], "reviewText": "Todo muy bien el producto esta en perfectas condiciones tal como en la publicaci&oacute;n. Recomiendo al vendedor.  + + + +", "overall": 5.0, "summary": "+++", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
{"reviewerID": "A1WEHMBW71NJ72", "asin": "104800001X", "reviewerName": "Justin Pulsipher", "helpful": [0, 0], "reviewText": "These ended up being much smaller than I expected. The description is pretty clear, but it's always hard to visualize just from a description so I don't fault the seller on this.The magnets themselves have a pretty good strength and adhere to each other very well, but the magnetic field is very small and they don't seem to adhere to other things with anywhere near a usable strength; sometimes it seems as though they can barely hold themselves onto a surface.", "overall": 3.0, "summary": "They are alright", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}
{"reviewerID": "A3RVJG02KVS4X5", "asin": "104800001X", "reviewerName": "jwood314", "helpful": [0, 0], "reviewText": "I use these in my Warhammer 40K minis, to magnetize many different options.  These magnets are fantastic. My wide also uses them in here stamping up and other crafts.  Great product, great price.", "overall": 5.0, "summary": "These magnets are fantastic. My wide also uses them in here stamping ...", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A3B8L6TMF3J4YE", "asin": "104800001X", "reviewerName": "Kelley A.", "helpful": [0, 0], "reviewText": "Downright Impressive -- I have to keep my teenagers from messing with them! They are enchanted with these mighty, little magnets! I use them in crafts & such. They work great.", "overall": 5.0, "summary": "Tiny but Powerful!", "unixReviewTime": 1397001600, "reviewTime": "04 9, 2014"}
{"reviewerID": "A1JYPJMD610LX4", "asin": "104800001X", "reviewerName": "Kevin B. Wells", "helpful": [0, 1], "reviewText": "These magnets work well and are strong for their size. However, I did not realize how small they were until I got them in hand. They are the exact dimensions stated, though I was able to make them work (had extras, so I doubled up) in future I'll order a 1/4&#34; size.Order came in quickly, without issues.", "overall": 3.0, "summary": "works as advertised", "unixReviewTime": 1387238400, "reviewTime": "12 17, 2013"}
{"reviewerID": "AIATBRWAEKYST", "asin": "104800001X", "reviewerName": "K. Gross \"S.F. Magician\"", "helpful": [0, 1], "reviewText": "I had a few ideas that I was able to use these very small discs to create. Still trying to create others, but so far here is what I have.On the down side: Not for use around children,Everything else is positive. The magnets are very powerful and sized perfectly for many projects.They make magnificent signs when glued into frames allowing me to quickly change signs.  I used a metal picture and a backing of a few of these magnets glued into a frame.The sign can be flipped fairly quickly from one side to the other and it works in the door.Next I am possibly going to create some multiple use refrigerator signs for leaving messages.", "overall": 5.0, "summary": "Very useful. Extremely powerful sized well.", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "A157N0SA4K2R8F", "asin": "104800001X", "reviewerName": "K. L. Stevens \"wife of dork\"", "helpful": [0, 6], "reviewText": "Arrived within 2 weeks which is long in the world of Amazon.  I misunderstood sizing and they were too small to hold up the spice jars that I attempted to glue them to.  Husband ended up using them in his Gundam model to make armor and weapons removable so they had a purpose in the end.", "overall": 3.0, "summary": "Was for a project", "unixReviewTime": 1354752000, "reviewTime": "12 6, 2012"}
{"reviewerID": "A3DRA62AUAMCIN", "asin": "104800001X", "reviewerName": "Laura J. Pauley \"LAURA PAULEY\"", "helpful": [0, 0], "reviewText": "Very great product.  I was tired of things falling off of my refrigerator!  This did the trick.  I would recommend.", "overall": 5.0, "summary": "Helpful", "unixReviewTime": 1383696000, "reviewTime": "11 6, 2013"}
{"reviewerID": "A3U4AFML9SZPWK", "asin": "104800001X", "reviewerName": "Leith Tussing \"I like tacos.\"", "helpful": [0, 0], "reviewText": "I use these to magnetize my Warhammer 40K miniatures together allowing me to swap out their various parts and weapons.  They provide excellent holding power along with small size to fit in snug areas.", "overall": 5.0, "summary": "Excellent hobby magnets", "unixReviewTime": 1371340800, "reviewTime": "06 16, 2013"}
{"reviewerID": "A2W7MK50L2KFOC", "asin": "104800001X", "reviewerName": "loves to sew \"loves to sew\"", "helpful": [0, 1], "reviewText": "Amazon lost the first package ordered so I had to order a second item.  But got refunded for the first lost item.These magnets were very small, which I expected.  So make sure that you read the size carefully when you order so that you don't get disappointed on the size.  I wanted the small size, so was happy with the size.But what I am not happy about is the strength of these.  I have used these before from another seller and my other ones same size was stronger.  So these are extremely weak.  They started to slide down my metal surface so obviously could not hold anything.The 1/4&#34; x 1/16&#34; was a perfect hold but too large for what I needed them for (miniatures). So I thought to try these as they are one size smaller.  Oh well, I guess I will have to keep looking.", "overall": 2.0, "summary": "Not strong magnets", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
{"reviewerID": "A1DKGQZWI320XP", "asin": "104800001X", "reviewerName": "Mairon", "helpful": [0, 1], "reviewText": "I prefer 1/4\" but this little magnets are very strong too.Watch out for the kids and pets it's not a toy, keep it safe.", "overall": 4.0, "summary": "really small", "unixReviewTime": 1366416000, "reviewTime": "04 20, 2013"}
{"reviewerID": "A23TCCP2E0ECF8", "asin": "104800001X", "reviewerName": "Margaret Sheehan", "helpful": [0, 0], "reviewText": "These are really really small...but super strong for their size. Great for crafts if you can handle something so small.", "overall": 4.0, "summary": "STRONG", "unixReviewTime": 1378857600, "reviewTime": "09 11, 2013"}
{"reviewerID": "A36Y7X194VWVKA", "asin": "104800001X", "reviewerName": "Mark D.", "helpful": [23, 25], "reviewText": "They are soo freaking annoying!!  Why?! You spend all this time, da*n near breaking off your fingernail trying to separate these li'l buggers, and when you do finally get them apart, you accidentally hold your hand in a certain way or angle and they snap right back together again with reckless abandon!  So yes, annoying, but that's only because they are soo good at what they do.  You too will be happily annoyed with your purchase.  I'd stick my reputation on that statement... with these magnets!", "overall": 5.0, "summary": "They're annoying... which is why they get five stars!", "unixReviewTime": 1376006400, "reviewTime": "08 9, 2013"}
{"reviewerID": "A1K1I9VE8AL46Y", "asin": "104800001X", "reviewerName": "Mark L", "helpful": [0, 0], "reviewText": "Nice shiny finish, these little guys will hold stuff on your fridge. if one isn't enough, stack em up to get the power you need.", "overall": 5.0, "summary": "How can you not love little rare earth magnets?", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A2SWG10HLT3SQ7", "asin": "104800001X", "reviewerName": "Mark Tassin \"cryptoknight\"", "helpful": [0, 0], "reviewText": "Do everything I ask for my Warhammer 40k modelling work.  I ordered 300 of these, and probably have about 100 left.  Great Price, Great Product!", "overall": 5.0, "summary": "Great Magnets!", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "A2MBKP24AYSXX2", "asin": "104800001X", "reviewerName": "Mary", "helpful": [0, 6], "reviewText": "These magnets are teeny tiny, I'm not really sure what I'm gonna do with them. Maybe I'll rob a tiny bank.", "overall": 4.0, "summary": "Teeny Super Magnets", "unixReviewTime": 1351209600, "reviewTime": "10 26, 2012"}
{"reviewerID": "AMKKS5NCN7W8I", "asin": "104800001X", "reviewerName": "Matt", "helpful": [0, 0], "reviewText": "Excellent quality magnets. Used for modeling.The package comes in a ziplock baggy. They were as described, and had a strong magnetic pull. Perfect for attaching arms and other equiment.", "overall": 5.0, "summary": "Good for Modeling", "unixReviewTime": 1386720000, "reviewTime": "12 11, 2013"}
{"reviewerID": "A2L0MEU6XMCZNB", "asin": "104800001X", "reviewerName": "MichaeL", "helpful": [0, 0], "reviewText": "These are pretty good.  I'm using them for Dreadnought weapons on a plastic Warhammer 40,000 model (a 4&#34; plastic robot).  They're fairly strong but I am not convinced they'll hold anything substantial as they hold the arms in place but only just.", "overall": 4.0, "summary": "Good magnets", "unixReviewTime": 1383523200, "reviewTime": "11 4, 2013"}
{"reviewerID": "A5JG6VUYSM4HT", "asin": "104800001X", "reviewerName": "Michelle DeCarlo", "helpful": [0, 0], "reviewText": "The absolute perfect size for what I need. They fit perfectly on my models and are easy to attach to the minis.", "overall": 5.0, "summary": "Miniatures", "unixReviewTime": 1388102400, "reviewTime": "12 27, 2013"}
{"reviewerID": "AM1IRORNVMLT1", "asin": "104800001X", "reviewerName": "MiG", "helpful": [0, 1], "reviewText": "These magnets are incredibly small which works out incredibly well for you and your Warmachine/Warhammer miniature building fantasies. They are incredibly strong and work great for plastic, as for your larger pewter models, consider getting a bigger size because arms will droop towards the bodies of them.", "overall": 5.0, "summary": "SUPER TINY MAGENTS FOR MINIATURES", "unixReviewTime": 1367452800, "reviewTime": "05 2, 2013"}
{"reviewerID": "A2Y3YQQKOQZYR6", "asin": "104800001X", "reviewerName": "Mike N", "helpful": [0, 0], "reviewText": "Small and strong enough for arms and hands on Warmachine Warjacks. Recessed a magnet on both sides of the joint.", "overall": 5.0, "summary": "Perfect for Warjacks", "unixReviewTime": 1376870400, "reviewTime": "08 19, 2013"}
