{"reviewerID": "A2GZ9GFZV1LWB0", "asin": "1603420304", "helpful": [0, 0], "reviewText": "I am well out of college but love this book.  I am always on the go and don't have a lot of time to plan menu's or shop for recipes during the week.  This has a ton of classic, yummy and EASY (did I say EASY!) recipes.  A lot of the times I can use staples from my pantry and just pick up a handful of items.  And it's great for singles/couples.", "overall": 4.0, "summary": "Good solid recipes", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
{"reviewerID": "A1K7VSUDCVAPW8", "asin": "1603420304", "reviewerName": "5ft2", "helpful": [3, 4], "reviewText": "So, I bought this book a few days ago and have tried three recipes so far.  The first was a total flop.  There must be an error, but be forewarned, do NOT make the Blueberry Coffee Cake as it comes out as inedible mush--WAY too much water.  The other two recipes (mac and cheese and grilled cheese with tomato) were decent for quick lunches or dinners.  They were average in taste, but considering the short amount of time it took to make them, I'm okay with that.  All in all, it's a nice idea book to get creative with everyday ingredients, but with errors and only average taste, I give it three stars.", "overall": 3.0, "summary": "Okay for true beginners", "unixReviewTime": 1282176000, "reviewTime": "08 19, 2010"}
{"reviewerID": "A35J5XRE5ZT6H2", "asin": "1603420304", "reviewerName": "810geb", "helpful": [0, 0], "reviewText": "The pros:1. It really teaches you the basics on cooking2. Really easy to make3. The recipes are categorized which make it easy to findThe cons:1. Some recipes are really high in calories2. Don't seem all that cheap to me, speaking from a college student on a budget", "overall": 4.0, "summary": "Worth the money", "unixReviewTime": 1365206400, "reviewTime": "04 6, 2013"}
{"reviewerID": "A3DGZNFSMNWSX5", "asin": "1603420304", "reviewerName": "AfterCsquared", "helpful": [0, 1], "reviewText": "got it in good time. i think its a great book but i do wish there was more variety of things like desserts and breakfast options you can make fast", "overall": 4.0, "summary": "Good book", "unixReviewTime": 1285632000, "reviewTime": "09 28, 2010"}
{"reviewerID": "A2CVDQ6H36L4VL", "asin": "1603420304", "reviewerName": "Alexisx3", "helpful": [0, 0], "reviewText": "I bought this for my friend's birthday,and she absolutely loves it. This book is especially for beginners with easy to make recipes for breakfast,lunch and dinner. In the beginning it gives an intro on spices and different utensils which is extremely helpful. I'm even considering buying this myself. This book is absolutely adorable.", "overall": 5.0, "summary": "Very adorable", "unixReviewTime": 1342396800, "reviewTime": "07 16, 2012"}
{"reviewerID": "A3U0EV8PXX6G2O", "asin": "1603420304", "reviewerName": "Allison Blackham", "helpful": [0, 0], "reviewText": "This is a good basic cookbook for new cooks and college students on their own for the first time.  My daughter is using it and reports good luck with the recipes.", "overall": 4.0, "summary": "Healthy food choices for college students", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A18KZLAOO17CH7", "asin": "1603420304", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I bought this book for my friend's daughter who was going to college and wanted some recipes.  As I looked through the book, I loved the recipes so much, I ended up buying another book for myself.  Jessie, the college student, told me she has already used the book and was thrilled the food she made tasted fantastic and was easy to make.  Good and easy recipes.", "overall": 5.0, "summary": "Great book", "unixReviewTime": 1315958400, "reviewTime": "09 14, 2011"}
{"reviewerID": "A1RYEDOAVTVC97", "asin": "1603420304", "reviewerName": "Amazon Customer", "helpful": [7, 7], "reviewText": "As someone that is single and knows my way around the kitchen pretty well, I found this cookbook to be very useful for single people. A lot of recipes/cookbooks out there are geared towards families. It's hard to find recipes that are single serve. Some of my favorite recipes included steamed cabbage, simple green beans, beef stir fry.", "overall": 4.0, "summary": "Very good for single people", "unixReviewTime": 1253491200, "reviewTime": "09 21, 2009"}
{"reviewerID": "AW4GYRDGPXSHC", "asin": "1603420304", "reviewerName": "a mom", "helpful": [1, 2], "reviewText": "After several days of hunting for the right book for a male college student, who doesn't cook, and lives with 5 other guys in a condo/dorm with a spectacular kitchen.........I chose this one because it is easy to use, there are few ingredients, it is basic (like making quesadillas), and things actually sound delicious.  Hope it is utilized but a mother  is the last one to know.", "overall": 5.0, "summary": "This is the one!!", "unixReviewTime": 1284336000, "reviewTime": "09 13, 2010"}
{"reviewerID": "A3RM23R5S3OBO5", "asin": "1603420304", "reviewerName": "Amy Braml", "helpful": [0, 0], "reviewText": "I absolutely love it! Everything I've tried so far tastes delicious, and it's affordable! It's great for when I make recipes just for myself, or when I have some friends over. I highly recommend this book.", "overall": 5.0, "summary": "Love it!!", "unixReviewTime": 1323216000, "reviewTime": "12 7, 2011"}
{"reviewerID": "A5T79U2IMPYTY", "asin": "1603420304", "reviewerName": "Anjali Mehra \"Anjali\"", "helpful": [0, 0], "reviewText": "The book has a lot of good ideas, but I only cared for a few recipes. Some take awhile to make and if it's aimed at collge students, time is an issue.", "overall": 3.0, "summary": "Nothing outstanding", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A109D193EJ98V2", "asin": "1603420304", "reviewerName": "Anna Klitzing", "helpful": [3, 3], "reviewText": "I'm a 21 year old junior in college and I've been struggling for a long time with not eating out so much. This book has helped me tremendously in overcoming that bad habit. I love the breakfast and sides sections. Very informative. Would recommend to anyone who is faced with a kitchen/cooking on their own for the first time.", "overall": 5.0, "summary": "Easy, Perfect for College Lifestyle", "unixReviewTime": 1325808000, "reviewTime": "01 6, 2012"}
{"reviewerID": "A3VX4QRMRMG143", "asin": "1603420304", "reviewerName": "Arya Zahiri", "helpful": [0, 0], "reviewText": "I purchased this title for a roommate and this has helped a great deal.This book is simple enough for beginners to understand but some of the techniques used might be too advanced for the average college student.", "overall": 4.0, "summary": "Great starting Point", "unixReviewTime": 1370995200, "reviewTime": "06 12, 2013"}
{"reviewerID": "A3QAL688R9KZT4", "asin": "1603420304", "reviewerName": "Bana", "helpful": [8, 8], "reviewText": "... and this book caught my eye in the supermarket because i have a granddaughter in her 1st year of college.  she shares a condo near campus with 3 other roommates and  this will probably become their 'kitchen bible'.  i don't want to give the book away now that i'm reading it, and will have to get a copy for myself.  [that's why i'm here on amazon.]  after 50+ years of cooking, i want QUICK and EASY as well as healthy.  i flag almost every page i open the book to because of a recipe i want to try.  who would have thought of spaghetti squash with butter and CINNAMON?  (pg 236)", "overall": 5.0, "summary": "I'm a grandma...", "unixReviewTime": 1324512000, "reviewTime": "12 22, 2011"}
{"reviewerID": "A36TM5HAM32TMO", "asin": "1603420304", "reviewerName": "Barbara Berkowitz", "helpful": [0, 0], "reviewText": "bought the healthy college cookbook for my grandson.and he was happy to receive it! i scanned it myself,and found recipes easy to use ,especially for students who are pressed for time-good healthy alternatives to a high fat fast food diet,so many young people follow-thanks for writing such a great book!", "overall": 5.0, "summary": "cookbook", "unixReviewTime": 1320019200, "reviewTime": "10 31, 2011"}
{"reviewerID": "AL69F6UZDPHFZ", "asin": "1603420304", "reviewerName": "Becky", "helpful": [0, 0], "reviewText": "On his first summer away from home, my son used this book as his first. He liked the general cooking information in the book and used many recipes. Mostly he cooked a big batch of things and ate leftovers for the week. He particularly liked the Minestrone.", "overall": 5.0, "summary": "My son found it very useful and made a number of recipes", "unixReviewTime": 1381881600, "reviewTime": "10 16, 2013"}
{"reviewerID": "A2WOB3XO3160CX", "asin": "1603420304", "reviewerName": "Caroline Rivard", "helpful": [0, 0], "reviewText": "Great basic receipes. The only thing that would make it perfect is pictures. I bought it for my son in college and he is looking forward to cooking on his own.", "overall": 4.0, "summary": "Good start for the college student", "unixReviewTime": 1356912000, "reviewTime": "12 31, 2012"}
{"reviewerID": "A22ZT1X0VUYNIV", "asin": "1603420304", "reviewerName": "Carolyn C. Leech \"Yoga teacher\"", "helpful": [4, 4], "reviewText": "I got this book for both of my daughters as they are just getting appartments for their new school year.They just started using some of the recipes in this book to practice on us at home.We like the recipe choices. This is a book that they will use at college.", "overall": 5.0, "summary": "The Healthy College Cookbook", "unixReviewTime": 1281916800, "reviewTime": "08 16, 2010"}
{"reviewerID": "AQFYGWUOGWBXY", "asin": "1603420304", "reviewerName": "Cassie", "helpful": [0, 0], "reviewText": "There are a lot of quick and easy recipes in the book that nearly any college student could make. They all seem pretty healthy, too.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1356998400, "reviewTime": "01 1, 2013"}
{"reviewerID": "A22AWOXGDCF4KR", "asin": "1603420304", "reviewerName": "Cathy Lishawa", "helpful": [0, 0], "reviewText": "Our teenage daughter was looking for a healthy cookbook.  She is not a fan of cooking, so it had to be easy.  In just a month, she has made several recipes from the book - and they are easy and good!  Some things are overly simple (liked baked potatoes), but there are a lot of recipes.  Orange chicken is already a favorite.  We have enjoyed the 'Mom says' comments, and some of the comments from the college kids that wrote it.  I will have to get a copy for myself when she goes away to college!", "overall": 5.0, "summary": "Useful and fun", "unixReviewTime": 1391904000, "reviewTime": "02 9, 2014"}
{"reviewerID": "AVRUPPKYLAA6Q", "asin": "1603420304", "reviewerName": "cedaddio", "helpful": [0, 5], "reviewText": "After receiving this as a Christmas gift, my collegiate son looked at it and then left it home.  Maybe next year, when he moves out of the dorm...", "overall": 3.0, "summary": "Hmm...", "unixReviewTime": 1361577600, "reviewTime": "02 23, 2013"}
{"reviewerID": "A17V9XL4CWTQ6G", "asin": "1603420304", "reviewerName": "Chandler", "helpful": [15, 15], "reviewText": "Toss the Ramen Noodles and Indulge!I actually bought this book as a gift for a friend who was both getting married AND going to graduate school all in the same year. I put it together with a gift basket...She has no cooking experience.And she said it has been one of her most used gifts!That said, upon leafing through her own copy, I bought a second book...for myself...in spite of the fact that I love to cook and have been doing so for MANY years. The recipes are quick, delicious, imaginative, and (a great thing in this economy) inexpensive too!It's a very thorough book even for someone who only wants to own ONE cookbook. Ever.There are loads of recipes and varied tastes within...from fish, to beef, to chicken, even vegetarian and vegan recipes are included...even for those who aren't vegetarians those recipes are GOOD hearty ones that cross-over well to carnivores.  It just has a huge variety of bites.The recipes are diverse. Lots of good hearty American fare, but intermingled with Chinese, Indian, and Italian recipes. Also, there's everything from appetizers to breakfasts to salads to sandwiches to main dishes and desserts.I found the ingredients to be ones that could easily be found and the recipes to be simple enough for the beginner cook...and fast for those on the go who still like good food.there are even some great recipes to help throughout life...such as how to make croutons!We've enjoyed the huevos rancheros. blueberry coffee cake, breakfast burritos and orange french toast for breakfast.You can't lose with the fettucine alfredo, chicken and mushrooms, chicken fiesta salad, honey dijon salmon, lasagna, mexican lasagna, slow cooked barbecue chicken, chicken soup (lots of good soups and stews  And soy meats are easy substitutes here if you wish!and the chocolate souffle and apple cobbler are great endings!While it is great for a college student learning to cook and short on time and money, I think any cook who loves good food can benefit. Lots of healthy dishes and hearty meals for anyone..and for those who want the basics, there is even help knowing what basic kitchen tools are.", "overall": 5.0, "summary": "This book is a winner for a cooking novice to a genuine foodie!", "unixReviewTime": 1251676800, "reviewTime": "08 31, 2009"}
{"reviewerID": "AY36HZFMJHCY7", "asin": "1603420304", "reviewerName": "Chelsea K. Bengal", "helpful": [2, 2], "reviewText": "I LOVE this cookbook. It's easy to use and has wonderful recipes in it. The main aspect I like most is the fact that it doesn't use unusual ingredients, usually they are easy to find. Definitely recommend.", "overall": 5.0, "summary": "Good Cookin'!", "unixReviewTime": 1274313600, "reviewTime": "05 20, 2010"}
{"reviewerID": "ANO8D2MFR5ZVQ", "asin": "1603420304", "reviewerName": "CW", "helpful": [1, 1], "reviewText": "My grand daughter in college had essentially never cooked before she left home.  She had no idea how to get around a kitchen, much less do it safely.  She loves the tips on cooking--what the terms mean (braise, blanch, etc.) and how to make substitutions if she doesn't have a certain ingredient on hand.  The recipes are easy to follow and healthy.", "overall": 5.0, "summary": "wonderful resource", "unixReviewTime": 1283212800, "reviewTime": "08 31, 2010"}
{"reviewerID": "ASHSWGTHZC1H0", "asin": "1603420304", "reviewerName": "Diane S.", "helpful": [0, 0], "reviewText": "I find that there are not any complicated recipes or anything I had not made before. It is more used to get me out of my rut of cooking the same thing every night.", "overall": 4.0, "summary": "Easy To Use", "unixReviewTime": 1392854400, "reviewTime": "02 20, 2014"}
{"reviewerID": "A1RIBL5O4ZJ0CE", "asin": "1603420304", "reviewerName": "Doggielover89", "helpful": [0, 1], "reviewText": "There are a few recipes that maybe your average college student wouldn't have time or ingredients for, but it really is a great starter book. Yes, it has no pictures, but it allows more room for recipes. Some of them literally take a few minutes like the peanut butter oatmeal one. Its so simple, but a wonderful quick idea. Sometimes its just nice to have an easy meal that isn't processed junk. It has recipes for everyone from your meat lovers to your vegans. It is fairly basic, but that is what most college students are looking for and need. This baby is getting me through nursing school and those long nights of studying. I don't know how I would have eaten without this darling book. It even has easy symbols indicating if they are vegan, vegetarian, quick, etc.", "overall": 5.0, "summary": "Great for a busy college student", "unixReviewTime": 1367107200, "reviewTime": "04 28, 2013"}
{"reviewerID": "A31MPAN4ZAN5F6", "asin": "1603420304", "reviewerName": "Ed Anamizu", "helpful": [0, 0], "reviewText": "Many health and delicious meals for our family that is easy to prepare. Economical on the  pocket book also. Saved us a lot on the budget", "overall": 4.0, "summary": "Easy, Healthy, Time Saving Cookbook", "unixReviewTime": 1387065600, "reviewTime": "12 15, 2013"}
{"reviewerID": "A1XNGX7WQP9I99", "asin": "1603420304", "reviewerName": "EL", "helpful": [0, 0], "reviewText": "We were given this cookbook as a wedding gift.  We were a little skeptical but figured we'd give it a try, and it has become our go-to recipe book for quick, easy dinners after a long workday. While some recipes include 1-2 ingredients that may not be familiar, the recipes are typically healthy, easy to follow and don't require a lot of time or effort.  This is a great cookbook whether you are in college or not!", "overall": 4.0, "summary": "not just for college", "unixReviewTime": 1302134400, "reviewTime": "04 7, 2011"}
{"reviewerID": "A15WHO49A3GIU9", "asin": "1603420304", "reviewerName": "Ellen Farrar", "helpful": [0, 0], "reviewText": "My granddaughter is into healthy cooking and eating.  She was glad to receive this book as the recopies seemed quick and easy.", "overall": 4.0, "summary": "Healthy College Girl", "unixReviewTime": 1391385600, "reviewTime": "02 3, 2014"}
{"reviewerID": "A1PYBYE38ST6A1", "asin": "1603420304", "reviewerName": "Erin", "helpful": [0, 0], "reviewText": "I absolutely LOVE  this cookbook. It will be very helpful when I am at college. It is so easy to read, and great for beginner cooks like myself. It really is a healthy cookbook. It gives you all of the nutritional facts and really helps you make healthy decisions. The recipes are also take into consideration that you don't have a lot of time to prepare meals. I am so happy that I purchased this book. It makes me excited to cook!!", "overall": 5.0, "summary": "MUST HAVE!!", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A2SPM30KR87VS6", "asin": "1603420304", "reviewerName": "Esther E.", "helpful": [0, 0], "reviewText": "His senior year in high school he decided to eat healthier and lost about 50 pounds.  To help keep him healthy in college we got him this book - it seems to have great recipes that are quick and easy to make while staying within college budget constraints.", "overall": 5.0, "summary": "for college son", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
{"reviewerID": "A1AQOBLA23N2L8", "asin": "1603420304", "reviewerName": "Frank Perrone", "helpful": [0, 0], "reviewText": "It is what it is.  For that, it gets four stars.  Don't expect anything mind-blowing but do expect the recipes in here to be totally doable for a novice.  It is full of easy-to-make, simple dishes that can help a newer cook make decent meals and improve as he or she becomes more comfortable in the kitchen.Some favorites: honey dijon salmon, apple chicken with mushrooms, sweet orange chickenI was not at all a fan of the lime-garlic shrimp and the baked tunaIf you are looking to save money, learn to cook and eat a little healthier, buy this book.  It has made learning to cook much easier via practice with simple, solid recipes and the fact that it is all in one place instead of spread out among various internet bookmarks.", "overall": 4.0, "summary": "Good for what it is", "unixReviewTime": 1368576000, "reviewTime": "05 15, 2013"}
{"reviewerID": "AYM9M2CG70COC", "asin": "1603420304", "reviewerName": "garbage truck collector", "helpful": [0, 0], "reviewText": "I really like this cookbook a lot.  Everything is easy to do and I haven't had trouble finding the ingredients in the grocery store.  There are lots of things to make and I especially like that the book tells you if you can make it in a hurry and if it's a favorite among the college students.  I'm glad I bought it.", "overall": 5.0, "summary": "Easy Cooking For Me", "unixReviewTime": 1265760000, "reviewTime": "02 10, 2010"}
{"reviewerID": "A269WG8C9O2B0C", "asin": "1603420304", "reviewerName": "Gee Geronimo", "helpful": [0, 0], "reviewText": "Perfect for a college student, especially one that lives in a dorm and has access to a kitchen or simple hot plate cooking.", "overall": 5.0, "summary": "Perfect for a college student.", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A33MJO5X9CCK2R", "asin": "1603420304", "reviewerName": "Grace Jones", "helpful": [1, 1], "reviewText": "i recommend this cookbook becase it has good tips about how keep your kicthen.it has good recipes and some tips you want to make sure you do when handling meat.", "overall": 5.0, "summary": "it is a awsome cookbook", "unixReviewTime": 1327276800, "reviewTime": "01 23, 2012"}
{"reviewerID": "A3UNPDOS40TSF1", "asin": "1603420304", "reviewerName": "Hoolia", "helpful": [5, 8], "reviewText": "I bought this book because it had received decent reviews and being a household of 1; I had hoped that I could make some quick meals.I am not a experienced chef by any means but don't consider myself a true beginner. I know how to make some basics and figured this may give me some fresh ideas.It seemed the ideas were TOO basic. And they didn't seem to have any fresh outlook on recipes.I wish I had invested in something I would read and use more often.", "overall": 3.0, "summary": "A little disappointing", "unixReviewTime": 1264032000, "reviewTime": "01 21, 2010"}
{"reviewerID": "AN0QSKR7GSMJ4", "asin": "1603420304", "reviewerName": "jal925", "helpful": [0, 0], "reviewText": "I've just finished up my sophomore year of college and this cookbook has been a hit in my apartment. The front section is helpful for beginner cooks who don't know the difference between parsley and oregano, as well as conversions and instructions on how to mince, dice, etc. The only drawback to this book that I can think of is that there are no pictures of the final product. Other than that, it's a simple, practical cookbook that I'm sure I'll use for years.", "overall": 5.0, "summary": "Most everything a college student would need to know in the kitchen", "unixReviewTime": 1305331200, "reviewTime": "05 14, 2011"}
{"reviewerID": "A30QW1N0FGSOWN", "asin": "1603420304", "reviewerName": "Jamie Philpot", "helpful": [0, 0], "reviewText": "I bought this for both of my college kids and they loved it!  They didn't know what they needed in terms of food and spices to start up their kitchen.  It is great to see fast and healthy foods to make.", "overall": 5.0, "summary": "Great basic cookbook", "unixReviewTime": 1356998400, "reviewTime": "01 1, 2013"}
{"reviewerID": "A1YHDA5OHZW5JP", "asin": "1603420304", "reviewerName": "Jared", "helpful": [0, 0], "reviewText": "I have been looking for a cookbook like this for some time.  I am a grad student without much time or money.  This book had some helpful idea for foods that I need to keep in my kitchen, and some simple recipes.  The trouble with being a student is that it is very easy to fall into the habit of just grabbing fast food on a regular basis, but that will end up costing you more in the end: money and health.  The down side of this book is that there are no pictures, and some of the recipes are actually quite complex.  I was also hoping for more easy crock pot meals.  While not perfect, I found this book to pretty helpful for a single graduate student with very little time and on a tight budget.", "overall": 4.0, "summary": "Pretty helpful", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
{"reviewerID": "A2J5S7Q3CW8AG8", "asin": "1603420304", "reviewerName": "JAR", "helpful": [0, 2], "reviewText": "not too good, needs more recipes. very disappointing. wouldn't recommend . other cook books available that would be much  better.", "overall": 1.0, "summary": "not my choice", "unixReviewTime": 1385251200, "reviewTime": "11 24, 2013"}
{"reviewerID": "A2EE0QU19W543S", "asin": "1603420304", "reviewerName": "Jenessnica \"Jessica Wilding\"", "helpful": [0, 0], "reviewText": "this book has saved me this past year while budgeting and trying to stay healthy a great buy for parents who have kids going to college", "overall": 5.0, "summary": "a++", "unixReviewTime": 1385337600, "reviewTime": "11 25, 2013"}
{"reviewerID": "A1W3LU9GFY3WIK", "asin": "1603420304", "reviewerName": "Jennifer", "helpful": [0, 1], "reviewText": "This book is AWESOME!!!!!!!!!! I don't even know where to start! is it because of the delicious amazing recipes? or maybe the countless tricks and tips throughout the whole thing, or maybe the whole Getting started guide at the front of the book? I really don't know what is the most awesome part about it, but needless to say I am IN LOVE with this book!!!!", "overall": 5.0, "summary": "Where do I start?!?!", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A5IR24XQS2F7D", "asin": "1603420304", "reviewerName": "Jenny Piotrowski", "helpful": [0, 0], "reviewText": "Plenty of great, easy recipes that take very little time.  The book also makes sure the cook knows exactly how to cook each recipe.", "overall": 5.0, "summary": "A Great Book for the Hard at Work College Student", "unixReviewTime": 1374883200, "reviewTime": "07 27, 2013"}
{"reviewerID": "A2Z1L4AXFLOL6O", "asin": "1603420304", "reviewerName": "JennyT", "helpful": [0, 0], "reviewText": "I've purchased this cookbook for all of my children -- they love the recipes.  It's a great way to introduce healthy cooking to your kids, who of course don't want to spend a lot of time in the kitchen while at school!", "overall": 5.0, "summary": "love it", "unixReviewTime": 1318550400, "reviewTime": "10 14, 2011"}
{"reviewerID": "A2OORKB8WYZZXQ", "asin": "1603420304", "reviewerName": "Jess Mahan", "helpful": [0, 0], "reviewText": "as a college student, this book was amazing for me to start out with. easy, quick recipes that are great for leftovers during class or after a long day. i don't know what i did before this book came into my life.", "overall": 5.0, "summary": "one of my favorite cookbooks", "unixReviewTime": 1395100800, "reviewTime": "03 18, 2014"}
{"reviewerID": "A1K6YG0OKQB9HX", "asin": "1603420304", "reviewerName": "J. Jen", "helpful": [5, 9], "reviewText": "Maybe its just bad luck.. but the first two recipes i try turned out awful... there seem to be issues with the amounts of ingredients.. for a cream sauce..it told me to use 1.5 CUPS of flowers with 1.25 cups of milk... i guess i shouldn't have blindly followed the recipes.. so it was a big waste of time and ingredients.. and it came out with a big floury goo mess...most of the recipes seem pretty basic. it would be a good tool for learning i don't continue to find typos..", "overall": 2.0, "summary": "Did anyone proof read this?", "unixReviewTime": 1265328000, "reviewTime": "02 5, 2010"}
{"reviewerID": "APUVRW28WB3UQ", "asin": "1603420304", "reviewerName": "Josh", "helpful": [0, 1], "reviewText": "I would recommend the product. It is interesting and shipped really fast, which was nice since it was a gift.", "overall": 5.0, "summary": "Good Product", "unixReviewTime": 1353542400, "reviewTime": "11 22, 2012"}
{"reviewerID": "A285JETQHXRHA8", "asin": "1603420304", "reviewerName": "jr", "helpful": [0, 0], "reviewText": "Recipes are simple/ just the type I was looking for. Some of the simpler dishes are more like snacks though which was not as good. Otherwise, I loved it!", "overall": 4.0, "summary": "Good", "unixReviewTime": 1284681600, "reviewTime": "09 17, 2010"}
{"reviewerID": "A3A8EVNU5778ZE", "asin": "1603420304", "reviewerName": "Karyn", "helpful": [0, 0], "reviewText": "These recipes are easy and cost effective.  There's a section that even explains what all the cooking terms mean: minced, diced, poached, chopped, etc.  I bought this for a recent grad about to move out and she loved it.", "overall": 5.0, "summary": "Great, easy recipes", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
{"reviewerID": "A3VYT1S64254XO", "asin": "1603420304", "reviewerName": "kathie barber", "helpful": [0, 0], "reviewText": "bought this for my nephew when he started college. He has an apartment he shares with three other guys and I thought he could use it to start learning to cook for himself.", "overall": 5.0, "summary": "Starting College", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}
{"reviewerID": "A1PKPRFEVR7GPK", "asin": "1603420304", "reviewerName": "Kbkaer", "helpful": [0, 0], "reviewText": "My cookbook was in great condition and came quickly. I have used it a few times and loved most of the things I tried. I would definitely recommend this book and seller to anyone.", "overall": 4.0, "summary": "Satisfied", "unixReviewTime": 1301443200, "reviewTime": "03 30, 2011"}
{"reviewerID": "A2PYQ53IJLWQVN", "asin": "1603420304", "reviewerName": "KDWelch91", "helpful": [2, 7], "reviewText": "this cook book was extremely basic. It seems to be made for someone who has no idea what to do in a kitchen. So i you don't know how to hard boil and egg then this book would be really helpful. however, I had hoped for more complex recipes. I do like how the recipes have calorie counts.", "overall": 2.0, "summary": "Too basic", "unixReviewTime": 1305676800, "reviewTime": "05 18, 2011"}
{"reviewerID": "A1XATWIHO83Q0I", "asin": "1603420304", "reviewerName": "Kimmy", "helpful": [0, 0], "reviewText": "I'm only 17, this cookbook helped my no-skill cooking to seem like a 5 star chef!!!!!!!!!! Yummy I wish they made another one!", "overall": 5.0, "summary": "Love it!!!!!", "unixReviewTime": 1369353600, "reviewTime": "05 24, 2013"}
{"reviewerID": "A1H9ARYNMB67SP", "asin": "1603420304", "reviewerName": "kmariedn", "helpful": [1, 1], "reviewText": "I got this as a present for my sister who is in college and loves to cook. All I can say it..WOW! I thought it would be nice of me to kind of thumb through and bookmark a few she might like to try....after looking at every single recipe I ended up with over 30 bookmarks for me alone! I don't enjoy cooking at all but the recipes all looked to easy and quick, I thought even I would try them. I would recommend this cookbook to anybody, even if you aren't in college.", "overall": 5.0, "summary": "Wow!!", "unixReviewTime": 1291766400, "reviewTime": "12 8, 2010"}
{"reviewerID": "A2DPFVVX6BCQ21", "asin": "1603420304", "reviewerName": "Lindsey L. Young", "helpful": [0, 0], "reviewText": "I LOVE using this book to start learning how to cook, There are simple and easy ideas in here and the book arrived in excellent condition!", "overall": 5.0, "summary": "EXCELLENT!", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "A29JXXL8X0ILB8", "asin": "1603420304", "reviewerName": "Lisa", "helpful": [0, 1], "reviewText": "I am an older student, but I still found myself falling victim to the typical poor eating habit of fast food or take out all the time.  That is the sentiment with most of my classmates, including other adults my age and older.  This book has a lot of easy common sense recipes, and some really great different ideas.  I honestly have yet to cook anything from it, but I did read it cover to cover.  The beginning is full of valuable information about the basics of cooking that everyone should know, as people are cooking less and eating out more.  Everything is simple to make and contains whole ingredients for the most part.I gave it 4 stars because there were a few recipes in there that are not so healthy as far as calorie and fat content.  I recall seeing something that had about 1000 calories a serving, that's TOO much for a \"healthy\" meal.  The book talks about spices and herbs in the beginning, but it also focuses on saving money since college students are typically on a limited budget.  I think it would have been cute if it had incorporated growing your own herbs.  It's simple, money saving, and can be done indoors with little space.  I still cannot believe how much they charge for a few sprigs of Rosemary or Basil at the grocery store!", "overall": 4.0, "summary": "Great for people of all ages", "unixReviewTime": 1303344000, "reviewTime": "04 21, 2011"}
{"reviewerID": "A1QJ938DYA6YN6", "asin": "1603420304", "reviewerName": "Lrm0ss", "helpful": [0, 0], "reviewText": "When I went away to College finding things that are simple to make wasn't as easy as it would seem, especially when your trying to be healthy! This book offers a lot more options for me now, and I absolutely love the lists of basics to have on hand. Stocking my pantry for the first time was tough and these lists helped a lot!", "overall": 5.0, "summary": "I love it!", "unixReviewTime": 1265846400, "reviewTime": "02 11, 2010"}
{"reviewerID": "A1DYWBL9HZI1S2", "asin": "1603420304", "reviewerName": "Mandie", "helpful": [0, 0], "reviewText": "I've been out of college for several years now, but I still go back to this cookbook for many recipes. The sweet potato fries, honey and garlic chicken, and orange chicken are all family favorites. This cookbook was definitely easy to use while in school because the recipes didn't require tons of obscure ingredients that were only used in one recipe; if an out of the way ingredient WAS called for, it was repeated in several recipes. That meant fewer trips to the local grocery store. I love this cookbook and it will stay on my shelves for a long time (and I'm a dedicated foodie who is choosy about what cookbooks I use).", "overall": 5.0, "summary": "Still in use", "unixReviewTime": 1382832000, "reviewTime": "10 27, 2013"}
{"reviewerID": "A2MZ15UX5F9NJ5", "asin": "1603420304", "reviewerName": "MTMama2010 \"music lover\"", "helpful": [0, 1], "reviewText": "This seems like a great cookbook for someone starting out on their own for the first time & not having much cooking knowledge.  So I got it as a gift for a family member who's a freshman in college.  Not sure what she thinks of it as I haven't heard anything.", "overall": 4.0, "summary": "Christmas gift for family member", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A13OWF14YQ0F7", "asin": "1603420304", "reviewerName": "nb45ti \"country garden\"", "helpful": [0, 0], "reviewText": "Bought this for my daughter who's in college and getting her first apartment.  Nice recipes, good layout.  Lots of handy information for setting up a college apartment kitchen.  Nice cheerful illustrations too.", "overall": 5.0, "summary": "Fun book", "unixReviewTime": 1399334400, "reviewTime": "05 6, 2014"}
{"reviewerID": "A38XJ4G6WMFKI2", "asin": "1603420304", "reviewerName": "Paige", "helpful": [0, 1], "reviewText": "I'm a college student who struggles with money and eating healthy as a resultI'm already a good cook, but when i saw this at the library i work at: i knew i had to have itThis book is wonderful, so many good ides that i'm eager to try :)", "overall": 5.0, "summary": "awesome!", "unixReviewTime": 1363996800, "reviewTime": "03 23, 2013"}
{"reviewerID": "AJM6MN9TJBYDD", "asin": "1603420304", "reviewerName": "P. Carras \"Peter\"", "helpful": [1, 2], "reviewText": "I originally purchased his book for my niece and she is maybe using it occassionally. I still thought it was a great cookbook and I bought another one for my son when he started his second year of college and was to start cooking. This time it was received with great appreciation and is being used regularly. It is the only cookbook they own and the 4 boys rely on it for their evening meals.", "overall": 5.0, "summary": "Second time purchasing this book", "unixReviewTime": 1284076800, "reviewTime": "09 10, 2010"}
{"reviewerID": "A2C7UPL5DECMMG", "asin": "1603420304", "reviewerName": "Prof. Rieann", "helpful": [1, 2], "reviewText": "This book was perfect!  I bought this for my daughter who was heading off to her first apt. and graduate school.  The lists for setting up her kitchen were very helpful--pots and pans, cooking utensils, fridge basics, pantry items, spices, etc. She also found lots of recipes that she marked to try.", "overall": 5.0, "summary": "Great find", "unixReviewTime": 1253059200, "reviewTime": "09 16, 2009"}
{"reviewerID": "A2XRIYADK9644S", "asin": "1603420304", "reviewerName": "P. Spradlin", "helpful": [2, 6], "reviewText": "I bought this for a friend whose daughter is leaving for college soon.  She's been complaining she's going to starve because she doesn't know how to cook. After reviewing it, I decided not to give it to her.  I think most of the recipes are just too complicated for the typical college student, and some of the ingredients are not easily found in a small college town.  I'll keep searching for another one.", "overall": 3.0, "summary": "Recipies a bit complicated for college kids", "unixReviewTime": 1277164800, "reviewTime": "06 22, 2010"}
{"reviewerID": "A4S2Q7JXNFNXV", "asin": "1603420304", "reviewerName": "quiltitpurple", "helpful": [0, 0], "reviewText": "My son loves to cook and he thinks this book is great!  Lots of healthy choices that are delicious and easy to make as well!  I would definitely recommend this to young cooks and older ones, too.", "overall": 5.0, "summary": "Delicious and healthy!", "unixReviewTime": 1262822400, "reviewTime": "01 7, 2010"}
{"reviewerID": "A3OGK2ZOGN9W5F", "asin": "1603420304", "reviewerName": "Rachel R Bailey", "helpful": [0, 0], "reviewText": "This book is awesome. It just proves that eating healthy doesn't have to cost tons of money and tons of time! The recipes use normal ingredients that people would have cooked with 100 years ago. These recipes are not fancy and are not a lot of things that you have never heard of so if you are looking for something to try obscure recipes this is not it. If you ARE looking for something straight forward with good, solid healthy recipes that taste delicious and will help keep on your budget BUY THIS BOOK! I've been out of college for almost 10 years and I have 3 kids and a husband to feed and we all love these recipes! I wish I would have had it in college too...it's really a great book for anyone!", "overall": 5.0, "summary": "Just what I thought didn't exist...but here it is!", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A16J1H95YRO0FQ", "asin": "1603420304", "reviewerName": "Rebecca L Nichols", "helpful": [0, 0], "reviewText": "Good recipes, and my nineteen year-old son is anxious to cook in college now!  It would have been nice to have photos of the entrees though.", "overall": 4.0, "summary": "Nice, but needs photos", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
{"reviewerID": "ATJZ2IBUD9NML", "asin": "1603420304", "reviewerName": "RetroGurl", "helpful": [0, 0], "reviewText": "I got this book for both my nephew & niece when they started college. It's great for the beginning cook and all the ingredients are easy to find at any grocery. Even my nephew who was a \"throw it in the micro\" kid, made things out of it!", "overall": 5.0, "summary": "Great for beginners", "unixReviewTime": 1238716800, "reviewTime": "04 3, 2009"}
{"reviewerID": "A13SIMAM6MST2C", "asin": "1603420304", "reviewerName": "Rival", "helpful": [0, 0], "reviewText": "I highly recommend this book. It has two lists of basics foods you should have, one for the fridge and one for the cupboard. The recipes actually use the stuff on the list! Every now and then you'll want to add something like fruits, veggies and meat to your shopping list but they are all easy to find ingredients. LOVE!", "overall": 5.0, "summary": "One of the best cookbooks you could get for college!", "unixReviewTime": 1373932800, "reviewTime": "07 16, 2013"}
{"reviewerID": "A2HZHZMY3SBGLT", "asin": "1603420304", "reviewerName": "RosesareRed", "helpful": [0, 0], "reviewText": "I really like the way that this book is organized and the way that it explains everything. I'm new to cooking and this book simplifies recipes when it can and explains where it can't. This is a must have for any college student who didn't do much cooking in the past.", "overall": 5.0, "summary": ":]", "unixReviewTime": 1317340800, "reviewTime": "09 30, 2011"}
{"reviewerID": "A3I4BKOOVWL2Z0", "asin": "1603420304", "reviewerName": "Sam G", "helpful": [0, 0], "reviewText": "I am no longer in college, but this is still one of my favorite go-to cookbooks. All of the recipes I have tried are very quick and easy to make, and are delicious!", "overall": 5.0, "summary": "Great, quick cooking ideas", "unixReviewTime": 1327276800, "reviewTime": "01 23, 2012"}
{"reviewerID": "A3DQRGJQ6M3GMM", "asin": "1603420304", "reviewerName": "Sammi", "helpful": [0, 0], "reviewText": "Great for all of the college students in your life who you cringe watching them try to live off Ramon noodles - yuck!  My son and his girlfriend use this book regularly to fit healthy more well-balanced meals into their days. I am so glad I bought this. They come for dinner much less now and that is a bummer but at least I know they are taking care of themselves amidst their super busy lives.", "overall": 5.0, "summary": "If you want them to eat right at their own dorm/apt. this is a must buy and gift it book", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}
{"reviewerID": "A29SPE2LQH3921", "asin": "1603420304", "reviewerName": "Sarah Phippen", "helpful": [0, 0], "reviewText": "Plenty of variety, easy to make, and super inexpensive! I'd recommend this book to any college student living in an apartment.", "overall": 5.0, "summary": "Great College Cookbook", "unixReviewTime": 1379030400, "reviewTime": "09 13, 2013"}
{"reviewerID": "A2PQXRNX8J122N", "asin": "1603420304", "reviewerName": "sebasw9", "helpful": [0, 0], "reviewText": "This cook book got me on track to cooking for myself. It has a lot of healthy recipes that are also delicious. This book will help you save money and teach you to cook.", "overall": 5.0, "summary": "great booK!", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "A3GV3HY4580KCG", "asin": "1603420304", "reviewerName": "Seth C. Yates \"The Kollektor\"", "helpful": [0, 0], "reviewText": "The book has a big variety of recipes. It has recipes for vegans and for the ultimate meat lovers. It provides basic knowledge for the kitchen and how to cook. The recipes for the most part are cheap and delectable.", "overall": 5.0, "summary": "Big Variety", "unixReviewTime": 1247270400, "reviewTime": "07 11, 2009"}
{"reviewerID": "A3HVMHTWXACEWU", "asin": "1603420304", "reviewerName": "Skyller Stickfort", "helpful": [2, 3], "reviewText": "This book has been used many times by me in the last few months and I love it. My favorite recipe in it so far was a meat chili. My roommates said it was the best chili ever. I'm not really a gourmet person so this cookbook is perfect. I don't want a ingredient list that takes an hour at the supermarket to fill. Most of the recipes in this book are quick and easy to make. Whenever a recipe didn't turn out, I found it to me my fault since I'm not a great cook. I'm really happy with this purchase and it's worth every penny. There's something for everyone in this book.", "overall": 5.0, "summary": "Great Book", "unixReviewTime": 1349395200, "reviewTime": "10 5, 2012"}
{"reviewerID": "A1A7HNCNWB52YS", "asin": "1603420304", "reviewerName": "slowoggie", "helpful": [0, 0], "reviewText": "Has great info for the beginner, but would like some photos to help see what it looks like. Recommended for sure", "overall": 4.0, "summary": "Great recipe selection..but wish it had more pictures", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A3ONK1QOTA8JGW", "asin": "1603420304", "reviewerName": "SparkleGirl", "helpful": [0, 0], "reviewText": "Great cookbook. I use it all of the time. There are lots of selections sure to please just about anyone. I've even had friends and family copy recipes for themselves. My sisters starting college and I'm going to order one for her too!", "overall": 5.0, "summary": "Use it all the time!", "unixReviewTime": 1313539200, "reviewTime": "08 17, 2011"}
{"reviewerID": "A1H6JWQV1E8GOL", "asin": "1603420304", "reviewerName": "Stephanie S. Chaousy", "helpful": [0, 0], "reviewText": "I am not a big cook so I was looking for a cookbook with easy, healthy and affordable recipes. I was pleasantly surprisrd when going through this book there were many choices my husband and I would like. Great book!", "overall": 5.0, "summary": "just what i was looking for", "unixReviewTime": 1379030400, "reviewTime": "09 13, 2013"}
{"reviewerID": "A25NUGWG8JCCRA", "asin": "1603420304", "reviewerName": "Steph", "helpful": [1, 2], "reviewText": "Even though I have been out of college for several years I ordered this cookbook through my Kindle thinking it would be perfect since I live alone and do not always feel like cooking a lot for myself.  When I ordered it, I imagined the recipes would be creative healthy snacks one could cook in a non-stocked kitchen, since it is described as a dorm room cookbook.  I found the recipes to be very very basic and require too many pots, pans, and utensils.  I cannot imagine any dorm or college kitchen being so well stocked.  I am not impressed and it was not what I was looking for.", "overall": 3.0, "summary": "A So So Cookbook", "unixReviewTime": 1347926400, "reviewTime": "09 18, 2012"}
{"reviewerID": "A3863HMGP4GO47", "asin": "1603420304", "reviewerName": "Syn Solange \"Skye\"", "helpful": [0, 0], "reviewText": "Some of these recipes are just outstandingly creative. Every recipe is straightforward, simple, and EVEN highly practical.Here's an example of the book's practicality:  For one of the recipes (\"Pita Pizza\"), directions include the suggestion to consider making this recipe after chopping vegetables for your prior meal, to use as toppings!) Now I don't know about anybody else, but since I'm as clueless as I am about cooking right now, I sure find tips like this useful in the learning the thinking process of a cook!", "overall": 5.0, "summary": "Outstandingly Creative & Practical Guide For the Newbie", "unixReviewTime": 1338076800, "reviewTime": "05 27, 2012"}
{"reviewerID": "ASYVCV7USXVB", "asin": "1603420304", "reviewerName": "Tabby p", "helpful": [0, 0], "reviewText": "I really couldn't wait to get this book so I could begin to learn how to cook meals. The book shows a lot of things to beginner cooks like me such as: which spices are good for which food and what is def needed in your apartment. Thanks to this book I really have enjoyed cooking! I recommend it for beginners. Even though there aren't any photos, I just used my imagination", "overall": 5.0, "summary": "Good book for beginners!!!", "unixReviewTime": 1287273600, "reviewTime": "10 17, 2010"}
{"reviewerID": "A2XXLGHY7U1VOB", "asin": "1603420304", "reviewerName": "T. Civantos", "helpful": [5, 19], "reviewText": "I received this book as a gift and since I love cooking, I immediately began using recipes from it. BIG mistake. This is one of the worst cookbooks I have ever used. First, it assumes that college students eat tiny portions; for example, the chili recipe is listed as \"serves 6\" but it was barely enough food for me and two friends. Also, several of the recipes turned out terribly despite my efforts to follow the instructions exactly. Tiny portions and absurd instructions make this a terrible cookbook for college students or anyone. NOT recommended.", "overall": 1.0, "summary": "WARNING: Do Not Buy", "unixReviewTime": 1266710400, "reviewTime": "02 21, 2010"}
{"reviewerID": "A8CVTHVS8PJ22", "asin": "1603420304", "reviewerName": "T. OBRIEN", "helpful": [0, 0], "reviewText": "It has tons of great recipes and all kinds of helpful cooking tips for the average college kid.  Great gift for the college kid on your list!", "overall": 5.0, "summary": "Awesome cook book for an awesome price!", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A2CRIOQFD8HYR0", "asin": "1603420304", "reviewerName": "Trudy Sheehan", "helpful": [0, 0], "reviewText": "Bought  2 of these cook books for my grandsons that are in college.  Much to my surprise they are using them.", "overall": 5.0, "summary": "College boys", "unixReviewTime": 1392508800, "reviewTime": "02 16, 2014"}
{"reviewerID": "A5SSCXZXV9O3C", "asin": "1603420304", "reviewerName": "Vicki L. Russell", "helpful": [0, 0], "reviewText": "Someone sent me this book because I was going back to college and meal prep time was at a premium. This book turned out to also make cooking actually... fun?! The recipes contain few but well thought out ingredients, and the prep is fast! Seriously, before you know it you are stuffing it in the oven. The food is good and nutritious, with inexpensive fresh ingredients. I'm 50, and painlessly losing weight!I will be buying another one for my daughter when she heads off to college, because I'm keeping this one.", "overall": 5.0, "summary": "Great for busy people and empty nesters", "unixReviewTime": 1397174400, "reviewTime": "04 11, 2014"}
{"reviewerID": "A1JEJEDR7NDZ7C", "asin": "1603420304", "reviewerName": "Zach B", "helpful": [3, 3], "reviewText": "Overall, I really like this book. I've been able to try about 15 different recipes. Only one of them I didn't like (but that was my fault!). I knocked it down one star because, well, some of these are really complex. I feel like the majority of college students don't have a few hours to sit around cooking in the evening.With that in mind, the vast majority of the recipes are quick and easy ways to eat yummy food that is healthy for you. A great guide for anyone trying to avoid that Freshman 15.", "overall": 4.0, "summary": "A good book", "unixReviewTime": 1360800000, "reviewTime": "02 14, 2013"}
{"reviewerID": "A2RWCDXMX1C597", "asin": "B0002IQ15S", "reviewerName": "BK", "helpful": [0, 0], "reviewText": "Slick car adapter that can be used for multiple devices.Solid design and good looks with simple green LED to indicate power.  I like the brilliant space saving side cord design.  Makes the adapter more compact and less likely to tangle with a stick shift.  Makes you wonder why somebody didn't do this sooner and why 99% of the adapters out there still have that annoying cord end that adds inches to the adapter and tangles with the shifter/cupholder/etc.  Tips for nearly every device out there.BUT, the only the BLUE tips are compatible with the iGo Wall adapter.  DO NOT BUY THE GREEN TIPS. I'd like to meet the bean counter that made that decision...  Otherwise, I'd give it 5 stars.  I guess they want to make more money on the @#*%$ tips.", "overall": 4.0, "summary": "One car adapter for all your toys- BUT BUY ONLY BLUE TIPS", "unixReviewTime": 1172448000, "reviewTime": "02 26, 2007"}
{"reviewerID": "A185HGLJQOH1K7", "asin": "B0002IQ15S", "reviewerName": "David Harris", "helpful": [2, 2], "reviewText": "I'm a little confused with the description of this item. They imply that it delivers differing output voltages for various appliances you want to power, but nowhere do they actually state this outright. It works fine for my Kyocera phone. But will it also work for a nine-volt radio or a three-volt set of noise-reduction headphones? If I find out that it does, I'll change my four stars to five.", "overall": 4.0, "summary": "Works for my phone, but what about devices with differing voltage?", "unixReviewTime": 1126224000, "reviewTime": "09 9, 2005"}
{"reviewerID": "A13F6NVPW73ORB", "asin": "B0002IQ15S", "reviewerName": "Edwin G. Hartnell", "helpful": [5, 6], "reviewText": "My father bought this as a suggested add-on to the Amazon Kindle - and I suspect a lot of other customers but this product the same sort of way. What they don't tell you is that you need to buy two things - the power adapter AND an \"iGo Power Tip for Amazon Kindle\". With the extra cost ($12) we felt we were both deceived and cheated. Particularly because the picture for the iGo Autopower power adapter includes a picture of the Power Tip (not actually included). But we were determined to make it all work and after an extra trip to an electronics store it now does. Overall I was impressed by the product but beware of what you are really getting.", "overall": 2.0, "summary": "Works well but a little deceptive", "unixReviewTime": 1212364800, "reviewTime": "06 2, 2008"}
{"reviewerID": "AU8DH6AOA1YOJ", "asin": "B0002IQ15S", "reviewerName": "J. Turner", "helpful": [6, 6], "reviewText": "When I found myself with a depleted cell phone several hours into a twelve hour drive, with nothing but an AC charger stowed in a suitcase, I stopped at the first electronics store I could find to buy a charger.Without hesitation, I purchased the iGo Autopower 3000, along with two tips, one for my Motorola V300 and one for my father's Sprint PCS phone.The IGO AutoPower 3000 is basically a generic 12v adapter.  You plug in your device-specific interchangeable tip to charge your electronics device.  In my case, it was a cell phone.We used both during the trip to charge our phones without any problems.Simple, reliable, and effective.  Recommended.", "overall": 5.0, "summary": "Great aftermarket cell phone charger", "unixReviewTime": 1102291200, "reviewTime": "12 6, 2004"}
{"reviewerID": "A2FN6JKET6O4Y5", "asin": "B000F83STC", "reviewerName": "Sharon M. Bressen \"Mema\"", "helpful": [0, 0], "reviewText": "Reading this poetry was a whole new experience for me...and in the end a totally pleasant experience into the world of sexual play.  The book is divided into six sections.  I enjoyed some sections more than others.  Where the poems covered many different sexual partnerships and situations, I enjoyed them all with no reservations.As an avid reader, I found the rhythm of the words and the pictures they created very exciting.  Sometimes sentences in regular prose take too long to convey a thought, whereas poetry can use one word to describe an action, a thought or a feeling with such speed and power.The author&#8217;s praise and undeniable respect for the female body creates a very stimulating read.  It would be wonderful to believe that your lover would be aroused with just the simple act of watching you walk across a room.I recommend this book of poetry to all readers who have open minds to the exciting world of sensual pleasures.", "overall": 4.0, "summary": "Poetry for Sensual Pleasures", "unixReviewTime": 1384905600, "reviewTime": "11 20, 2013"}
{"reviewerID": "A1F6404F1VG29J", "asin": "B000F83SZQ", "reviewerName": "Avidreader", "helpful": [0, 0], "reviewText": "I enjoy vintage books and movies so I enjoyed reading this book.  The plot was unusual.  Don't think killing someone in self-defense but leaving the scene and the body without notifying the police or hitting someone in the jaw to knock them out would wash today.Still it was a good read for me.", "overall": 5.0, "summary": "Nice vintage story", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "AN0N05A9LIJEQ", "asin": "B000F83SZQ", "reviewerName": "critters", "helpful": [2, 2], "reviewText": "This book is a reissue of an old one; the author was born in 1910. It's of the era of, say, Nero Wolfe. The introduction was quite interesting, explaining who the author was and why he's been forgotten; I'd never heard of him.The language is a little dated at times, like calling a gun a &#34;heater.&#34;  I also made good use of my Fire's dictionary to look up words like &#34;deshabille&#34; and &#34;Canarsie.&#34; Still, it was well worth a look-see.", "overall": 4.0, "summary": "Different...", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "AXGLIE1I6LX40", "asin": "B000F83SZQ", "reviewerName": "db", "helpful": [0, 0], "reviewText": "Really good story although Amy Brewster does not really figure much other than being in the story.  The lead character certainly does figure in the story and its hard action from the get go.", "overall": 5.0, "summary": "Really good story although Amy Brewster does not really figure much ...", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
{"reviewerID": "A795DMNCJILA6", "asin": "B000F83SZQ", "reviewerName": "dot", "helpful": [2, 2], "reviewText": "This was a fairly interesting read.  It had old- style terminology.I was glad to get  to read a story that doesn't have coarse, crasslanguage.  I read for fun and relaxation......I like the free ebooksbecause I can check out a writer and decide if they are intriguing,innovative, and have enough of the command of Englishthat they can convey the story without crude language.", "overall": 4.0, "summary": "Oldie", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}
{"reviewerID": "A1FV0SX13TWVXQ", "asin": "B000F83SZQ", "reviewerName": "Elaine H. Turley \"Montana Songbird\"", "helpful": [1, 1], "reviewText": "I'd never read any of the Amy Brewster mysteries until this one..  So I am really hooked on them now.", "overall": 5.0, "summary": "I really liked it.", "unixReviewTime": 1392768000, "reviewTime": "02 19, 2014"}
{"reviewerID": "A3SPTOKDG7WBLN", "asin": "B000F83SZQ", "reviewerName": "Father Dowling Fan", "helpful": [0, 1], "reviewText": "If you like period pieces - clothing, lingo, you will enjoy this mystery.  Author had me guessing at least 2/3 of the way through.", "overall": 4.0, "summary": "Period Mystery", "unixReviewTime": 1395187200, "reviewTime": "03 19, 2014"}
{"reviewerID": "A1M2PI6B4KY4SD", "asin": "B000F83SZQ", "reviewerName": "Sandi", "helpful": [1, 1], "reviewText": "This book almost demands the time to read it straight through. The kind you read curled up on a sofa with hot chocolate by your side. A wonderful evenings entertainment. Would like more from this author with some of same characters.", "overall": 5.0, "summary": "Very entertaining", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"}
{"reviewerID": "A1RK2OCZDSGC6R", "asin": "B000F83SZQ", "reviewerName": "ubavka seirovska", "helpful": [0, 0], "reviewText": "A beautiful in-depth character description makes it like a fast pacing movie. It is a pity Mr Merwin did not write 30 instead only 3 of the Amy Brewster mysteries.", "overall": 4.0, "summary": "Review", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"}
